{
  "article": {
    "id": 32869,
    "link": "https://www.thenewswire.com/press-releases?id=1LmPFn7p4",
    "title": "Majuba Hill Copper to Acquire Copper King and Desert Mountain Claims and Leases Including the Historical Cayote Mine SW of Tintic Mining District",
    "description": "<table style='width:fit-content; border: none;'><tr style='background: none;'><td colspan='10' style='padding: 0; margin: 0; border: none; background: none;' valign='bottom'><img src=\"https://www.thenewswire.com/data/tnw/clients/logos/1LmPFW3Y0.png\" alt=\"Majuba Hill Copper Corp.\" /></td></tr><tr style='background: none;'><td style='padding: 0; margin: 0; border: none; background: none;'></td></tr></table>\n<p style='text-align:justify; '>\n<span style=''>VANCOUVER, BC — </span><span style=''>TheNewswire -</span><span style=''> March 27, 2023 — Majuba Hill Copper Corp. (CSE:JUBA</span><span style=''>) (</span><span style=''>OTC:JUBAF</span><span style=''>) (</span><span style=''>FWB:4NP) (“Majuba Hill Copper” or the “Company”) </span><a href='' target='_blank'></a><span style=''>is pleased to announce the Company has entered in to an agreement dated March 20, 2023 (the “Purchase Agreement”) </span><a href='' target='_blank'></a><span style=''>with Ruby Hollow, LLC to acquire a 100% interest in the Copper King and Desert Mountain Claim Group </span><span style=''>SW of the Tintic Mining District in Juab, Utah (the “Transaction”). The properties consist of 6,827.994 acres of highly prospective claims and leases (the “Subject Property”). </span>\n</p>\n\n<p style='text-align:justify; '>\n<span style='font-weight:bold; '>Copper King and Desert Mountain Claims</span>\n</p>\n\n<p style='text-align:justify; '>\n<span style=''>The two claim blocks are situated approximately 90 km SW of Kennecott’s prolific Bingham Canyon Mine Complex (just west of Salt Lake City, Utah) and 40 km SW of the Tintic Mining District which hosted some of the richest lead/silver mines in the state.</span>\n</p>\n\n<p style='text-align:center; '>\n<span style='text-align:center; '><a href='https://www.thenewswire.com/data/tnw/clients/img/07737deb2c0900eb4b8d4556ed47fa06.png' target='_blank'><img src=\"https://www.thenewswire.com/data/tnw/clients/img/07737deb2c0900eb4b8d4556ed47fa06_.png\" /></a><br />\nClick Image To View Full Size</span>\n</p>\n \n<p style='text-align:justify; '>\n<span style=''>The Copper King Claims is a greenfield project that hosts numerous quartz-specularite veins with occasional Cu-oxides, barite, and fluorite showings that increase in intensity along the western flank of the mountain range. A field program took place in 2020 that focused on collecting structural orientation data and geochemical grab samples of veins to provide further insight into the mineralizing system. Geophysical anomalies outline potential targets for drilling the 5113.214 acre property.</span>\n</p>\n\n<p style='text-align:justify; '>\n<span style=''>The Desert Mountain Claims is a block of land covered by the DMG claims, the Coyote Knoll claims, and a state section on west side of the claim block.  There is alteration, mineralization, and jasperoids in the volcanic and Precambrian rock covered by the claims.  There is a small mine on the property called the Coyote Mine with small production and reported 1000 ounces silver.  A review of the drilling, including creating cross sections of the drilling, indicates excellent drilling opportunities along a mostly east-west structure covered by the claims.  Additional </span><span style=''>opportunities can be found north and south off this east-west structure. The overall block size is approximately 1,714.78 acres.</span>\n</p>\n\n<p style='text-align:justify; '>\n<span style=''>David Greenway, President and CEO, commented: &quot;While we continue to advance our flagship </span><a href='' target='_blank'></a><span style=''>Majuba Hill Copper Project </span><span style=''>showcasing the potential for 1.5 Billion pounds of copper, with results just announced to expand that size, which will contribute to the development of a NI 43-101 compliant copper resource</span><span style=''>. Our phased approach is how the next great copper mines of America will be developed. This in an era when copper has never been in greater demand, the shortfall for copper been forecasted to become so significant and the need to find strategic copper reserves in domestic, safe, American, mining friendly jurisdictions been so imperative. Bravo to 2022. We couldn’t be more excited to see what 2023 brings. We are excited to add to</span><span style=''> the Company’s US based mining portfolio with this strategic acquisition to find the next ‘Majuba Hill’.&quot;</span>\n</p>\n\n<p style='text-align:justify; '>\n<span style='font-weight:bold; '>The Transaction</span>\n</p>\n\n<p style='text-align:justify; '>\n<span style=''>In consideration for the Transaction and pursuant to the terms of the Purchase Agreement, and closing thereof (&quot;Closing&quot;), the Company will issue an aggregate of </span><span style=''>3,000,000 </span><span style=''>common shares in the capital of the Company at a deemed price of $</span><span style=''>0.13 USD </span><span style=''>per share (the “Consideration Shares”).</span>\n</p>\n\n<p style='text-align:justify; '>\n<span style=''>Pursuant to the Purchase Agreement, the Company has agreed to </span><span style=''>undertake </span><span style=''>and assume all obligations related to the Properties such as certain royalty interests and maintaining the Subject Property in good standing. </span>\n</p>\n\n<p style='text-align:justify; '>\n<span style=''>The Consideration Shares will be subject to a four month and one day restriction on resale commencing on the closing date.</span>\n</p>\n \n<p style='text-align:justify; '>\n<span style='font-weight:bold; '>Awareness Agreement</span>\n</p>\n\n<p style='text-align:justify; '>\n<span style=''>Further, the Company has engaged Positive Phil Inc. of San Marcos, California, to provide digital marketing services to the Company for a term of 30 days, in consideration of 300,000 RSUs. Positive Phil Inc. will utilize its online programs and media placement to generate a greater following, increase investor awareness and attract new investors through many different online platforms and methods of engagement.</span>\n</p>\n\n<p style=''>\n\n<p style='text-align:justify; '>\n<span style='font-weight:bold; '>About Majuba Hill Copper Corp.</span>\n</p>\n\n<p style='text-align:justify; '>\n<span style=''>Majuba Hill Copper Corp. is engaged in the identification, review and acquisition of latter stage copper and copper/silver/gold assets. This is in direct response to the growing worldwide demand and lack of supply for precious metals fueled by the Green New Deal in the US and most other developed nations with similar programs aimed at addressing climate change. Such programs are heavily reliant on silver, gold and especially copper to produce Electric Vehicles and other renewable power sources, as well as building infrastructure to provide clean and affordable electricity. </span>\n</p>\n\n<p style='text-align:justify; '>\n<span style=''>The flagship project is the Majuba Hill copper, silver and gold District located 156 miles outside Reno, Nevada, USA. Management has been mandated to focus on safe, mining friendly jurisdictions where government regulations are supportive of mining operations.</span>\n</p>\n \n<p style='text-align:justify; '>\n<span style='font-weight:bold; '>On Behalf of the Board of Majuba Hill Copper Corp.</span>\n</p>\n\n<p style='text-align:justify; '>\n<span style=''>“David Greenway”</span>\n</p>\n\n<p style='text-align:justify; '>\n<span style=''>David C. Greenway</span>\n</p>\n\n<p style='text-align:justify; '>\n<span style='font-style:italic; '>President &amp; CEO</span>\n</p>\n \n<p style='text-align:justify; '>\n<span style='font-weight:bold; '>For further information, please contact:</span>\n</p>\n\n<p style='text-align:justify; '>\n<span style=''>Joel Warawa</span>\n</p>\n\n<p style='text-align:justify; '>\n<span style=''>VP of Corporate Communications</span>\n</p>\n\n<p style='text-align:justify; '>\n<span style=''>E: jw@majubahillcopper.com</span>\n</p>\n\n<p style='text-align:justify; '>\n<span style=''>P: 1 (855) 475-0745 </span>\n</p>\n \n<p style='text-align:justify; '>\n<span style=''>Neither the Canadian Securities Exchange nor its Market Regulator (as that term is defined in the policies of the Canadian Securities Exchange) accepts responsibility for the adequacy or accuracy of this release.</span>\n</p>\n \n<p style='text-align:justify; '>\n<span style='font-style:italic; '>Forward-Looking Statements </span>\n</p>\n \n<p style='text-align:justify; '>\n<span style='font-style:italic; '>This news release contains certain statements that may be deemed &quot;forward-looking&quot; statements. Forward looking statements are statements that are not historical facts and are generally, but not always, identified by the words &quot;expects&quot;, &quot;plans&quot;, &quot;anticipates&quot;, &quot;believes&quot;, &quot;intends&quot;, &quot;estimates&quot;, &quot;projects&quot;, &quot;potential&quot; and similar expressions, or that events or conditions &quot;will&quot;, &quot;would&quot;, &quot;may&quot;, &quot;could&quot; or &quot;should&quot; occur. Although Majuba Hill Copper Corp. believes the expectations expressed in such forward-looking statements are based on reasonable assumptions, such statements are not guarantees of future performance and actual results may differ materially from those in forward looking statements. Forward looking statements are based on the beliefs, estimates and opinions of Majuba Hill Copper Corp. management on the date the statements are made. Except as required by law, Majuba Hill Copper Corp. undertakes no obligation to update these forward-looking statements in the event that management's beliefs, estimates or opinions, or other factors, should change.</span>\n</p>\n \n</p>\n\n\n<p>Copyright (c) 2023 TheNewswire - All rights reserved.</p>\n",
    "search_terms": "Majuba Hill,Giant Mining Corp.,JUBA",
    "master_gid": 1018,
    "date": "2023-03-27T07:05:00.000Z",
    "tags": "USA|Utah||Copper|Project Acquisition",
    "image_id": null,
    "hidden": false,
    "company_id": 164,
    "provider": null,
    "excerpt": "VANCOUVER, BC —TheNewswire -March 27, 2023 — Majuba Hill Copper Corp. (CSE:JUBA) (OTC:JUBAF) (FWB:4NP) (“Majuba Hill Copper” or the “Company”)is pleased to announce the Company has entered in to an agreement dated March 20, 2023 (the “Purchase Agreement”)with Ruby Hollow, LLC to acquire a 100% interest in the Copper King",
    "is_regulatory": false,
    "refined_tags": [
      "Project Acquisition"
    ],
    "ftp_filename": null,
    "company_name": "Giant Mining Corp.",
    "exchange": "CSE",
    "root_ticker": "BFG",
    "project_name": "Majuba Hill",
    "gid": 1018,
    "location": "Nevada, USA",
    "plan_id": null,
    "description_text": "VANCOUVER, BC — TheNewswire - March 27, 2023 — Majuba Hill Copper Corp. (CSE:JUBA ) ( OTC:JUBAF ) ( FWB:4NP) (“Majuba Hill Copper” or the “Company”) is pleased to announce the Company has entered in to an agreement dated March 20, 2023 (the “Purchase Agreement”) with Ruby Hollow, LLC to acquire a 100% interest in the Copper King and Desert Mountain Claim Group SW of the Tintic Mining District in Juab, Utah (the “Transaction”). The properties consist of 6,827.994 acres of highly prospective claims and leases (the “Subject Property”). Copper King and Desert Mountain Claims The two claim blocks are situated approximately 90 km SW of Kennecott’s prolific Bingham Canyon Mine Complex (just west of Salt Lake City, Utah) and 40 km SW of the Tintic Mining District which hosted some of the richest lead/silver mines in the state. Click Image To View Full Size The Copper King Claims is a greenfield project that hosts numerous quartz-specularite veins with occasional Cu-oxides, barite, and fluorite showings that increase in intensity along the western flank of the mountain range. A field program took place in 2020 that focused on collecting structural orientation data and geochemical grab samples of veins to provide further insight into the mineralizing system. Geophysical anomalies outline potential targets for drilling the 5113.214 acre property. The Desert Mountain Claims is a block of land covered by the DMG claims, the Coyote Knoll claims, and a state section on west side of the claim block.  There is alteration, mineralization, and jasperoids in the volcanic and Precambrian rock covered by the claims.  There is a small mine on the property called the Coyote Mine with small production and reported 1000 ounces silver.  A review of the drilling, including creating cross sections of the drilling, indicates excellent drilling opportunities along a mostly east-west structure covered by the claims.  Additional opportunities can be found north and south off this east-west structure. The overall block size is approximately 1,714.78 acres. David Greenway, President and CEO, commented: \"While we continue to advance our flagship Majuba Hill Copper Project showcasing the potential for 1.5 Billion pounds of copper, with results just announced to expand that size, which will contribute to the development of a NI 43-101 compliant copper resource . Our phased approach is how the next great copper mines of America will be developed. This in an era when copper has never been in greater demand, the shortfall for copper been forecasted to become so significant and the need to find strategic copper reserves in domestic, safe, American, mining friendly jurisdictions been so imperative. Bravo to 2022. We couldn’t be more excited to see what 2023 brings. We are excited to add to the Company’s US based mining portfolio with this strategic acquisition to find the next ‘Majuba Hill’.\" The Transaction In consideration for the Transaction and pursuant to the terms of the Purchase Agreement, and closing thereof (\"Closing\"), the Company will issue an aggregate of 3,000,000 common shares in the capital of the Company at a deemed price of $ 0.13 USD per share (the “Consideration Shares”). Pursuant to the Purchase Agreement, the Company has agreed to undertake and assume all obligations related to the Properties such as certain royalty interests and maintaining the Subject Property in good standing. The Consideration Shares will be subject to a four month and one day restriction on resale commencing on the closing date. Awareness Agreement Further, the Company has engaged Positive Phil Inc. of San Marcos, California, to provide digital marketing services to the Company for a term of 30 days, in consideration of 300,000 RSUs. Positive Phil Inc. will utilize its online programs and media placement to generate a greater following, increase investor awareness and attract new investors through many different online platforms and methods of engagement. About Majuba Hill Copper Corp. Majuba Hill Copper Corp. is engaged in the identification, review and acquisition of latter stage copper and copper/silver/gold assets. This is in direct response to the growing worldwide demand and lack of supply for precious metals fueled by the Green New Deal in the US and most other developed nations with similar programs aimed at addressing climate change. Such programs are heavily reliant on silver, gold and especially copper to produce Electric Vehicles and other renewable power sources, as well as building infrastructure to provide clean and affordable electricity. The flagship project is the Majuba Hill copper, silver and gold District located 156 miles outside Reno, Nevada, USA. Management has been mandated to focus on safe, mining friendly jurisdictions where government regulations are supportive of mining operations. On Behalf of the Board of Majuba Hill Copper Corp. “David Greenway” David C. Greenway President & CEO For further information, please contact: Joel Warawa VP of Corporate Communications E: jw@majubahillcopper.com P: 1 (855) 475-0745 Neither the Canadian Securities Exchange nor its Market Regulator (as that term is defined in the policies of the Canadian Securities Exchange) accepts responsibility for the adequacy or accuracy of this release. Forward-Looking Statements This news release contains certain statements that may be deemed \"forward-looking\" statements. Forward looking statements are statements that are not historical facts and are generally, but not always, identified by the words \"expects\", \"plans\", \"anticipates\", \"believes\", \"intends\", \"estimates\", \"projects\", \"potential\" and similar expressions, or that events or conditions \"will\", \"would\", \"may\", \"could\" or \"should\" occur. Although Majuba Hill Copper Corp. believes the expectations expressed in such forward-looking statements are based on reasonable assumptions, such statements are not guarantees of future performance and actual results may differ materially from those in forward looking statements. Forward looking statements are based on the beliefs, estimates and opinions of Majuba Hill Copper Corp. management on the date the statements are made. Except as required by law, Majuba Hill Copper Corp. undertakes no obligation to update these forward-looking statements in the event that management's beliefs, estimates or opinions, or other factors, should change. Copyright (c) 2023 TheNewswire - All rights reserved.",
    "primary_commodity": "Cu"
  },
  "articleProject": {
    "gid": 1018,
    "project_name": "Majuba Hill",
    "location": "Nevada, USA"
  },
  "articleExchange": "CSE",
  "articleCompanyId": 164,
  "articleTicker": "BFG",
  "articleCompanyName": "Giant Mining Corp.",
  "allOtherCompanyProjects": [
    {
      "company_id": 164,
      "gid": 1018,
      "project_name": "Majuba Hill",
      "location": "Nevada, USA"
    },
    {
      "company_id": 164,
      "gid": 8681,
      "project_name": "Friday",
      "location": null
    }
  ],
  "allOtherCompanyNews": [
    {
      "id": 107280,
      "company_id": 164,
      "title": "Giant Mining Continues Engagement of RESPEC Engineering to Incorporate 2024 and Spring 2025 Core Drilling into Modeling at Majuba Hill Copper-Silver-Gold Project, Nevada",
      "link": "https://www.thenewswire.com/press-releases?id=1ArbFmblM",
      "date": "2025-06-09T07:05:00.000Z",
      "hidden": false
    },
    {
      "id": 106505,
      "company_id": 164,
      "title": "Giant Mining Submits Assays for 595-Foot Hole MHB-35, Processes Ai Driven Discovery Hole MHB-36, and Launches Special Warrant Financing at Majuba Hill Copper Project ",
      "link": "https://www.thenewswire.com/press-releases?id=1kVGFxgR1",
      "date": "2025-06-02T07:05:00.000Z",
      "hidden": false
    },
    {
      "id": 106342,
      "company_id": 164,
      "title": "Giant Mining Submits Core For Assay From 1,963 Foot Hole Mhb-34 At Majuba Hill Copper Project- Advancing Critical Minerals In Nevada",
      "link": "https://www.thenewswire.com/press-releases?id=1LYzFbMZz",
      "date": "2025-05-30T07:05:00.000Z",
      "hidden": false
    },
    {
      "id": 105454,
      "company_id": 164,
      "title": "Giant Mining Intersects High-Grade Copper at Majuba Hill: 169.5 ft of 0.41% Cu Including 40 ft of 1.36% Cu and 10 ft at 4.36% Cu, Highlighting Expansion Potential",
      "link": "https://www.thenewswire.com/press-releases?id=1LpMFq07r",
      "date": "2025-05-22T07:05:00.000Z",
      "hidden": false
    },
    {
      "id": -201620,
      "company_id": 164,
      "title": "Giant Mining Announces Listing of Warrants on the CSE",
      "link": "https://www.thenewswire.com/press-releases?id=1AdyFqmEm",
      "date": "2025-05-21T23:10:00.000Z",
      "hidden": false
    },
    {
      "id": 105097,
      "company_id": 164,
      "title": "Giant Mining Advances Majuba Hill with Completion of 5,484.5 Ft Spring 2025 Drill Program",
      "link": "https://www.thenewswire.com/press-releases?id=1LymF1Ya8",
      "date": "2025-05-19T13:55:00.000Z",
      "hidden": false
    },
    {
      "id": 104289,
      "company_id": 164,
      "title": "Giant Mining Intersects ExploreTech-Predicted Mineralization, Indicating Potential Extension or New Discovery at Majuba Hill Copper-Silver-Gold Project, Nevada",
      "link": "https://www.thenewswire.com/press-releases?id=1BglFwoyr",
      "date": "2025-05-12T07:05:00.000Z",
      "hidden": false
    },
    {
      "id": 104161,
      "company_id": 164,
      "title": "Giant Mining Begins Drilling AI-Designed Fifth Hole at 2025 Majuba Hill Copper-Silver-Gold Project with ExploreTech",
      "link": "https://golddiscovery.com/legacy/user/news_details/756032-bfgcnx-giant-mining-begins-drilling-ai-designed-fifth-hole-at-2025-majuba-hill-copper-silver-gold-project-with-exploretech",
      "date": "2025-05-09T07:05:00.000Z",
      "hidden": false
    },
    {
      "id": 103799,
      "company_id": 164,
      "title": "Giant Mining MHB-34 Drilled to 1,963 Feet with Assays Now Pending From MHB-33 at Majuba Hill Copper-Silver-Gold Project, Nevada",
      "link": "https://www.thenewswire.com/press-releases?id=1Av7FaWPD",
      "date": "2025-05-07T07:05:00.000Z",
      "hidden": false
    },
    {
      "id": 103314,
      "company_id": 164,
      "title": "Giant Mining Extends MHB-34 Beyond 1,850 Feet with Native Copper, Cuprite and Chalcopyrite at Majuba Hill Copper-Silver-Gold Project, Nevada",
      "link": "https://www.thenewswire.com/press-releases?id=1Bb4FR6wE",
      "date": "2025-05-02T20:05:00.000Z",
      "hidden": false
    }
  ]
}
