{
  "article": {
    "id": 64990,
    "link": "https://www.newsfilecorp.com/release/216394/Silver-Valley-Metals-Announces-Sale-of-the-RangerPage-Project-in-the-Silver-Valley-Northern-Idaho-USA",
    "title": "Silver Valley Metals Announces Sale of the Ranger-Page Project in the Silver Valley, Northern Idaho, USA",
    "description": "<img src=\"https://api.newsfilecorp.com/newsinfo/216394/367\" id=\"367\" width=\"2\" height=\"2\" style=\"width: 1px;  height: 1px;border: 0px solid;\" /><p>Vancouver, British Columbia--(Newsfile Corp. - July 15, 2024) - Silver Valley Metals Corp. (TSXV: SILV) (OTCQB: SVMFF) (\"Silver Valley\" or the \"Company\"), a brownfield exploration Company announces it has signed an asset purchase agreement (the \"Agreement\") on July 12, 2024 with Silver Dollar Resources Incorporated (\"Silver Dollar\") whereby Silver Dollar will acquire from Silver Valley and its subsidiary, North Idaho Metals Corporation, the right, title and interest in the assets related to the \"Ranger-Page Project\" located in Shoshone County, Idaho, USA (the \"Target Assets\"), including the option rights under the Government Gulch Option and Joint Venture Agreement (the \"Government Gulch Agreement\") and the Page Mine Mineral Rights Lease and Option Agreement (the \"Page Mine Agreement\").  The disposition is an arm's length transaction.</p><p>After careful consideration the board of directors weighed its options about how to move the Company forward in the most effective and least capital dilutive way.  With two projects of merit and a share structure that remains in tact, the Company's decision to enter into a sale of the Ranger-Page Project to Silver Dollar was considered to be the most strategic option.  </p><p>The opportunity for Silver Valley to be financed without share dilution, to retain certain royalties, and to have a meaningful participation in the upside of the Ranger-Page project through its approximately 12% equity participation in Silver Dollar, represents a compelling proposal.  The Company's equity position in Silver Dollar also provides it with  the upside potential of Silver Dollar's flagship project in Mexico, <i>La Joya,</i> which has approximately 100 million near surface silver equivalent ounces (see details below) while continuing to be developed. </p><p>Following the transaction, the Company will be in a good position to re-focus its efforts at the <i>Mexi-Can lithium / sulphate of potash project</i> in Mexico that has a large inferred resource outlined at surface with major expansion possibilities.  It will also give the Company financial resources to continue to build out its project portfolio.</p><p>Brandon Rook, CEO commented: \"Selling the Ranger-Page Project to Silver Dollar not only relieves the Company from having to undergo substantial capital dilution in order to meet the financial obligations of approximatley $2,400,000 CAD over the next 15 months, it enables the Company to concentrate its efforts on its <i>Mexi-Can lithium / sulphate of potash project</i> which have historically been its core asset.  With the money and equity received, the structure of the transaction reflected in the Agreement also enables Silver Valley to participate in the upside success of Silver Dollar through both the Ranger-Page and the flagship, La Joya Project.  We believe there is strong upside to Silver Dollar's share value because of its tier one assets in their portfolio today.  With this transaction, Silver Valley avoids diluting its shares on a 2X plus multiple and adds dollars to the treasury at the same time.   Silver Valley will also get to participate in the future success of the <i>Ranger-Page Project </i>through the residual net smelter returns that will be issued.\" </p><p><u><b>About Silver Dollar's Flagship La Joya Asset:</b></u></p><p>Silver Dollar's La Joya project is located in a mining friendly juridsdiction in Mexico, 75 kilometres southeast of Durango, Mexico in a past producing and operating District of prolific mines.  At La Joya, over 51,000 metres of drilling has been completed, of which 37,000 metres has been used to define a large 100 million plus ounce silver dominant historic resource at a cut-off grade of 60 g/t silver equivalent that also includes meaningful copper and gold contributions.</p><p>Subsequent to the published historic inferred resource there was a phase 3 drilling program completed that opened up and expanded large portions of the deposit which to date has not been added to the inferred resource estimate.  The Phase 3 drilling program targeted infill drilling along the Main Mineralized Trend and was successful in confirming strong  mineralization in 15 of 17 drill holes.</p><p style=\"text-align: center;\"><a rel=\"nofollow\" href=\"https://images.newsfilecorp.com/files/7777/216394_5731ce0a146a0b27_002full.jpg\"><img src=\"https://images.newsfilecorp.com/files/7777/216394_5731ce0a146a0b27_002.jpg\" style=\"border-width: 0px;\" alt=\"Cannot view this image? Visit: https://images.newsfilecorp.com/files/7777/216394_5731ce0a146a0b27_002.jpg\" /></a></p><p style=\"text-align: center;\">Historic Resource Estimate<br /><br />To view an enhanced version of this graphic, please visit:<br /><a rel=\"nofollow\" href=\"https://images.newsfilecorp.com/files/7777/216394_5731ce0a146a0b27_002full.jpg\">https://images.newsfilecorp.com/files/7777/216394_5731ce0a146a0b27_002full.jpg</a></p><ul style=\"list-style-type: disc;\"><li>The historic resource estimate at MMT and Santo Nino Deposits resource is historic in nature (2012) and therefore non-NI 43-101 compliant</li></ul><p>Following the phase 3 program, Silver Dollar recently expanded the historic drilling with another drill campaign that yielded new discoveries located within close proximity to the inferred resource.    </p><p>At a <b>~</b> $12 million CAD market cap and over $3,000,000 cash in the treasury Silver Dollar is in a strong position and well on its way to building out the historic inferred resource at La Joya into a significant silver dominant deposit.</p><p><u><b>Transaction Summary:</b></u></p><p>Under the terms of the Agreement, the Company has agreed to assign to Silver Dollar the <i>Target Assets</i> for cash consideration of CAD$300,000 and the issuance of six million (6,000,000) common shares in the capital of Silver Dollar at a deemed price of CAD$0.30 per share (the \"Payment Shares\") for aggregate consideration of CAD$2,100,000. The Payment Shares will be subject to a statutory four-month hold period and contractual escrow in accordance with the following release schedule: </p><table cellspacing=\"0\" cellpadding=\"3\" border=\"0\" style=\"width: 100%; border-collapse: collapse; border-width: 1px; border-style: solid; border-color: #000000;\"><tbody><tr><td style=\"border-width: 1px; border-style: solid; border-color: #000000; width: 50%;\"><b>Release Date</b></td><td style=\"text-align: center; border-width: 1px; border-style: solid; border-color: #000000; width: 50%;\"><b>Release from Contractual Escrow</b></td></tr><tr><td style=\"border-width: 1px; border-style: solid; border-color: #000000; width: 50%;\">Closing Date</td><td style=\"text-align: center; border-width: 1px; border-style: solid; border-color: #000000; width: 50%;\">1,000,000 Payment Shares</td></tr><tr><td style=\"border-width: 1px; border-style: solid; border-color: #000000; width: 50%;\">6-month anniversary of Closing Date</td><td style=\"text-align: center; border-width: 1px; border-style: solid; border-color: #000000; width: 50%;\">1,250,000 Payment Shares</td></tr><tr><td style=\"border-width: 1px; border-style: solid; border-color: #000000; width: 50%;\">12-month anniversary of Closing Date</td><td style=\"text-align: center; border-width: 1px; border-style: solid; border-color: #000000; width: 50%;\">1,250,000 Payment Shares</td></tr><tr><td style=\"border-width: 1px; border-style: solid; border-color: #000000; width: 50%;\">18-month anniversary of Closing Date</td><td style=\"text-align: center; border-width: 1px; border-style: solid; border-color: #000000; width: 50%;\">1,250,000 Payment Shares</td></tr><tr><td style=\"border-width: 1px; border-style: solid; border-color: #000000; width: 50%;\">24-month anniversary of Closing Date</td><td style=\"text-align: center; border-width: 1px; border-style: solid; border-color: #000000; width: 50%;\">1,250,000 Payment Shares</td></tr></tbody></table><p>&#160;</p><p>As part of the Agreement, the parties will enter into a voting support agreement, whereby Silver Valley will, so long as it owns Payment Shares, cast all votes attaching to such shares in favour of electing the individuals recommended by Silver Dollar for election to its board of directors, and will not support a shareholder proposal for consideration at any meeting of shareholders or tender its shares pursuant to a takeover bid not recommended by Silver Dollar's board.</p><p>If Silver Dollar exercises its option under the acquired Government Gulch Agreement, it will grant Silver Valley Metals a royalty equal to 0.5% of net smelter returns from the Government Gulch property. Further, if Silver Dollar exercises its option under the acquired Page Mine Agreement, it will grant Silver Valley Metals a royalty equal to 1% of net smelter returns from the Page Mine property; Silver Dollar may repurchase half of such royalty (0.5% of net smelter returns) at any time for CAD$500,000.</p><p>The Agreement also includes representations, warranties, covenants and indemnities customary in transactions of this nature.</p><p><u>The Government Gulch Agreement:</u></p><p>To exercise its option to acquire a 75% interest in the Government Gulch property under the Government Gulch Agreement (the \"<b>First Option</b>\"), Silver Dollar must pay the optionor US$250,000 and incur approximately US$1,210,000 in exploration expenditures on the property on or before October 18, 2025. </p><p>Within 60 days of exercising the First Option, Silver Dollar has the option to acquire the remaining 25% interest in the Government Gulch property (the \"<b>Second Option</b>\") through good faith negotiations with the optionor. In the event the optionor and the Company cannot agree on a purchase price for the Second Option, the Company can elect the purchase price of the Second Option to be: (a) US$2,250,000, (b) US$1,000,000 and issue US$1,250,000 of Silver Dollar's shares valued at the 20-day volume-weighted average price (\"VWAP\"), or (c) if the optionor so requests, US$2,250,000 of Silver Dollar's shares valued at the 20-day VWAP. </p><p>If Silver Dollar does not exercise the Second Option within 60 days of exercising the First Option, a joint venture will be formed among the parties and Silver Dollar will serve as operator on the project. If Silver Dollar spends more than 90% of the exploration expenditures of such joint venture, under the Government Gulch Agreement, it will automatically acquire the remaining 25% interest in the Government Gulch property and the optionor will receive a 2.0% net smelter returns royalty on the Government Gulch property. Silver Dollar will have the ability to repurchase half of such royalty (1.0% of net smelter returns) for US$1,000,000. </p><p><u>The Page Mine Agreement: </u></p><p>The Page Mine Agreement is a lease and option expiring November 17, 2031 requiring Silver Dollar to pay rental payments of US$30,000 per year. During the term of the lease, Silver Dollar may elect to acquire the Page Mine property for US$1,500,000 less amounts previously paid under the lease. To date, the Vendors have paid US$120,000 pursuant to the lease and option agreement.</p><p>The Company will, subject to TSX Venture Exchange (the \"Exchange\")  acceptance, pay a finder's fee in accordance with Exchange policy consisting of 1,512,500 shares valued at 6 cents per share to Kluane Capital FZCO and 779,166 shares valued at 6 cents per share to Canal Front Investments Inc. in respect of the transaction. The finders' shares will be subject to a statutory four-month hold period.  The finders are non-arm's length to the Company and the purchaser.</p><p>Closing of the transaction is expected to be completed on or before July 31, 2024.</p><p><b>Qualified person:</b></p><p>Timothy Mosey, BSc, MSc, SME, is the qualified person for the company and qualified person as defined by National Instrument 43-101. The QP and the company have not completed sufficient work to verify the information on the La Joya property.</p><p>The independent Qualified Persons for the Technical Report of the La Joya project who have prepared, reviewed and approved the contents of the historic inferred resource estimate are James Barr., P.Geo. from the consulting firm of EBA Engineering Consultants Ltd., a Tetra Tech Company and Ting Lu, P.Eng. (for Metallurgy) from Wardrop Engineering, a Tetra Tech Company.</p><p>Link to Website: <a href=\"https://api.newsfilecorp.com/redirect/O3Za3c4qra\">http://www.silvervalleymetals.com</a></p><p><u><b>Social Media:</b></u></p><p>Facebook: <a href=\"https://api.newsfilecorp.com/redirect/PL1aLIVRGE\">https://www.facebook.com/silvervalmetals</a><br />X:            <a href=\"https://api.newsfilecorp.com/redirect/wWnBWiAnJn\">https://twitter.com/silvervalmetals</a><br />Instagram:   <a href=\"https://api.newsfilecorp.com/redirect/gOAaOCxaY0\">https://www.instagram.com/silvervalmetals</a><br />Linked-In:   <a href=\"https://api.newsfilecorp.com/redirect/pEnjEtRyLw\">https://www.linkedin.com/company/silvervalmetals</a><br />YouTube:      <a href=\"https://api.newsfilecorp.com/redirect/R71a7trZG0\">https://youtube.com/@silvervalmetals</a></p><p><b>About: Mexi-Can Lithium / Potassium (</b><i><b>sulphate of potash</b></i><b>) Project:<br /></b>Silver Valley Metals Corp. owns a 100% interest in a lithium and potassium bearing salar complex comprising 4,056 hectares on three mineral concessions (\"the Mexico-Canada Project\" or \"Mexi-Can Project\") located on the Central Mexican Plateau in the states of Zacatecas, and San Luis Potosi, Mexico. The NI 43-101 inferred mineral resource contains 12.3Mt of Sulfate of Potash (SOP) and 243,000 tonnes of lithium carbonate equivalent (LCE) defined only from surface to an average of 5 metres depth.  The salars remain wide open in all directions for expansion.</p><p><b>About: Ranger-Page Project:<br /></b>The Ranger-Page Project (\"The Project\") is in the Silver Valley, northern Idaho, USA, 60 kilometers east of Coeur d'Alene and 1 kilometer from the I-90 freeway. In 2020 Idaho was ranked the first in the world in policy perception and 9th best mining jurisdiction (Fraser Institute Annual Mining Survey). The Project borders the famous Bunker Hill Mine to the east and, for the first time, consolidates the western extent of the prolific Silver Valley mining corridor by one operator in the past 100+ years.</p><p>The Project comprises 6 historical mines on patented claims, without royalties. The largest of these, the Page Mine, was a top ten producer in the Silver Valley yielding over 1.1 billion pounds of zinc and lead and 14.6 million ounces of silver. The Page Mine has high grade silver-zinc-lead historic reserves and remains open at depth and along strike beyond what has been identified to date. </p><p>Historical mining on the properties have shared underground infrastructure from the larger Page mine to the Blackhawk mine. The Company has underground mining data and surface geological data that supports high grade silver-zinc-lead mineralization present within the other shallow, undeveloped mines. These mines remain open at depth, and laterally along strike. </p><p>Exploration potential beyond the historic mines is considered significant as modern systematic exploration is being applied to the project for the first time.</p><p><b>About: Silver Valley Metals:<br /></b>Silver Valley Metals Corp. is a Canadian exploration company comprised of a group of experienced exploration, mining, and financing specialists focused on the pursuit of mineral discovery and development. We are focused on the advancement of strategic and precious mineral properties including Lithium-Potash in Mexico and Silver-Zinc-Lead in northern Idaho, USA.</p><p>On behalf of the Board of Directors of Silver Valley Metals,</p><p>\"Brandon Rook\"</p><p>Brandon Rook, President &#38; CEO, Director</p><div id=\"contactInfo\"><p>For further information please contact: 604-800-4710<br />Email: <a href=\"mailto:info@silvervalleymetals.com\">info@silvervalleymetals.com</a></p></div><p>NEITHER THE TSX VENTURE EXCHANGE NOR ITS REGULATION SERVICES PROVIDER (AS THAT TERM IS DEFINED IN POLICIES OF THE TSX VENTURE EXCHANGE) ACCEPTS RESPONSIBILITY FOR THE ADEQUACY OR ACCURACY OF THIS RELEASE.</p><p>The information contained herein contains \"forward-looking statements\" within the meaning of applicable securities legislation. Forward-looking statements relate to information that is based on assumptions of management, forecasts of future results, and estimates of amounts not yet determinable. Any statements that express predictions, expectations, beliefs, plans, projections, objectives, assumptions or future events or performance are not statements of historical fact and may be \"forward-looking statements.\" Forward-looking statements are subject to a variety of risks and uncertainties which could cause actual events or results to differ from those reflected in the forward-looking statements, including, without limitation: risks related to failure to obtain adequate financing on a timely basis and on acceptable terms; risks related to the outcome of legal proceedings; political and regulatory risks associated with mining and exploration; risks related to the maintenance of stock exchange listings; risks related to environmental regulation and liability; the potential for delays in exploration or development activities or the completion of feasibility studies; the uncertainty of profitability; risks and uncertainties relating to the interpretation of drill results, the geology, grade and continuity of mineral deposits; risks related to the inherent uncertainty of production and cost estimates and the potential for unexpected costs and expenses; results of prefeasibility and feasibility studies, and the possibility that future exploration, development or mining results will not be consistent with the Company's expectations; risks related to commodity price fluctuations; and other risks and uncertainties related to the Company's prospects, properties and business detailed elsewhere in the Company's disclosure record. Should one or more of these risks and uncertainties materialize, or should underlying assumptions prove incorrect, actual results may vary materially from those described in forward-looking statements. Investors are cautioned against attributing undue certainty to forward-looking statements. These forward-looking statements are made as of the date hereof and the Company does not assume any obligation to update or revise them to reflect new events or circumstances. Actual events or results could differ materially from the Company's expectations or projections.</p><p id=\"corporateNewsLogoContainer\"><img src=\"https://images.newsfilecorp.com/files/7777/216394_5731ce0a146a0b27_logo.jpg\" id=\"corporateNewsLogo\" alt=\"Corporate Logo\" /></p><p id=\"corporateLinkBack\">To view the source version of this press release, please visit <a href=\"https://api.newsfilecorp.com/redirect/0VPQVfE2vo\">https://www.newsfilecorp.com/release/216394</a></p>",
    "search_terms": "Ranger-Page,Silver Valley Metals Corp.,SILV",
    "master_gid": 7995,
    "date": "2024-07-15T11:30:00.000Z",
    "tags": "USA|Idaho||Silver|Project Acquisition",
    "image_id": null,
    "hidden": false,
    "company_id": 1729,
    "provider": "newsfilecorp",
    "excerpt": "Vancouver, British Columbia--(Newsfile Corp. - July 15, 2024) - Silver Valley Metals Corp. (TSXV: SILV) (OTCQB: SVMFF) (\"Silver Valley\" or the \"Company\"), a brownfield exploration Company announces it has signed an asset purchase agreement (the \"Agreement\") on July 12, 2024 with Silver Dollar Resources Incorporated (\"Silver Dollar\") whereby Silver Dollar",
    "is_regulatory": false,
    "refined_tags": [],
    "ftp_filename": null,
    "company_name": "Silver Dollar Resources Inc.",
    "exchange": "TSXV",
    "root_ticker": "SILV",
    "project_name": "Ranger-Page",
    "gid": 7995,
    "location": null,
    "plan_id": null,
    "description_text": "Vancouver, British Columbia--(Newsfile Corp. - July 15, 2024) - Silver Valley Metals Corp. (TSXV: SILV) (OTCQB: SVMFF) (\"Silver Valley\" or the \"Company\"), a brownfield exploration Company announces it has signed an asset purchase agreement (the \"Agreement\") on July 12, 2024 with Silver Dollar Resources Incorporated (\"Silver Dollar\") whereby Silver Dollar will acquire from Silver Valley and its subsidiary, North Idaho Metals Corporation, the right, title and interest in the assets related to the \"Ranger-Page Project\" located in Shoshone County, Idaho, USA (the \"Target Assets\"), including the option rights under the Government Gulch Option and Joint Venture Agreement (the \"Government Gulch Agreement\") and the Page Mine Mineral Rights Lease and Option Agreement (the \"Page Mine Agreement\").  The disposition is an arm's length transaction. After careful consideration the board of directors weighed its options about how to move the Company forward in the most effective and least capital dilutive way.  With two projects of merit and a share structure that remains in tact, the Company's decision to enter into a sale of the Ranger-Page Project to Silver Dollar was considered to be the most strategic option. The opportunity for Silver Valley to be financed without share dilution, to retain certain royalties, and to have a meaningful participation in the upside of the Ranger-Page project through its approximately 12% equity participation in Silver Dollar, represents a compelling proposal.  The Company's equity position in Silver Dollar also provides it with  the upside potential of Silver Dollar's flagship project in Mexico, La Joya, which has approximately 100 million near surface silver equivalent ounces (see details below) while continuing to be developed. Following the transaction, the Company will be in a good position to re-focus its efforts at the Mexi-Can lithium / sulphate of potash project in Mexico that has a large inferred resource outlined at surface with major expansion possibilities.  It will also give the Company financial resources to continue to build out its project portfolio. Brandon Rook, CEO commented: \"Selling the Ranger-Page Project to Silver Dollar not only relieves the Company from having to undergo substantial capital dilution in order to meet the financial obligations of approximatley $2,400,000 CAD over the next 15 months, it enables the Company to concentrate its efforts on its Mexi-Can lithium / sulphate of potash project which have historically been its core asset.  With the money and equity received, the structure of the transaction reflected in the Agreement also enables Silver Valley to participate in the upside success of Silver Dollar through both the Ranger-Page and the flagship, La Joya Project.  We believe there is strong upside to Silver Dollar's share value because of its tier one assets in their portfolio today.  With this transaction, Silver Valley avoids diluting its shares on a 2X plus multiple and adds dollars to the treasury at the same time.   Silver Valley will also get to participate in the future success of the Ranger-Page Project through the residual net smelter returns that will be issued.\" About Silver Dollar's Flagship La Joya Asset: Silver Dollar's La Joya project is located in a mining friendly juridsdiction in Mexico, 75 kilometres southeast of Durango, Mexico in a past producing and operating District of prolific mines.  At La Joya, over 51,000 metres of drilling has been completed, of which 37,000 metres has been used to define a large 100 million plus ounce silver dominant historic resource at a cut-off grade of 60 g/t silver equivalent that also includes meaningful copper and gold contributions. Subsequent to the published historic inferred resource there was a phase 3 drilling program completed that opened up and expanded large portions of the deposit which to date has not been added to the inferred resource estimate.  The Phase 3 drilling program targeted infill drilling along the Main Mineralized Trend and was successful in confirming strong  mineralization in 15 of 17 drill holes. Historic Resource Estimate To view an enhanced version of this graphic, please visit: https://images.newsfilecorp.com/files/7777/216394_5731ce0a146a0b27_002full.jpg The historic resource estimate at MMT and Santo Nino Deposits resource is historic in nature (2012) and therefore non-NI 43-101 compliant Following the phase 3 program, Silver Dollar recently expanded the historic drilling with another drill campaign that yielded new discoveries located within close proximity to the inferred resource. At a ~ $12 million CAD market cap and over $3,000,000 cash in the treasury Silver Dollar is in a strong position and well on its way to building out the historic inferred resource at La Joya into a significant silver dominant deposit. Transaction Summary: Under the terms of the Agreement, the Company has agreed to assign to Silver Dollar the Target Assets for cash consideration of CAD$300,000 and the issuance of six million (6,000,000) common shares in the capital of Silver Dollar at a deemed price of CAD$0.30 per share (the \"Payment Shares\") for aggregate consideration of CAD$2,100,000. The Payment Shares will be subject to a statutory four-month hold period and contractual escrow in accordance with the following release schedule: Release Date Release from Contractual Escrow Closing Date 1,000,000 Payment Shares 6-month anniversary of Closing Date 1,250,000 Payment Shares 12-month anniversary of Closing Date 1,250,000 Payment Shares 18-month anniversary of Closing Date 1,250,000 Payment Shares 24-month anniversary of Closing Date 1,250,000 Payment Shares As part of the Agreement, the parties will enter into a voting support agreement, whereby Silver Valley will, so long as it owns Payment Shares, cast all votes attaching to such shares in favour of electing the individuals recommended by Silver Dollar for election to its board of directors, and will not support a shareholder proposal for consideration at any meeting of shareholders or tender its shares pursuant to a takeover bid not recommended by Silver Dollar's board. If Silver Dollar exercises its option under the acquired Government Gulch Agreement, it will grant Silver Valley Metals a royalty equal to 0.5% of net smelter returns from the Government Gulch property. Further, if Silver Dollar exercises its option under the acquired Page Mine Agreement, it will grant Silver Valley Metals a royalty equal to 1% of net smelter returns from the Page Mine property; Silver Dollar may repurchase half of such royalty (0.5% of net smelter returns) at any time for CAD$500,000. The Agreement also includes representations, warranties, covenants and indemnities customary in transactions of this nature. The Government Gulch Agreement: To exercise its option to acquire a 75% interest in the Government Gulch property under the Government Gulch Agreement (the \" First Option \"), Silver Dollar must pay the optionor US$250,000 and incur approximately US$1,210,000 in exploration expenditures on the property on or before October 18, 2025. Within 60 days of exercising the First Option, Silver Dollar has the option to acquire the remaining 25% interest in the Government Gulch property (the \" Second Option \") through good faith negotiations with the optionor. In the event the optionor and the Company cannot agree on a purchase price for the Second Option, the Company can elect the purchase price of the Second Option to be: (a) US$2,250,000, (b) US$1,000,000 and issue US$1,250,000 of Silver Dollar's shares valued at the 20-day volume-weighted average price (\"VWAP\"), or (c) if the optionor so requests, US$2,250,000 of Silver Dollar's shares valued at the 20-day VWAP. If Silver Dollar does not exercise the Second Option within 60 days of exercising the First Option, a joint venture will be formed among the parties and Silver Dollar will serve as operator on the project. If Silver Dollar spends more than 90% of the exploration expenditures of such joint venture, under the Government Gulch Agreement, it will automatically acquire the remaining 25% interest in the Government Gulch property and the optionor will receive a 2.0% net smelter returns royalty on the Government Gulch property. Silver Dollar will have the ability to repurchase half of such royalty (1.0% of net smelter returns) for US$1,000,000. The Page Mine Agreement: The Page Mine Agreement is a lease and option expiring November 17, 2031 requiring Silver Dollar to pay rental payments of US$30,000 per year. During the term of the lease, Silver Dollar may elect to acquire the Page Mine property for US$1,500,000 less amounts previously paid under the lease. To date, the Vendors have paid US$120,000 pursuant to the lease and option agreement. The Company will, subject to TSX Venture Exchange (the \"Exchange\")  acceptance, pay a finder's fee in accordance with Exchange policy consisting of 1,512,500 shares valued at 6 cents per share to Kluane Capital FZCO and 779,166 shares valued at 6 cents per share to Canal Front Investments Inc. in respect of the transaction. The finders' shares will be subject to a statutory four-month hold period.  The finders are non-arm's length to the Company and the purchaser. Closing of the transaction is expected to be completed on or before July 31, 2024. Qualified person: Timothy Mosey, BSc, MSc, SME, is the qualified person for the company and qualified person as defined by National Instrument 43-101. The QP and the company have not completed sufficient work to verify the information on the La Joya property. The independent Qualified Persons for the Technical Report of the La Joya project who have prepared, reviewed and approved the contents of the historic inferred resource estimate are James Barr., P.Geo. from the consulting firm of EBA Engineering Consultants Ltd., a Tetra Tech Company and Ting Lu, P.Eng. (for Metallurgy) from Wardrop Engineering, a Tetra Tech Company. Link to Website: http://www.silvervalleymetals.com Social Media: Facebook: https://www.facebook.com/silvervalmetals X: https://twitter.com/silvervalmetals Instagram: https://www.instagram.com/silvervalmetals Linked-In: https://www.linkedin.com/company/silvervalmetals YouTube: https://youtube.com/@silvervalmetals About: Mexi-Can Lithium / Potassium ( sulphate of potash ) Project: Silver Valley Metals Corp. owns a 100% interest in a lithium and potassium bearing salar complex comprising 4,056 hectares on three mineral concessions (\"the Mexico-Canada Project\" or \"Mexi-Can Project\") located on the Central Mexican Plateau in the states of Zacatecas, and San Luis Potosi, Mexico. The NI 43-101 inferred mineral resource contains 12.3Mt of Sulfate of Potash (SOP) and 243,000 tonnes of lithium carbonate equivalent (LCE) defined only from surface to an average of 5 metres depth.  The salars remain wide open in all directions for expansion. About: Ranger-Page Project: The Ranger-Page Project (\"The Project\") is in the Silver Valley, northern Idaho, USA, 60 kilometers east of Coeur d'Alene and 1 kilometer from the I-90 freeway. In 2020 Idaho was ranked the first in the world in policy perception and 9th best mining jurisdiction (Fraser Institute Annual Mining Survey). The Project borders the famous Bunker Hill Mine to the east and, for the first time, consolidates the western extent of the prolific Silver Valley mining corridor by one operator in the past 100+ years. The Project comprises 6 historical mines on patented claims, without royalties. The largest of these, the Page Mine, was a top ten producer in the Silver Valley yielding over 1.1 billion pounds of zinc and lead and 14.6 million ounces of silver. The Page Mine has high grade silver-zinc-lead historic reserves and remains open at depth and along strike beyond what has been identified to date. Historical mining on the properties have shared underground infrastructure from the larger Page mine to the Blackhawk mine. The Company has underground mining data and surface geological data that supports high grade silver-zinc-lead mineralization present within the other shallow, undeveloped mines. These mines remain open at depth, and laterally along strike. Exploration potential beyond the historic mines is considered significant as modern systematic exploration is being applied to the project for the first time. About: Silver Valley Metals: Silver Valley Metals Corp. is a Canadian exploration company comprised of a group of experienced exploration, mining, and financing specialists focused on the pursuit of mineral discovery and development. We are focused on the advancement of strategic and precious mineral properties including Lithium-Potash in Mexico and Silver-Zinc-Lead in northern Idaho, USA. On behalf of the Board of Directors of Silver Valley Metals, \"Brandon Rook\" Brandon Rook, President & CEO, Director For further information please contact: 604-800-4710 Email: info@silvervalleymetals.com NEITHER THE TSX VENTURE EXCHANGE NOR ITS REGULATION SERVICES PROVIDER (AS THAT TERM IS DEFINED IN POLICIES OF THE TSX VENTURE EXCHANGE) ACCEPTS RESPONSIBILITY FOR THE ADEQUACY OR ACCURACY OF THIS RELEASE. The information contained herein contains \"forward-looking statements\" within the meaning of applicable securities legislation. Forward-looking statements relate to information that is based on assumptions of management, forecasts of future results, and estimates of amounts not yet determinable. Any statements that express predictions, expectations, beliefs, plans, projections, objectives, assumptions or future events or performance are not statements of historical fact and may be \"forward-looking statements.\" Forward-looking statements are subject to a variety of risks and uncertainties which could cause actual events or results to differ from those reflected in the forward-looking statements, including, without limitation: risks related to failure to obtain adequate financing on a timely basis and on acceptable terms; risks related to the outcome of legal proceedings; political and regulatory risks associated with mining and exploration; risks related to the maintenance of stock exchange listings; risks related to environmental regulation and liability; the potential for delays in exploration or development activities or the completion of feasibility studies; the uncertainty of profitability; risks and uncertainties relating to the interpretation of drill results, the geology, grade and continuity of mineral deposits; risks related to the inherent uncertainty of production and cost estimates and the potential for unexpected costs and expenses; results of prefeasibility and feasibility studies, and the possibility that future exploration, development or mining results will not be consistent with the Company's expectations; risks related to commodity price fluctuations; and other risks and uncertainties related to the Company's prospects, properties and business detailed elsewhere in the Company's disclosure record. Should one or more of these risks and uncertainties materialize, or should underlying assumptions prove incorrect, actual results may vary materially from those described in forward-looking statements. Investors are cautioned against attributing undue certainty to forward-looking statements. These forward-looking statements are made as of the date hereof and the Company does not assume any obligation to update or revise them to reflect new events or circumstances. Actual events or results could differ materially from the Company's expectations or projections. To view the source version of this press release, please visit https://www.newsfilecorp.com/release/216394",
    "primary_commodity": "Zn"
  },
  "articleProject": {
    "gid": 7995,
    "project_name": "Ranger-Page",
    "location": null
  },
  "articleExchange": "TSXV",
  "articleCompanyId": 1729,
  "articleTicker": "SILV",
  "articleCompanyName": "Silver Valley Metals Corp.",
  "allOtherCompanyProjects": [
    {
      "company_id": 1729,
      "gid": 4636,
      "project_name": "MexiCan",
      "location": "Zacatecas, Mexico"
    }
  ],
  "allOtherCompanyNews": [
    {
      "id": 97077,
      "company_id": 1729,
      "title": "SILVER VALLEY METALS POSTPONES ANNUAL MEETING",
      "link": "https://app.quotemedia.com/data/downloadFiling?webmasterId=104408&ref=674f8ea89f49b630f1028a91&type=PDFC&formType=002-002-001089-003001&formDescription=News+release&dateFiled=2024-12-03",
      "date": "2024-12-03T23:05:12.000Z",
      "hidden": false
    },
    {
      "id": 67758,
      "company_id": 1729,
      "title": "Silver Valley Metals Announces Closing of the Sale of the Ranger-Page Project in the Silver Valley, Northern Idaho, USA",
      "link": "https://www.newsfilecorp.com/release/219097/Silver-Valley-Metals-Announces-Closing-of-the-Sale-of-the-RangerPage-Project-in-the-Silver-Valley-Northern-Idaho-USA",
      "date": "2024-08-07T12:00:00.000Z",
      "hidden": false
    },
    {
      "id": 64990,
      "company_id": 1729,
      "title": "Silver Valley Metals Announces Sale of the Ranger-Page Project in the Silver Valley, Northern Idaho, USA",
      "link": "https://www.newsfilecorp.com/release/216394/Silver-Valley-Metals-Announces-Sale-of-the-RangerPage-Project-in-the-Silver-Valley-Northern-Idaho-USA",
      "date": "2024-07-15T11:30:00.000Z",
      "hidden": false
    },
    {
      "id": 47344,
      "company_id": 1729,
      "title": "Silver Valley Metals Announces Positive Resolution of Issues Relating to its Mexi-Can Sulphate of Potash and Lithium Project; Exploration to Recommence",
      "link": "https://www.newsfilecorp.com/release/194366/Silver-Valley-Metals-Announces-Positive-Resolution-of-Issues-Relating-to-its-MexiCan-Sulphate-of-Potash-and-Lithium-Project-Exploration-to-Recommence",
      "date": "2024-01-16T13:00:00.000Z",
      "hidden": false
    },
    {
      "id": 44356,
      "company_id": 1729,
      "title": "Silver Valley Metals Announces Change to Board of Directors and Provides Corporate Update",
      "link": "https://www.newsfilecorp.com/release/187810/Silver-Valley-Metals-Announces-Change-to-Board-of-Directors-and-Provides-Corporate-Update",
      "date": "2023-11-17T13:00:00.000Z",
      "hidden": false
    },
    {
      "id": 41057,
      "company_id": 1729,
      "title": "Silver Valley Metals Provides Corporate Update",
      "link": "https://contentapi.cision.com/api/v1.0/releases/20230918C4622",
      "date": "2023-09-18T11:00:00.000Z",
      "hidden": false
    },
    {
      "id": 97075,
      "company_id": 1729,
      "title": "Silver Valley Metals Closes $685,874 Non-Brokered Private Placement Financing",
      "link": "https://app.quotemedia.com/data/downloadFiling?webmasterId=104408&ref=64cbcc963d8e6568682a4ae4&type=PDFC&formType=002-002-001089-003001&formDescription=News+release&dateFiled=2023-08-03",
      "date": "2023-08-03T15:49:42.000Z",
      "hidden": false
    },
    {
      "id": 97076,
      "company_id": 1729,
      "title": "Silver Valley Metals Files for Final Approval to Close its Non-Brokered Private Placement Financing",
      "link": "https://app.quotemedia.com/data/downloadFiling?webmasterId=104408&ref=64cbc0fe38b88652d160f156&type=PDFC&formType=002-002-001089-003001&formDescription=News+release&dateFiled=2023-08-03",
      "date": "2023-08-03T15:00:14.000Z",
      "hidden": false
    },
    {
      "id": 38137,
      "company_id": 1729,
      "title": "Silver Valley Metals Files for Approval of Non-Brokered Private Placement Financing; Expiry of Warrant Exercise Incentive Program",
      "link": "https://www.newsfilecorp.com/release/173894/Silver-Valley-Metals-Files-for-Approval-of-NonBrokered-Private-Placement-Financing-Expiry-of-Warrant-Exercise-Incentive-Program",
      "date": "2023-07-18T12:00:00.000Z",
      "hidden": false
    },
    {
      "id": 37274,
      "company_id": 1729,
      "title": "Silver Valley Metals Announces Discovery of Mineralized Vein Structures At Surface Extending Crown Point Mine 220 Metres West at the Ranger-Page Project, North Idaho, USA",
      "link": "https://contentapi.cision.com/api/v1.0/releases/20230628VA44779",
      "date": "2023-06-28T12:00:00.000Z",
      "hidden": false
    }
  ]
}