{
  "article": {
    "id": 67758,
    "link": "https://www.newsfilecorp.com/release/219097/Silver-Valley-Metals-Announces-Closing-of-the-Sale-of-the-RangerPage-Project-in-the-Silver-Valley-Northern-Idaho-USA",
    "title": "Silver Valley Metals Announces Closing of the Sale of the Ranger-Page Project in the Silver Valley, Northern Idaho, USA",
    "description": "<img src=\"https://api.newsfilecorp.com/newsinfo/219097/367\" id=\"367\" width=\"2\" height=\"2\" style=\"width: 1px;  height: 1px;border: 0px solid;\" /><p>Vancouver, British Columbia--(Newsfile Corp. - August 7, 2024) - Silver Valley Metals Corp. (TSXV: SILV) (OTCQB: SVMFF) (\"Silver Valley\" or the \"Company\"), announces that the sale of the Ranger-Page Project in the Silver Valley, northern Idaho, USA has closed.  On July 15, 2024 the Company press released (the \"Initial News Release\") the signing of an asset purchase agreement (the \"Agreement\") with Silver Dollar Resources Incorporated (\"Silver Dollar\") whereby Silver Dollar aquired the right to acquire from Silver Valley and its subsidiary, North Idaho Metals Corporation, the right, title and interest in the assets related to the \"Ranger-Page Project\" located in Shoshone County, Idaho, USA (the \"Target Assets\"), including the option rights under the Government Gulch Option and Joint Venture Agreement (the \"Government Gulch Agreement\") and the Page Mine Mineral Rights Lease and Option Agreement (the \"Page Mine Agreement\").  The disposition transaction does not involve non-arm's length parties.</p><p>The sale of the Ranger-Page Project to Silver Dollar will relieve the Company from having to undergo substantial capital dilution in order to meet the financial obligations of the project over the next year while enabling Silver Valley to participate in the upside success of Silver Dollar through both the Ranger-Page project and Silver Dollar's project portfolio via receiving equity in Silver Dollar, receiving residual net smelter returns from both projects as well as cash. </p><p>With the money and equity received from the transaction, the Company will be in a solid position to re-focus its efforts at the <i>Mexi-Can lithium / sulphate of potash project</i> in Mexico that has a large inferred resource outlined at surface with major expansion possibilities.  It will also give the Company financial resources to continue to build out its project portfolio. </p><p>Under the terms of the Agreement, the Company has agreed to assign to Silver Dollar the <i>Target Assets</i> for cash consideration of CAD$300,000 (the \"Cash Payment\") and the issuance of six million (6,000,000) common shares in the capital of Silver Dollar at a deemed price of CAD$0.30 per share (the \"Payment Shares\") for aggregate consideration of CAD$2,100,000. The Cash Payment has been paid to the Company and all  Payment Shares have been issued to the Company upfront in conjunction with the closing of the transaction. The Payment Shares are subject to a statutory four-month hold period and contractual escrow as described in the July 15, 2024 press release. </p><p>If Silver Dollar exercises its option under the acquired Government Gulch Agreement, it will grant Silver Valley Metals a royalty equal to 0.5% of net smelter returns from the Government Gulch property. Further, if Silver Dollar exercises its option under the acquired Page Mine Agreement, it will grant Silver Valley Metals a royalty equal to 1% of net smelter returns from the Page Mine property; Silver Dollar may repurchase half of such royalty (0.5% of net smelter returns) at any time for CAD$500,000.</p><p><u>The Government Gulch Agreement:</u></p><p>For Silver Dollar to exercise its option to acquire a 75% interest in the Government Gulch property under the Government Gulch Agreement (the \"<b>First Option</b>\"), Silver Dollar must pay the optionor US$250,000 and incur approximately US$1,210,000 in exploration expenditures on the property on or before October 18, 2025.  From the inception of the Government Gulch Agreement, Silver Valley has paid the underlying optionor US$400,000 and incurred approximately US$1,790,000 in exploration expenditures. Silver Dollar will assume the remaining payment and exploration obligations under the Government Gulch Agreement.</p><p>Within 60 days of exercising the First Option, Silver Dollar has the option to acquire the remaining 25% interest in the Government Gulch property (the \"<b>Second Option</b>\") through good faith negotiations with the optionor. In the event the optionor and the Company cannot agree on a purchase price for the Second Option, the Company can elect the purchase price of the Second Option to be: (a) US$2,250,000, (b) US$1,000,000 and issue US$1,250,000 of Silver Dollar's shares valued at the 20-day volume-weighted average price (\"VWAP\"), or (c) if the optionor so requests, US$2,250,000 of Silver Dollar's shares valued at the 20-day VWAP. </p><p>If Silver Dollar does not exercise the Second Option within 60 days of exercising the First Option, a joint venture will be formed among the parties and Silver Dollar will serve as operator on the project. If Silver Dollar spends more than 90% of the exploration expenditures of such joint venture, under the Government Gulch Agreement, it will automatically acquire the remaining 25% interest in the Government Gulch property and the optionor will receive a 2.0% net smelter returns royalty on the Government Gulch property. Silver Dollar will have the ability to repurchase half of such royalty (1.0% of net smelter returns) for US$1,000,000. </p><p><u>The Page Mine Agreement: </u></p><p>The Page Mine Agreement is a lease and option expiring November 17, 2031 requiring Silver Dollar to pay rental payments of US$30,000 per year. During the term of the lease, Silver Dollar may elect to acquire the Page Mine property for US$1,500,000 less amounts previously paid under the lease. To date, Silver Valley has paid US$120,000 pursuant to the lease and option agreement and no exploration expenditures were incurred on the property. Silver Dollar will assume the remaining payment obligations under the the Page Mine Agreement.</p><p>Finders' Fees</p><p>The Company has paid a finder's fee in accordance with TSXV policy consisting of 1,512,500 shares valued at 6 cents per share to Kluane Capital FZCO and 779,166 shares valued at 6 cents per share to Canal Front Investments Inc. in respect of the transaction. The finders' shares are subject to a statutory four-month hold period.  The Initial News Release contained a typo in as much as it referred to the finders as being non-arm's length to the Company and Silver Dollar. The finders are in fact arm's length to the Company and Silver Dollar.</p><p>Link to Website: <a href=\"https://api.newsfilecorp.com/redirect/BpJzEiGJVq\">http://www.silvervalleymetals.com</a></p><p><u><b>Social Media:</b></u></p><p>Facebook: <a href=\"https://api.newsfilecorp.com/redirect/55aP8U4VJ2\">https://www.facebook.com/silvervalmetals</a><br />X:            <a href=\"https://api.newsfilecorp.com/redirect/LGP3yUaY0W\">https://twitter.com/silvervalmetals</a><br />Instagram:   <a href=\"https://api.newsfilecorp.com/redirect/oLbmQFMw55\">https://www.instagram.com/silvervalmetals</a><br />Linked-In:   <a href=\"https://api.newsfilecorp.com/redirect/O3pWNc7Yba\">https://www.linkedin.com/company/silvervalmetals</a><br />YouTube:      <a href=\"https://api.newsfilecorp.com/redirect/PLY3XFLXmE\">https://youtube.com/@silvervalmetals</a></p><p><b>About: Mexi-Can Lithium / Potassium (</b><i><b>sulphate of potash</b></i><b>) Project:</b></p><p>Silver Valley Metals Corp. owns a 100% interest in a lithium and potassium bearing salar complex comprising 4,056 hectares on three mineral concessions (\"the Mexico-Canada Project\" or \"Mexi-Can Project\") located on the Central Mexican Plateau in the states of Zacatecas, and San Luis Potosi, Mexico. The NI 43-101 inferred mineral resource contains 12.3Mt of Sulfate of Potash (SOP) and 243,000 tonnes of lithium carbonate equivalent (LCE) defined only from surface to an average of 5 metres depth.  The salars remain wide open in all directions for expansion.</p><p><b>About: Silver Valley Metals:</b></p><p>Silver Valley Metals Corp. is a Canadian exploration company comprised of a group of experienced exploration, mining, and financing specialists focused on the pursuit of mineral discovery and development. We are focused on the advancement of strategic and precious mineral properties including Lithium-Potash in Mexico and and an ownership stake in the Ranger-Page silver-zinc-lead project in the Silver Valley of Idaho through equity ownership in Silver Dollar Resources and residual net smelter returns at the project.   </p><p>On behalf of the Board of Directors of Silver Valley Metals,</p><p>\"Brandon Rook\"</p><p>Brandon Rook, President &#38; CEO, Director</p><div id=\"contactInfo\"><p>For further information please contact: 604-800-4710<br />Email: <a href=\"mailto:info@silvervalleymetals.com\">info@silvervalleymetals.com</a></p></div><p>NEITHER THE TSX VENTURE EXCHANGE NOR ITS REGULATION SERVICES PROVIDER (AS THAT TERM IS DEFINED IN POLICIES OF THE TSX VENTURE EXCHANGE) ACCEPTS RESPONSIBILITY FOR THE ADEQUACY OR ACCURACY OF THIS RELEASE.</p><p>The information contained herein contains \"forward-looking statements\" within the meaning of applicable securities legislation. Forward-looking statements relate to information that is based on assumptions of management, forecasts of future results, and estimates of amounts not yet determinable. Any statements that express predictions, expectations, beliefs, plans, projections, objectives, assumptions or future events or performance are not statements of historical fact and may be \"forward-looking statements.\" Forward-looking statements are subject to a variety of risks and uncertainties which could cause actual events or results to differ from those reflected in the forward-looking statements, including, without limitation: risks related to failure to obtain adequate financing on a timely basis and on acceptable terms; risks related to the outcome of legal proceedings; political and regulatory risks associated with mining and exploration; risks related to the maintenance of stock exchange listings; risks related to environmental regulation and liability; the potential for delays in exploration or development activities or the completion of feasibility studies; the uncertainty of profitability; risks and uncertainties relating to the interpretation of drill results, the geology, grade and continuity of mineral deposits; risks related to the inherent uncertainty of production and cost estimates and the potential for unexpected costs and expenses; results of prefeasibility and feasibility studies, and the possibility that future exploration, development or mining results will not be consistent with the Company's expectations; risks related to commodity price fluctuations; and other risks and uncertainties related to the Company's prospects, properties and business detailed elsewhere in the Company's disclosure record. Should one or more of these risks and uncertainties materialize, or should underlying assumptions prove incorrect, actual results may vary materially from those described in forward-looking statements. Investors are cautioned against attributing undue certainty to forward-looking statements. These forward-looking statements are made as of the date hereof and the Company does not assume any obligation to update or revise them to reflect new events or circumstances. Actual events or results could differ materially from the Company's expectations or projections.</p><p id=\"corporateNewsLogoContainer\"><img src=\"https://images.newsfilecorp.com/files/7777/219097_9053161754fb39a8_logo.jpg\" id=\"corporateNewsLogo\" alt=\"Corporate Logo\" /></p><p id=\"corporateLinkBack\">To view the source version of this press release, please visit <a href=\"https://api.newsfilecorp.com/redirect/wWbRPHyQpn\">https://www.newsfilecorp.com/release/219097</a></p>",
    "search_terms": "Ranger-Page,Silver Valley Metals Corp.,SILV",
    "master_gid": 7995,
    "date": "2024-08-07T12:00:00.000Z",
    "tags": "USA|Idaho||Silver|Project Acquisition",
    "image_id": null,
    "hidden": false,
    "company_id": 1729,
    "provider": "newsfilecorp",
    "excerpt": "Vancouver, British Columbia--(Newsfile Corp. - August 7, 2024) - Silver Valley Metals Corp. (TSXV: SILV) (OTCQB: SVMFF) (\"Silver Valley\" or the \"Company\"), announces that the sale of the Ranger-Page Project in the Silver Valley, northern Idaho, USA has closed. On July 15, 2024 the Company press released (the \"Initial News",
    "is_regulatory": false,
    "refined_tags": [],
    "ftp_filename": null,
    "company_name": "Silver Dollar Resources Inc.",
    "exchange": "TSXV",
    "root_ticker": "SILV",
    "project_name": "Ranger-Page",
    "gid": 7995,
    "location": null,
    "plan_id": null,
    "description_text": "Vancouver, British Columbia--(Newsfile Corp. - August 7, 2024) - Silver Valley Metals Corp. (TSXV: SILV) (OTCQB: SVMFF) (\"Silver Valley\" or the \"Company\"), announces that the sale of the Ranger-Page Project in the Silver Valley, northern Idaho, USA has closed.  On July 15, 2024 the Company press released (the \"Initial News Release\") the signing of an asset purchase agreement (the \"Agreement\") with Silver Dollar Resources Incorporated (\"Silver Dollar\") whereby Silver Dollar aquired the right to acquire from Silver Valley and its subsidiary, North Idaho Metals Corporation, the right, title and interest in the assets related to the \"Ranger-Page Project\" located in Shoshone County, Idaho, USA (the \"Target Assets\"), including the option rights under the Government Gulch Option and Joint Venture Agreement (the \"Government Gulch Agreement\") and the Page Mine Mineral Rights Lease and Option Agreement (the \"Page Mine Agreement\").  The disposition transaction does not involve non-arm's length parties. The sale of the Ranger-Page Project to Silver Dollar will relieve the Company from having to undergo substantial capital dilution in order to meet the financial obligations of the project over the next year while enabling Silver Valley to participate in the upside success of Silver Dollar through both the Ranger-Page project and Silver Dollar's project portfolio via receiving equity in Silver Dollar, receiving residual net smelter returns from both projects as well as cash. With the money and equity received from the transaction, the Company will be in a solid position to re-focus its efforts at the Mexi-Can lithium / sulphate of potash project in Mexico that has a large inferred resource outlined at surface with major expansion possibilities.  It will also give the Company financial resources to continue to build out its project portfolio. Under the terms of the Agreement, the Company has agreed to assign to Silver Dollar the Target Assets for cash consideration of CAD$300,000 (the \"Cash Payment\") and the issuance of six million (6,000,000) common shares in the capital of Silver Dollar at a deemed price of CAD$0.30 per share (the \"Payment Shares\") for aggregate consideration of CAD$2,100,000. The Cash Payment has been paid to the Company and all  Payment Shares have been issued to the Company upfront in conjunction with the closing of the transaction. The Payment Shares are subject to a statutory four-month hold period and contractual escrow as described in the July 15, 2024 press release. If Silver Dollar exercises its option under the acquired Government Gulch Agreement, it will grant Silver Valley Metals a royalty equal to 0.5% of net smelter returns from the Government Gulch property. Further, if Silver Dollar exercises its option under the acquired Page Mine Agreement, it will grant Silver Valley Metals a royalty equal to 1% of net smelter returns from the Page Mine property; Silver Dollar may repurchase half of such royalty (0.5% of net smelter returns) at any time for CAD$500,000. The Government Gulch Agreement: For Silver Dollar to exercise its option to acquire a 75% interest in the Government Gulch property under the Government Gulch Agreement (the \" First Option \"), Silver Dollar must pay the optionor US$250,000 and incur approximately US$1,210,000 in exploration expenditures on the property on or before October 18, 2025.  From the inception of the Government Gulch Agreement, Silver Valley has paid the underlying optionor US$400,000 and incurred approximately US$1,790,000 in exploration expenditures. Silver Dollar will assume the remaining payment and exploration obligations under the Government Gulch Agreement. Within 60 days of exercising the First Option, Silver Dollar has the option to acquire the remaining 25% interest in the Government Gulch property (the \" Second Option \") through good faith negotiations with the optionor. In the event the optionor and the Company cannot agree on a purchase price for the Second Option, the Company can elect the purchase price of the Second Option to be: (a) US$2,250,000, (b) US$1,000,000 and issue US$1,250,000 of Silver Dollar's shares valued at the 20-day volume-weighted average price (\"VWAP\"), or (c) if the optionor so requests, US$2,250,000 of Silver Dollar's shares valued at the 20-day VWAP. If Silver Dollar does not exercise the Second Option within 60 days of exercising the First Option, a joint venture will be formed among the parties and Silver Dollar will serve as operator on the project. If Silver Dollar spends more than 90% of the exploration expenditures of such joint venture, under the Government Gulch Agreement, it will automatically acquire the remaining 25% interest in the Government Gulch property and the optionor will receive a 2.0% net smelter returns royalty on the Government Gulch property. Silver Dollar will have the ability to repurchase half of such royalty (1.0% of net smelter returns) for US$1,000,000. The Page Mine Agreement: The Page Mine Agreement is a lease and option expiring November 17, 2031 requiring Silver Dollar to pay rental payments of US$30,000 per year. During the term of the lease, Silver Dollar may elect to acquire the Page Mine property for US$1,500,000 less amounts previously paid under the lease. To date, Silver Valley has paid US$120,000 pursuant to the lease and option agreement and no exploration expenditures were incurred on the property. Silver Dollar will assume the remaining payment obligations under the the Page Mine Agreement. Finders' Fees The Company has paid a finder's fee in accordance with TSXV policy consisting of 1,512,500 shares valued at 6 cents per share to Kluane Capital FZCO and 779,166 shares valued at 6 cents per share to Canal Front Investments Inc. in respect of the transaction. The finders' shares are subject to a statutory four-month hold period.  The Initial News Release contained a typo in as much as it referred to the finders as being non-arm's length to the Company and Silver Dollar. The finders are in fact arm's length to the Company and Silver Dollar. Link to Website: http://www.silvervalleymetals.com Social Media: Facebook: https://www.facebook.com/silvervalmetals X: https://twitter.com/silvervalmetals Instagram: https://www.instagram.com/silvervalmetals Linked-In: https://www.linkedin.com/company/silvervalmetals YouTube: https://youtube.com/@silvervalmetals About: Mexi-Can Lithium / Potassium ( sulphate of potash ) Project: Silver Valley Metals Corp. owns a 100% interest in a lithium and potassium bearing salar complex comprising 4,056 hectares on three mineral concessions (\"the Mexico-Canada Project\" or \"Mexi-Can Project\") located on the Central Mexican Plateau in the states of Zacatecas, and San Luis Potosi, Mexico. The NI 43-101 inferred mineral resource contains 12.3Mt of Sulfate of Potash (SOP) and 243,000 tonnes of lithium carbonate equivalent (LCE) defined only from surface to an average of 5 metres depth.  The salars remain wide open in all directions for expansion. About: Silver Valley Metals: Silver Valley Metals Corp. is a Canadian exploration company comprised of a group of experienced exploration, mining, and financing specialists focused on the pursuit of mineral discovery and development. We are focused on the advancement of strategic and precious mineral properties including Lithium-Potash in Mexico and and an ownership stake in the Ranger-Page silver-zinc-lead project in the Silver Valley of Idaho through equity ownership in Silver Dollar Resources and residual net smelter returns at the project. On behalf of the Board of Directors of Silver Valley Metals, \"Brandon Rook\" Brandon Rook, President & CEO, Director For further information please contact: 604-800-4710 Email: info@silvervalleymetals.com NEITHER THE TSX VENTURE EXCHANGE NOR ITS REGULATION SERVICES PROVIDER (AS THAT TERM IS DEFINED IN POLICIES OF THE TSX VENTURE EXCHANGE) ACCEPTS RESPONSIBILITY FOR THE ADEQUACY OR ACCURACY OF THIS RELEASE. The information contained herein contains \"forward-looking statements\" within the meaning of applicable securities legislation. Forward-looking statements relate to information that is based on assumptions of management, forecasts of future results, and estimates of amounts not yet determinable. Any statements that express predictions, expectations, beliefs, plans, projections, objectives, assumptions or future events or performance are not statements of historical fact and may be \"forward-looking statements.\" Forward-looking statements are subject to a variety of risks and uncertainties which could cause actual events or results to differ from those reflected in the forward-looking statements, including, without limitation: risks related to failure to obtain adequate financing on a timely basis and on acceptable terms; risks related to the outcome of legal proceedings; political and regulatory risks associated with mining and exploration; risks related to the maintenance of stock exchange listings; risks related to environmental regulation and liability; the potential for delays in exploration or development activities or the completion of feasibility studies; the uncertainty of profitability; risks and uncertainties relating to the interpretation of drill results, the geology, grade and continuity of mineral deposits; risks related to the inherent uncertainty of production and cost estimates and the potential for unexpected costs and expenses; results of prefeasibility and feasibility studies, and the possibility that future exploration, development or mining results will not be consistent with the Company's expectations; risks related to commodity price fluctuations; and other risks and uncertainties related to the Company's prospects, properties and business detailed elsewhere in the Company's disclosure record. Should one or more of these risks and uncertainties materialize, or should underlying assumptions prove incorrect, actual results may vary materially from those described in forward-looking statements. Investors are cautioned against attributing undue certainty to forward-looking statements. These forward-looking statements are made as of the date hereof and the Company does not assume any obligation to update or revise them to reflect new events or circumstances. Actual events or results could differ materially from the Company's expectations or projections. To view the source version of this press release, please visit https://www.newsfilecorp.com/release/219097",
    "primary_commodity": "Zn"
  },
  "articleProject": {
    "gid": 7995,
    "project_name": "Ranger-Page",
    "location": null
  },
  "articleExchange": "TSXV",
  "articleCompanyId": 1729,
  "articleTicker": "SILV",
  "articleCompanyName": "Silver Valley Metals Corp.",
  "allOtherCompanyProjects": [
    {
      "company_id": 1729,
      "gid": 4636,
      "project_name": "MexiCan",
      "location": "Zacatecas, Mexico"
    }
  ],
  "allOtherCompanyNews": [
    {
      "id": 97077,
      "company_id": 1729,
      "title": "SILVER VALLEY METALS POSTPONES ANNUAL MEETING",
      "link": "https://app.quotemedia.com/data/downloadFiling?webmasterId=104408&ref=674f8ea89f49b630f1028a91&type=PDFC&formType=002-002-001089-003001&formDescription=News+release&dateFiled=2024-12-03",
      "date": "2024-12-03T23:05:12.000Z",
      "hidden": false
    },
    {
      "id": 67758,
      "company_id": 1729,
      "title": "Silver Valley Metals Announces Closing of the Sale of the Ranger-Page Project in the Silver Valley, Northern Idaho, USA",
      "link": "https://www.newsfilecorp.com/release/219097/Silver-Valley-Metals-Announces-Closing-of-the-Sale-of-the-RangerPage-Project-in-the-Silver-Valley-Northern-Idaho-USA",
      "date": "2024-08-07T12:00:00.000Z",
      "hidden": false
    },
    {
      "id": 64990,
      "company_id": 1729,
      "title": "Silver Valley Metals Announces Sale of the Ranger-Page Project in the Silver Valley, Northern Idaho, USA",
      "link": "https://www.newsfilecorp.com/release/216394/Silver-Valley-Metals-Announces-Sale-of-the-RangerPage-Project-in-the-Silver-Valley-Northern-Idaho-USA",
      "date": "2024-07-15T11:30:00.000Z",
      "hidden": false
    },
    {
      "id": 47344,
      "company_id": 1729,
      "title": "Silver Valley Metals Announces Positive Resolution of Issues Relating to its Mexi-Can Sulphate of Potash and Lithium Project; Exploration to Recommence",
      "link": "https://www.newsfilecorp.com/release/194366/Silver-Valley-Metals-Announces-Positive-Resolution-of-Issues-Relating-to-its-MexiCan-Sulphate-of-Potash-and-Lithium-Project-Exploration-to-Recommence",
      "date": "2024-01-16T13:00:00.000Z",
      "hidden": false
    },
    {
      "id": 44356,
      "company_id": 1729,
      "title": "Silver Valley Metals Announces Change to Board of Directors and Provides Corporate Update",
      "link": "https://www.newsfilecorp.com/release/187810/Silver-Valley-Metals-Announces-Change-to-Board-of-Directors-and-Provides-Corporate-Update",
      "date": "2023-11-17T13:00:00.000Z",
      "hidden": false
    },
    {
      "id": 41057,
      "company_id": 1729,
      "title": "Silver Valley Metals Provides Corporate Update",
      "link": "https://contentapi.cision.com/api/v1.0/releases/20230918C4622",
      "date": "2023-09-18T11:00:00.000Z",
      "hidden": false
    },
    {
      "id": 97075,
      "company_id": 1729,
      "title": "Silver Valley Metals Closes $685,874 Non-Brokered Private Placement Financing",
      "link": "https://app.quotemedia.com/data/downloadFiling?webmasterId=104408&ref=64cbcc963d8e6568682a4ae4&type=PDFC&formType=002-002-001089-003001&formDescription=News+release&dateFiled=2023-08-03",
      "date": "2023-08-03T15:49:42.000Z",
      "hidden": false
    },
    {
      "id": 97076,
      "company_id": 1729,
      "title": "Silver Valley Metals Files for Final Approval to Close its Non-Brokered Private Placement Financing",
      "link": "https://app.quotemedia.com/data/downloadFiling?webmasterId=104408&ref=64cbc0fe38b88652d160f156&type=PDFC&formType=002-002-001089-003001&formDescription=News+release&dateFiled=2023-08-03",
      "date": "2023-08-03T15:00:14.000Z",
      "hidden": false
    },
    {
      "id": 38137,
      "company_id": 1729,
      "title": "Silver Valley Metals Files for Approval of Non-Brokered Private Placement Financing; Expiry of Warrant Exercise Incentive Program",
      "link": "https://www.newsfilecorp.com/release/173894/Silver-Valley-Metals-Files-for-Approval-of-NonBrokered-Private-Placement-Financing-Expiry-of-Warrant-Exercise-Incentive-Program",
      "date": "2023-07-18T12:00:00.000Z",
      "hidden": false
    },
    {
      "id": 37274,
      "company_id": 1729,
      "title": "Silver Valley Metals Announces Discovery of Mineralized Vein Structures At Surface Extending Crown Point Mine 220 Metres West at the Ranger-Page Project, North Idaho, USA",
      "link": "https://contentapi.cision.com/api/v1.0/releases/20230628VA44779",
      "date": "2023-06-28T12:00:00.000Z",
      "hidden": false
    }
  ]
}