{
  "article": {
    "id": 67759,
    "link": "https://www.newsfilecorp.com/release/219091/Silver-Dollar-Completes-Acquisition-of-the-RangerPage-Project-in-Idahos-Silver-Valley",
    "title": "Silver Dollar Completes Acquisition of the Ranger-Page Project in Idaho's Silver Valley",
    "description": "<img src=\"https://api.newsfilecorp.com/newsinfo/219091/367\" id=\"367\" width=\"2\" height=\"2\" style=\"width: 1px;  height: 1px;border: 0px solid;\" /><p class=\"nfSubHeading\">The drill ready Ranger-Page Project is located in the Coeur d'Alene Mining District that ranks among the world's top producers of silver, lead and zinc.</p><p>Vancouver, British Columbia--(Newsfile Corp. - August 7, 2024) - <b>Silver Dollar Resources Inc. (CSE: SLV) (OTCQX: SLVDF) (FSE: 4YW) (\"Silver Dollar\" or the \"Company\")</b> is pleased to announce that, further to the news release of <a href=\"https://api.newsfilecorp.com/redirect/ZAWqjCLeEz\">July 15, 2024</a>, it has completed the acquisition of the assets related to the Ranger-Page Project located in Shoshone County, Idaho, USA (<a href=\"https://api.newsfilecorp.com/redirect/ar8RBCeYbD\">Figure 1</a>), which includes the option rights under the Government Gulch Option and Joint Venture Agreement and the Page Mine Mineral Rights Lease and Option Agreement.</p><p style=\"text-align: center;\"><a rel=\"nofollow\" href=\"https://api.newsfilecorp.com/redirect/JgowYtDWR1\"><img src=\"https://images.newsfilecorp.com/files/7232/219091_b2b78ed80455eaa4_001.jpg\" style=\"border-width: 0px;\" alt=\"Cannot view this image? Visit: https://images.newsfilecorp.com/files/7232/219091_b2b78ed80455eaa4_001.jpg\" /></a><br /><br /></p><p style=\"text-align: center;\">Figure 1: Location of the Ranger-Page Project in the Coeur d'Alene Mining District.</p><p style=\"text-align: center;\">To view an enhanced version of this graphic, please visit:<br /><a rel=\"nofollow\" href=\"https://silverdollarresources.com/images/Ranger-Page/Ranger-Page_Silver-Valley.jpg\">https://silverdollarresources.com/images/Ranger-Page/Ranger-Page_Silver-Valley.jpg</a></p><p><u>Project Highlights:</u></p><ul><li>A drill-ready project in a world-class silver district where over 90 mines have operated since the first major lead-zinc-silver discovery was staked in 1884.</li><li>Ideally situated approximately two kilometres (km) south of Interstate 90 Freeway and the town of Smelterville, the Project features power, water, year-round access to local infrastructure and a workforce skilled in exploration and mining.</li><li>The Project comprises two contiguous patented lode claim groups - Government Gulch (403 acres) and Page Mine (802 acres) - that consolidate the western end of the Silver Valley mining corridor under a single operator for the first time.</li><li>The land package covers six historic mines with the option to acquire ownership of the Project's mineral rights, which are not currently subject to any royalties.</li><li>Surface access rights are in place to allow Silver Dollar to conduct exploration activities, and the permitting process is with the State of Idaho, no federal permitting required.</li><li>Multiple exploration targets developed over the last two years and are ready to drill after the systematic use of modern exploration techniques for the first time.</li><li>Primary target areas are up-plunge from where historical underground mining ended, near surface, and targets have been defined laterally away from the footprint of the past producing mines.</li><li>Additional drill targets not associated with the historical mining areas have also been identified.</li><li>The Project borders the Bunker Hill mine that is on track to restart mining in Q4 2024.</li></ul><p style=\"text-align: center;\"><a rel=\"nofollow\" href=\"https://api.newsfilecorp.com/redirect/GmByqcaRYq\"><img src=\"https://images.newsfilecorp.com/files/7232/219091_b2b78ed80455eaa4_002.jpg\" style=\"border-width: 0px;\" alt=\"Cannot view this image? Visit: https://images.newsfilecorp.com/files/7232/219091_b2b78ed80455eaa4_002.jpg\" /></a><br /><br />Figure 2: Ranger-Page fault system, historical underground mine workings, and new target zones.</p><p style=\"text-align: center;\">To view an enhanced version of this graphic, please visit:<br /><a rel=\"nofollow\" href=\"https://silverdollarresources.com/images/Ranger-Page/Ranger-Page-Target-Zones.jpg\">https://silverdollarresources.com/images/Ranger-Page/Ranger-Page-Target-Zones.jpg</a></p><p><u>A Structurally Active Area:</u></p><p>The ore deposits of the Coeur d'Alene Mining District are hosted in structural features characterized by a complex network of faults and folds resulting from tectonic forces of diverse ages and movements. The district occurs at the intersection of the west-northwest-trending Osburn Fault and a north-trending anticlinal (upfolded) structure called the Noxon Arch. </p><p>The 27 km displacement of the Osburn Fault runs through the district's most productive silver belts and along the northern boundary of the Ranger-Page Project. A network of seven secondary faults transverses the Project area, with the north-south trending Page Fault (that hosts the Page Mine) at the western end and the Crown Point Fault at the eastern end intersecting the Osburn Fault. Additional faults include the east-west trending Curlew, 96, Buckeye and Spring faults and the southeast-northwest trending Government Gulch Fault (Figures <a href=\"https://api.newsfilecorp.com/redirect/2Ea7mTRZ41\">2</a> and <a href=\"https://api.newsfilecorp.com/redirect/MAwYyCK7PM\">3</a>).</p><p><u>Exploration Potential:</u></p><p>Major discoveries in the Coeur d'Alene Mining District tend to result from deep exploration down plunge of near-surface mineral showings. Narrow veins near surface can blossom into multimillion-ounce ore bodies at depth, where vein structures intersect favourable rock formations. Consequently, the district remains an active region for exploration and mining even 140 years after Ag-Pb-Zn deposits were first discovered along the South Fork of the Coeur d'Alene River.</p><p>Consistent with the exploration history of the district, the Ranger-Page Project exhibits similar discovery potential near surface and at depth. This assessment is based on the comprehensive underground mining database that provides strong evidence of high-grade mineralization continuing at depth and along strike from where historical underground mining ended, and the latest exploration results from geophysical and geochemical surveys, extensive trenching and sampling, and geological mapping that have identified new target areas with potential near-surface mineralization.<a href=\"https://api.newsfilecorp.com/redirect/bVWB1hOW40\"><sup>1</sup></a> </p><p style=\"text-align: center;\"><a rel=\"nofollow\" href=\"https://api.newsfilecorp.com/redirect/QO0Ept2Daw\"><img src=\"https://images.newsfilecorp.com/files/7232/219091_b2b78ed80455eaa4_003.jpg\" style=\"border-width: 0px;\" alt=\"Cannot view this image? Visit: https://images.newsfilecorp.com/files/7232/219091_b2b78ed80455eaa4_003.jpg\" /></a><br /><br />Figure 3: Coloured areas depict IP anomalous zones dipping along faults toward the south.<br /><br />To view an enhanced version of this graphic, please visit:<br /><a rel=\"nofollow\" href=\"https://silverdollarresources.com/images/Ranger-Page/Ranger-Page_IP-Anomalies.jpg\">https://silverdollarresources.com/images/Ranger-Page/Ranger-Page_IP-Anomalies.jpg</a></p><p>For additional information on the Ranger-Page Project see the news release of <a href=\"https://silverdollarresources.com/index.php/news/366-silver-dollar-to-acquire-the-ranger-page-project-in-idaho-s-silver-valley\">July 15, 2024</a>.</p><p>\"We are thrilled with the acquisition of the Ranger-Page Project and thank all involved for their assistance in expediting the completion of the transaction,\" said Mike Romanik, president of Silver Dollar. \"Our immediate exploration focus is on the near-surface targets recently discovered outside of the area of the historic mines.\" </p><p><u>Transaction Summary:</u></p><p>The vendors assigned the assets to Silver Dollar's wholly owned subsidiary for cash consideration of $300,000 and the issuance of 6,000,000 common shares in the capital of Silver Dollar at a deemed price of $0.30 per share for aggregate consideration of $2,100,000. The shares are subject to a statutory four-month hold period and contractual escrow in accordance with the following release schedule: </p><table cellspacing=\"0\" cellpadding=\"3\" border=\"0\" style=\"width: 100%; border-collapse: collapse; border-width: 1px; border-style: solid; border-color: #000000;\"><tbody><tr><td style=\"text-align: center; border-width: 1px; border-style: solid; border-color: #000000; width: 50%; font-size: 10px;\">Release Date</td><td style=\"text-align: center; border-width: 1px; border-style: solid; border-color: #000000; width: 50%; font-size: 10px;\">Release from Contractual Escrow</td></tr><tr><td style=\"text-align: center; border-width: 1px; border-style: solid; border-color: #000000; width: 50%; font-size: 10px;\">August 6, 2024</td><td style=\"text-align: center; border-width: 1px; border-style: solid; border-color: #000000; width: 50%; font-size: 10px;\">1,000,000 shares</td></tr><tr><td style=\"text-align: center; border-width: 1px; border-style: solid; border-color: #000000; width: 50%; font-size: 10px;\">February 6, 2025</td><td style=\"text-align: center; border-width: 1px; border-style: solid; border-color: #000000; width: 50%; font-size: 10px;\">1,250,000 shares</td></tr><tr><td style=\"text-align: center; border-width: 1px; border-style: solid; border-color: #000000; width: 50%; font-size: 10px;\">August 6, 2025</td><td style=\"text-align: center; border-width: 1px; border-style: solid; border-color: #000000; width: 50%; font-size: 10px;\">1,250,000 shares</td></tr><tr><td style=\"text-align: center; border-width: 1px; border-style: solid; border-color: #000000; width: 50%; font-size: 10px;\">February 6, 2026</td><td style=\"text-align: center; border-width: 1px; border-style: solid; border-color: #000000; width: 50%; font-size: 10px;\">1,250,000 shares</td></tr><tr><td style=\"text-align: center; border-width: 1px; border-style: solid; border-color: #000000; width: 50%; font-size: 10px;\">August 6, 2026</td><td style=\"text-align: center; border-width: 1px; border-style: solid; border-color: #000000; width: 50%; font-size: 10px;\">1,250,000 shares</td></tr></tbody></table><p>&#160;</p><p>The Company also paid finders' fees totaling $30,000 and 600,000 shares in respect of the acquisition. The finders' shares are subject to a statutory four-month hold period.</p><p>Mike Kilbourne, P.Geo., an independent Qualified Person (QP) as defined in NI 43-101, has reviewed and approved the technical contents of this news release on behalf of the Company. The QP and the Company have not completed sufficient work to verify the information on the Ranger-Page Project, particularly regarding historical exploration, resources and production, neighbouring companies and government geological work.</p><p><u><b>About Silver Dollar Resources Inc.</b></u></p><p>Silver Dollar is a mineral exploration company that is fully funded to execute its near-term exploration plans having closed its last financing with lead orders from billionaire mining investor Eric Sprott and NYSE-listed First Majestic Silver. The Company's primary projects lie within Idaho's prolific Silver Valley and the Durango-Zacatecas silver-gold belt and include the advanced exploration stage Ranger-Page and La Joya projects and the early exploration stage Nora project. Management has an aggressive growth strategy and is actively reviewing potential acquisitions with a focus on drill-ready projects in mining-friendly jurisdictions.</p><p>For additional information, you can download our latest presentation by clicking <a href=\"https://api.newsfilecorp.com/redirect/NBg2KF45Y0\">here</a> and follow us on X by clicking <a href=\"https://api.newsfilecorp.com/redirect/X3WBzfRVnX\">here</a>. </p><p>ON BEHALF OF THE BOARD</p><p><u>Signed <i>\"Michael Romanik\"  </i></u></p><div id=\"contactInfo\"><p>Michael Romanik,<br />President, CEO &#38; Director<br />Silver Dollar Resources Inc.<br />Direct line: (204) 724-0613<br />Email: <a href=\"mailto:mike@silverdollarresources.com\">mike@silverdollarresources.com</a><br />179 - 2945 Jacklin Road, Suite 416<br />Victoria, BC, V9B 6J9</p></div><p><b>Forward-Looking Statements:  </b></p><p><i>This news release may contain \"forward-looking statements.\" Forward-looking statements involve known and unknown risks, uncertainties, assumptions, and other factors that may cause the actual results, performance or achievements of the Company to be materially different from any future results, performance or achievements expressed or implied by the forward-looking statements. Any forward-looking statement speaks only as of the date of this news release and, except as may be required by applicable securities laws, the Company disclaims any intent or obligation to update any forward-looking statement, whether as a result of new information, future events or results or otherwise.</i></p><p><i><b>The Canadian Securities Exchange (operated by CNSX Markets Inc.) has neither approved nor disapproved of the contents of this news release.</b></i></p><p><u>Referenced Sources:</u></p><ol style=\"list-style-type: decimal;\"><li><a href=\"https://api.newsfilecorp.com/redirect/DZQByHMgEx\">https://silvervalleymetals.com/projects/ranger-page-project/exploration-potential/</a><u> </u></li></ol><p id=\"corporateLinkBack\">To view the source version of this press release, please visit <a href=\"https://api.newsfilecorp.com/redirect/rvbmXCx5Qg\">https://www.newsfilecorp.com/release/219091</a></p>",
    "search_terms": "Ranger-Page,Silver Dollar Resources Inc.,SLV",
    "master_gid": 7995,
    "date": "2024-08-07T12:00:00.000Z",
    "tags": "Canada|||Silver,Zinc|Project Acquisition",
    "image_id": null,
    "hidden": false,
    "company_id": 964,
    "provider": "newsfilecorp",
    "excerpt": "The drill ready Ranger-Page Project is located in the Coeur d'Alene Mining District that ranks among the world's top producers of silver, lead and zinc.Vancouver, British Columbia--(Newsfile Corp. - August 7, 2024) -Silver Dollar Resources Inc. (CSE: SLV) (OTCQX: SLVDF) (FSE: 4YW) (\"Silver Dollar\" or the \"Company\")is pleased to announce",
    "is_regulatory": false,
    "refined_tags": [],
    "ftp_filename": null,
    "company_name": "Silver Dollar Resources Inc.",
    "exchange": "CSE",
    "root_ticker": "SLV",
    "project_name": "Ranger-Page",
    "gid": 7995,
    "location": null,
    "plan_id": null,
    "description_text": "The drill ready Ranger-Page Project is located in the Coeur d'Alene Mining District that ranks among the world's top producers of silver, lead and zinc. Vancouver, British Columbia--(Newsfile Corp. - August 7, 2024) - Silver Dollar Resources Inc. (CSE: SLV) (OTCQX: SLVDF) (FSE: 4YW) (\"Silver Dollar\" or the \"Company\") is pleased to announce that, further to the news release of July 15, 2024 , it has completed the acquisition of the assets related to the Ranger-Page Project located in Shoshone County, Idaho, USA ( Figure 1 ), which includes the option rights under the Government Gulch Option and Joint Venture Agreement and the Page Mine Mineral Rights Lease and Option Agreement. Figure 1: Location of the Ranger-Page Project in the Coeur d'Alene Mining District. To view an enhanced version of this graphic, please visit: https://silverdollarresources.com/images/Ranger-Page/Ranger-Page_Silver-Valley.jpg Project Highlights: A drill-ready project in a world-class silver district where over 90 mines have operated since the first major lead-zinc-silver discovery was staked in 1884. Ideally situated approximately two kilometres (km) south of Interstate 90 Freeway and the town of Smelterville, the Project features power, water, year-round access to local infrastructure and a workforce skilled in exploration and mining. The Project comprises two contiguous patented lode claim groups - Government Gulch (403 acres) and Page Mine (802 acres) - that consolidate the western end of the Silver Valley mining corridor under a single operator for the first time. The land package covers six historic mines with the option to acquire ownership of the Project's mineral rights, which are not currently subject to any royalties. Surface access rights are in place to allow Silver Dollar to conduct exploration activities, and the permitting process is with the State of Idaho, no federal permitting required. Multiple exploration targets developed over the last two years and are ready to drill after the systematic use of modern exploration techniques for the first time. Primary target areas are up-plunge from where historical underground mining ended, near surface, and targets have been defined laterally away from the footprint of the past producing mines. Additional drill targets not associated with the historical mining areas have also been identified. The Project borders the Bunker Hill mine that is on track to restart mining in Q4 2024. Figure 2: Ranger-Page fault system, historical underground mine workings, and new target zones. To view an enhanced version of this graphic, please visit: https://silverdollarresources.com/images/Ranger-Page/Ranger-Page-Target-Zones.jpg A Structurally Active Area: The ore deposits of the Coeur d'Alene Mining District are hosted in structural features characterized by a complex network of faults and folds resulting from tectonic forces of diverse ages and movements. The district occurs at the intersection of the west-northwest-trending Osburn Fault and a north-trending anticlinal (upfolded) structure called the Noxon Arch. The 27 km displacement of the Osburn Fault runs through the district's most productive silver belts and along the northern boundary of the Ranger-Page Project. A network of seven secondary faults transverses the Project area, with the north-south trending Page Fault (that hosts the Page Mine) at the western end and the Crown Point Fault at the eastern end intersecting the Osburn Fault. Additional faults include the east-west trending Curlew, 96, Buckeye and Spring faults and the southeast-northwest trending Government Gulch Fault (Figures 2 and 3 ). Exploration Potential: Major discoveries in the Coeur d'Alene Mining District tend to result from deep exploration down plunge of near-surface mineral showings. Narrow veins near surface can blossom into multimillion-ounce ore bodies at depth, where vein structures intersect favourable rock formations. Consequently, the district remains an active region for exploration and mining even 140 years after Ag-Pb-Zn deposits were first discovered along the South Fork of the Coeur d'Alene River. Consistent with the exploration history of the district, the Ranger-Page Project exhibits similar discovery potential near surface and at depth. This assessment is based on the comprehensive underground mining database that provides strong evidence of high-grade mineralization continuing at depth and along strike from where historical underground mining ended, and the latest exploration results from geophysical and geochemical surveys, extensive trenching and sampling, and geological mapping that have identified new target areas with potential near-surface mineralization. 1 Figure 3: Coloured areas depict IP anomalous zones dipping along faults toward the south. To view an enhanced version of this graphic, please visit: https://silverdollarresources.com/images/Ranger-Page/Ranger-Page_IP-Anomalies.jpg For additional information on the Ranger-Page Project see the news release of July 15, 2024 . \"We are thrilled with the acquisition of the Ranger-Page Project and thank all involved for their assistance in expediting the completion of the transaction,\" said Mike Romanik, president of Silver Dollar. \"Our immediate exploration focus is on the near-surface targets recently discovered outside of the area of the historic mines.\" Transaction Summary: The vendors assigned the assets to Silver Dollar's wholly owned subsidiary for cash consideration of $300,000 and the issuance of 6,000,000 common shares in the capital of Silver Dollar at a deemed price of $0.30 per share for aggregate consideration of $2,100,000. The shares are subject to a statutory four-month hold period and contractual escrow in accordance with the following release schedule: Release Date Release from Contractual Escrow August 6, 2024 1,000,000 shares February 6, 2025 1,250,000 shares August 6, 2025 1,250,000 shares February 6, 2026 1,250,000 shares August 6, 2026 1,250,000 shares The Company also paid finders' fees totaling $30,000 and 600,000 shares in respect of the acquisition. The finders' shares are subject to a statutory four-month hold period. Mike Kilbourne, P.Geo., an independent Qualified Person (QP) as defined in NI 43-101, has reviewed and approved the technical contents of this news release on behalf of the Company. The QP and the Company have not completed sufficient work to verify the information on the Ranger-Page Project, particularly regarding historical exploration, resources and production, neighbouring companies and government geological work. About Silver Dollar Resources Inc. Silver Dollar is a mineral exploration company that is fully funded to execute its near-term exploration plans having closed its last financing with lead orders from billionaire mining investor Eric Sprott and NYSE-listed First Majestic Silver. The Company's primary projects lie within Idaho's prolific Silver Valley and the Durango-Zacatecas silver-gold belt and include the advanced exploration stage Ranger-Page and La Joya projects and the early exploration stage Nora project. Management has an aggressive growth strategy and is actively reviewing potential acquisitions with a focus on drill-ready projects in mining-friendly jurisdictions. For additional information, you can download our latest presentation by clicking here and follow us on X by clicking here . ON BEHALF OF THE BOARD Signed \"Michael Romanik\" Michael Romanik, President, CEO & Director Silver Dollar Resources Inc. Direct line: (204) 724-0613 Email: mike@silverdollarresources.com 179 - 2945 Jacklin Road, Suite 416 Victoria, BC, V9B 6J9 Forward-Looking Statements: This news release may contain \"forward-looking statements.\" Forward-looking statements involve known and unknown risks, uncertainties, assumptions, and other factors that may cause the actual results, performance or achievements of the Company to be materially different from any future results, performance or achievements expressed or implied by the forward-looking statements. Any forward-looking statement speaks only as of the date of this news release and, except as may be required by applicable securities laws, the Company disclaims any intent or obligation to update any forward-looking statement, whether as a result of new information, future events or results or otherwise. The Canadian Securities Exchange (operated by CNSX Markets Inc.) has neither approved nor disapproved of the contents of this news release. Referenced Sources: https://silvervalleymetals.com/projects/ranger-page-project/exploration-potential/ To view the source version of this press release, please visit https://www.newsfilecorp.com/release/219091",
    "primary_commodity": "Zn"
  },
  "articleProject": {
    "gid": 7995,
    "project_name": "Ranger-Page",
    "location": null
  },
  "articleExchange": "CSE",
  "articleCompanyId": 964,
  "articleTicker": "SLV",
  "articleCompanyName": "Silver Dollar Resources Inc.",
  "allOtherCompanyProjects": [
    {
      "company_id": 964,
      "gid": 2623,
      "project_name": "Pakwash Lake",
      "location": "Ontario"
    },
    {
      "company_id": 964,
      "gid": 1651,
      "project_name": "Longlegged Lake",
      "location": "Ontario, Canada"
    },
    {
      "company_id": 964,
      "gid": 2258,
      "project_name": "La Joya",
      "location": "Durango, Mexico"
    },
    {
      "company_id": 964,
      "gid": 5204,
      "project_name": "Nora",
      "location": "Durango, Mexico"
    },
    {
      "company_id": 964,
      "gid": 7995,
      "project_name": "Ranger-Page",
      "location": null
    }
  ],
  "allOtherCompanyNews": [
    {
      "id": 99988,
      "company_id": 964,
      "title": "Silver Dollar Extends Curlew Vein Strike Length to 700 Metres with Near Surface Intercepts at Ranger-Page",
      "link": null,
      "date": "2025-04-16T11:30:00.000Z",
      "hidden": false
    },
    {
      "id": 101372,
      "company_id": 964,
      "title": "Silver Dollar Announces Grant of Stock Options and Restricted Share Units",
      "link": "https://app.quotemedia.com/data/downloadFiling?webmasterId=104408&ref=67e75083cf9a1105e7717fb8&type=PDFC&formType=002-002-001089-003001&formDescription=News+release&dateFiled=2025-03-28",
      "date": "2025-03-28T18:44:35.000Z",
      "hidden": false
    },
    {
      "id": 90784,
      "company_id": 964,
      "title": "Silver Dollar Announces Management Change",
      "link": "https://www.newsfilecorp.com/release/244260/Silver-Dollar-Announces-Management-Change",
      "date": "2025-03-12T12:00:00.000Z",
      "hidden": false
    },
    {
      "id": 90586,
      "company_id": 964,
      "title": "Silver Dollar Completes Initial Exploration Drilling Program at the Ranger-Page Project in Idaho's Silver Valley",
      "link": "https://www.newsfilecorp.com/release/244079/Silver-Dollar-Completes-Initial-Exploration-Drilling-Program-at-the-RangerPage-Project-in-Idahos-Silver-Valley",
      "date": "2025-03-11T11:30:00.000Z",
      "hidden": false
    },
    {
      "id": 82207,
      "company_id": 964,
      "title": "Silver Dollar Identifies Two New IP Anomalies at the Ranger-Page Project Where Drilling is in Progress",
      "link": "https://www.newsfilecorp.com/release/233964/Silver-Dollar-Identifies-Two-New-IP-Anomalies-at-the-RangerPage-Project-Where-Drilling-is-in-Progress",
      "date": "2024-12-17T13:00:00.000Z",
      "hidden": false
    },
    {
      "id": 80006,
      "company_id": 964,
      "title": "Silver Dollar Commences Exploration Drilling at the Ranger-Page Project in Idaho's Silver Valley",
      "link": "https://www.newsfilecorp.com/release/231390/Silver-Dollar-Commences-Exploration-Drilling-at-the-RangerPage-Project-in-Idahos-Silver-Valley",
      "date": "2024-11-26T13:00:00.000Z",
      "hidden": false
    },
    {
      "id": 78467,
      "company_id": 964,
      "title": "Silver Dollar Outlines Exploration Drilling Plan for Ranger-Page Project in Idaho's Silver Valley",
      "link": "https://www.newsfilecorp.com/release/229492/Silver-Dollar-Outlines-Exploration-Drilling-Plan-for-RangerPage-Project-in-Idahos-Silver-Valley",
      "date": "2024-11-12T13:00:00.000Z",
      "hidden": false
    },
    {
      "id": 76556,
      "company_id": 964,
      "title": "Silver Dollar Closes Financing Led by Strategic Investor and Largest Shareholder Eric Sprott",
      "link": "https://www.newsfilecorp.com/release/228199/Silver-Dollar-Closes-Financing-Led-by-Strategic-Investor-and-Largest-Shareholder-Eric-Sprott",
      "date": "2024-10-29T16:32:00.000Z",
      "hidden": false
    },
    {
      "id": 75556,
      "company_id": 964,
      "title": "Silver Dollar Hires Integri-Core for Fall Drilling at Ranger-Page Project in Idaho's Silver Valley",
      "link": "https://www.newsfilecorp.com/release/227320/Silver-Dollar-Hires-IntegriCore-for-Fall-Drilling-at-RangerPage-Project-in-Idahos-Silver-Valley",
      "date": "2024-10-22T12:00:00.000Z",
      "hidden": false
    },
    {
      "id": 74737,
      "company_id": 964,
      "title": "Silver Dollar Arranges Financing with Continued Support from Strategic Investor Eric Sprott",
      "link": "https://www.newsfilecorp.com/release/226431/Silver-Dollar-Arranges-Financing-with-Continued-Support-from-Strategic-Investor-Eric-Sprott",
      "date": "2024-10-15T12:00:00.000Z",
      "hidden": false
    }
  ]
}
