{
  "article": {
    "id": 70256,
    "link": "https://www.thenewswire.com/press-releases?id=1BKRFpdYN",
    "title": "Headwater Gold Acquires Two Additional 100% Owned Epithermal Vein Projects in Northern Nevada",
    "description": "<table style='width:fit-content; border: none;'><tr style='background: none;'><td colspan='10' style='padding: 0; margin: 0; border: none; background: none;' valign='bottom'><a target='_blank' href='https://headwatergold.com/'><img src=\"https://www.thenewswire.com/data/tnw/clients/logos/1kx7F1jbP.png?t=1622049454\" alt=\"Headwater Gold Inc.\" /></a></td></tr><tr style='background: none;'><td style='width: 34px; padding: 0; margin: 0; border: none; background: none;' valign='bottom'><a target='_blank' href='https://thenewswire.com/api/apps/tnw/r?i=1kx7F1jbP&amp;m=twi'><img src=\"https://www.thenewswire.com/data/tnw/img/twi.png\" /></a></td><td style='width: 34px; padding: 0; margin: 0; border: none; background: none;' valign='bottom'><a target='_blank' href='https://thenewswire.com/api/apps/tnw/r?i=1kx7F1jbP&amp;m=lin'><img src=\"https://www.thenewswire.com/data/tnw/img/lin.png\" /></a></td><td style='width: 34px; padding: 0; margin: 0; border: none; background: none;' valign='bottom'><a target='_blank' href='https://thenewswire.com/api/apps/tnw/r?i=1kx7F1jbP&amp;m=you'><img src=\"https://www.thenewswire.com/data/tnw/img/you.png\" /></a></td><td style='padding: 0; margin: 0; border: none; background: none;'></td></tr></table>\n<p style='text-align:justify; '>\n<span style='font-weight:bold; '>Vancouver, British Columbia - </span><span style='font-weight:bold; '>TheNewswire -</span><span style='font-weight:bold; '> September 4,</span> <span style='font-weight:bold; '>2024: </span><span style=''>Headwater Gold Inc. (CSE: HWG) (OTCQB: HWAUF) (the &quot;Company&quot; or &quot;Headwater&quot;) is pleased to announce the acquisitions of two additional epithermal vein projects, Rock Creek and Hot Creek, in Northern Nevada. Both projects have been acquired through claim staking on open ground managed by the Bureau of Land Management (“BLM”).</span>\n</p>\n\n<p style='text-align:justify; '>\n<span style='font-weight:bold; '>Highlights:</span>\n</p>\n\r\n<ul>\r\n<li>\n<p style='text-align:justify; '>\n<span style='font-weight:bold; '>Two New Projects in Northern Nevada:</span><span style=''> Headwater has acquired the Rock Creek and Hot Creek epithermal gold projects by claim staking on BLM land.  Both projects are 100% owned and are royalty free.</span> \n</p>\n</li><li>\n<p style='text-align:justify; '>\n<span style='font-weight:bold; '>Large Epithermal Gold Systems:</span><span style=''> Both projects host widespread epithermal alteration footprints indicative of large hydrothermal systems. High-level silica alteration, including hydrothermal vent breccias and opalized sediments are present indicating the systems are likely fully preserved.</span> \n</p>\n</li><li>\n<p style='text-align:justify; '>\n<span style='font-weight:bold; '>Untested High-Grade Targets: </span><span style=''> Historical surface sampling and drilling indicate the widespread presence of near-surface anomalous gold mineralization on the properties.  Limited drilling has been completed in the target epithermal boiling zones at depth.</span> \n</p>\n</li>\r\n</ul>\r\n\n<p style='text-align:justify; '>\n<span style=''>Caleb Stroup, the President and CEO of the Company, states: </span><span style='font-style:italic; '>“The acquisition of the Rock Creek and Hot Creek projects significantly enhances our portfolio of high-potential epithermal gold projects in Northern Nevada. The historical datasets from these projects provide a strong foundation for a systematic modern exploration effort with the geological characteristics pointing towards untested potential for high-grade precious metals at depth. We are particularly excited about the potential at Rock Creek where the Main Vein target remains open along strike in both directions as well as down dip. These 100% owned and royalty free acquisitions align perfectly with our strategy of maintaining a large, active portfolio of high-grade epithermal projects and provide our shareholders with exposure to significant upside potential.”</span>\n</p>\n\n<p style='text-align:justify; '>\n<span style='font-weight:bold; '>Rock Creek Project:</span><span style=''> The Rock Creek project is located along the eastern margin of the Northern Nevada Rift, which hosts multiple high-grade epithermal gold mines such as Midas, Fire Creek and Hollister.  Headwater acquired Rock Creek by staking 103 unpatented mining claims on BLM land.  Headwater’s land position adjoins private land and mining claims controlled by Nevada Gold Mines (“NGM”) and captures the along strike and down dip projections of the three principal vein systems in the district: the Main Vein, SW Vein and SE Vein.  These principal structures occur within an approximate 5 kilometre (“km”) by 1.5 km epithermal alteration cell. An outcropping hydrothermal vent breccia cemented by chalcedonic silica in the center of the zone is interpreted as the upper parts of a well-preserved epithermal system. Historic rock sampling</span><span style='vertical-align:super; '>1</span><span style=''> has returned gold values locally up to 34.2 g/t where the Main Vein projects south on to Headwater claims and the northernmost historic drill hole</span><span style='vertical-align:super; '>1</span><span style=''> testing the Main Vein, also on Headwater claims, returned 27.43 m grading 0.89 g/t Au, including 4.64 g/t Au over 1.53 m suggesting strike potential in both directions.</span>\n</p>\n\n<p style='text-align:center; '>\n<span style='text-align:center; '><a href='https://www.thenewswire.com/data/tnw/clients/img/47c87631b0aaa32eceea0568cdde4ce8.png' target='_blank'><img src=\"https://www.thenewswire.com/data/tnw/clients/img/47c87631b0aaa32eceea0568cdde4ce8_.png\" /></a><br />\nClick Image To View Full Size</span>\n</p>\n \n<p style='text-align:center; '>\n<span style='text-align:center; '><a href='https://www.thenewswire.com/data/tnw/clients/img/2419f00b48a2a66b09130b5e5f2c1300.png' target='_blank'><img src=\"https://www.thenewswire.com/data/tnw/clients/img/2419f00b48a2a66b09130b5e5f2c1300_.png\" /></a><br />\nClick Image To View Full Size</span>\n</p>\n \n<p style='text-align:justify; '>\n<span style='font-style:italic; '>Figure 1: Map of the Northern Nevada Rift showing the location of 100% owned Headwater epithermal gold projects on a hill shade base (top) and a regional Reduced To Pole aeromagnetic map (bottom).</span>\n</p>\n\n<p style='text-align:justify; '>\n<span style=''>Future exploration at Rock Creek will focus on compiling and digitizing historical datasets to create a comprehensive 3D model, additional geological mapping, surface sampling and potential geophysical surveys to refine targets.</span>\n</p>\n\n<p style='text-align:justify; '>\n<span style='font-weight:bold; '>Hot Creek Project:</span><span style=''> The Hot Creek project consists of 52 unpatented mining claims staked by Headwater in the Tuscarora District.  The project hosts a widespread zone of silica flooding in Tertiary sediments in the immediate hanging wall of a silicified range front fault.  Historical shallow drilling</span><span style='vertical-align:super; '>1 </span><span style=''>results include grades up to 1.04 g/t Au over 12.2 m and 0.34 g/t Au over 117.3 m along a range front fault. The majority of the historic drill holes at Hot Creek were relatively shallow and did not adequately test for the presence of high-grade feeders at depth along the range front fault or subsidiary structures.  </span>\n</p>\n\n<p style='text-align:justify; '>\n<span style=''>Future exploration at Hot Creek will focus on refining the geological model, identifying new high-potential zones and conducting additional geological mapping and surface sampling.</span><a href='' target='_blank'></a>\n</p>\n\n<p style='text-align:justify; '>\n<span style='font-weight:bold; '>About Headwater Gold:</span> \n</p>\n\n<p style='text-align:justify; '>\n<span style=''>Headwater Gold Inc. (CSE: HWG, OTCQB: HWAUF) is a technically driven mineral exploration company focused on the exploration and discovery of high-grade precious metal deposits in the Western USA.  Headwater is aggressively exploring one of the most well-endowed and mining-friendly jurisdictions in the world with a goal of making world-class precious metal discoveries.  Headwater has a large portfolio of epithermal vein exploration projects and a technical team of experienced geologists with diverse capital markets, junior and major mining company backgrounds.  </span><a href='' target='_blank'></a><span style=''>The Company is systematically drill testing several projects in Nevada and in August 2022 and May 2023 announced significant transactions with Newmont Corporation where it acquired a 9.9% strategic equity interest in the Company and entered into earn-in agreements on several of Headwater’s projects, including Spring Peak and Lodestar which continue under partnership towards a goal of discovering a Tier-one scale gold deposit in Nevada.</span>\n</p>\n\n<p style='text-align:justify; '>\n<span style=''>Headwater is part of the NewQuest Capital Group which is a discovery-driven investment enterprise that builds value through the incubation and financing of mineral projects and companies.  Further information about NewQuest can be found on the company website at </span><a href='http://www.nqcapitalgroup.com' target='_blank'><span style=''>www.nqcapitalgroup.com</span></a><span style=''>.</span>\n</p>\n\n<p style='text-align:justify; '>\n<span style=''>For more information, please visit the Company's website at </span><a href='http://www.headwatergold.com' target='_blank'><span style=''>www.headwatergold.com</span></a><span style=''>.</span>\n</p>\n\n<p style='text-align:justify; '>\n<span style='font-weight:bold; '>On Behalf of the Board of Directors</span>\n</p>\n\n<p style='text-align:justify; '>\n<span style=''>Caleb Stroup</span>\n</p>\n\n<p style='text-align:justify; '>\n<span style=''>President and CEO</span>\n</p>\n\n<p style='text-align:justify; '>\n<span style=''>+1 (775) 409-3197</span>\n</p>\n\n<p style='text-align:justify; '>\n<a href='mailto:cstroup@headwatergold.com' target='_blank'><span style=''>cstroup@headwatergold.com</span></a>\n</p>\n\n<p style='text-align:justify; '>\n<span style=''>For further information, please contact:</span>\n</p>\n\n<p style='text-align:justify; '>\n<span style=''>Brennan Zerb</span>\n</p>\n\n<p style='text-align:justify; '>\n<span style=''>Investor Relations Manager</span>\n</p>\n\n<p style='text-align:justify; '>\n<span style=''>+1 (778) 867-5016 </span>\n</p>\n\n<p style='text-align:justify; '>\n<a href='mailto:bzerb@headwatergold.com' target='_blank'><span style=''>bzerb@headwatergold.com</span></a>\n</p>\n\n<p style='text-align:justify; '>\n<span style='font-weight:bold; '>Qualified Person: </span>\n</p>\n\n<p style='text-align:justify; '>\n<span style=''>The technical information contained in this news release has been reviewed and approved by Scott Close, P.Geo (158157), a “Qualified Person” (“QP”) as defined in National Instrument 43-101 – Standards of Disclosure for Mineral Projects.</span>\n</p>\n\n<p style='text-align:justify; '>\n<span style='vertical-align:super; '>1</span><span style=''>Historical drill intercepts and surface samples cannot be relied upon and are treated by the Company as historical in nature and not current or NI 43-101 compliant.</span>\n</p>\n\n<p style='text-align:justify; '>\n<span style='font-weight:bold; '>Forward-Looking Statements:</span>\n</p>\n\n<p style='text-align:justify; '>\n<span style='font-style:italic; '>This news release includes certain forward-looking statements and forward-looking information (collectively, “forward-looking statements”) within the meaning of applicable Canadian securities legislation. All statements, other than statements of historical fact, included herein including, without limitation, statements regarding future capital expenditures, exploration activities and the specifications, targets, results, analyses, interpretations, benefits, costs and timing of them, Newmont’s anticipated funding of the earn-in projects and the timing thereof, and the anticipated business plans and timing of future activities of the Company, are forward-looking statements. Although the Company believes that such statements are reasonable, it can give no assurance that such expectations will prove to be correct. Often, but not always, forward looking information can be identified by words such as “pro forma”, “plans”, “expects”, “may”, “should”, “budget”, “scheduled”, “estimates”, “forecasts”, “intends”, “anticipates”, “believes”, “potential” or variations of such words including negative variations thereof, and phrases that refer to certain actions, events or results that may, could, would, might or will occur or be taken or achieved. Forward-looking statements involve known and unknown risks, uncertainties and other factors which may cause the actual results, performance or achievements of the Company to differ materially from any future results, performance or achievements expressed or implied by the forward-looking statements. Such risks and other factors include, among others, risks related to the anticipated business plans and timing of future activities of the Company, including the Company’s exploration plans and the proposed expenditures for exploration work thereon, the ability of the Company to obtain sufficient financing to fund its business activities and plans, the risk that Newmont will not elect to obtain any additional interest in the earn-in projects in excess of the minimum commitment, the ability of the Company to obtain the required permits, changes in laws, regulations and policies affecting mining operations, the Company’s limited operating history, currency fluctuations, title disputes or claims, environmental issues and liabilities, as well as those factors discussed under the heading “Risk Factors” in the Company’s prospectus dated May 26, 2021 and other filings of the Company with the Canadian Securities Authorities, copies of which can be found under the Company’s profile on the SEDAR website at www.sedar.com. </span>\n</p>\n\n<p style='text-align:justify; '>\n<span style='font-style:italic; '>Readers are cautioned not to place undue reliance on forward-looking statements. The Company undertakes no obligation to update any of the forward-looking statements, except as otherwise required by law.</span>\n</p>\n\n\n<p>Copyright (c) 2024 TheNewswire - All rights reserved.</p>\n",
    "search_terms": "Rock Creek,Headwater Gold Inc.,HWG",
    "master_gid": 8426,
    "date": "2024-09-04T10:30:00.000Z",
    "tags": "USA|Nevada||Gold|Project Acquisition",
    "image_id": null,
    "hidden": false,
    "company_id": 424,
    "provider": "thenewswire",
    "excerpt": "Vancouver, British Columbia -TheNewswire -September 4,2024:Headwater Gold Inc. (CSE: HWG) (OTCQB: HWAUF) (the &quot;Company&quot; or &quot;Headwater&quot;) is pleased to announce the acquisitions of two additional epithermal vein projects, Rock Creek and Hot Creek, in Northern Nevada. Both projects have been acquired through claim staking on open ground managed by the",
    "is_regulatory": false,
    "refined_tags": null,
    "ftp_filename": null,
    "company_name": "Headwater Gold Inc.",
    "exchange": "CSE",
    "root_ticker": "HWG",
    "project_name": "Rock Creek",
    "gid": 8426,
    "location": null,
    "plan_id": "companytier2",
    "description_text": "Vancouver, British Columbia - TheNewswire - September 4, 2024: Headwater Gold Inc. (CSE: HWG) (OTCQB: HWAUF) (the \"Company\" or \"Headwater\") is pleased to announce the acquisitions of two additional epithermal vein projects, Rock Creek and Hot Creek, in Northern Nevada. Both projects have been acquired through claim staking on open ground managed by the Bureau of Land Management (“BLM”). Highlights: Two New Projects in Northern Nevada: Headwater has acquired the Rock Creek and Hot Creek epithermal gold projects by claim staking on BLM land.  Both projects are 100% owned and are royalty free. Large Epithermal Gold Systems: Both projects host widespread epithermal alteration footprints indicative of large hydrothermal systems. High-level silica alteration, including hydrothermal vent breccias and opalized sediments are present indicating the systems are likely fully preserved. Untested High-Grade Targets: Historical surface sampling and drilling indicate the widespread presence of near-surface anomalous gold mineralization on the properties.  Limited drilling has been completed in the target epithermal boiling zones at depth. Caleb Stroup, the President and CEO of the Company, states: “The acquisition of the Rock Creek and Hot Creek projects significantly enhances our portfolio of high-potential epithermal gold projects in Northern Nevada. The historical datasets from these projects provide a strong foundation for a systematic modern exploration effort with the geological characteristics pointing towards untested potential for high-grade precious metals at depth. We are particularly excited about the potential at Rock Creek where the Main Vein target remains open along strike in both directions as well as down dip. These 100% owned and royalty free acquisitions align perfectly with our strategy of maintaining a large, active portfolio of high-grade epithermal projects and provide our shareholders with exposure to significant upside potential.” Rock Creek Project: The Rock Creek project is located along the eastern margin of the Northern Nevada Rift, which hosts multiple high-grade epithermal gold mines such as Midas, Fire Creek and Hollister.  Headwater acquired Rock Creek by staking 103 unpatented mining claims on BLM land.  Headwater’s land position adjoins private land and mining claims controlled by Nevada Gold Mines (“NGM”) and captures the along strike and down dip projections of the three principal vein systems in the district: the Main Vein, SW Vein and SE Vein.  These principal structures occur within an approximate 5 kilometre (“km”) by 1.5 km epithermal alteration cell. An outcropping hydrothermal vent breccia cemented by chalcedonic silica in the center of the zone is interpreted as the upper parts of a well-preserved epithermal system. Historic rock sampling 1 has returned gold values locally up to 34.2 g/t where the Main Vein projects south on to Headwater claims and the northernmost historic drill hole 1 testing the Main Vein, also on Headwater claims, returned 27.43 m grading 0.89 g/t Au, including 4.64 g/t Au over 1.53 m suggesting strike potential in both directions. Click Image To View Full Size Click Image To View Full Size Figure 1: Map of the Northern Nevada Rift showing the location of 100% owned Headwater epithermal gold projects on a hill shade base (top) and a regional Reduced To Pole aeromagnetic map (bottom). Future exploration at Rock Creek will focus on compiling and digitizing historical datasets to create a comprehensive 3D model, additional geological mapping, surface sampling and potential geophysical surveys to refine targets. Hot Creek Project: The Hot Creek project consists of 52 unpatented mining claims staked by Headwater in the Tuscarora District.  The project hosts a widespread zone of silica flooding in Tertiary sediments in the immediate hanging wall of a silicified range front fault.  Historical shallow drilling 1 results include grades up to 1.04 g/t Au over 12.2 m and 0.34 g/t Au over 117.3 m along a range front fault. The majority of the historic drill holes at Hot Creek were relatively shallow and did not adequately test for the presence of high-grade feeders at depth along the range front fault or subsidiary structures. Future exploration at Hot Creek will focus on refining the geological model, identifying new high-potential zones and conducting additional geological mapping and surface sampling. About Headwater Gold: Headwater Gold Inc. (CSE: HWG, OTCQB: HWAUF) is a technically driven mineral exploration company focused on the exploration and discovery of high-grade precious metal deposits in the Western USA.  Headwater is aggressively exploring one of the most well-endowed and mining-friendly jurisdictions in the world with a goal of making world-class precious metal discoveries.  Headwater has a large portfolio of epithermal vein exploration projects and a technical team of experienced geologists with diverse capital markets, junior and major mining company backgrounds. The Company is systematically drill testing several projects in Nevada and in August 2022 and May 2023 announced significant transactions with Newmont Corporation where it acquired a 9.9% strategic equity interest in the Company and entered into earn-in agreements on several of Headwater’s projects, including Spring Peak and Lodestar which continue under partnership towards a goal of discovering a Tier-one scale gold deposit in Nevada. Headwater is part of the NewQuest Capital Group which is a discovery-driven investment enterprise that builds value through the incubation and financing of mineral projects and companies.  Further information about NewQuest can be found on the company website at www.nqcapitalgroup.com . For more information, please visit the Company's website at www.headwatergold.com . On Behalf of the Board of Directors Caleb Stroup President and CEO +1 (775) 409-3197 cstroup@headwatergold.com For further information, please contact: Brennan Zerb Investor Relations Manager +1 (778) 867-5016 bzerb@headwatergold.com Qualified Person: The technical information contained in this news release has been reviewed and approved by Scott Close, P.Geo (158157), a “Qualified Person” (“QP”) as defined in National Instrument 43-101 – Standards of Disclosure for Mineral Projects. 1 Historical drill intercepts and surface samples cannot be relied upon and are treated by the Company as historical in nature and not current or NI 43-101 compliant. Forward-Looking Statements: This news release includes certain forward-looking statements and forward-looking information (collectively, “forward-looking statements”) within the meaning of applicable Canadian securities legislation. All statements, other than statements of historical fact, included herein including, without limitation, statements regarding future capital expenditures, exploration activities and the specifications, targets, results, analyses, interpretations, benefits, costs and timing of them, Newmont’s anticipated funding of the earn-in projects and the timing thereof, and the anticipated business plans and timing of future activities of the Company, are forward-looking statements. Although the Company believes that such statements are reasonable, it can give no assurance that such expectations will prove to be correct. Often, but not always, forward looking information can be identified by words such as “pro forma”, “plans”, “expects”, “may”, “should”, “budget”, “scheduled”, “estimates”, “forecasts”, “intends”, “anticipates”, “believes”, “potential” or variations of such words including negative variations thereof, and phrases that refer to certain actions, events or results that may, could, would, might or will occur or be taken or achieved. Forward-looking statements involve known and unknown risks, uncertainties and other factors which may cause the actual results, performance or achievements of the Company to differ materially from any future results, performance or achievements expressed or implied by the forward-looking statements. Such risks and other factors include, among others, risks related to the anticipated business plans and timing of future activities of the Company, including the Company’s exploration plans and the proposed expenditures for exploration work thereon, the ability of the Company to obtain sufficient financing to fund its business activities and plans, the risk that Newmont will not elect to obtain any additional interest in the earn-in projects in excess of the minimum commitment, the ability of the Company to obtain the required permits, changes in laws, regulations and policies affecting mining operations, the Company’s limited operating history, currency fluctuations, title disputes or claims, environmental issues and liabilities, as well as those factors discussed under the heading “Risk Factors” in the Company’s prospectus dated May 26, 2021 and other filings of the Company with the Canadian Securities Authorities, copies of which can be found under the Company’s profile on the SEDAR website at www.sedar.com. Readers are cautioned not to place undue reliance on forward-looking statements. The Company undertakes no obligation to update any of the forward-looking statements, except as otherwise required by law. Copyright (c) 2024 TheNewswire - All rights reserved.",
    "primary_commodity": "Au"
  },
  "articleProject": {
    "gid": 8426,
    "project_name": "Rock Creek",
    "location": null
  },
  "articleExchange": "CSE",
  "articleCompanyId": 424,
  "articleTicker": "HWG",
  "articleCompanyName": "Headwater Gold Inc.",
  "allOtherCompanyProjects": [
    {
      "company_id": 424,
      "gid": 3743,
      "project_name": "Agate Point",
      "location": "Nevada, United States"
    },
    {
      "company_id": 424,
      "gid": 9937,
      "project_name": "Jake Creek",
      "location": "Nevada, United States"
    },
    {
      "company_id": 424,
      "gid": 4124,
      "project_name": "Katey",
      "location": "Oregon, United States"
    },
    {
      "company_id": 424,
      "gid": 4685,
      "project_name": "Mahogany",
      "location": "Oregon, United States"
    },
    {
      "company_id": 424,
      "gid": 4208,
      "project_name": "Lodestar",
      "location": "Nevada, United States"
    },
    {
      "company_id": 424,
      "gid": 5505,
      "project_name": "Crane Creek",
      "location": "Idaho, United States"
    },
    {
      "company_id": 424,
      "gid": 5511,
      "project_name": "TJ",
      "location": "Nevada, United States"
    },
    {
      "company_id": 424,
      "gid": 1080,
      "project_name": "Spring Peak",
      "location": "Nevada, United States"
    },
    {
      "company_id": 424,
      "gid": 3942,
      "project_name": "Midas North",
      "location": "Nevada, United States"
    },
    {
      "company_id": 424,
      "gid": 8426,
      "project_name": "Rock Creek",
      "location": null
    },
    {
      "company_id": 424,
      "gid": 10231,
      "project_name": "Whiskey",
      "location": "Nevada, United States"
    }
  ],
  "allOtherCompanyNews": [
    {
      "id": 106022,
      "company_id": 424,
      "title": "Headwater Gold Identifies Outcropping High-Grade Veins at its New Doug Target on the Spring Peak Property, Nevada",
      "link": "https://www.thenewswire.com/press-releases?id=1LaPFo9Mp",
      "date": "2025-05-28T10:30:00.000Z",
      "hidden": false
    },
    {
      "id": 104147,
      "company_id": 424,
      "title": "Headwater Gold Grants Stock Options",
      "link": "https://www.thenewswire.com/press-releases?id=1kogFwPmd",
      "date": "2025-05-09T10:30:00.000Z",
      "hidden": false
    },
    {
      "id": 99340,
      "company_id": 424,
      "title": "Headwater Gold Acquires the Whiskey Project in Nevada and Reports 19.2 g/t Au in Rock Samples at Surface",
      "link": "https://www.thenewswire.com/press-releases?id=1BQPFN9mG",
      "date": "2025-04-10T10:30:00.000Z",
      "hidden": false
    },
    {
      "id": 89826,
      "company_id": 424,
      "title": "Headwater Gold Expands Northern Nevada Portfolio with Acquisition of the Jake Creek Epithermal Gold System",
      "link": "https://www.thenewswire.com/press-releases?id=1k98F16NY",
      "date": "2025-03-03T11:30:00.000Z",
      "hidden": false
    },
    {
      "id": 89396,
      "company_id": 424,
      "title": "Headwater Gold Intercepts 3.55 g/t Au over 7.62 m in New Target Area at Spring Peak Project, Nevada",
      "link": "https://www.thenewswire.com/press-releases?id=1k98F1d72",
      "date": "2025-02-27T11:30:00.000Z",
      "hidden": false
    },
    {
      "id": 84279,
      "company_id": 424,
      "title": "Headwater Gold Announces Results from Initial Drilling at TJ Project, Nevada",
      "link": "https://www.thenewswire.com/press-releases?id=1Bb4F9doP",
      "date": "2025-01-16T11:30:00.000Z",
      "hidden": false
    },
    {
      "id": 82609,
      "company_id": 424,
      "title": "Headwater Gold Announces Completion of First Pass Drilling at the TJ Project, Nevada",
      "link": "https://www.thenewswire.com/press-releases?id=1Av7Fv592",
      "date": "2024-12-20T11:30:00.000Z",
      "hidden": false
    },
    {
      "id": 77138,
      "company_id": 424,
      "title": "Headwater Commences Drilling on TJ Project and Provides Update on Spring Peak and Lodestar Projects, Nevada",
      "link": "https://www.thenewswire.com/press-releases?id=1A0vFvN2j",
      "date": "2024-10-31T10:30:00.000Z",
      "hidden": false
    },
    {
      "id": 73882,
      "company_id": 424,
      "title": "Headwater Announces Drilling Plans for the TJ Project, Nevada",
      "link": "https://www.thenewswire.com/press-releases?id=1k49F8wz1",
      "date": "2024-10-07T10:30:00.000Z",
      "hidden": false
    },
    {
      "id": 71608,
      "company_id": 424,
      "title": "Headwater Completes Strategic Investment by Centerra Gold",
      "link": "https://www.thenewswire.com/press-releases?id=1k3wFwwlO",
      "date": "2024-09-17T10:30:00.000Z",
      "hidden": false
    }
  ]
}
