{
  "article": {
    "id": 65022,
    "link": "https://www.thenewswire.com/press-releases?id=1AG9F7eMr",
    "title": "Peloton Stakes Additional Mineral Claims at the North Elko Lithium Project, Nevada",
    "description": "<table style='width:fit-content; border: none;'><tr style='background: none;'><td colspan='10' style='padding: 0; margin: 0; border: none; background: none;' valign='bottom'><a target='_blank' href='https://pelotonminerals.com/'><img src=\"https://www.thenewswire.com/data/tnw/clients/logos/A0vFPDQL.png?t=1648584081\" alt=\"Peloton Minerals Corporation\" /></a></td></tr><tr style='background: none;'><td style='padding: 0; margin: 0; border: none; background: none;'></td></tr></table> \n<p style='text-align:justify; '>\n<span style='font-weight:bold; '>July 15, 2024 – </span><span style='font-weight:bold; '>TheNewswire - </span><span style='font-weight:bold; '>London, Ontario – Peloton Minerals Corporation (“Peloton” or the “Company”)</span> <span style='font-weight:bold; '>(CSE Symbol: PMC; OTCQB Symbol: PMCCF)</span> reports that it has staked an additional 27 mineral claims at its 100% owned North Elko Lithium Project (“NELP”) in northeastern Nevada, bringing the total ground position to 444 mineral claims or about 37 square kilometers.\n</p>\n\n<p style='text-align:justify; '>\nThe new claims cover additional areas of prospective lithium interest to the east following analysis of hyperspectral data and ground follow-up work. The new claims are on the eastern boundary of the NELP claim block, which is the farthest boundary from Surge Battery Metals who tie onto the western boundary of NELP and who have discovered a significant lithium deposit beside Peloton’s NELP to the west. A map accompanies this release showing an outline of Peloton’s current claim position.\n</p>\n\n<p style='text-align:justify; '>\nPeloton is presently conducting a multi-faceted exploration program at NELP including geochemical sampling across a 35 square kilometer grid, geological mapping, spectrometer prospecting and sampling, XRD minerology analysis, airborne geophysics, the additional staking, shallow packsack drilling, and permitting for deeper drilling. The exploration program will continue through the summer and into the fall.\n</p>\n\n<p style='text-align:justify; '>\nPeloton President and CEO Edward (Ted) Ellwood commented<span style='font-style:italic; '>, “We are pleased with the early progress of the exploration program as well as the initial data received. We expect many important milestones to be achieved over the course of the summer and fall.”</span>\n</p>\n\n<p style='text-align:justify; '>\n<span style=''>For further information please contact:</span>\n</p>\n \n<p style='text-align:justify; '>\n<span style='font-weight:bold; '>Edward (Ted) Ellwood, MBA</span>\n</p>\n\n<p style='text-align:justify; '>\n<span style='font-weight:bold; '>President &amp; CEO        </span><span style=''>1-519-697-2313</span>\n</p>\n \n<p style='text-align:justify; '>\n<span style=''>Richard C. Capps, PhD, is the qualified person responsible for approving the technical information contained within this release. </span>\n</p>\n \n<p style='text-align:justify; '>\nPeloton Minerals Corporation is a reporting issuer in good standing in the Provinces of British Columbia and Ontario whose common shares are listed on the CSE (Symbol: PMC) and trade in the U.S. on the <span style=''>OTC QB (Symbol: PMCCF)</span>. There are 136,598,705 common shares issued and outstanding in the capital of the Company. \n</p>\n\n<p style='text-align:justify; '>\n<span style=''>Peloton’s exploration portfolio includes the North Elko Lithium Project, as well as a gold exploration project on the Carlin Trend, Nevada, a past producing gold project in Montana under option to a JV partner, and a non-controlling interest in a copper porphyry project near </span><span style=''>Butte, Montana. </span>\n</p>\n\n<p style='text-align:center; '>\n<span style='font-weight:bold; '>Current Peloton Ground Position</span>\n</p>\n\n<p style='text-align:center; '>\n<span style='font-weight:bold; '>North Elko Lithium Project</span>\n</p>\n\n<p style='text-align:justify; '>\n<span style='text-align:center; '><a href='https://www.thenewswire.com/data/tnw/clients/img/9f909d8ad784b35fb13a159302c070a8.png' target='_blank'><img src=\"https://www.thenewswire.com/data/tnw/clients/img/9f909d8ad784b35fb13a159302c070a8_.png\" /></a><br />\nClick Image To View Full Size</span>\n</p>\n \n<p style='text-align:left; '>\n<span style='font-style:italic; font-weight:bold; '>CSE has not reviewed and does not accept responsibility for the adequacy or accuracy of this release.</span>\n</p>\n\n<p style='text-align:justify; '>\n<span style=''><span style='font-style:italic; '>This news release contains &quot;forward-looking information&quot; (within the meaning of applicable Canadian securities laws) and &quot;forward-looking statements&quot; (within the meaning of the U.S. Private Securities Litigation Reform Act of 1995). Such statements or information are identified with words such as &quot;anticipate&quot;, &quot;believe&quot;, &quot;estimate”, &quot;expect&quot;, “foresee”, &quot;intend&quot;, “looking”, “plan”, &quot;potential&quot;, &quot;propose&quot;, &quot;project&quot;,” suggests”, &quot;outlook&quot; or similar words suggesting future outcomes or statements regarding an outlook. </span></span> \n</p>\n \n<p style='text-align:justify; '>\n<span style=''><span style='font-style:italic; '>Such statements include, among others, those concerning the Company’s plans for exploration activity and to conduct future exploration programs.</span></span> <span style=''><span style='font-style:italic; '>Such forward-looking information or statements are based on a number of risks, uncertainties, and assumptions which may cause actual results or other expectations to differ materially from those anticipated and which may prove to be incorrect. Assumptions have been made regarding, among other things, management's expectations regarding its ability to initiate and complete future exploration work as expected. Actual results could differ materially due to a number of factors, including, without limitation, operational risks in the completion of the Company’s future exploration work; technical, safety or regulatory issues; availability of capital;</span></span> <span style='font-style:italic; '>changes in general economic conditions and financial markets; the imposition of government restrictions on business which may ultimately affect and delay the exploration timeline; and changes in prices for metals that the Company is exploring for</span><span style=''><span style='font-style:italic; '>. </span></span> \n</p>\n \n<p style='text-align:left; '>\n<span style=''><span style='font-style:italic; '>Although the Company believes that the expectations reflected in the forward-looking information or statements are reasonable, prospective investors in the Company’s securities should not place undue reliance on forward-looking statements because the Company can provide no assurance that such expectations will prove to be correct. Forward-looking information and statements contained in this news release are as of the date of this news release and the Company assumes no obligation to update or revise this forward-looking information and statements except as required by law.</span></span>\n</p>\n\n\n<p>Copyright (c) 2024 TheNewswire - All rights reserved.</p>\n",
    "search_terms": "North Elko,Peloton Minerals Corporation,PMC",
    "master_gid": 5946,
    "date": "2024-07-15T12:30:00.000Z",
    "tags": "Canada,USA|Nevada||Lithium|Project Acquisition",
    "image_id": null,
    "hidden": false,
    "company_id": 216,
    "provider": "thenewswire",
    "excerpt": "July 15, 2024 –TheNewswire -London, Ontario – Peloton Minerals Corporation (“Peloton” or the “Company”)(CSE Symbol: PMC; OTCQB Symbol: PMCCF)reports that it has staked an additional 27 mineral claims at its 100% owned North Elko Lithium Project (“NELP”) in northeastern Nevada, bringing the total ground position to 444 mineral claims or",
    "is_regulatory": false,
    "refined_tags": [],
    "ftp_filename": null,
    "company_name": "Peloton Minerals Corporation",
    "exchange": "CSE",
    "root_ticker": "PMC",
    "project_name": "North Elko",
    "gid": 5946,
    "location": "Nevada, United States",
    "plan_id": null,
    "description_text": "July 15, 2024 – TheNewswire - London, Ontario – Peloton Minerals Corporation (“Peloton” or the “Company”) (CSE Symbol: PMC; OTCQB Symbol: PMCCF) reports that it has staked an additional 27 mineral claims at its 100% owned North Elko Lithium Project (“NELP”) in northeastern Nevada, bringing the total ground position to 444 mineral claims or about 37 square kilometers. The new claims cover additional areas of prospective lithium interest to the east following analysis of hyperspectral data and ground follow-up work. The new claims are on the eastern boundary of the NELP claim block, which is the farthest boundary from Surge Battery Metals who tie onto the western boundary of NELP and who have discovered a significant lithium deposit beside Peloton’s NELP to the west. A map accompanies this release showing an outline of Peloton’s current claim position. Peloton is presently conducting a multi-faceted exploration program at NELP including geochemical sampling across a 35 square kilometer grid, geological mapping, spectrometer prospecting and sampling, XRD minerology analysis, airborne geophysics, the additional staking, shallow packsack drilling, and permitting for deeper drilling. The exploration program will continue through the summer and into the fall. Peloton President and CEO Edward (Ted) Ellwood commented , “We are pleased with the early progress of the exploration program as well as the initial data received. We expect many important milestones to be achieved over the course of the summer and fall.” For further information please contact: Edward (Ted) Ellwood, MBA President & CEO 1-519-697-2313 Richard C. Capps, PhD, is the qualified person responsible for approving the technical information contained within this release. Peloton Minerals Corporation is a reporting issuer in good standing in the Provinces of British Columbia and Ontario whose common shares are listed on the CSE (Symbol: PMC) and trade in the U.S. on the OTC QB (Symbol: PMCCF) . There are 136,598,705 common shares issued and outstanding in the capital of the Company. Peloton’s exploration portfolio includes the North Elko Lithium Project, as well as a gold exploration project on the Carlin Trend, Nevada, a past producing gold project in Montana under option to a JV partner, and a non-controlling interest in a copper porphyry project near Butte, Montana. Current Peloton Ground Position North Elko Lithium Project Click Image To View Full Size CSE has not reviewed and does not accept responsibility for the adequacy or accuracy of this release. This news release contains \"forward-looking information\" (within the meaning of applicable Canadian securities laws) and \"forward-looking statements\" (within the meaning of the U.S. Private Securities Litigation Reform Act of 1995). Such statements or information are identified with words such as \"anticipate\", \"believe\", \"estimate”, \"expect\", “foresee”, \"intend\", “looking”, “plan”, \"potential\", \"propose\", \"project\",” suggests”, \"outlook\" or similar words suggesting future outcomes or statements regarding an outlook. Such statements include, among others, those concerning the Company’s plans for exploration activity and to conduct future exploration programs. Such forward-looking information or statements are based on a number of risks, uncertainties, and assumptions which may cause actual results or other expectations to differ materially from those anticipated and which may prove to be incorrect. Assumptions have been made regarding, among other things, management's expectations regarding its ability to initiate and complete future exploration work as expected. Actual results could differ materially due to a number of factors, including, without limitation, operational risks in the completion of the Company’s future exploration work; technical, safety or regulatory issues; availability of capital; changes in general economic conditions and financial markets; the imposition of government restrictions on business which may ultimately affect and delay the exploration timeline; and changes in prices for metals that the Company is exploring for . Although the Company believes that the expectations reflected in the forward-looking information or statements are reasonable, prospective investors in the Company’s securities should not place undue reliance on forward-looking statements because the Company can provide no assurance that such expectations will prove to be correct. Forward-looking information and statements contained in this news release are as of the date of this news release and the Company assumes no obligation to update or revise this forward-looking information and statements except as required by law. Copyright (c) 2024 TheNewswire - All rights reserved.",
    "primary_commodity": "Li"
  },
  "articleProject": {
    "gid": 5946,
    "project_name": "North Elko",
    "location": "Nevada, United States"
  },
  "articleExchange": "CSE",
  "articleCompanyId": 216,
  "articleTicker": "PMC",
  "articleCompanyName": "Peloton Minerals Corporation",
  "allOtherCompanyProjects": [
    {
      "company_id": 216,
      "gid": 6882,
      "project_name": "Silver Bell & St. Lawrence",
      "location": "Montana, United States"
    },
    {
      "company_id": 216,
      "gid": 5946,
      "project_name": "North Elko",
      "location": "Nevada, United States"
    },
    {
      "company_id": 216,
      "gid": 5462,
      "project_name": "Emigrant Springs",
      "location": "Nevada, United States"
    },
    {
      "company_id": 216,
      "gid": 908,
      "project_name": "Golden Trail",
      "location": "Nevada, United States"
    },
    {
      "company_id": 216,
      "gid": 2277,
      "project_name": "Independence Valley",
      "location": "Nevada, USA"
    },
    {
      "company_id": 216,
      "gid": 4716,
      "project_name": "Boulder",
      "location": "Montana, United States"
    },
    {
      "company_id": 216,
      "gid": 2276,
      "project_name": "Texas Canyon",
      "location": "Nevada, United States"
    }
  ],
  "allOtherCompanyNews": [
    {
      "id": 103665,
      "company_id": 216,
      "title": "Drilling Permits Approved for the North Elko Lithium Project, Nevada ",
      "link": "https://www.thenewswire.com/press-releases?id=1BR1F95gm",
      "date": "2025-05-06T12:30:00.000Z",
      "hidden": false
    },
    {
      "id": 89463,
      "company_id": 216,
      "title": "Multiple Exploration Techniques Encourage Drilling for the Potential Discovery of a District-Scale Lithium Deposit at the North Elko Lithium Project, Nevada ",
      "link": "https://www.thenewswire.com/press-releases?id=1k3wFlr9V",
      "date": "2025-02-27T13:30:00.000Z",
      "hidden": false
    },
    {
      "id": 84161,
      "company_id": 216,
      "title": "Peloton Stakes Additional Claims & Completes Surface Geophysical Data Collection North Elko Lithium Project, Nevada ",
      "link": "https://www.thenewswire.com/press-releases?id=1BjjFK1dR",
      "date": "2025-01-15T13:30:00.000Z",
      "hidden": false
    },
    {
      "id": 80149,
      "company_id": 216,
      "title": "Peloton Minerals Corporation - Private Placement",
      "link": "https://www.thenewswire.com/press-releases?id=1Bb4F951q",
      "date": "2024-11-26T21:30:00.000Z",
      "hidden": false
    },
    {
      "id": 79593,
      "company_id": 216,
      "title": "Geophysics Contracted for the North Elko Lithium Project, Nevada",
      "link": "https://www.thenewswire.com/press-releases?id=1LpMF7ZQa",
      "date": "2024-11-21T13:30:00.000Z",
      "hidden": false
    },
    {
      "id": 78396,
      "company_id": 216,
      "title": "Private Placement",
      "link": "https://www.thenewswire.com/press-releases?id=1k98FG6Ko",
      "date": "2024-11-11T21:40:00.000Z",
      "hidden": false
    },
    {
      "id": -152086,
      "company_id": 216,
      "title": "Grant of Options",
      "link": "https://www.thenewswire.com/press-releases?id=1BNMFO3Pv",
      "date": "2024-11-01T20:30:00.000Z",
      "hidden": false
    },
    {
      "id": -149660,
      "company_id": 216,
      "title": "Extension of Warrant Expiry Date",
      "link": "https://www.thenewswire.com/press-releases?id=1AMqFqXmJ",
      "date": "2024-10-25T20:30:00.000Z",
      "hidden": false
    },
    {
      "id": 71651,
      "company_id": 216,
      "title": "Exploration Update on the  North Elko Lithium Project, Nevada",
      "link": "https://www.thenewswire.com/press-releases?id=1kEjFyyzZ",
      "date": "2024-09-17T12:30:00.000Z",
      "hidden": false
    },
    {
      "id": 68715,
      "company_id": 216,
      "title": "Private Placement",
      "link": "https://www.thenewswire.com/press-releases?id=1Bb4FdZ0X",
      "date": "2024-08-16T20:30:00.000Z",
      "hidden": false
    }
  ]
}
