{
  "article": {
    "id": 46810,
    "link": "https://www.accesswire.com/viewarticle.aspx?id=822547&lang=en",
    "title": "Lincoln Secures Conditional TSXV Approval for Bell Mountain Acquisition",
    "description": "<p><i><strong>NOT FOR DISTRIBUTION TO U.S. NEWSWIRE SERVICES OR FOR DISSEMINATION IN THE UNITED STATES</strong></i></p><p><strong>VANCOUVER, BC / ACCESSWIRE / January 5, 2024 / Lincoln Gold Mining Inc. (&quot;Lincoln&quot; or the &quot;Company&quot;) (TSXV:LMG) </strong>is pleased to provide an update further to its news releases dated August 10, 2023, October 27, 2023 and November 6, 2023 (the &quot;<strong>News Releases</strong>&quot;), on its previously announced acquisition of the assets that comprise the Bell Mountain Project located in Churchill County, Nevada (the &quot;<strong>Transaction</strong>&quot;) pursuant to a purchase agreement dated November 3, 2023 between Lincoln Resource Group Corp., a wholly-owned subsidiary of the Company, Eros Resources Corp. (&quot;<strong>Eros</strong>&quot;) and Bell Mountain Exploration Corp., a wholly-owned subsidiary of Eros.</p><p>On November 24, 2023, the TSX Venture Exchange (the &quot;<strong>TSXV</strong>&quot;) provided its conditional approval of the Transaction. Both companies continue to work diligently towards satisfying the TSXV's requirements in order to obtain final approval of the Transaction.</p><p>For further details on the Transaction, readers are referred to the News Releases, which are available under the Company's profile on SEDAR+ at <a href=\"https://pr.report/NpTbuJ0s\">www.sedarplus.ca</a>.</p><p><strong>About Lincoln</strong><br />Lincoln Gold Mining Inc. is an advanced-stage gold mine exploration and development company holding a 100% interest in the Pine Grove Gold Project, in the Walker Lane structural zone of western Nevada. The Company has prepared a preliminary economic assessment of the Pine Grove Gold Project pursuant to National Instrument 43-101 - Standards of Disclosure for Mineral Projects.</p><p>Lincoln holds its interests in the US projects through its wholly-owned subsidiaries, Lincoln Resource Group Corp. and Lincoln Gold US Corporation, both Nevada corporations.</p><p>For more information, please contact Paul Saxton, President and CEO of the Company.</p><p>On behalf of Lincoln Gold Mining Inc.<br />Paul Saxton<br />President and CEO, Lincoln Gold Mining Inc.<br />Tel: (604) 688-7377<br />Email: <a href=\"mailto:saxton@lincolnmining.com\">saxton@lincolnmining.com</a></p><p><i>CAUTIONARY STATEMENT REGARDING FORWARD-LOOKING INFORMATION</i><br /><i>Neither TSX Venture Exchange nor its Regulation Services Provider (as that term is defined in the policies of the TSX Venture Exchange) accepts responsibility for the adequacy or accuracy of this release.</i></p><p><i><strong>Forward-Looking Information</strong></i><br /><i>This press release contains &quot;forward-looking information&quot; within the meaning of applicable securities laws that is intended to be covered by the safe harbours created by those laws. &quot;Forward-looking information&quot; includes statements that use forward-looking terminology such as &quot;may&quot;, &quot;will&quot;, &quot;expect&quot;, &quot;anticipate&quot;, &quot;believe&quot;, &quot;continue&quot;, &quot;potential&quot; or the negative thereof or other variations thereof or comparable terminology. Such forward-looking information includes, without limitation, statements relating to the Company's expectation that the Transaction will close and that the Company anticipates that the Transaction will receive final Exchange acceptance.</i></p><p><i>Forward-looking statements involve risks and uncertainties and there can be no assurance that such statements will prove to be accurate and actual results and future events could differ materially from those anticipated in such statements. Important factors that could cause actual results to differ materially from the Company's expectations include those relating to the Company's expectation that the Transaction will be completed, the failure to obtain approval of the Transaction from the Exchange, and other risks detailed from time to time in the filings made by the Company with securities regulators.</i></p><p><i>The reader is cautioned that assumptions used in the preparation of any forward-looking information may prove to be incorrect. Events or circumstances may cause actual results to differ materially from those predicted, as a result of numerous known and unknown risks, uncertainties, and other factors, many of which are beyond the control of the Company, including, without limitation, the Company not being able to complete the Transaction within an acceptable timeline and the risk that the Company may not obtain approval of the Exchange or other necessary regulatory approval of the Transaction. The reader is cautioned not to place undue reliance on any forward-looking information. Such information, although considered reasonable by management at the time of preparation, may prove to be incorrect and actual results may differ materially from those anticipated. Forward-looking statements contained in this news release are expressly qualified by this cautionary statement. The forward-looking statements contained in this news release are made as of the date of this news release and the Company will not update or revise publicly any of the included forward- looking statements unless as expressly required by applicable law.</i></p><p><strong>SOURCE:</strong> Lincoln Gold Mining Inc.</p><br><br>View the original <a href='https://www.accesswire.com/822547/lincoln-secures-conditional-tsxv-approval-for-bell-mountain-acquisition'>press release</a> on accesswire.com<br><br>",
    "search_terms": "Bell Mountain,Lincoln Gold Mining Inc.,LMG",
    "master_gid": 5738,
    "date": "2024-01-05T22:35:00.000Z",
    "tags": "USA|Nevada||Gold|Project Acquisition",
    "image_id": null,
    "hidden": false,
    "company_id": 1475,
    "provider": "accesswire",
    "excerpt": "NOT FOR DISTRIBUTION TO U.S. NEWSWIRE SERVICES OR FOR DISSEMINATION IN THE UNITED STATESVANCOUVER, BC / ACCESSWIRE / January 5, 2024 / Lincoln Gold Mining Inc. (&quot;Lincoln&quot; or the &quot;Company&quot;) (TSXV:LMG)is pleased to provide an update further to its news releases dated August 10, 2023, October 27, 2023 and November",
    "is_regulatory": false,
    "refined_tags": [
      "Project Acquisition"
    ],
    "ftp_filename": null,
    "company_name": "Lincoln Gold Mining Inc.",
    "exchange": "TSXV",
    "root_ticker": "LMG",
    "project_name": "Bell Mountain",
    "gid": 5738,
    "location": null,
    "plan_id": "companytier2",
    "description_text": "NOT FOR DISTRIBUTION TO U.S. NEWSWIRE SERVICES OR FOR DISSEMINATION IN THE UNITED STATES VANCOUVER, BC / ACCESSWIRE / January 5, 2024 / Lincoln Gold Mining Inc. (\"Lincoln\" or the \"Company\") (TSXV:LMG) is pleased to provide an update further to its news releases dated August 10, 2023, October 27, 2023 and November 6, 2023 (the \" News Releases \"), on its previously announced acquisition of the assets that comprise the Bell Mountain Project located in Churchill County, Nevada (the \" Transaction \") pursuant to a purchase agreement dated November 3, 2023 between Lincoln Resource Group Corp., a wholly-owned subsidiary of the Company, Eros Resources Corp. (\" Eros \") and Bell Mountain Exploration Corp., a wholly-owned subsidiary of Eros. On November 24, 2023, the TSX Venture Exchange (the \" TSXV \") provided its conditional approval of the Transaction. Both companies continue to work diligently towards satisfying the TSXV's requirements in order to obtain final approval of the Transaction. For further details on the Transaction, readers are referred to the News Releases, which are available under the Company's profile on SEDAR+ at www.sedarplus.ca . About Lincoln Lincoln Gold Mining Inc. is an advanced-stage gold mine exploration and development company holding a 100% interest in the Pine Grove Gold Project, in the Walker Lane structural zone of western Nevada. The Company has prepared a preliminary economic assessment of the Pine Grove Gold Project pursuant to National Instrument 43-101 - Standards of Disclosure for Mineral Projects. Lincoln holds its interests in the US projects through its wholly-owned subsidiaries, Lincoln Resource Group Corp. and Lincoln Gold US Corporation, both Nevada corporations. For more information, please contact Paul Saxton, President and CEO of the Company. On behalf of Lincoln Gold Mining Inc. Paul Saxton President and CEO, Lincoln Gold Mining Inc. Tel: (604) 688-7377 Email: saxton@lincolnmining.com CAUTIONARY STATEMENT REGARDING FORWARD-LOOKING INFORMATION Neither TSX Venture Exchange nor its Regulation Services Provider (as that term is defined in the policies of the TSX Venture Exchange) accepts responsibility for the adequacy or accuracy of this release. Forward-Looking Information This press release contains \"forward-looking information\" within the meaning of applicable securities laws that is intended to be covered by the safe harbours created by those laws. \"Forward-looking information\" includes statements that use forward-looking terminology such as \"may\", \"will\", \"expect\", \"anticipate\", \"believe\", \"continue\", \"potential\" or the negative thereof or other variations thereof or comparable terminology. Such forward-looking information includes, without limitation, statements relating to the Company's expectation that the Transaction will close and that the Company anticipates that the Transaction will receive final Exchange acceptance. Forward-looking statements involve risks and uncertainties and there can be no assurance that such statements will prove to be accurate and actual results and future events could differ materially from those anticipated in such statements. Important factors that could cause actual results to differ materially from the Company's expectations include those relating to the Company's expectation that the Transaction will be completed, the failure to obtain approval of the Transaction from the Exchange, and other risks detailed from time to time in the filings made by the Company with securities regulators. The reader is cautioned that assumptions used in the preparation of any forward-looking information may prove to be incorrect. Events or circumstances may cause actual results to differ materially from those predicted, as a result of numerous known and unknown risks, uncertainties, and other factors, many of which are beyond the control of the Company, including, without limitation, the Company not being able to complete the Transaction within an acceptable timeline and the risk that the Company may not obtain approval of the Exchange or other necessary regulatory approval of the Transaction. The reader is cautioned not to place undue reliance on any forward-looking information. Such information, although considered reasonable by management at the time of preparation, may prove to be incorrect and actual results may differ materially from those anticipated. Forward-looking statements contained in this news release are expressly qualified by this cautionary statement. The forward-looking statements contained in this news release are made as of the date of this news release and the Company will not update or revise publicly any of the included forward- looking statements unless as expressly required by applicable law. SOURCE: Lincoln Gold Mining Inc. View the original press release on accesswire.com",
    "primary_commodity": "Au"
  },
  "articleProject": {
    "gid": 5738,
    "project_name": "Bell Mountain",
    "location": null
  },
  "articleExchange": "TSXV",
  "articleCompanyId": 1475,
  "articleTicker": "LMG",
  "articleCompanyName": "Lincoln Gold Mining Inc.",
  "allOtherCompanyProjects": [
    {
      "company_id": 1475,
      "gid": 8241,
      "project_name": "Pine Grove",
      "location": null
    }
  ],
  "allOtherCompanyNews": [
    {
      "id": 107145,
      "company_id": 1475,
      "title": "Lincoln Gold Announces $1.2 Million Financing",
      "link": "https://www.thenewswire.com/press-releases?id=1BR1F9pK5",
      "date": "2025-06-05T13:30:00.000Z",
      "hidden": false
    },
    {
      "id": 104070,
      "company_id": 1475,
      "title": "Lincoln Gold Announces Warrant Extension",
      "link": "https://www.thenewswire.com/press-releases?id=1LPRFrXQw",
      "date": "2025-05-08T13:30:00.000Z",
      "hidden": false
    },
    {
      "id": 103673,
      "company_id": 1475,
      "title": "Lincoln Gold Appoints New Director",
      "link": "https://www.thenewswire.com/press-releases?id=1LymF1Pnd",
      "date": "2025-05-06T13:00:00.000Z",
      "hidden": false
    },
    {
      "id": 103342,
      "company_id": 1475,
      "title": "Lincoln Gold Calls Shareholders' Meeting",
      "link": "https://www.thenewswire.com/press-releases?id=1BglFw27Z",
      "date": "2025-05-02T21:05:00.000Z",
      "hidden": false
    },
    {
      "id": 100583,
      "company_id": 1475,
      "title": "Lincoln Gold Update",
      "link": "https://www.thenewswire.com/press-releases?id=1AMqFebZz",
      "date": "2025-04-22T22:30:00.000Z",
      "hidden": false
    },
    {
      "id": 99848,
      "company_id": 1475,
      "title": "Shareholder Meeting Requisitioned by Shareholders of Lincoln Gold Mining",
      "link": "https://www.juniorminingnetwork.com/junior-miner-news/press-releases/467-tsx-venture/lmg/178438-shareholder-meeting-requisitioned-by-shareholders-of-lincoln-gold-mining-inc.html",
      "date": "2025-04-15T13:15:00.000Z",
      "hidden": false
    },
    {
      "id": 89879,
      "company_id": 1475,
      "title": "Lincoln Gold Expands and Confirms Gold Mineralization and Deposit Geology at Pine Grove in Nevada",
      "link": "https://www.thenewswire.com/press-releases?id=1L7OF7bP8",
      "date": "2025-03-03T14:00:00.000Z",
      "hidden": false
    },
    {
      "id": -197927,
      "company_id": 1475,
      "title": "A Review of Lincoln’s Gold-Silver Exciting Progress in Nevada",
      "link": "https://app.quotemedia.com/data/downloadFiling?webmasterId=104408&ref=67c5c1b62db5df79b64e438a&type=PDFC&formType=002-002-001089-003001&formDescription=News+release&dateFiled=2025-03-03",
      "date": "2025-03-03T06:50:30.000Z",
      "hidden": false
    },
    {
      "id": 85064,
      "company_id": 1475,
      "title": "A Review of Lincoln's Gold-Silver Exciting Progress in Nevada",
      "link": "https://www.thenewswire.com/press-releases?id=1AdyFDqK5",
      "date": "2025-01-23T13:50:00.000Z",
      "hidden": false
    },
    {
      "id": 83322,
      "company_id": 1475,
      "title": "Lincoln Gold Acquires the Bell Mountain Gold-Silver Project",
      "link": "https://www.accesswire.com/964465/lincoln-gold-acquires-the-bell-mountain-gold-silver-project",
      "date": "2025-01-06T20:00:00.000Z",
      "hidden": false
    }
  ]
}
