{
  "article": {
    "id": 86647,
    "link": "https://www.globenewswire.com/news-release/2025/02/03/3019588/0/en/WALKER-RIVER-SIGNS-LAPON-CANYON-STREAM-AGREEMENT.html",
    "title": "WALKER RIVER SIGNS LAPON CANYON STREAM AGREEMENT",
    "description": "<p align=\"justify\">Vancouver, B.C., Feb.  03, 2025  (GLOBE NEWSWIRE) -- <b>Walker River Resources Corp.</b> (“<b>Walker</b>” or the “<b>Company</b>”) (TSX-V: <b>WRR</b>) is pleased to announce it has signed, through its wholly owned subsidiary Walker River Resources, LLC, an Exploration Stream Earn-in Agreement (the “<b>Agreement</b>”) with Nevada Canyon, LLC, a wholly owned subsidiary of Nevada Canyon Gold Corp. (“<b>Nevada Canyon</b>”)<b>,</b> to explore and develop the Lapon Canyon Gold Project (“<b>Lapon Canyon</b>” or the “<b>Lapon Canyon Project</b>”) a portion of the Lapon Gold Project, located within the prolific Walker Lane gold trend, 40 miles southeast of Yerington, Nevada. The Agreement grants Nevada Canyon the exclusive right to earn and purchase up to a 50% interest in the Lapon Canyon Project by funding cumulative Exploration Expenses of US$5,000,000 over a three-year period.</p>   <p align=\"justify\" style=\" text-align: justify; font-size:10.5pt;\"> </p>   <p align=\"justify\">The Agreement provides that, subject to certain conditions, Walker River will grant Nevada Canyon an exclusive right to earn and purchase either (i) an undivided 50% interest (the “Earned Interest”) in Lapon Canyon, or (ii) alternatively, a production royalty in the Lapon Canyon Project. Nevada Canyon has the right to accelerate completion of the Minimum Work Requirements and exercise its Earn-In Right at its discretion.</p>   <p align=\"justify\" style=\" text-align: justify; font-size:10.5pt;\"> </p>   <p align=\"justify\"><b>Key Terms of the Agreement </b></p>   <p align=\"justify\" style=\" text-align: justify; font-size:10.5pt;\"> </p>   <ul type=\"disc\"><li>Nevada Canyon to incur minimum Exploration Expenses of US$1,000,000 during the first Annual Period.</li></ul>   <ul type=\"disc\"><li>Nevada Canyon to incur minimum Exploration Expenses of US$2,000,000 during each of the second and third Annual Periods.</li></ul>   <ul type=\"disc\"><li>Exploration program to include extensive exploration and definition drilling, initial and subsequent compliant mineral resource estimates, and completion of a Preliminary Economic Assessment (\"PEA\") during the Earn-In Period.</li></ul>   <ul type=\"disc\"><li>Nevada Canyon, through its exploration project accelerator, will act as operator for the duration of the Earn-in Period, with Walker River providing its exploration expertise and guidance. </li></ul>   <p align=\"justify\" style=\" text-align: justify; font-size:10.5pt;\"> </p>   <p align=\"justify\">Upon Nevada Canyon acquiring the 50% Earned Interest, the Parties will form a Nevada limited liability company (the “<b>Joint Venture LLC</b>”) and contribute the Lapon Canyon Project to the Joint Venture LLC for the joint development and operation. Each party will fund its pro-rata share of future expenditures on the Lapon Canyon Project or face dilution of its interest in the Joint Venture LLC. If a party’s interest in the Joint Venture LLC is diluted below 10% or pursuant to certain other conditions of the Joint Venture LLC Agreement, its interest will be converted to a 2% Net Smelter Returns royalty on the Lapon Canyon Project, subject to a buy-down option to 1% exercisable at any time for the payment of US$2,500,000. The Parties agreed on the closing of the Agreement, Nevada Canyon’s US$200,000 Promissory Note dated December 19, 2024, including principal and accrued interest, shall be deemed satisfied in full and credited toward Nevada Canyon's Exploration Expenses obligations for the first Annual Period.</p>   <p align=\"justify\" style=\" text-align: justify; font-size:10.5pt;\"> </p>   <p align=\"justify\">Michel David, President states: “We are very excited to have the funding in place to confirm and prove up the potential of Lapon Canyon. Nevada Canyon’s commitment to fund the project clearly shows the potential of Lapon Canyon, we can now accelerate the drilling, and development of the Lapon Canyon Project.”</p>   <p align=\"justify\" style=\" text-align: justify; font-size:10.5pt;\"> </p>   <p align=\"justify\">Walker River owns a 100% undivided interest in the Lapon Canyon Project, which consists of 96 unpatented lode mining claims known as the Sleeper and Lapon Rose claim groups located within the prolific Walker Lane gold trend, in Nevada. Walker River has completed considerable exploration work to date, with numerous drill hole intercepts that have indicated significant gold mineralization. </p>   <p align=\"justify\" style=\" text-align: justify; font-size:10.5pt;\"> </p>   <p align=\"justify\" style=\" text-align: justify; font-size:10.5pt;\"> </p>   <p align=\"justify\">The drill programs at Lapon Canyon will consist of definition and systematic drilling on section for geological modelling purposes, exploration drilling to discover new gold mineralization, extension of known gold mineralization, in several directions, including at depth. The results from the 2024 drill programs and subsequent data compilation will enable the completion of an initial NI 43-101 compliant mineral resource on the Project.</p>   <p align=\"justify\" style=\" text-align: justify; font-size:10.5pt;\"> </p>   <p align=\"justify\"><b>About the Lapon Gold Project</b></p>   <p align=\"justify\"> The Lapon Gold Project consists of 147 claims (2940 acres) situated in the Wassuk Range, within the Walker Lane shear zone, a 100 km wide structural corridor extending in a southeast direction from Reno, Nevada. The Project is easily accessible by secondary state roads from the main highway (25 kilometres), and is located approximately 60 kilometres southeast of Yerington, Nevada. A state power grid transmission line passes within three kilometres of the Project. </p>   <p align=\"justify\" style=\" text-align: justify; font-size:10.5pt;\"> </p>   <p align=\"justify\">The Lapon Gold Project includes Lapon Canyon, the Pikes Peak claims located 4 kilometres to the north, and the Rattlesnake and Range Front claims 3 kilometres to the west and over 600 meters lower than the present drilling at Lapon Canyon. The Rattlesnake, Range Front, and Pikers Peak claims cover over 8 km of possible extensions of the range front zones to the west, north, and south of Lapon Canyon, adding several additional drill target areas to the project. Rattlesnake and Pikes Peak contain numerous historical mining and milling areas that consist of adits at different levels, shafts and underground workings, and a network of existing roads providing access throughout. Little or no exploration work has been carried out on these claims prior to Walker’s arrival. It is notable that the Rattlesnake area and adits are on strike with the Lapon Canyon discoveries located 3 km on strike and 600 meters above. Lapon Canyon hosts historical high grade gold mining with approximately 2000 feet of undergoing workings in three adits. Historical underground work returned numerous assay values in the one ounce per ton range, with a sample at the end of the adit A returning a 20.6 ounces per ton Au. (NI 43-101, Montgomery and Barr, 2004).</p>   <p align=\"justify\" style=\" text-align: justify; font-size:10.5pt;\"> </p>   <p align=\"justify\" style=\" text-align: justify; font-size:10.5pt;\"> </p>   <p><b>FOR FURTHER INFORMATION PLEASE CONTACT:</b></p>   <p style=\"font-size:10.5pt;\"> </p>   <p>Michel David, CEO &amp; Director<br />Tel: 819 874-0030<br />Email: <a href=\"https://www.globenewswire.com/Tracker?data=-3rYEMnyU81_Vy8WvRVxyEeM9-GEEFI0qUrrBhkMVObV7Snfm4eLZVqUpgfKL4zxYWwQ7zHTrEodjeNwJ4pMkA==\" rel=\"nofollow\" target=\"_blank\" title=\"\"><u>info@wrrgold.com</u></a><br />Website: <a href=\"https://www.globenewswire.com/Tracker?data=fPqdyXTBkJIH1why_FUS3qVXSjMpKd9DamxqYHAbs3Pd8cif1iGdZu-NADSu1HkAa9UoJ4YBIFC4FZYZ1rzqEQ==\" rel=\"nofollow\" target=\"_blank\" title=\"\"><u>www.wrrgold.com</u></a></p>   <p style=\"font-size:10.5pt;\"> </p>   <p align=\"justify\">Neither the TSX Venture Exchange nor its Regulation Service Provider (as that term is defined in the policies of the TSX Venture Exchange) accepts responsibility for the adequacy or accuracy of this release.</p>   <p align=\"justify\" style=\"background: #FFFFFF;  text-align: justify; font-size:10.5pt;\"> </p>   <p align=\"justify\"><b><u>Cautionary Statements Regarding Forward Looking Information</u></b></p>   <p align=\"justify\">This news release contains certain “forward-looking information” and “forward-looking statements” (collectively “forward-looking statements”) within the meaning of applicable securities legislation. All statements, other than statements of historical fact, included herein, are forward-looking statements. Forward-looking statements are frequently, but not always, identified by words such as “expects”, “anticipates”, “believes”, “intends”, “estimates”, “potential”, “possible”, and similar expressions, or statements that events, conditions, or results “will”, “may”, “could”, or “should” occur or be achieved There can be no assurance that such statements will prove to be accurate and actual results and future events could differ materially from those anticipated in such statements. Forward-looking statements reflect the beliefs, opinions and projections on the date the statements are made and are based upon a number of assumptions and estimates that, while considered reasonable by the Company, are inherently subject to significant business, economic, competitive, political, social and regulatory uncertainties and contingencies. Many factors, both known and unknown, could cause actual results, performance or achievements to be materially different from the results, performance or achievements that are or may be expressed or implied by such forward-looking statements and the parties have made assumptions and estimates based on or related to many of these factors. Readers should not place undue reliance on the forward-looking statements and information contained in this news release concerning these items. The Company does not assume any obligation to update the forward-looking statements of beliefs, opinions, projections, or other factors, should they change, except as required by applicable securities laws.</p>   <p align=\"justify\" style=\" text-align: justify; font-size:9pt;\"> </p>   <p> </p>  <br /><img alt=\"\" src='https://ml.globenewswire.com/media/NWIwMDQyOWUtOWY1ZS00N2Q3LWFkOGEtOTMwYjY5YjBhY2I4LTUwMDA3NzY4OA==/tiny/Walker-River-Resources.png' referrerpolicy='no-referrer-when-downgrade' />",
    "search_terms": "Lapon,Walker River Resources Corp.,WRR",
    "master_gid": 1000,
    "date": "2025-02-03T14:00:00.000Z",
    "tags": "USA|Nevada||Gold|Project Acquisition",
    "image_id": null,
    "hidden": false,
    "company_id": 119,
    "provider": "globenewswire",
    "excerpt": "Vancouver, B.C., Feb. 03, 2025 (GLOBE NEWSWIRE) --Walker River Resources Corp.(“Walker” or the “Company”) (TSX-V:WRR) is pleased to announce it has signed, through its wholly owned subsidiary Walker River Resources, LLC, an Exploration Stream Earn-in Agreement (the “Agreement”) with Nevada Canyon, LLC, a wholly owned subsidiary of Nevada Canyon Gold",
    "is_regulatory": false,
    "refined_tags": [],
    "ftp_filename": null,
    "company_name": "Walker River Resources Corp.",
    "exchange": "TSXV",
    "root_ticker": "WRR",
    "project_name": "Lapon",
    "gid": 1000,
    "location": "Nevada, USA",
    "plan_id": null,
    "description_text": "Vancouver, B.C., Feb.  03, 2025  (GLOBE NEWSWIRE) -- Walker River Resources Corp. (“ Walker ” or the “ Company ”) (TSX-V: WRR ) is pleased to announce it has signed, through its wholly owned subsidiary Walker River Resources, LLC, an Exploration Stream Earn-in Agreement (the “ Agreement ”) with Nevada Canyon, LLC, a wholly owned subsidiary of Nevada Canyon Gold Corp. (“ Nevada Canyon ”) , to explore and develop the Lapon Canyon Gold Project (“ Lapon Canyon ” or the “ Lapon Canyon Project ”) a portion of the Lapon Gold Project, located within the prolific Walker Lane gold trend, 40 miles southeast of Yerington, Nevada. The Agreement grants Nevada Canyon the exclusive right to earn and purchase up to a 50% interest in the Lapon Canyon Project by funding cumulative Exploration Expenses of US$5,000,000 over a three-year period. The Agreement provides that, subject to certain conditions, Walker River will grant Nevada Canyon an exclusive right to earn and purchase either (i) an undivided 50% interest (the “Earned Interest”) in Lapon Canyon, or (ii) alternatively, a production royalty in the Lapon Canyon Project. Nevada Canyon has the right to accelerate completion of the Minimum Work Requirements and exercise its Earn-In Right at its discretion. Key Terms of the Agreement Nevada Canyon to incur minimum Exploration Expenses of US$1,000,000 during the first Annual Period. Nevada Canyon to incur minimum Exploration Expenses of US$2,000,000 during each of the second and third Annual Periods. Exploration program to include extensive exploration and definition drilling, initial and subsequent compliant mineral resource estimates, and completion of a Preliminary Economic Assessment (\"PEA\") during the Earn-In Period. Nevada Canyon, through its exploration project accelerator, will act as operator for the duration of the Earn-in Period, with Walker River providing its exploration expertise and guidance. Upon Nevada Canyon acquiring the 50% Earned Interest, the Parties will form a Nevada limited liability company (the “ Joint Venture LLC ”) and contribute the Lapon Canyon Project to the Joint Venture LLC for the joint development and operation. Each party will fund its pro-rata share of future expenditures on the Lapon Canyon Project or face dilution of its interest in the Joint Venture LLC. If a party’s interest in the Joint Venture LLC is diluted below 10% or pursuant to certain other conditions of the Joint Venture LLC Agreement, its interest will be converted to a 2% Net Smelter Returns royalty on the Lapon Canyon Project, subject to a buy-down option to 1% exercisable at any time for the payment of US$2,500,000. The Parties agreed on the closing of the Agreement, Nevada Canyon’s US$200,000 Promissory Note dated December 19, 2024, including principal and accrued interest, shall be deemed satisfied in full and credited toward Nevada Canyon's Exploration Expenses obligations for the first Annual Period. Michel David, President states: “We are very excited to have the funding in place to confirm and prove up the potential of Lapon Canyon. Nevada Canyon’s commitment to fund the project clearly shows the potential of Lapon Canyon, we can now accelerate the drilling, and development of the Lapon Canyon Project.” Walker River owns a 100% undivided interest in the Lapon Canyon Project, which consists of 96 unpatented lode mining claims known as the Sleeper and Lapon Rose claim groups located within the prolific Walker Lane gold trend, in Nevada. Walker River has completed considerable exploration work to date, with numerous drill hole intercepts that have indicated significant gold mineralization. The drill programs at Lapon Canyon will consist of definition and systematic drilling on section for geological modelling purposes, exploration drilling to discover new gold mineralization, extension of known gold mineralization, in several directions, including at depth. The results from the 2024 drill programs and subsequent data compilation will enable the completion of an initial NI 43-101 compliant mineral resource on the Project. About the Lapon Gold Project The Lapon Gold Project consists of 147 claims (2940 acres) situated in the Wassuk Range, within the Walker Lane shear zone, a 100 km wide structural corridor extending in a southeast direction from Reno, Nevada. The Project is easily accessible by secondary state roads from the main highway (25 kilometres), and is located approximately 60 kilometres southeast of Yerington, Nevada. A state power grid transmission line passes within three kilometres of the Project. The Lapon Gold Project includes Lapon Canyon, the Pikes Peak claims located 4 kilometres to the north, and the Rattlesnake and Range Front claims 3 kilometres to the west and over 600 meters lower than the present drilling at Lapon Canyon. The Rattlesnake, Range Front, and Pikers Peak claims cover over 8 km of possible extensions of the range front zones to the west, north, and south of Lapon Canyon, adding several additional drill target areas to the project. Rattlesnake and Pikes Peak contain numerous historical mining and milling areas that consist of adits at different levels, shafts and underground workings, and a network of existing roads providing access throughout. Little or no exploration work has been carried out on these claims prior to Walker’s arrival. It is notable that the Rattlesnake area and adits are on strike with the Lapon Canyon discoveries located 3 km on strike and 600 meters above. Lapon Canyon hosts historical high grade gold mining with approximately 2000 feet of undergoing workings in three adits. Historical underground work returned numerous assay values in the one ounce per ton range, with a sample at the end of the adit A returning a 20.6 ounces per ton Au. (NI 43-101, Montgomery and Barr, 2004). FOR FURTHER INFORMATION PLEASE CONTACT: Michel David, CEO & Director Tel: 819 874-0030 Email: info@wrrgold.com Website: www.wrrgold.com Neither the TSX Venture Exchange nor its Regulation Service Provider (as that term is defined in the policies of the TSX Venture Exchange) accepts responsibility for the adequacy or accuracy of this release. Cautionary Statements Regarding Forward Looking Information This news release contains certain “forward-looking information” and “forward-looking statements” (collectively “forward-looking statements”) within the meaning of applicable securities legislation. All statements, other than statements of historical fact, included herein, are forward-looking statements. Forward-looking statements are frequently, but not always, identified by words such as “expects”, “anticipates”, “believes”, “intends”, “estimates”, “potential”, “possible”, and similar expressions, or statements that events, conditions, or results “will”, “may”, “could”, or “should” occur or be achieved There can be no assurance that such statements will prove to be accurate and actual results and future events could differ materially from those anticipated in such statements. Forward-looking statements reflect the beliefs, opinions and projections on the date the statements are made and are based upon a number of assumptions and estimates that, while considered reasonable by the Company, are inherently subject to significant business, economic, competitive, political, social and regulatory uncertainties and contingencies. Many factors, both known and unknown, could cause actual results, performance or achievements to be materially different from the results, performance or achievements that are or may be expressed or implied by such forward-looking statements and the parties have made assumptions and estimates based on or related to many of these factors. Readers should not place undue reliance on the forward-looking statements and information contained in this news release concerning these items. The Company does not assume any obligation to update the forward-looking statements of beliefs, opinions, projections, or other factors, should they change, except as required by applicable securities laws.",
    "primary_commodity": "Au"
  },
  "articleProject": {
    "gid": 1000,
    "project_name": "Lapon",
    "location": "Nevada, USA"
  },
  "articleExchange": "TSXV",
  "articleCompanyId": 119,
  "articleTicker": "WRR",
  "articleCompanyName": "Walker River Resources Corp.",
  "allOtherCompanyProjects": [
    {
      "company_id": 119,
      "gid": 1000,
      "project_name": "Lapon",
      "location": "Nevada, USA"
    }
  ],
  "allOtherCompanyNews": [
    {
      "id": 105518,
      "company_id": 119,
      "title": "WALKER BEGINS DRILL PROGRAM AT LAPON CANYON",
      "link": null,
      "date": "2025-05-22T13:00:00.000Z",
      "hidden": false
    },
    {
      "id": 92693,
      "company_id": 119,
      "title": "WALKER RIVER ANNOUNCES INTERCEPTS INCLUDING 2.62 G/T OVER 41.1 METERS AT THE LAPON GOLD PROJECT",
      "link": null,
      "date": "2025-03-27T12:00:00.000Z",
      "hidden": false
    },
    {
      "id": -177852,
      "company_id": 119,
      "title": "WALKER CLOSES NON-BROKERED PRIVATE PLACEMENT",
      "link": "https://app.quotemedia.com/data/downloadFiling?webmasterId=104408&ref=67d498e593c00527454c5c5a&type=PDFC&formType=002-002-001089-003001&formDescription=News+release&dateFiled=2025-03-14",
      "date": "2025-03-14T21:00:21.000Z",
      "hidden": false
    },
    {
      "id": 86647,
      "company_id": 119,
      "title": "WALKER RIVER SIGNS LAPON CANYON STREAM AGREEMENT",
      "link": "https://www.globenewswire.com/news-release/2025/02/03/3019588/0/en/WALKER-RIVER-SIGNS-LAPON-CANYON-STREAM-AGREEMENT.html",
      "date": "2025-02-03T14:00:00.000Z",
      "hidden": false
    },
    {
      "id": 83605,
      "company_id": 119,
      "title": "WALKER RIVER ANNOUNCES SIGNIFICANT GOLD INTERCEPTS INCLUDING 3.88 G/T OVER 77.72 METERS AT THE LAPON GOLD PROJECT",
      "link": "https://www.globenewswire.com/news-release/2025/01/09/3007000/0/en/WALKER-RIVER-ANNOUNCES-SIGNIFICANT-GOLD-INTERCEPTS-INCLUDING-3-88-G-T-OVER-77-72-METERS-AT-THE-LAPON-GOLD-PROJECT.html",
      "date": "2025-01-09T13:00:00.000Z",
      "hidden": false
    },
    {
      "id": 74736,
      "company_id": 119,
      "title": "WALKER RIVER ANNOUNCES ADDITIONAL RESULTS FROM THE LAPON GOLD PROJECT",
      "link": "https://www.globenewswire.com/news-release/2024/10/15/2963116/0/en/WALKER-RIVER-ANNOUNCES-ADDITIONAL-RESULTS-FROM-THE-LAPON-GOLD-PROJECT.html",
      "date": "2024-10-15T12:00:00.000Z",
      "hidden": false
    },
    {
      "id": 72349,
      "company_id": 119,
      "title": "WALKER RIVER ANNOUNCES INITIAL RESULTS FROM THE 2024 LAPON GOLD PROJECT DRILL PROGRAM",
      "link": "https://www.globenewswire.com/news-release/2024/09/24/2952126/0/en/WALKER-RIVER-ANNOUNCES-INITIAL-RESULTS-FROM-THE-2024-LAPON-GOLD-PROJECT-DRILL-PROGRAM.html",
      "date": "2024-09-24T12:00:00.000Z",
      "hidden": false
    },
    {
      "id": -177851,
      "company_id": 119,
      "title": "Walker River Announces Pikes Peak Royalty Agreement",
      "link": "https://app.quotemedia.com/data/downloadFiling?webmasterId=104408&ref=666b795d9af0f7140032a95c&type=PDFC&formType=002-002-001089-003001&formDescription=News+release&dateFiled=2024-06-13",
      "date": "2024-06-13T22:57:33.000Z",
      "hidden": false
    },
    {
      "id": 55265,
      "company_id": 119,
      "title": "WALKER RIVER BEGINS DRILLING AT THE LAPON GOLD PROJECT",
      "link": "https://www.globenewswire.com/news-release/2024/06/06/2894687/0/en/WALKER-RIVER-BEGINS-DRILLING-AT-THE-LAPON-GOLD-PROJECT.html",
      "date": "2024-06-06T13:00:00.000Z",
      "hidden": false
    },
    {
      "id": 93498,
      "company_id": 119,
      "title": "WALKER ANNOUNCES LAPON CANYON DRILLING TO BEGIN",
      "link": "https://app.quotemedia.com/data/downloadFiling?webmasterId=104408&ref=665642e79749f0545c681d12&type=PDFC&formType=002-002-001089-003001&formDescription=News+release&dateFiled=2024-05-28",
      "date": "2024-05-28T20:47:35.000Z",
      "hidden": false
    }
  ]
}
