{
  "article": {
    "id": 70555,
    "link": "https://www.newsfilecorp.com/release/222344/Ridgeline-Minerals-Receives-Approval-for-Exploration-EarnIn-Agreement-with-South32-at-the-Selena-Project-Nevada",
    "title": "Ridgeline Minerals Receives Approval for Exploration Earn-In Agreement with South32 at the Selena Project, Nevada",
    "description": "<img src=\"https://api.newsfilecorp.com/newsinfo/222344/367\" id=\"367\" width=\"2\" height=\"2\" style=\"width: 1px;  height: 1px;border: 0px solid;\" /><p>Vancouver, British Columbia--(Newsfile Corp. - September 6, 2024) - Ridgeline Minerals Corp. (TSXV: RDG) (OTCQB: RDGMF) FRA: 0GC0) (\"<b>Ridgeline</b>\" or the \"<b>Company</b>\") is pleased to announce, further to its news release on August 22, 2024, that the TSX Venture Exchange has accepted for filing the previously announced Earn-In Agreement dated August 21, 2024 (the \"<b>Earn-In Agreement</b>\" or \"<b>Agreement</b>\") with a wholly-owned subsidiary of South32 Limited (\"<b>South32</b>\") at the Selena carbonate replacement deposit project (\"<b>Selena</b>\" or the \"<b>Project</b>\") located in White Pine County, Nevada. </p><p>The Earn-In Agreement was signed effective August 21, 2024, wherein South32 has the option to earn an initial 60% ownership interest in the Project by paying Ridgeline a US$100,000 execution payment and funding a minimum of US$10.0 million (of which US$2.0 million is guaranteed) in qualifying exploration expenditures on the Project over an initial five-year term. Ridgeline will remain operator of the Project during the Initial Phase 1 Earn-in Option period (the \"<b>First Option</b>\"). Subject to South32 having exercised the First Option, South32 will have a further option (the \"<b>Second Option</b>\") to increase its ownership interest in the Project to a total of 80% by incurring an additional US$10.0 million in expenditures over a three-year  Phase 2 Earn-In Option period for an aggregate spend of US$20.0 million over eight years. </p><p>If South32 wishes to exercise the Second Option, it must within 42 months of the Second Option commencement date, arrange for and provide draft definitive documentation in respect of a debt facility (\"<b>Ridgeline Facility</b>\") from which (if executed) Ridgeline may draw on to sufficiently fund Ridgeline's share of costs associated with the development of a mine at Selena through to commercial production. Execution of the Ridgeline Facility will be subject to, among other things, approval of the TSX Venture Exchange.</p><p><b>About Ridgeline Minerals Corp.<br /></b>Ridgeline Minerals is a discovery focused precious and base metal explorer with a proven management team and a 192km<sup>2</sup> exploration portfolio across five projects in Nevada, USA. The Company boasts two earn-in exploration agreements with Nevada Gold Mines at its Swift and Black Ridge projects, which are being aggressively explored in 2024. More information about Ridgeline can be found at <a href=\"https://api.newsfilecorp.com/redirect/2EAwNSRaW0\">www.ridgelineminerals.com</a>.</p><p><b>About South32 Limited<br /></b>South32 Limited is a globally diversified mining and metals company. The company's purpose is to make a difference by developing natural resources, improving people's lives now and for generations to come. South32 Limited is trusted by its owners and partners to realize the potential of their resources. South32 Limited produces commodities including bauxite, alumina, aluminum, copper, zinc, lead, silver, nickel and manganese from its operations in Australia, Southern Africa and South America. South32 Limited also has a portfolio of high-quality development projects and options, and exploration prospects, consistent with its strategy to reshape its portfolio toward commodities that are critical for a low-carbon future.</p><p><b>On behalf of the Board<br /></b><i>\"Chad Peters\"<br /></i>President &#38; CEO</p><div id=\"contactInfo\"><p><b>Further Information:<br /></b>Chad Peters, P.Geo.<br />President, CEO &#38; Director<br />Ridgeline Minerals Corp.<br />+1 775 304 9773<br /><a href=\"mailto:cpeters@ridgelineminerals.com\">cpeters@ridgelineminerals.com</a></p></div><p><b>Neither the TSX Venture Exchange nor its Regulation Service Provider (as that term is defined in the policies of the TSX Venture Exchange) accepts responsibility for the adequacy or accuracy of this press release.</b></p><p><b>Cautionary Note regarding Forward Looking Statements</b></p><p><i>Statements contained in this press release that are not historical facts are \"forward-looking information\" or \"forward-looking statements\" (collectively, \"Forward-Looking Information\") within the meaning of applicable Canadian securities legislation and the United States Private Securities Litigation Reform Act of 1995. Forward-Looking Information includes, but is not limited to, the  Earn-In Agreement and the transactions contemplated thereby (collectively the \"Earn-In Transaction\"). The words \"potential\", \"anticipate\", \"meaningful\", \"discovery\", \"forecast\", \"believe\", \"estimate\", \"expect\", \"may\", \"will\", \"project\", \"plan\", \"historical\", \"historic\" and similar expressions are intended to be among the statements that identify Forward-Looking Information. Forward-Looking Information involves known and unknown risks, uncertainties and other factors which may cause the actual results to be materially different from any future results expressed or implied by the Forward-Looking Information. In preparing the Forward-Looking Information in this news release, Ridgeline has applied several material assumptions, including, but not limited to, that all conditions precedent to the Earn-In will be satisfied in a timely manner; the current objectives concerning the Project and the Company's other projects can be achieved and that its other corporate activities will proceed as expected; that general business and economic conditions will not change in a materially adverse manner; and that all requisite information will be available in a timely manner. Forward-Looking Information involves known and unknown risks, uncertainties and other factors which may cause the actual results, performance, or achievements of Ridgeline to be materially different from any future results, performance or achievements expressed or implied by the Forward-Looking Information. Such risks and other factors include, among others, risks related to dependence on key personnel; risks related to unforeseen delays; risks related to historical data that has not been verified by the Company; as well as those factors discussed in Ridgeline's public disclosure record. Although Ridgeline has attempted to identify important factors that could affect Ridgeline and may cause actual actions, events, or results to differ materially from those described in Forward-Looking Information, there may be other factors that cause actions, events or results not to be as anticipated, estimated or intended. There can be no assurance that Forward-Looking Information will prove to be accurate, as actual results and future events could differ materially from those anticipated in such statements. Accordingly, readers should not place undue reliance on Forward-Looking Information. In addition, this news release contains information about adjacent properties on which Ridgeline has no right to explore or mine. Readers are cautioned that mineral deposits on adjacent properties are not indicative of mineral deposits on the Company's properties. Except as required by law, Ridgeline does not assume any obligation to release publicly any revisions to Forward-Looking Information contained in this news release to reflect events or circumstances after the date hereof or to reflect the occurrence of unanticipated events.</i></p><p id=\"corporateNewsLogoContainer\"><img src=\"https://images.newsfilecorp.com/files/7298/222344_b7ff0b7204a4f879_logo.jpg\" id=\"corporateNewsLogo\" alt=\"Corporate Logo\" /></p><p id=\"corporateLinkBack\">To view the source version of this press release, please visit <a href=\"https://api.newsfilecorp.com/redirect/MAgGrTKOgk\">https://www.newsfilecorp.com/release/222344</a></p>",
    "search_terms": "Selena,Ridgeline Minerals Corp.,RDG",
    "master_gid": 736,
    "date": "2024-09-06T12:00:00.000Z",
    "tags": "||||Project Acquisition",
    "image_id": null,
    "hidden": false,
    "company_id": 383,
    "provider": "newsfilecorp",
    "excerpt": "Vancouver, British Columbia--(Newsfile Corp. - September 6, 2024) - Ridgeline Minerals Corp. (TSXV: RDG) (OTCQB: RDGMF) FRA: 0GC0) (\"Ridgeline\" or the \"Company\") is pleased to announce, further to its news release on August 22, 2024, that the TSX Venture Exchange has accepted for filing the previously announced Earn-In Agreement dated",
    "is_regulatory": false,
    "refined_tags": [],
    "ftp_filename": null,
    "company_name": "South32 Limited",
    "exchange": "TSXV",
    "root_ticker": "RDG",
    "project_name": "Selena",
    "gid": 736,
    "location": "Nevada, USA",
    "plan_id": null,
    "description_text": "Vancouver, British Columbia--(Newsfile Corp. - September 6, 2024) - Ridgeline Minerals Corp. (TSXV: RDG) (OTCQB: RDGMF) FRA: 0GC0) (\" Ridgeline \" or the \" Company \") is pleased to announce, further to its news release on August 22, 2024, that the TSX Venture Exchange has accepted for filing the previously announced Earn-In Agreement dated August 21, 2024 (the \" Earn-In Agreement \" or \" Agreement \") with a wholly-owned subsidiary of South32 Limited (\" South32 \") at the Selena carbonate replacement deposit project (\" Selena \" or the \" Project \") located in White Pine County, Nevada. The Earn-In Agreement was signed effective August 21, 2024, wherein South32 has the option to earn an initial 60% ownership interest in the Project by paying Ridgeline a US$100,000 execution payment and funding a minimum of US$10.0 million (of which US$2.0 million is guaranteed) in qualifying exploration expenditures on the Project over an initial five-year term. Ridgeline will remain operator of the Project during the Initial Phase 1 Earn-in Option period (the \" First Option \"). Subject to South32 having exercised the First Option, South32 will have a further option (the \" Second Option \") to increase its ownership interest in the Project to a total of 80% by incurring an additional US$10.0 million in expenditures over a three-year  Phase 2 Earn-In Option period for an aggregate spend of US$20.0 million over eight years. If South32 wishes to exercise the Second Option, it must within 42 months of the Second Option commencement date, arrange for and provide draft definitive documentation in respect of a debt facility (\" Ridgeline Facility \") from which (if executed) Ridgeline may draw on to sufficiently fund Ridgeline's share of costs associated with the development of a mine at Selena through to commercial production. Execution of the Ridgeline Facility will be subject to, among other things, approval of the TSX Venture Exchange. About Ridgeline Minerals Corp. Ridgeline Minerals is a discovery focused precious and base metal explorer with a proven management team and a 192km 2 exploration portfolio across five projects in Nevada, USA. The Company boasts two earn-in exploration agreements with Nevada Gold Mines at its Swift and Black Ridge projects, which are being aggressively explored in 2024. More information about Ridgeline can be found at www.ridgelineminerals.com . About South32 Limited South32 Limited is a globally diversified mining and metals company. The company's purpose is to make a difference by developing natural resources, improving people's lives now and for generations to come. South32 Limited is trusted by its owners and partners to realize the potential of their resources. South32 Limited produces commodities including bauxite, alumina, aluminum, copper, zinc, lead, silver, nickel and manganese from its operations in Australia, Southern Africa and South America. South32 Limited also has a portfolio of high-quality development projects and options, and exploration prospects, consistent with its strategy to reshape its portfolio toward commodities that are critical for a low-carbon future. On behalf of the Board \"Chad Peters\" President & CEO Further Information: Chad Peters, P.Geo. President, CEO & Director Ridgeline Minerals Corp. +1 775 304 9773 cpeters@ridgelineminerals.com Neither the TSX Venture Exchange nor its Regulation Service Provider (as that term is defined in the policies of the TSX Venture Exchange) accepts responsibility for the adequacy or accuracy of this press release. Cautionary Note regarding Forward Looking Statements Statements contained in this press release that are not historical facts are \"forward-looking information\" or \"forward-looking statements\" (collectively, \"Forward-Looking Information\") within the meaning of applicable Canadian securities legislation and the United States Private Securities Litigation Reform Act of 1995. Forward-Looking Information includes, but is not limited to, the  Earn-In Agreement and the transactions contemplated thereby (collectively the \"Earn-In Transaction\"). The words \"potential\", \"anticipate\", \"meaningful\", \"discovery\", \"forecast\", \"believe\", \"estimate\", \"expect\", \"may\", \"will\", \"project\", \"plan\", \"historical\", \"historic\" and similar expressions are intended to be among the statements that identify Forward-Looking Information. Forward-Looking Information involves known and unknown risks, uncertainties and other factors which may cause the actual results to be materially different from any future results expressed or implied by the Forward-Looking Information. In preparing the Forward-Looking Information in this news release, Ridgeline has applied several material assumptions, including, but not limited to, that all conditions precedent to the Earn-In will be satisfied in a timely manner; the current objectives concerning the Project and the Company's other projects can be achieved and that its other corporate activities will proceed as expected; that general business and economic conditions will not change in a materially adverse manner; and that all requisite information will be available in a timely manner. Forward-Looking Information involves known and unknown risks, uncertainties and other factors which may cause the actual results, performance, or achievements of Ridgeline to be materially different from any future results, performance or achievements expressed or implied by the Forward-Looking Information. Such risks and other factors include, among others, risks related to dependence on key personnel; risks related to unforeseen delays; risks related to historical data that has not been verified by the Company; as well as those factors discussed in Ridgeline's public disclosure record. Although Ridgeline has attempted to identify important factors that could affect Ridgeline and may cause actual actions, events, or results to differ materially from those described in Forward-Looking Information, there may be other factors that cause actions, events or results not to be as anticipated, estimated or intended. There can be no assurance that Forward-Looking Information will prove to be accurate, as actual results and future events could differ materially from those anticipated in such statements. Accordingly, readers should not place undue reliance on Forward-Looking Information. In addition, this news release contains information about adjacent properties on which Ridgeline has no right to explore or mine. Readers are cautioned that mineral deposits on adjacent properties are not indicative of mineral deposits on the Company's properties. Except as required by law, Ridgeline does not assume any obligation to release publicly any revisions to Forward-Looking Information contained in this news release to reflect events or circumstances after the date hereof or to reflect the occurrence of unanticipated events. To view the source version of this press release, please visit https://www.newsfilecorp.com/release/222344",
    "primary_commodity": "Ag"
  },
  "articleProject": {
    "gid": 736,
    "project_name": "Selena",
    "location": "Nevada, USA"
  },
  "articleExchange": "TSXV",
  "articleCompanyId": 383,
  "articleTicker": "RDG",
  "articleCompanyName": "Ridgeline Minerals Corp.",
  "allOtherCompanyProjects": [
    {
      "company_id": 383,
      "gid": 1022,
      "project_name": "Swift",
      "location": "Nevada, USA"
    },
    {
      "company_id": 383,
      "gid": 4027,
      "project_name": "Big Blue",
      "location": "Nevada, United States"
    },
    {
      "company_id": 383,
      "gid": 10663,
      "project_name": "Eagle",
      "location": "Nevada, United States"
    },
    {
      "company_id": 383,
      "gid": 736,
      "project_name": "Selena",
      "location": "Nevada, USA"
    },
    {
      "company_id": 383,
      "gid": 5133,
      "project_name": "Black Ridge (Carlin East)",
      "location": "Nevada, United States"
    },
    {
      "company_id": 383,
      "gid": 9529,
      "project_name": "Atlas",
      "location": "Nevada, United States"
    },
    {
      "company_id": 383,
      "gid": 5206,
      "project_name": "Bell Creek",
      "location": "Nevada, United States"
    }
  ],
  "allOtherCompanyNews": [
    {
      "id": 106772,
      "company_id": 383,
      "title": "Ridgeline Minerals Sells Tungsten and Critical Metals Project to Midasco Capital Corp.",
      "link": null,
      "date": "2025-06-03T11:30:00.000Z",
      "hidden": false
    },
    {
      "id": 106239,
      "company_id": 383,
      "title": "Ridgeline Minerals Acquires High-Grade Oxide Gold Project, Further Consolidating Land Position at the Atlas Project, Nevada",
      "link": null,
      "date": "2025-05-29T12:00:00.000Z",
      "hidden": false
    },
    {
      "id": 104795,
      "company_id": 383,
      "title": "Ridgeline Minerals Provides Drill Program Updates for the Big Blue and Atlas Projects",
      "link": null,
      "date": "2025-05-15T12:00:00.000Z",
      "hidden": false
    },
    {
      "id": 99151,
      "company_id": 383,
      "title": "Ridgeline Minerals Provides 2025 Budget Guidance for the Selena CRD Project, Nevada",
      "link": null,
      "date": "2025-04-09T12:00:00.000Z",
      "hidden": false
    },
    {
      "id": 92101,
      "company_id": 383,
      "title": "Ridgeline Minerals Closes $500k Private Placement",
      "link": null,
      "date": "2025-03-21T19:37:00.000Z",
      "hidden": false
    },
    {
      "id": 91703,
      "company_id": 383,
      "title": "Ridgeline Minerals Announces Non-Brokered Private Placement",
      "link": null,
      "date": "2025-03-18T19:05:00.000Z",
      "hidden": false
    },
    {
      "id": 90987,
      "company_id": 383,
      "title": "Ridgeline Minerals Announces Remaining 2024 Drill Results and Provides 2025 Budget Guidance for the Swift Project, Nevada",
      "link": null,
      "date": "2025-03-13T12:00:00.000Z",
      "hidden": false
    },
    {
      "id": 90599,
      "company_id": 383,
      "title": "Ridgeline Minerals Commences Drill Program at the Big Blue Porphyry Cu-Au Project, Nevada",
      "link": "https://www.newsfilecorp.com/release/244074/Ridgeline-Minerals-Commences-Drill-Program-at-the-Big-Blue-Porphyry-CuAu-Project-Nevada",
      "date": "2025-03-11T12:00:00.000Z",
      "hidden": false
    },
    {
      "id": 89131,
      "company_id": 383,
      "title": "Ridgeline Minerals MT Survey Confirms High-Priority 2025 Drill Targets at the Selena CRD Project, Nevada",
      "link": "https://www.newsfilecorp.com/release/242238/Ridgeline-Minerals-MT-Survey-Confirms-HighPriority-2025-Drill-Targets-at-the-Selena-CRD-Project-Nevada",
      "date": "2025-02-25T13:00:00.000Z",
      "hidden": false
    },
    {
      "id": 87885,
      "company_id": 383,
      "title": "Ridgeline Minerals Closes $4.1 Million Private Placement",
      "link": "https://www.newsfilecorp.com/release/240899/Ridgeline-Minerals-Closes-4.1-Million-Private-Placement",
      "date": "2025-02-14T00:00:00.000Z",
      "hidden": false
    }
  ]
}