{
  "article": {
    "id": 10361,
    "link": "https://www.globenewswire.com/news-release/2020/04/14/2015984/0/en/American-Pacific-Mining-Announces-Webinar-at-2-15PM-PST-today-for-Update-on-the-Madison-Mine-Acquisition.html",
    "title": "American Pacific Mining Announces Webinar at 2:15PM PST today for Update on the Madison Mine Acquisition",
    "description": "<p align=\"justify\">VANCOUVER, British Columbia, April  14, 2020  (GLOBE NEWSWIRE) -- American Pacific Mining Corp (CSE: USGD / FWB: 1QC / OTCPK: USGDF) (“APM” or the “Company”) would like to announce that Duane Parnham of Madison Metals, and Warwick Smith and Eric Saderholm of APM will give a corporate update later today on the acquisition of the Madison Copper Gold Project in Butte Montana.<br /></p>  <p align=\"justify\">Please register at the following link below for the Madison Copper Gold Project Acquisition Update on April 14, 2020 at 2:15PM PST:</p>  <p align=\"justify\">https://attendee.gotowebinar.com/register/5696582244359889933</p>  <p align=\"justify\">After registering, you will receive a confirmation email containing information about joining the webinar. A link to the webinar will be posted on the website shortly after.</p>  <p align=\"justify\"><strong><em>About American Pacific Mining Corp.</em></strong></p>  <p align=\"justify\">American Pacific Mining Corp. is a gold explorer focused on precious metal opportunities in the Western United States. The Gooseberry Gold/Silver Project and the Tuscarora Gold Project are two high-grade, precious metal projects located in key mining districts of Nevada USA. The company’s mission is to grow by the drill bit and by acquisition. American Pacific is Eyeing a Gold Discovery amidst gold’s next bull market.</p>  <p align=\"justify\"><em>On Behalf of the Board of American Pacific Mining Corp.</em><br /><br /> \"Warwick Smith\" <br /> CEO &amp; Director<br /> <br /> <em>Corporate Office: </em>Suite 910 – 510 Burrard Street Vancouver, BC, V6C 3A8 Canada<br /> <em>Contact</em> MarketSmart:  1.877.261.4466   <a href=\"https://www.globenewswire.com/Tracker?data=l5QTB9Hjs1Gj8oj7hJGKZvf9WgJoVkEXdLvfP_1cj78bN8niSHiuxdyo5snEBPIDuNpF8ksH7NpMoD_RJJrkoDaL-8xQaCj9sqtXazhccJI=\" rel=\"nofollow\" target=\"_blank\" title=\"info@marketsmart.ca\">info@marketsmart.ca</a></p>  <p align=\"justify\"><em>Forward-looking Information</em></p>  <p align=\"justify\"> Some statements in this news release contain forward-looking information (within the meaning of Canadian securities legislation) including, without limitation, statements as to planned exploration activities and the expected timing of the receipt of results. These statements address future events and conditions and, as such, involve known and unknown risks, uncertainties and other factors, which may cause the actual results, performance or achievements to be materially different from any future results, performance or achievements expressed or implied by the statements. Such factors include, without limitation, customary risks of the mineral resource industry as well as the performance of services by third parties.<br /><br /> Forward-looking statements are statements that are not historical facts; they are generally, but not always, identified by the words \"expects,\" \"plans,\" \"anticipates,\" \"believes,\" \"intends,\" \"estimates,\" \"projects,\" \"aims,\" \"potential,\" \"goal,\" \"objective,\" \"prospective,\" and similar expressions, or that events or conditions \"will,\" \"would,\" \"may,\" \"can,\" \"could\" or \"should\" occur, or are those statements, which, by their nature, refer to future events. The Company cautions that Forward-looking statements are based on the beliefs, estimates and opinions of the Company's management on the date the statements are made and they involve a number of risks and uncertainties. Consequently, there can be no assurances that such statements will prove to be accurate and actual results and future events could differ materially from those anticipated in such statements.<br /><br /> <em>The CSE has neither approved nor disapproved the contents of this news release. Neither the CSE nor its Regulation Services Provider (as that term is defined in the policies of the CSE) accepts responsibility for the adequacy or accuracy of this release.</em></p>  <p />",
    "search_terms": "Madison,American Pacific Mining Corp.,USGD",
    "master_gid": 2453,
    "date": "2020-04-14T13:15:00.000Z",
    "tags": "USA|Montana,Nevada||Silver,Copper,Gold|Project Acquisition",
    "image_id": null,
    "hidden": false,
    "company_id": 180,
    "provider": null,
    "excerpt": "VANCOUVER, British Columbia, April  14, 2020  (GLOBE NEWSWIRE) -- American Pacific Mining Corp (CSE: USGD / FWB: 1QC / OTCPK: USGDF) (“APM” or the “Company”) would like to announce that Duane Parnham of Madison Metals, and Warwick Smith and Eric Saderholm of APM will give a corporate update",
    "is_regulatory": false,
    "refined_tags": [
      "Project Acquisition"
    ],
    "ftp_filename": null,
    "company_name": "American Pacific Mining Corp.",
    "exchange": "CSE",
    "root_ticker": "USGD",
    "project_name": "Madison",
    "gid": 2453,
    "location": null,
    "plan_id": "companytier2",
    "description_text": "VANCOUVER, British Columbia, April  14, 2020  (GLOBE NEWSWIRE) -- American Pacific Mining Corp (CSE: USGD / FWB: 1QC / OTCPK: USGDF) (“APM” or the “Company”) would like to announce that Duane Parnham of Madison Metals, and Warwick Smith and Eric Saderholm of APM will give a corporate update later today on the acquisition of the Madison Copper Gold Project in Butte Montana. Please register at the following link below for the Madison Copper Gold Project Acquisition Update on April 14, 2020 at 2:15PM PST: https://attendee.gotowebinar.com/register/5696582244359889933 After registering, you will receive a confirmation email containing information about joining the webinar. A link to the webinar will be posted on the website shortly after. About American Pacific Mining Corp. American Pacific Mining Corp. is a gold explorer focused on precious metal opportunities in the Western United States. The Gooseberry Gold/Silver Project and the Tuscarora Gold Project are two high-grade, precious metal projects located in key mining districts of Nevada USA. The company’s mission is to grow by the drill bit and by acquisition. American Pacific is Eyeing a Gold Discovery amidst gold’s next bull market. On Behalf of the Board of American Pacific Mining Corp. \"Warwick Smith\" CEO & Director Corporate Office: Suite 910 – 510 Burrard Street Vancouver, BC, V6C 3A8 Canada Contact MarketSmart:  1.877.261.4466 info@marketsmart.ca Forward-looking Information Some statements in this news release contain forward-looking information (within the meaning of Canadian securities legislation) including, without limitation, statements as to planned exploration activities and the expected timing of the receipt of results. These statements address future events and conditions and, as such, involve known and unknown risks, uncertainties and other factors, which may cause the actual results, performance or achievements to be materially different from any future results, performance or achievements expressed or implied by the statements. Such factors include, without limitation, customary risks of the mineral resource industry as well as the performance of services by third parties. Forward-looking statements are statements that are not historical facts; they are generally, but not always, identified by the words \"expects,\" \"plans,\" \"anticipates,\" \"believes,\" \"intends,\" \"estimates,\" \"projects,\" \"aims,\" \"potential,\" \"goal,\" \"objective,\" \"prospective,\" and similar expressions, or that events or conditions \"will,\" \"would,\" \"may,\" \"can,\" \"could\" or \"should\" occur, or are those statements, which, by their nature, refer to future events. The Company cautions that Forward-looking statements are based on the beliefs, estimates and opinions of the Company's management on the date the statements are made and they involve a number of risks and uncertainties. Consequently, there can be no assurances that such statements will prove to be accurate and actual results and future events could differ materially from those anticipated in such statements. The CSE has neither approved nor disapproved the contents of this news release. Neither the CSE nor its Regulation Services Provider (as that term is defined in the policies of the CSE) accepts responsibility for the adequacy or accuracy of this release.",
    "primary_commodity": "Au"
  },
  "articleProject": {
    "gid": 2453,
    "project_name": "Madison",
    "location": null
  },
  "articleExchange": "CSE",
  "articleCompanyId": 180,
  "articleTicker": "USGD",
  "articleCompanyName": "American Pacific Mining Corp.",
  "allOtherCompanyProjects": [
    {
      "company_id": 180,
      "gid": 2453,
      "project_name": "Madison",
      "location": null
    },
    {
      "company_id": 180,
      "gid": 5271,
      "project_name": "Danny Boy",
      "location": null
    },
    {
      "company_id": 180,
      "gid": 895,
      "project_name": "Tuscarora",
      "location": null
    },
    {
      "company_id": 180,
      "gid": 9668,
      "project_name": "Ziggurat",
      "location": "Nevada, United States"
    },
    {
      "company_id": 180,
      "gid": 951,
      "project_name": "Gooseberry",
      "location": null
    },
    {
      "company_id": 180,
      "gid": 1054,
      "project_name": "South Lida",
      "location": null
    },
    {
      "company_id": 180,
      "gid": 922,
      "project_name": "Red Hill",
      "location": null
    }
  ],
  "allOtherCompanyNews": [
    {
      "id": 107872,
      "company_id": 180,
      "title": "American Pacific Completes Phase I Drill Program at Madison Copper-Gold Project in Montana",
      "link": null,
      "date": "2025-06-12T20:15:00.000Z",
      "hidden": false
    },
    {
      "id": 100383,
      "company_id": 180,
      "title": "American Pacific Commences Drill Program at the Madison Copper-Gold Project in Montana",
      "link": null,
      "date": "2025-04-22T11:00:00.000Z",
      "hidden": false
    },
    {
      "id": 93041,
      "company_id": 180,
      "title": "American Pacific Receives Updated Permit and Prepares to Commence Next Phase of Drilling at the Madison Copper-Gold Project",
      "link": null,
      "date": "2025-03-31T11:00:00.000Z",
      "hidden": false
    },
    {
      "id": 89794,
      "company_id": 180,
      "title": "American Pacific Files Updated Technical Report for its Palmer Copper-Zinc VMS Project in Southeast Alaska",
      "link": "https://www.newsfilecorp.com/release/242968/American-Pacific-Files-Updated-Technical-Report-for-its-Palmer-CopperZinc-VMS-Project-in-Southeast-Alaska",
      "date": "2025-03-03T12:00:00.000Z",
      "hidden": false
    },
    {
      "id": 89423,
      "company_id": 180,
      "title": "American Pacific Mining Positioned to Benefit from Growing US Copper Demand Driven by Tariff Uncertainty",
      "link": "https://www.newsfilecorp.com/release/242574/American-Pacific-Mining-Positioned-to-Benefit-from-Growing-US-Copper-Demand-Driven-by-Tariff-Uncertainty",
      "date": "2025-02-27T12:00:00.000Z",
      "hidden": false
    },
    {
      "id": 84552,
      "company_id": 180,
      "title": "American Pacific Reports Significant Increase in Contained Copper with Updated Mineral Resource Estimate for its Palmer Copper-Zinc VMS Project in Southeast Alaska",
      "link": "https://www.newsfilecorp.com/release/237762/American-Pacific-Reports-Significant-Increase-in-Contained-Copper-with-Updated-Mineral-Resource-Estimate-for-its-Palmer-CopperZinc-VMS-Project-in-Southeast-Alaska",
      "date": "2025-01-20T12:00:00.000Z",
      "hidden": false
    },
    {
      "id": 80547,
      "company_id": 180,
      "title": "American Pacific Closes Transaction to Gain USD$10M and 100% Interest in the Palmer VMS Project in Alaska",
      "link": "https://www.newsfilecorp.com/release/231954/American-Pacific-Closes-Transaction-to-Gain-USD10M-and-100-Interest-in-the-Palmer-VMS-Project-in-Alaska",
      "date": "2024-12-02T12:00:00.000Z",
      "hidden": false
    },
    {
      "id": 80134,
      "company_id": 180,
      "title": "American Pacific Reports up to 80.6 g/t Gold, 5.2% Copper and 136 g/t Silver from the 2024 Field Program at its Madison Project",
      "link": "https://www.newsfilecorp.com/release/231547/American-Pacific-Reports-up-to-80.6-gt-Gold-5.2-Copper-and-136-gt-Silver-from-the-2024-Field-Program-at-its-Madison-Project",
      "date": "2024-11-27T12:00:00.000Z",
      "hidden": false
    },
    {
      "id": 79082,
      "company_id": 180,
      "title": "American Pacific Receives US$10 Million and 100% Interest in the Palmer VMS Project in Alaska",
      "link": "https://www.newsfilecorp.com/release/230311/American-Pacific-Receives-US10-Million-and-100-Interest-in-the-Palmer-VMS-Project-in-Alaska",
      "date": "2024-11-18T12:00:00.000Z",
      "hidden": false
    },
    {
      "id": 77879,
      "company_id": 180,
      "title": "American Pacific Reports 18.0 Metres of 1.5% Copper and 5.4% Zinc (4.4% CuEq) from Zone 2-3 at Palmer Copper-Zinc VMS Project in Southeast Alaska",
      "link": "https://www.newsfilecorp.com/release/229018/American-Pacific-Reports-18.0-Metres-of-1.5-Copper-and-5.4-Zinc-4.4-CuEq-from-Zone-23-at-Palmer-CopperZinc-VMS-Project-in-Southeast-Alaska",
      "date": "2024-11-06T12:00:00.000Z",
      "hidden": false
    }
  ]
}
