{
  "article": {
    "id": 53704,
    "link": "https://www.globenewswire.com/news-release/2024/05/13/2880327/0/en/Alaska-Energy-Metals-Advances-Core-Asset-Focus-With-Sale-of-Mexico-Subsidiary-and-Shareholding.html",
    "title": "Alaska Energy Metals Advances Core Asset Focus With Sale of Mexico Subsidiary and Shareholding",
    "description": "<p align=\"left\">VANCOUVER, British Columbia, May  13, 2024  (GLOBE NEWSWIRE) -- Alaska Energy Metals Corporation (TSX-V: AEMC, OTCQB: AKEMF) (“AEMC” or the “Company”) today announced:<br /></p>  <ol><li>The sale of its shareholding in Felix Gold Ltd. (ASX: FXG) (“Felix Gold”), and</li><li>The sale of its Mexico subsidiary, Recursos Millrock S. de R.L. de C.V. (“Recursos Millrock”).</li></ol>  <p>As a result of these sales, AEMC added non-dilutive capital to its balance sheet.</p>  <p>“<em>We have strategically re-built our asset portfolio to enhance our long-term sustainability and maintain focus on our Nikolai Nickel Project</em>,” says Gregory Beischer, CEO of Alaska Energy Metals. “<em>These sales allow us to realize value for these non-core assets. Alaska Energy Metals owns other gold property assets in Alaska that it may also consider selling.</em>”</p>  <p><strong>Felix Gold Shares</strong><br />The Company sold the Felix Gold shares it received in 2022 as partial payment for its gold projects in the Fairbanks Gold District in Alaska. Proceeds from the sale amount to CAD$350,000 net of brokerage and currency exchange fees.</p>  <p><strong>Mexico Subsidiary</strong><br />The Company has completed the sale of its Mexico subsidiary, Recursos Millrock, to Grupo Minero Factor S.A. de C.V., a private company based in Chihuahua, Mexico. Consideration for the purchase was the grant of royalty interests in 12 mining concessions that were held by Recursos Millrock. Of particular note is the 0.5% royalty on the Higuerita concession, which comprises the El Batamote porphyry copper project. Grupo Factor must offer to return the concessions to the Company in the event they decide to abandon them. The royalties are summarized in the table below. The Company may consider the sale of these royalty interests in the future.</p>  <p><img alt=\"Table of Royalties\" data-mce-style=\"display: block; margin-left: auto; margin-right: auto;\" height=\"316.36px\" name=\"GNW_RichHtml_IMG\" src=\"https://ml.globenewswire.com/Resource/Download/6f5e7abd-7468-45f2-b709-825668d5266d/image1.png\" style=\"display:block; margin-left:auto; margin-right:auto;\" width=\"635.14px\" /></p>  <p>For additional information, visit: <a href=\"https://alaskaenergymetals.com/\" rel=\"nofollow\" target=\"_blank\" title=\"\"><u>https://alaskaenergymetals.com/</u></a> </p>  <p><strong>ABOUT ALASKA ENERGY METALS</strong><br />Alaska Energy Metals Corporation (AEMC) is an Alaska-based corporation with offices in Anchorage and Vancouver working to sustainably deliver the critical materials needed for national security and a bright energy future, while generating superior returns for shareholders.</p>  <p>AEMC is focused on delineating and developing the large-scale, bulk tonnage, polymetallic Eureka deposit containing nickel, copper, cobalt, chromium, iron, platinum, palladium, and gold. Located in Interior Alaska near existing transportation and power infrastructure, its flagship project, Nikolai, is well-situated to become a significant domestic source of strategic energy-related metals for North America. AEMC also holds a secondary project, ‘Angliers-Belleterre,’ in western Quebec. Today, material sourcing demands excellence in environmental performance, carbon mitigation, and the responsible management of human and financial capital. AEMC works every day to earn and maintain the respect and confidence of the public and believes that ESG performance is measured by action and led from the top.</p>  <p><strong>ON BEHALF OF THE BOARD</strong><br /><em>“Gregory Beischer”</em><br />Gregory Beischer, President &amp; CEO</p>  <p><strong>FOR FURTHER INFORMATION, PLEASE CONTACT:</strong><br />Gregory A. Beischer, President &amp; CEO<br />Toll-Free: 877-217-8978 | Local: 604-638-3164</p>  <p>Sarah Mawji, Public Relations<br />Venture Strategies<br />Email: <a href=\"mailto:sarah@venturestrategies.com\" rel=\"nofollow\" target=\"_blank\" title=\"sarah@venturestrategies.com\">sarah@venturestrategies.com</a></p>  <p><em>Some statements in this news release may contain forward-looking information (within the meaning of Canadian securities legislation), including, but not limited to, a potential sale of royalties and other assets. These statements address future events and conditions and, as such, involve known and unknown risks, uncertainties, and other factors which may cause the actual results, performance, or achievements to be materially different from any future results, performance, or achievements expressed or implied by the statements. Forward-looking statements speak only as of the date those statements are made. Although the Company believes the expectations expressed in such forward-looking statements are based on reasonable assumptions, such statements are not guaranteeing of future performance and actual results may differ materially from those in the forward-looking statements. Factors that could cause the actual results to differ materially from those in forward-looking statements include regulatory actions, market prices, and continued availability of capital and financing, and general economic, market or business conditions. Investors are cautioned that any such statements are not guarantees of future performance and actual results or developments may differ materially from those projected in the forward-looking statements. Forward-looking statements are based on the beliefs, estimates and opinions of the Company's management on the date the statements are made. Except as required by applicable law, the Company assumes no obligation to update or to publicly announce the results of any change to any forward-looking statement contained or incorporated by reference herein to reflect actual results, future events or developments, changes in assumptions, or changes in other factors affecting the forward-looking statements. If the Company updates any forward-looking statement(s), no inference should be drawn that it will make additional updates with respect to those or other forward-looking statements.</em></p>  <p><strong><em>Neither the TSX Venture Exchange nor its Regulation Services Provider (as that term is defined in the policies of the TSX Venture Exchange) accepts responsibility for the adequacy or accuracy of this press release.</em></strong></p>  <p>A photo accompanying this announcement is available at <img src=\"https://ml.globenewswire.com/Resource/Download/6f5e7abd-7468-45f2-b709-825668d5266d?size=original\" alt=\"\"/></p>  <br /><img src='https://ml.globenewswire.com/media/ODg3ODY2YTYtMDg5NC00M2NlLTlmNTktNmMxYmMxMGRkZWQyLTExMDg0OTA=/tiny/Alaska-Energy-Metals-Corporati.png' referrerpolicy='no-referrer-when-downgrade' />",
    "search_terms": "Nikolai,Alaska Energy Metals Corporation,AEMC",
    "master_gid": 3372,
    "date": "2024-05-13T11:30:00.000Z",
    "tags": "Mexico,USA|Alaska||Gold|Project Acquisition,Royalties and Streams",
    "image_id": null,
    "hidden": false,
    "company_id": 242,
    "provider": null,
    "excerpt": "VANCOUVER, British Columbia, May 13, 2024 (GLOBE NEWSWIRE) -- Alaska Energy Metals Corporation (TSX-V: AEMC, OTCQB: AKEMF) (“AEMC” or the “Company”) today announced:The sale of its shareholding in Felix Gold Ltd. (ASX: FXG) (“Felix Gold”), andThe sale of its Mexico subsidiary, Recursos Millrock S. de R.L. de C.V. (“Recursos Millrock”).As",
    "is_regulatory": false,
    "refined_tags": [
      "Project Acquisition",
      "Royalties and Streams"
    ],
    "ftp_filename": null,
    "company_name": "Alaska Energy Metals Corporation",
    "exchange": "TSXV",
    "root_ticker": "AEMC",
    "project_name": "Nikolai",
    "gid": 3372,
    "location": "Alaska, United States",
    "plan_id": null,
    "description_text": "VANCOUVER, British Columbia, May  13, 2024  (GLOBE NEWSWIRE) -- Alaska Energy Metals Corporation (TSX-V: AEMC, OTCQB: AKEMF) (“AEMC” or the “Company”) today announced: The sale of its shareholding in Felix Gold Ltd. (ASX: FXG) (“Felix Gold”), and The sale of its Mexico subsidiary, Recursos Millrock S. de R.L. de C.V. (“Recursos Millrock”). As a result of these sales, AEMC added non-dilutive capital to its balance sheet. “ We have strategically re-built our asset portfolio to enhance our long-term sustainability and maintain focus on our Nikolai Nickel Project ,” says Gregory Beischer, CEO of Alaska Energy Metals. “ These sales allow us to realize value for these non-core assets. Alaska Energy Metals owns other gold property assets in Alaska that it may also consider selling. ” Felix Gold Shares The Company sold the Felix Gold shares it received in 2022 as partial payment for its gold projects in the Fairbanks Gold District in Alaska. Proceeds from the sale amount to CAD$350,000 net of brokerage and currency exchange fees. Mexico Subsidiary The Company has completed the sale of its Mexico subsidiary, Recursos Millrock, to Grupo Minero Factor S.A. de C.V., a private company based in Chihuahua, Mexico. Consideration for the purchase was the grant of royalty interests in 12 mining concessions that were held by Recursos Millrock. Of particular note is the 0.5% royalty on the Higuerita concession, which comprises the El Batamote porphyry copper project. Grupo Factor must offer to return the concessions to the Company in the event they decide to abandon them. The royalties are summarized in the table below. The Company may consider the sale of these royalty interests in the future. For additional information, visit: https://alaskaenergymetals.com/ ABOUT ALASKA ENERGY METALS Alaska Energy Metals Corporation (AEMC) is an Alaska-based corporation with offices in Anchorage and Vancouver working to sustainably deliver the critical materials needed for national security and a bright energy future, while generating superior returns for shareholders. AEMC is focused on delineating and developing the large-scale, bulk tonnage, polymetallic Eureka deposit containing nickel, copper, cobalt, chromium, iron, platinum, palladium, and gold. Located in Interior Alaska near existing transportation and power infrastructure, its flagship project, Nikolai, is well-situated to become a significant domestic source of strategic energy-related metals for North America. AEMC also holds a secondary project, ‘Angliers-Belleterre,’ in western Quebec. Today, material sourcing demands excellence in environmental performance, carbon mitigation, and the responsible management of human and financial capital. AEMC works every day to earn and maintain the respect and confidence of the public and believes that ESG performance is measured by action and led from the top. ON BEHALF OF THE BOARD “Gregory Beischer” Gregory Beischer, President & CEO FOR FURTHER INFORMATION, PLEASE CONTACT: Gregory A. Beischer, President & CEO Toll-Free: 877-217-8978 | Local: 604-638-3164 Sarah Mawji, Public Relations Venture Strategies Email: sarah@venturestrategies.com Some statements in this news release may contain forward-looking information (within the meaning of Canadian securities legislation), including, but not limited to, a potential sale of royalties and other assets. These statements address future events and conditions and, as such, involve known and unknown risks, uncertainties, and other factors which may cause the actual results, performance, or achievements to be materially different from any future results, performance, or achievements expressed or implied by the statements. Forward-looking statements speak only as of the date those statements are made. Although the Company believes the expectations expressed in such forward-looking statements are based on reasonable assumptions, such statements are not guaranteeing of future performance and actual results may differ materially from those in the forward-looking statements. Factors that could cause the actual results to differ materially from those in forward-looking statements include regulatory actions, market prices, and continued availability of capital and financing, and general economic, market or business conditions. Investors are cautioned that any such statements are not guarantees of future performance and actual results or developments may differ materially from those projected in the forward-looking statements. Forward-looking statements are based on the beliefs, estimates and opinions of the Company's management on the date the statements are made. Except as required by applicable law, the Company assumes no obligation to update or to publicly announce the results of any change to any forward-looking statement contained or incorporated by reference herein to reflect actual results, future events or developments, changes in assumptions, or changes in other factors affecting the forward-looking statements. If the Company updates any forward-looking statement(s), no inference should be drawn that it will make additional updates with respect to those or other forward-looking statements. Neither the TSX Venture Exchange nor its Regulation Services Provider (as that term is defined in the policies of the TSX Venture Exchange) accepts responsibility for the adequacy or accuracy of this press release. A photo accompanying this announcement is available at",
    "primary_commodity": "Ni"
  },
  "articleProject": {
    "gid": 3372,
    "project_name": "Nikolai",
    "location": "Alaska, United States"
  },
  "articleExchange": "TSXV",
  "articleCompanyId": 242,
  "articleTicker": "AEMC",
  "articleCompanyName": "Alaska Energy Metals Corporation",
  "allOtherCompanyProjects": [
    {
      "company_id": 242,
      "gid": 3372,
      "project_name": "Nikolai",
      "location": "Alaska, United States"
    },
    {
      "company_id": 242,
      "gid": 3373,
      "project_name": "Shaw",
      "location": "Alaska, United States"
    },
    {
      "company_id": 242,
      "gid": 5422,
      "project_name": "Angliers-Belleterre",
      "location": "Quebec, Canada"
    },
    {
      "company_id": 242,
      "gid": 3374,
      "project_name": "Snettisham",
      "location": "Alaska, United States"
    },
    {
      "company_id": 242,
      "gid": 3369,
      "project_name": "Apex-El Nido",
      "location": "Alaska, United States"
    },
    {
      "company_id": 242,
      "gid": 1128,
      "project_name": "Liberty Bell",
      "location": "Alaska, United States"
    },
    {
      "company_id": 242,
      "gid": 1131,
      "project_name": "64 North",
      "location": "Alaska, United States"
    },
    {
      "company_id": 242,
      "gid": 1136,
      "project_name": "Chisna",
      "location": "Alaska, United States"
    }
  ],
  "allOtherCompanyNews": [
    {
      "id": 105817,
      "company_id": 242,
      "title": "Alaska Energy Metals Announces Closing of Flow -Through Unit Financing With a Single, Strategic, Institutional Subscriber for Further Exploration at Angliers - Belleterre Project, Quebec",
      "link": null,
      "date": "2025-05-26T23:30:00.000Z",
      "hidden": false
    },
    {
      "id": 104721,
      "company_id": 242,
      "title": "Alaska Energy Metals Reports on At - The - Market Equity Financing Program",
      "link": null,
      "date": "2025-05-14T23:53:00.000Z",
      "hidden": false
    },
    {
      "id": 100455,
      "company_id": 242,
      "title": "Alaska Energy Metals Files Updated NI 43-101 Technical Report for The Eureka Deposit, Nikolai Nickel Project, Alaska, USA",
      "link": null,
      "date": "2025-04-22T13:45:00.000Z",
      "hidden": false
    },
    {
      "id": 92252,
      "company_id": 242,
      "title": "Alaska Energy Metals Hails US Presidential Executive Order on Domestic Critical Mineral Mining and Implications for the Nikolai Nickel Project, Alaska, USA",
      "link": null,
      "date": "2025-03-24T17:45:00.000Z",
      "hidden": false
    },
    {
      "id": 90447,
      "company_id": 242,
      "title": "Alaska Energy Metals Announces Major Increase In Mineral Resource Estimate, Nikolai Nickel Project, Alaska, USA ",
      "link": "https://www.accessnewswire.com/newsroom/en/metals-and-mining/alaska-energy-metals-announces-major-increase-in-mineral-resource-estimate-nikolai-997623",
      "date": "2025-03-10T11:20:00.000Z",
      "hidden": false
    },
    {
      "id": -170132,
      "company_id": 242,
      "title": "Alaska Energy Metals Announces Shares For Debt Settlements",
      "link": "https://www.accessnewswire.com/newsroom/en/metals-and-mining/alaska-energy-metals-announces-shares-for-debt-settlements-988123",
      "date": "2025-02-19T21:30:00.000Z",
      "hidden": false
    },
    {
      "id": 88037,
      "company_id": 242,
      "title": "Alaska Energy Metals Announces Resignation Of Director",
      "link": "https://www.accessnewswire.com/newsroom/en/metals-and-mining/alaska-energy-metals-announces-resignation-of-director-986806",
      "date": "2025-02-17T23:15:00.000Z",
      "hidden": false
    },
    {
      "id": 86491,
      "company_id": 242,
      "title": "Alaska Energy Metals Announces At-the-Market Offering of up to $10 Million",
      "link": "https://www.accessnewswire.com/newsroom/en/metals-and-mining/alaska-energy-metals-announces-at-the-market-offering-of-up-to-10-million-978008",
      "date": "2025-01-31T23:51:00.000Z",
      "hidden": false
    },
    {
      "id": 84903,
      "company_id": 242,
      "title": "Alaska Energy Metals Hails Positive Presidential Executive Order Concerning Resource Development In Alaska",
      "link": "https://www.accessnewswire.com/newsroom/en/metals-and-mining/alaska-energy-metals-hails-positive-presidential-executive-order-concerning-resource-development-in-alaska-971647",
      "date": "2025-01-21T19:15:00.000Z",
      "hidden": false
    },
    {
      "id": 84729,
      "company_id": 242,
      "title": "Alaska Energy Metals' 2024 Surface Exploration Program Reveals Multiple Nickel - Copper Targets at The Angliers - Belleterre Project, Quebec, Canada",
      "link": "https://www.accessnewswire.com/newsroom/en/metals-and-mining/alaska-energy-metals-2024-surface-exploration-program-reveals-multiple-nickel--copper-targets-at-the-angliers--belleterre-project-quebec-canada-971123",
      "date": "2025-01-21T12:20:00.000Z",
      "hidden": false
    }
  ]
}
