{
  "article": {
    "id": 39994,
    "link": "https://contentapi.cision.com/api/v1.0/releases/20230829C2038",
    "title": "Arizona Metals Corp to Acquire Additional Private Lands at its Kay Mine Project",
    "description": "\n\n<p class=\"prntac\"><b>/NOT FOR DISTRIBUTION TO US NEWSWIRE SERVICES OR FOR RELEASE, PUBLICATION, DISTRIBUTION OR DISSEMINATION DIRECTLY, OR INDIRECTLY, IN WHOLE OR IN PART, IN OR INTO <span class=\"xn-location\">THE UNITED STATES</span>/</b></p>\n<p><span class=\"legendSpanClass\"><span class=\"xn-location\">TORONTO</span></span>, <span class=\"legendSpanClass\"><span class=\"xn-chron\">Aug. 29, 2023</span></span> /CNW/ - Arizona Metals Corp. (TSX: AMC) (OTCQX: AZMCF) (the \"Company\" or \"Arizona Metals\") is pleased to announce that it has entered into a purchase and sale agreement (the \"Purchase Agreement\") with an arm's length <span class=\"xn-location\">California</span>-based public company (the \"Vendor\") to acquire 100% of a private land parcel totaling 46.4 acres (the \"Property\"), located 950 metres northeast of its Kay Mine Deposit. The Property includes the surface, mineral, and water rights, among other rights and benefits.</p>\n<div aria-level=\"3\" class=\"wcag-arialevel-3\" role=\"heading\" style=\"display: block; font-size: 1.17em; margin-block-start: 1em; margin-block-end: 1em; margin-inline-start: 0px; margin-inline-end: 0px; font-weight: bold;\"><b>Transaction Details</b></div><p>The Purchase Agreement to acquire the Property calls for total payments of <span class=\"xn-money\">US$2,500,000</span> to the Vendor as consideration for a 100% interest in the Property. The terms of the Purchase Agreement include a due diligence period ending on <span class=\"xn-chron\">November 11th, 2023</span>. The Company has sufficient financial resources to acquire this additional private land while also meeting its current exploration objectives, with over <span class=\"xn-money\">$44 million</span> in the treasury as of <span class=\"xn-chron\">June 30, 2023</span>.</p>\n<p><i><span class=\"xn-person\">Marc Pais</span>, CEO of Arizona Metals comments, \"The acquisition of the Property is another significant de-risking step in moving the Kay Mine Deposit closer to a production decision. Including the 71 acres of patented land that host our Kay Mine Deposit, this acquisition will increase our total holdings of private and patented land to 224 acres. The Property is contiguous with and adjacent to the 107 acres of patented land (including water rights and wells) acquired in <span class=\"xn-chron\">January 2021</span>. The additional flat land we are acquiring increases the private land suitable for future mine infrastructure by more than 40%, and is in-line with our vision of a minimally-disruptive operation.</i></p>\n<p><i>We believe that our Kay Mine Project has the potential to become one of <span class=\"xn-location\">Arizona's</span> newest and highest-grade copper-gold-zinc-silver mines, with the main deposit and potential for all infrastructure to be located on private land. This would allow for a small footprint while also providing high-paying jobs to the local community of <span class=\"xn-location\">Black Canyon City</span>. The Kay Mine Project already has the benefit of being only an hour north of <span class=\"xn-location\">Phoenix</span>, with excellent access to infrastructure, including rail, roads, water, and power. The acquisition announced today will provide the potential for an expanded operation, increased flexibility in mine design, and accelerated permitting timelines.\"</i></p>\n<div class=\"PRN_ImbeddedAssetReference\" id=\"DivAssetPlaceHolder7062\"><p><a href=\"https://mma.prnewswire.com/media/2196200/Arizona_Metals_Corp__Arizona_Metals_Corp_to_Acquire_Additional_P.html\" rel=\"nofollow\" target=\"_blank\"><img alt=\"Figure 1. Kay Mine claims showing the acquisition Property located 950 metres to the northeast (CNW Group/Arizona Metals Corp.)\" src=\"https://mma.prnewswire.com/media/2196200/Arizona_Metals_Corp__Arizona_Metals_Corp_to_Acquire_Additional_P.jpg?p=original\" title=\"Figure 1. Kay Mine claims showing the acquisition Property located 950 metres to the northeast (CNW Group/Arizona Metals Corp.)\"></img></a></p>\n</div><div aria-level=\"3\" class=\"wcag-arialevel-3\" role=\"heading\" style=\"display: block; font-size: 1.17em; margin-block-start: 1em; margin-block-end: 1em; margin-inline-start: 0px; margin-inline-end: 0px; font-weight: bold;\"><b>About Arizona Metals Corp</b></div><p>Arizona Metals Corp owns 100% of the Kay Mine Property in <span class=\"xn-location\">Yavapai County</span>, which is located on a combination of patented and BLM claims totaling 1,300 acres that are not subject to any royalties. An historic estimate by Exxon Minerals in 1982 reported a \"proven and probable reserve of 6.4 million short tons at a grade of 2.2% copper, 2.8 g/t gold, 3.03% zinc, and 55 g/t silver.\" The historic estimate at the Kay Mine was reported by Exxon Minerals in 1982. (Fellows, M.L., 1982, Kay Mine massive sulphide deposit: Internal report prepared for Exxon Minerals Company)</p>\n<p>*The Kay Mine historic estimate has not been verified as a current mineral resource. None of the key assumptions, parameters, and methods used to prepare the historic estimate were reported, and no resource categories were used. Significant data compilation, re-drilling and data verification may be required by a Qualified Person before the historic estimate can be verified and upgraded to be a current mineral resource. A Qualified Person has not done sufficient work to classify it as a current mineral resource, and Arizona Metals is not treating the historic estimate as a current mineral resource.</p>\n<p>The Kay Mine is a steeply dipping VMS deposit that has been defined from a depth of <span class=\"xn-money\">60 m</span> to at least <span class=\"xn-money\">900 m</span>. It is open for expansion on strike and at depth.</p>\n<p>The Company also owns 100% of the Sugarloaf Peak Property, in La Paz County, which is located on 4,400 acres of BLM claims. Sugarloaf is a heap-leach, open-pit target and has a historic estimate of \"100 million tons containing 1.5 million ounces gold\" at a grade of 0.5 g/t (Dausinger, N.E., 1983, Phase 1 Drill Program and Evaluation of Gold-Silver Potential, Sugarloaf Peak Project, <span class=\"xn-location\">Quartzsite, Arizona</span>: Report for Westworld Inc.)</p>\n<p>The historic estimate at the Sugarloaf Peak Property was reported by Westworld Resources in 1983. The historic estimate has not been verified as a current mineral resource. None of the key assumptions, parameters, and methods used to prepare the historic estimate were reported, and no resource categories were used. Significant data compilation, re-drilling and data verification may be required by a Qualified Person before the historic estimate can be verified and upgraded to a current mineral resource. A Qualified Person has not done sufficient work to classify it as a current mineral resource, and Arizona Metals is not treating the historic estimate as a current mineral resource.</p>\n<p>The Qualified Person who reviewed and approved the technical disclosure in this release is <span class=\"xn-person\">David Smith</span>, CPG.</p>\n<p><i>This press release contains statements that constitute \"forward-looking information\" (collectively, \"forward-looking statements\") within the meaning of the applicable Canadian securities legislation, All statements, other than statements of historical fact, are forward-looking statements and are based on expectations, estimates and projections as at the date of this news release. Any statement that discusses predictions, expectations, beliefs, plans, projections, objectives, assumptions, future events or performance (often but not always using phrases such as \"expects\", or \"does not expect\", \"is expected\", \"anticipates\" or \"does not anticipate\", \"plans\", \"budget\", \"scheduled\", \"forecasts\", \"estimates\", \"believes\" or \"intends\" or variations of such words and phrases or stating that certain actions, events or results \"may\" or \"could\", \"would\", \"might\" or \"will\" be taken to occur or be achieved) are not statements of historical fact and may be forward-looking statements. Forward-looking statements contained in this press release include, without limitation, statements regarding the acquisition of the Property, including completion of due diligence and the satisfaction of the Company's payment obligations under the Purchase Agreement, and the completion of the Offering. In making the forward- looking statements contained in this press release, the Company has made certain assumptions. Although the Company believes that the expectations reflected in forward-looking statements are reasonable, it can give no assurance that the expectations of any forward-looking statements will prove to be correct. Known and unknown risks, uncertainties, and other factors which may cause the actual results and future events to differ materially from those expressed or implied by such forward-looking statements. Such factors include, but are not limited to: availability of financing; delay or failure to receive required permits or regulatory approvals; and general business, economic, competitive, political and social uncertainties. Accordingly, readers should not place undue reliance on the forward-looking statements and information contained in this press release. Except as required by law, the Company disclaims any intention and assumes no obligation to update or revise any forward-looking statements to reflect actual results, whether as a result of new information, future events, changes in assumptions, changes in factors affecting such forward- looking statements or otherwise.</i></p>\n<p><i>NEITHER THE TSX VENTURE EXCHANGE (NOR ITS REGULATORY SERVICE PROVIDER) ACCEPTS RESPONSIBILITY FOR THE ADEQUACY OR ACCURACY OF THIS RELEASE</i></p>\n\n<div class=\"PRN_ImbeddedAssetReference\" id=\"DivAssetPlaceHolder0\">\n                    <p>\n                            <a href=\"https://mma.prnewswire.com/media/2196230/Arizona_Metals_Corp__Arizona_Metals_Corp_to_Acquire_Additional_P.html\" rel=\"nofollow\" target=\"_blank\">\n                        <img alt=\"Arizona Metals Corp. Logo (CNW Group/Arizona Metals Corp.)\" src=\"https://mma.prnewswire.com/media/2196230/Arizona_Metals_Corp__Arizona_Metals_Corp_to_Acquire_Additional_P.jpg\" title=\"Arizona Metals Corp. Logo (CNW Group/Arizona Metals Corp.)\"></img>\n                            </a>\n                    </p>\n\n</div>\n<p>SOURCE  Arizona Metals Corp.</p>\n<img alt=\"\" src=\"https://rt.newswire.ca/rt.gif?NewsItemId=C2038&amp;Transmission_Id=202308290500CANADANWCANADAPR_C2038&amp;DateId=20230829\" style=\"border:0px; width:1px; height:1px;\"></img>\n\n",
    "search_terms": "Kay,Arizona Metals Corp.,AMC",
    "master_gid": 3169,
    "date": "2023-08-29T09:00:00.000Z",
    "tags": "USA|Arizona,California|||Project Acquisition",
    "image_id": null,
    "hidden": false,
    "company_id": 1097,
    "provider": null,
    "excerpt": "/NOT FOR DISTRIBUTION TO US NEWSWIRE SERVICES OR FOR RELEASE, PUBLICATION, DISTRIBUTION OR DISSEMINATION DIRECTLY, OR INDIRECTLY, IN WHOLE OR IN PART, IN OR INTOTHE UNITED STATES/TORONTO,Aug. 29, 2023/CNW/ - Arizona Metals Corp. (TSX: AMC) (OTCQX: AZMCF) (the \"Company\" or \"Arizona Metals\") is pleased to announce that it has entered",
    "is_regulatory": false,
    "refined_tags": [
      "Project Acquisition"
    ],
    "ftp_filename": null,
    "company_name": "Arizona Metals Corp.",
    "exchange": "TSX",
    "root_ticker": "AMC",
    "project_name": "Kay",
    "gid": 3169,
    "location": "Arizona, United States",
    "plan_id": null,
    "description_text": "/NOT FOR DISTRIBUTION TO US NEWSWIRE SERVICES OR FOR RELEASE, PUBLICATION, DISTRIBUTION OR DISSEMINATION DIRECTLY, OR INDIRECTLY, IN WHOLE OR IN PART, IN OR INTO THE UNITED STATES / TORONTO , Aug. 29, 2023 /CNW/ - Arizona Metals Corp. (TSX: AMC) (OTCQX: AZMCF) (the \"Company\" or \"Arizona Metals\") is pleased to announce that it has entered into a purchase and sale agreement (the \"Purchase Agreement\") with an arm's length California -based public company (the \"Vendor\") to acquire 100% of a private land parcel totaling 46.4 acres (the \"Property\"), located 950 metres northeast of its Kay Mine Deposit. The Property includes the surface, mineral, and water rights, among other rights and benefits. Transaction Details The Purchase Agreement to acquire the Property calls for total payments of US$2,500,000 to the Vendor as consideration for a 100% interest in the Property. The terms of the Purchase Agreement include a due diligence period ending on November 11th, 2023 . The Company has sufficient financial resources to acquire this additional private land while also meeting its current exploration objectives, with over $44 million in the treasury as of June 30, 2023 . Marc Pais , CEO of Arizona Metals comments, \"The acquisition of the Property is another significant de-risking step in moving the Kay Mine Deposit closer to a production decision. Including the 71 acres of patented land that host our Kay Mine Deposit, this acquisition will increase our total holdings of private and patented land to 224 acres. The Property is contiguous with and adjacent to the 107 acres of patented land (including water rights and wells) acquired in January 2021 . The additional flat land we are acquiring increases the private land suitable for future mine infrastructure by more than 40%, and is in-line with our vision of a minimally-disruptive operation. We believe that our Kay Mine Project has the potential to become one of Arizona's newest and highest-grade copper-gold-zinc-silver mines, with the main deposit and potential for all infrastructure to be located on private land. This would allow for a small footprint while also providing high-paying jobs to the local community of Black Canyon City . The Kay Mine Project already has the benefit of being only an hour north of Phoenix , with excellent access to infrastructure, including rail, roads, water, and power. The acquisition announced today will provide the potential for an expanded operation, increased flexibility in mine design, and accelerated permitting timelines.\" About Arizona Metals Corp Arizona Metals Corp owns 100% of the Kay Mine Property in Yavapai County , which is located on a combination of patented and BLM claims totaling 1,300 acres that are not subject to any royalties. An historic estimate by Exxon Minerals in 1982 reported a \"proven and probable reserve of 6.4 million short tons at a grade of 2.2% copper, 2.8 g/t gold, 3.03% zinc, and 55 g/t silver.\" The historic estimate at the Kay Mine was reported by Exxon Minerals in 1982. (Fellows, M.L., 1982, Kay Mine massive sulphide deposit: Internal report prepared for Exxon Minerals Company) *The Kay Mine historic estimate has not been verified as a current mineral resource. None of the key assumptions, parameters, and methods used to prepare the historic estimate were reported, and no resource categories were used. Significant data compilation, re-drilling and data verification may be required by a Qualified Person before the historic estimate can be verified and upgraded to be a current mineral resource. A Qualified Person has not done sufficient work to classify it as a current mineral resource, and Arizona Metals is not treating the historic estimate as a current mineral resource. The Kay Mine is a steeply dipping VMS deposit that has been defined from a depth of 60 m to at least 900 m . It is open for expansion on strike and at depth. The Company also owns 100% of the Sugarloaf Peak Property, in La Paz County, which is located on 4,400 acres of BLM claims. Sugarloaf is a heap-leach, open-pit target and has a historic estimate of \"100 million tons containing 1.5 million ounces gold\" at a grade of 0.5 g/t (Dausinger, N.E., 1983, Phase 1 Drill Program and Evaluation of Gold-Silver Potential, Sugarloaf Peak Project, Quartzsite, Arizona : Report for Westworld Inc.) The historic estimate at the Sugarloaf Peak Property was reported by Westworld Resources in 1983. The historic estimate has not been verified as a current mineral resource. None of the key assumptions, parameters, and methods used to prepare the historic estimate were reported, and no resource categories were used. Significant data compilation, re-drilling and data verification may be required by a Qualified Person before the historic estimate can be verified and upgraded to a current mineral resource. A Qualified Person has not done sufficient work to classify it as a current mineral resource, and Arizona Metals is not treating the historic estimate as a current mineral resource. The Qualified Person who reviewed and approved the technical disclosure in this release is David Smith , CPG. This press release contains statements that constitute \"forward-looking information\" (collectively, \"forward-looking statements\") within the meaning of the applicable Canadian securities legislation, All statements, other than statements of historical fact, are forward-looking statements and are based on expectations, estimates and projections as at the date of this news release. Any statement that discusses predictions, expectations, beliefs, plans, projections, objectives, assumptions, future events or performance (often but not always using phrases such as \"expects\", or \"does not expect\", \"is expected\", \"anticipates\" or \"does not anticipate\", \"plans\", \"budget\", \"scheduled\", \"forecasts\", \"estimates\", \"believes\" or \"intends\" or variations of such words and phrases or stating that certain actions, events or results \"may\" or \"could\", \"would\", \"might\" or \"will\" be taken to occur or be achieved) are not statements of historical fact and may be forward-looking statements. Forward-looking statements contained in this press release include, without limitation, statements regarding the acquisition of the Property, including completion of due diligence and the satisfaction of the Company's payment obligations under the Purchase Agreement, and the completion of the Offering. In making the forward- looking statements contained in this press release, the Company has made certain assumptions. Although the Company believes that the expectations reflected in forward-looking statements are reasonable, it can give no assurance that the expectations of any forward-looking statements will prove to be correct. Known and unknown risks, uncertainties, and other factors which may cause the actual results and future events to differ materially from those expressed or implied by such forward-looking statements. Such factors include, but are not limited to: availability of financing; delay or failure to receive required permits or regulatory approvals; and general business, economic, competitive, political and social uncertainties. Accordingly, readers should not place undue reliance on the forward-looking statements and information contained in this press release. Except as required by law, the Company disclaims any intention and assumes no obligation to update or revise any forward-looking statements to reflect actual results, whether as a result of new information, future events, changes in assumptions, changes in factors affecting such forward- looking statements or otherwise. NEITHER THE TSX VENTURE EXCHANGE (NOR ITS REGULATORY SERVICE PROVIDER) ACCEPTS RESPONSIBILITY FOR THE ADEQUACY OR ACCURACY OF THIS RELEASE SOURCE  Arizona Metals Corp.",
    "primary_commodity": "Au"
  },
  "articleProject": {
    "gid": 3169,
    "project_name": "Kay",
    "location": "Arizona, United States"
  },
  "articleExchange": "TSX",
  "articleCompanyId": 1097,
  "articleTicker": "AMC",
  "articleCompanyName": "Arizona Metals Corp.",
  "allOtherCompanyProjects": [
    {
      "company_id": 1097,
      "gid": 3169,
      "project_name": "Kay",
      "location": "Arizona, United States"
    },
    {
      "company_id": 1097,
      "gid": 5371,
      "project_name": "Sugarloaf Peak",
      "location": "Arizona, United States"
    }
  ],
  "allOtherCompanyNews": [
    {
      "id": 105849,
      "company_id": 1097,
      "title": "Arizona Metals Intersects 44.5 m @ 4.0 g/t AuEq, 18.6 m @ 2.1% CuEq, and 32.0 m @5.3 g/t AuEq in Kay2 Zone",
      "link": "https://contentapi.cision.com/api/v1.0/releases/20250527C0468",
      "date": "2025-05-27T10:00:00.000Z",
      "hidden": false
    },
    {
      "id": 105175,
      "company_id": 1097,
      "title": "Arizona Metals Strengthens Board with New Director Nominee; Announces Director Retirements and Provides Corporate Update",
      "link": "https://contentapi.cision.com/api/v1.0/releases/20250520C2361",
      "date": "2025-05-20T10:00:00.000Z",
      "hidden": false
    },
    {
      "id": 89781,
      "company_id": 1097,
      "title": "Arizona Metals Intersects 34.8 m @ 11.3 g/t AuEq in Kay2 Zone",
      "link": "https://contentapi.cision.com/api/v1.0/releases/20250303C1719",
      "date": "2025-03-03T11:00:00.000Z",
      "hidden": false
    },
    {
      "id": 88338,
      "company_id": 1097,
      "title": "Arizona Metals Provides Corporate Update",
      "link": "https://contentapi.cision.com/api/v1.0/releases/20250219C2844",
      "date": "2025-02-19T11:00:00.000Z",
      "hidden": false
    },
    {
      "id": 86949,
      "company_id": 1097,
      "title": "Arizona Metals Extends Kay2 Zone 450 m Below Discovery Hole at Kay Deposit",
      "link": "https://contentapi.cision.com/api/v1.0/releases/20250205C6362",
      "date": "2025-02-05T22:00:00.000Z",
      "hidden": false
    },
    {
      "id": 82678,
      "company_id": 1097,
      "title": "Arizona Metals Corp. Announces Closing of Bought Deal Public Offering",
      "link": "https://contentapi.cision.com/api/v1.0/releases/20241220C2332",
      "date": "2024-12-20T14:49:00.000Z",
      "hidden": false
    },
    {
      "id": 82540,
      "company_id": 1097,
      "title": "Arizona Metals Corp. Files Final Short Form Prospectus in connection with its Bought Deal Public Offering, Underwriters exercise Over-Allotment Option",
      "link": "https://contentapi.cision.com/api/v1.0/releases/20241219C9393",
      "date": "2024-12-19T17:37:00.000Z",
      "hidden": false
    },
    {
      "id": -160833,
      "company_id": 1097,
      "title": "Arizona Metals Announces Restatement of Q3 Financial Statements",
      "link": "https://contentapi.cision.com/api/v1.0/releases/20241216C0699",
      "date": "2024-12-16T20:08:00.000Z",
      "hidden": false
    },
    {
      "id": -158338,
      "company_id": 1097,
      "title": "Canadian Investment Regulatory Organization Trade Resumption - AMC",
      "link": "https://contentapi.cision.com/api/v1.0/releases/20241203C6555",
      "date": "2024-12-03T12:49:00.000Z",
      "hidden": false
    },
    {
      "id": 80703,
      "company_id": 1097,
      "title": "Arizona Metals Corp. Announces Bought Deal Financing",
      "link": "https://contentapi.cision.com/api/v1.0/releases/20241202C6315",
      "date": "2024-12-02T21:34:00.000Z",
      "hidden": false
    }
  ]
}
