{
  "article": {
    "id": 51820,
    "link": "https://contentapi.cision.com/api/v1.0/releases/20240410C9566",
    "title": "Arizona Metals Extends Kay Claims 300 Metres North, Increases Land Holdings by 22%, and Permits 3 New Drill Pads. Rock Sampling Program Identifies Priority High-Grade Targets on New Claims",
    "description": "\n\n<p class=\"prntac\"><i><b>/Not for distribution to US newswire services or for release, publication, distribution or dissemination directly, or indirectly, in whole or in part, in or into <span class=\"xn-location\">the United States</span>/</b></i></p>\n<p><span class=\"legendSpanClass\"><span class=\"xn-location\">TORONTO</span></span>, <span class=\"legendSpanClass\"><span class=\"xn-chron\">April 10, 2024</span></span> /CNW/ - Arizona Metals Corp. (TSX: AMC) (OTCQX: AZMCF) (the \"Company\" or \"Arizona Metals\") is pleased to announce that a recently completed claims staking program at the Kay Mine Project (\"Kay\" or the \"Property\") in <span class=\"xn-location\">Arizona</span> has extended the property by 300 metres to the north. This, along with additional claims staked to the southeast, has increased the total property size by 22%, from 1,330 acres to 1,625 acres.</p>\n<p>The Company has also permitted three new dill pads (pads 8, 9, and 10 refer to Figure 1) allowing for additional testing of the northern extension of the Central Target. The drill pads also allow access to high-grade mineralization identified through rock sampling of the newly-staked claims, and extensions of mineralization identified at the Kay Deposit. These new pads were permitted under amendments to the existing Notice of Intent to Explore. The Exploration Plan of Operations has also been submitted to the Bureau of Land Management (\"BLM\") to allow for additional roads and pads to test new property-wide targets.</p>\n<p>Mapping of the new claims identified an historic adit, approximately 100 feet in length. Sampling of this adit returned a number of high-grade samples of VMS mineralization, with grades including 11.7% copper, 9.1% copper, 6.7 g/t gold, and 286 g/t silver. The area of this adit can be reached from drill pad 10, and a number of target holes are currently being planned.</p>\n<p><b><span class=\"xn-person\">Marc Pais</span>, CEO, commented,</b><i> \"The extension of our border by <span class=\"xn-money\">300m</span> to the north increases the untested strike extent north of our best hole at the Western Target (KM-23-113; <span class=\"xn-money\">3.0m</span> at 3.2 g/t AuEq) to more than 650 metres. Rock sampling on the new claims has also identified a number of high-grade targets which can be reached by drilling from newly-permitted pads 9 and 10. These two pads, along with the third new pad (pad 8) will also allow for drilling of the strike extent north of the Central Target, where hole KM-23-95 intersected <span class=\"xn-money\">2.7m</span> at 0.5% in stringer-type VMS mineralization. We are currently planning drill holes for these new targets and will provide an update on timing in the next few weeks.\"</i></p>\n<div class=\"PRN_ImbeddedAssetReference\" id=\"DivAssetPlaceHolder3897\"><p><a href=\"https://mma.prnewswire.com/media/2383294/Arizona_Metals_Corp__Arizona_Metals_Extends_Kay_Claims_300_Metre.html\" rel=\"nofollow\" target=\"_blank\"><img alt=\"Figure 1. Map showing newly staked claims, 3 newly permitted drill pads, and highlights of recent rock sampling program. (CNW Group/Arizona Metals Corp.)\" src=\"https://mma.prnewswire.com/media/2383294/Arizona_Metals_Corp__Arizona_Metals_Extends_Kay_Claims_300_Metre.jpg?p=original\" title=\"Figure 1. Map showing newly staked claims, 3 newly permitted drill pads, and highlights of recent rock sampling program. (CNW Group/Arizona Metals Corp.)\"></img></a></p>\n</div><div class=\"PRN_ImbeddedAssetReference\" id=\"DivAssetPlaceHolder5645\"><p><a href=\"https://mma.prnewswire.com/media/2383295/Arizona_Metals_Corp__Arizona_Metals_Extends_Kay_Claims_300_Metre.html\" rel=\"nofollow\" target=\"_blank\"><img alt=\"Figure 2. Left: historic adit on newly-staked northern claims showing copper staining. Right: sulphide mineralization with copper oxide staining. Sampling returned grades of 11.7% Cu, 6.7 g/t Au, 9.1% Cu, and 286 g/t Ag. (CNW Group/Arizona Metals Corp.)\" src=\"https://mma.prnewswire.com/media/2383295/Arizona_Metals_Corp__Arizona_Metals_Extends_Kay_Claims_300_Metre.jpg?p=original\" title=\"Figure 2. Left: historic adit on newly-staked northern claims showing copper staining. Right: sulphide mineralization with copper oxide staining. Sampling returned grades of 11.7% Cu, 6.7 g/t Au, 9.1% Cu, and 286 g/t Ag. (CNW Group/Arizona Metals Corp.)\"></img></a></p>\n</div><div class=\"PRN_ImbeddedAssetReference\" id=\"DivAssetPlaceHolder2248\"><p><a href=\"https://mma.prnewswire.com/media/2383296/Arizona_Metals_Corp__Arizona_Metals_Extends_Kay_Claims_300_Metre.html\" rel=\"nofollow\" target=\"_blank\"><img alt=\"Table 1. Results of recent rock sampling program at the Kay Mine Property: (CNW Group/Arizona Metals Corp.)\" src=\"https://mma.prnewswire.com/media/2383296/Arizona_Metals_Corp__Arizona_Metals_Extends_Kay_Claims_300_Metre.jpg?p=original\" title=\"Table 1. Results of recent rock sampling program at the Kay Mine Property: (CNW Group/Arizona Metals Corp.)\"></img></a></p>\n</div><div aria-level=\"3\" class=\"wcag-arialevel-3\" role=\"heading\" style=\"display: block; font-size: 1.17em; margin-block-start: 1em; margin-block-end: 1em; margin-inline-start: 0px; margin-inline-end: 0px; font-weight: bold;\">About Arizona Metals Corp</div><p>Arizona Metals Corp owns 100% of the Kay Mine Project in <span class=\"xn-location\">Yavapai County</span>, which is located on a combination of patented and BLM claims totaling 1,300 acres that are not subject to any royalties. An historic estimate by Exxon Minerals in 1982 reported a \"proven and probable reserve of 6.4 million short tons at a grade of 2.2% copper, 2.8 g/t gold, 3.03% zinc, and 55 g/t silver.\" The historic estimate at the Kay Deposit was reported by Exxon Minerals in 1982. (Fellows, M.L., 1982, Kay Mine massive sulphide deposit: Internal report prepared for Exxon Minerals Company)</p>\n<p>*The Kay Mine historic estimate has not been verified as a current mineral resource. None of the key assumptions, parameters, and methods used to prepare the historic estimate were reported, and no resource categories were used.  Significant data compilation, re-drilling and data verification may be required by a Qualified Person before the historic estimate can be verified and upgraded to be a current mineral resource. A Qualified Person has not done sufficient work to classify it as a current mineral resource, and Arizona Metals is not treating the historic estimate as a current mineral resource.</p>\n<p>The Kay Mine is a steeply dipping VMS deposit that has been defined from a depth of <span class=\"xn-money\">60 m</span> to at least <span class=\"xn-money\">900 m</span>. It is open for expansion on strike and at depth.</p>\n<p>The Company also owns 100% of the Sugarloaf Peak Property, in La Paz County, which is located on 4,400 acres of BLM claims. Sugarloaf is a heap-leach, open-pit target and has a historic estimate of \"100 million tons containing 1.5 million ounces gold\" at a grade of 0.5 g/t (Dausinger, N.E., 1983, Phase 1 Drill Program and Evaluation of Gold-Silver Potential, Sugarloaf Peak Project, <span class=\"xn-location\">Quartzsite, Arizona</span>: Report for Westworld Inc.)</p>\n<p>The historic estimate at the Sugarloaf Peak Property was reported by Westworld Resources in 1983. The historic estimate has not been verified as a current mineral resource. None of the key assumptions, parameters, and methods used to prepare the historic estimate were reported, and no resource categories were used.  Significant data compilation, re-drilling and data verification may be required by a Qualified Person before the historic estimate can be verified and upgraded to a current mineral resource. A Qualified Person has not done sufficient work to classify it as a current mineral resource, and Arizona Metals is not treating the historic estimate as a current mineral resource.</p>\n<div aria-level=\"3\" class=\"wcag-arialevel-3\" role=\"heading\" style=\"display: block; font-size: 1.17em; margin-block-start: 1em; margin-block-end: 1em; margin-inline-start: 0px; margin-inline-end: 0px; font-weight: bold;\">Qualified Person and Quality Assurance/Quality Control</div><p>All of Arizona Metals' drill sample assay results have been independently monitored through a quality assurance/quality control (\"QA/QC\") protocol which includes the insertion of blind standard reference materials and blanks at regular intervals. Logging and sampling were completed at Arizona Metals' core handling facilities located in <span class=\"xn-location\">Phoenix</span> and <span class=\"xn-location\">Black Canyon City, Arizona</span>. Drill core was diamond sawn on site and half drill-core samples were securely transported to ALS Laboratories' (\"ALS\") sample preparation facility in <span class=\"xn-location\">Tucson, Arizona</span>. Sample pulps were sent to ALS's labs in <span class=\"xn-location\">Vancouver, Canada</span>, for analysis.</p>\n<p>Gold content was determined by fire assay of a 30-gram charge with ICP finish (ALS method Au-AA23). Silver and 32 other elements were analyzed by ICP methods with four-acid digestion (ALS method ME-ICP61a). Over-limit samples for Au, Ag, Cu, and Zn were determined by ore-grade analyses Au-GRA21, Ag-OG62, Cu-OG62, and Zn-OG62, respectively. </p>\n<p>ALS Laboratories is independent of Arizona Metals Corp. and its <span class=\"xn-location\">Vancouver</span> facility is ISO 17025 accredited. ALS also performed its own internal QA/QC procedures to assure the accuracy and integrity of results. Parameters for ALS' internal and Arizona Metals' external blind quality control samples were acceptable for the samples analyzed. Arizona Metals is not aware of any drilling, sampling, recovery, or other factors that could materially affect the accuracy or reliability of the data referred to herein.</p>\n<p>The qualified person who reviewed and approved the technical disclosure in this release is <span class=\"xn-person\">David Smith</span>, CPG, a qualified person as defined in National Instrument43-101–Standards of Disclosure for Mineral Projects. Mr. Smith supervised the preparation of the scientific and technical information that forms the basis for this news release and has reviewed and approved the disclosure herein. Mr. Smith is the Vice-President, Exploration of the Company.  Mr. Smith supervised the drill program and verified the data disclosed, including sampling, analytical and QA/QC data, underlying the technical information in this news release, including reviewing the reports of ALS, methodologies, results, and all procedures undertaken for quality assurance and quality control in a manner consistent with industry practice, and all matters were consistent and accurate according to his professional judgement. There were no limitations on the verification process.</p>\n<div aria-level=\"3\" class=\"wcag-arialevel-3\" role=\"heading\" style=\"display: block; font-size: 1.17em; margin-block-start: 1em; margin-block-end: 1em; margin-inline-start: 0px; margin-inline-end: 0px; font-weight: bold;\"><b>Disclaimer</b></div><p><i>This press release contains statements that constitute \"forward-looking information\" (collectively, \"forward-looking statements\") within the meaning of the applicable Canadian securities legislation, All statements, other than statements of historical fact, are forward-looking statements and are based on expectations, estimates and projections as at the date of this news release. Any statement that discusses predictions, expectations, beliefs, plans, projections, objectives, assumptions, future events or performance (often but not always using phrases such as \"expects\", or \"does not expect\", \"is expected\", \"anticipates\" or \"does not anticipate\", \"plans\", \"budget\", \"scheduled\", \"forecasts\", \"estimates\", \"believes\" or \"intends\" or variations of such words and phrases or stating that certain actions, events or results \"may\" or \"could\", \"would\", \"might\" or \"will\" be taken to occur or be achieved) are not statements of historical fact and may be forward-looking statements. Forward-looking statements contained in this press release include, without limitation, statements regarding drill results and future drilling and assays, plans and anticipated costs with respect to the Phase 3 drill program, and the potential existence and size of VMS deposits at the Kay Mine Project. In making the forward- looking statements contained in this press release, the Company has made certain assumptions. Although the Company believes that the expectations reflected in forward-looking statements are reasonable, it can give no assurance that the expectations of any forward-looking statements will prove to be correct. Known and unknown risks, uncertainties, and other factors which may cause the actual results and future events to differ materially from those expressed or implied by such forward-looking statements. Such factors include, but are not limited to: availability of financing; delay or failure to receive required permits or regulatory approvals; and general business, economic, competitive, political and social uncertainties. Accordingly, readers should not place undue reliance on the forward-looking statements and information contained in this press release. Except as required by law, the Company disclaims any intention and assumes no obligation to update or revise any forward-looking statements to reflect actual results, whether as a result of new information, future events, changes in assumptions, changes in factors affecting such forward- looking statements or otherwise.</i></p>\n<p><i>NEITHER THE TSX VENTURE EXCHANGE (NOR ITS REGULATORY SERVICE PROVIDER) ACCEPTS RESPONSIBILITY FOR THE ADEQUACY OR ACCURACY OF THIS RELEASE</i></p>\n\n<div class=\"PRN_ImbeddedAssetReference\" id=\"DivAssetPlaceHolder0\">\n                    <p>\n                            <a href=\"https://mma.prnewswire.com/media/2383291/Arizona_Metals_Corp__Arizona_Metals_Extends_Kay_Claims_300_Metre.html\" rel=\"nofollow\" target=\"_blank\">\n                        <img alt=\"Arizona Metals Corp. Logo (CNW Group/Arizona Metals Corp.)\" src=\"https://mma.prnewswire.com/media/2383291/Arizona_Metals_Corp__Arizona_Metals_Extends_Kay_Claims_300_Metre.jpg\" title=\"Arizona Metals Corp. Logo (CNW Group/Arizona Metals Corp.)\"></img>\n                            </a>\n                    </p>\n\n</div>\n<p>SOURCE  Arizona Metals Corp.</p>\n<img alt=\"\" src=\"https://rt.newswire.ca/rt.gif?NewsItemId=C9566&amp;Transmission_Id=202404100500CANADANWCANADAPR_C9566&amp;DateId=20240410\" style=\"border:0px; width:1px; height:1px;\"></img>\n\n",
    "search_terms": "Kay,Arizona Metals Corp.,AMC",
    "master_gid": 3169,
    "date": "2024-04-10T09:00:00.000Z",
    "tags": "USA|Arizona|||Exploration update,Permitting,Project Acquisition,Project Update,Sampling Results",
    "image_id": null,
    "hidden": false,
    "company_id": 1097,
    "provider": null,
    "excerpt": "/Not for distribution to US newswire services or for release, publication, distribution or dissemination directly, or indirectly, in whole or in part, in or intothe United States/TORONTO,April 10, 2024/CNW/ - Arizona Metals Corp. (TSX: AMC) (OTCQX: AZMCF) (the \"Company\" or \"Arizona Metals\") is pleased to announce that a recently completed claims",
    "is_regulatory": false,
    "refined_tags": [
      "Project Acquisition",
      "Exploration Update",
      "Permitting",
      "Project Update",
      "Sampling Results"
    ],
    "ftp_filename": null,
    "company_name": "Arizona Metals Corp.",
    "exchange": "TSX",
    "root_ticker": "AMC",
    "project_name": "Kay",
    "gid": 3169,
    "location": "Arizona, United States",
    "plan_id": null,
    "description_text": "/Not for distribution to US newswire services or for release, publication, distribution or dissemination directly, or indirectly, in whole or in part, in or into the United States / TORONTO , April 10, 2024 /CNW/ - Arizona Metals Corp. (TSX: AMC) (OTCQX: AZMCF) (the \"Company\" or \"Arizona Metals\") is pleased to announce that a recently completed claims staking program at the Kay Mine Project (\"Kay\" or the \"Property\") in Arizona has extended the property by 300 metres to the north. This, along with additional claims staked to the southeast, has increased the total property size by 22%, from 1,330 acres to 1,625 acres. The Company has also permitted three new dill pads (pads 8, 9, and 10 refer to Figure 1) allowing for additional testing of the northern extension of the Central Target. The drill pads also allow access to high-grade mineralization identified through rock sampling of the newly-staked claims, and extensions of mineralization identified at the Kay Deposit. These new pads were permitted under amendments to the existing Notice of Intent to Explore. The Exploration Plan of Operations has also been submitted to the Bureau of Land Management (\"BLM\") to allow for additional roads and pads to test new property-wide targets. Mapping of the new claims identified an historic adit, approximately 100 feet in length. Sampling of this adit returned a number of high-grade samples of VMS mineralization, with grades including 11.7% copper, 9.1% copper, 6.7 g/t gold, and 286 g/t silver. The area of this adit can be reached from drill pad 10, and a number of target holes are currently being planned. Marc Pais , CEO, commented, \"The extension of our border by 300m to the north increases the untested strike extent north of our best hole at the Western Target (KM-23-113; 3.0m at 3.2 g/t AuEq) to more than 650 metres. Rock sampling on the new claims has also identified a number of high-grade targets which can be reached by drilling from newly-permitted pads 9 and 10. These two pads, along with the third new pad (pad 8) will also allow for drilling of the strike extent north of the Central Target, where hole KM-23-95 intersected 2.7m at 0.5% in stringer-type VMS mineralization. We are currently planning drill holes for these new targets and will provide an update on timing in the next few weeks.\" About Arizona Metals Corp Arizona Metals Corp owns 100% of the Kay Mine Project in Yavapai County , which is located on a combination of patented and BLM claims totaling 1,300 acres that are not subject to any royalties. An historic estimate by Exxon Minerals in 1982 reported a \"proven and probable reserve of 6.4 million short tons at a grade of 2.2% copper, 2.8 g/t gold, 3.03% zinc, and 55 g/t silver.\" The historic estimate at the Kay Deposit was reported by Exxon Minerals in 1982. (Fellows, M.L., 1982, Kay Mine massive sulphide deposit: Internal report prepared for Exxon Minerals Company) *The Kay Mine historic estimate has not been verified as a current mineral resource. None of the key assumptions, parameters, and methods used to prepare the historic estimate were reported, and no resource categories were used.  Significant data compilation, re-drilling and data verification may be required by a Qualified Person before the historic estimate can be verified and upgraded to be a current mineral resource. A Qualified Person has not done sufficient work to classify it as a current mineral resource, and Arizona Metals is not treating the historic estimate as a current mineral resource. The Kay Mine is a steeply dipping VMS deposit that has been defined from a depth of 60 m to at least 900 m . It is open for expansion on strike and at depth. The Company also owns 100% of the Sugarloaf Peak Property, in La Paz County, which is located on 4,400 acres of BLM claims. Sugarloaf is a heap-leach, open-pit target and has a historic estimate of \"100 million tons containing 1.5 million ounces gold\" at a grade of 0.5 g/t (Dausinger, N.E., 1983, Phase 1 Drill Program and Evaluation of Gold-Silver Potential, Sugarloaf Peak Project, Quartzsite, Arizona : Report for Westworld Inc.) The historic estimate at the Sugarloaf Peak Property was reported by Westworld Resources in 1983. The historic estimate has not been verified as a current mineral resource. None of the key assumptions, parameters, and methods used to prepare the historic estimate were reported, and no resource categories were used.  Significant data compilation, re-drilling and data verification may be required by a Qualified Person before the historic estimate can be verified and upgraded to a current mineral resource. A Qualified Person has not done sufficient work to classify it as a current mineral resource, and Arizona Metals is not treating the historic estimate as a current mineral resource. Qualified Person and Quality Assurance/Quality Control All of Arizona Metals' drill sample assay results have been independently monitored through a quality assurance/quality control (\"QA/QC\") protocol which includes the insertion of blind standard reference materials and blanks at regular intervals. Logging and sampling were completed at Arizona Metals' core handling facilities located in Phoenix and Black Canyon City, Arizona . Drill core was diamond sawn on site and half drill-core samples were securely transported to ALS Laboratories' (\"ALS\") sample preparation facility in Tucson, Arizona . Sample pulps were sent to ALS's labs in Vancouver, Canada , for analysis. Gold content was determined by fire assay of a 30-gram charge with ICP finish (ALS method Au-AA23). Silver and 32 other elements were analyzed by ICP methods with four-acid digestion (ALS method ME-ICP61a). Over-limit samples for Au, Ag, Cu, and Zn were determined by ore-grade analyses Au-GRA21, Ag-OG62, Cu-OG62, and Zn-OG62, respectively. ALS Laboratories is independent of Arizona Metals Corp. and its Vancouver facility is ISO 17025 accredited. ALS also performed its own internal QA/QC procedures to assure the accuracy and integrity of results. Parameters for ALS' internal and Arizona Metals' external blind quality control samples were acceptable for the samples analyzed. Arizona Metals is not aware of any drilling, sampling, recovery, or other factors that could materially affect the accuracy or reliability of the data referred to herein. The qualified person who reviewed and approved the technical disclosure in this release is David Smith , CPG, a qualified person as defined in National Instrument43-101–Standards of Disclosure for Mineral Projects. Mr. Smith supervised the preparation of the scientific and technical information that forms the basis for this news release and has reviewed and approved the disclosure herein. Mr. Smith is the Vice-President, Exploration of the Company.  Mr. Smith supervised the drill program and verified the data disclosed, including sampling, analytical and QA/QC data, underlying the technical information in this news release, including reviewing the reports of ALS, methodologies, results, and all procedures undertaken for quality assurance and quality control in a manner consistent with industry practice, and all matters were consistent and accurate according to his professional judgement. There were no limitations on the verification process. Disclaimer This press release contains statements that constitute \"forward-looking information\" (collectively, \"forward-looking statements\") within the meaning of the applicable Canadian securities legislation, All statements, other than statements of historical fact, are forward-looking statements and are based on expectations, estimates and projections as at the date of this news release. Any statement that discusses predictions, expectations, beliefs, plans, projections, objectives, assumptions, future events or performance (often but not always using phrases such as \"expects\", or \"does not expect\", \"is expected\", \"anticipates\" or \"does not anticipate\", \"plans\", \"budget\", \"scheduled\", \"forecasts\", \"estimates\", \"believes\" or \"intends\" or variations of such words and phrases or stating that certain actions, events or results \"may\" or \"could\", \"would\", \"might\" or \"will\" be taken to occur or be achieved) are not statements of historical fact and may be forward-looking statements. Forward-looking statements contained in this press release include, without limitation, statements regarding drill results and future drilling and assays, plans and anticipated costs with respect to the Phase 3 drill program, and the potential existence and size of VMS deposits at the Kay Mine Project. In making the forward- looking statements contained in this press release, the Company has made certain assumptions. Although the Company believes that the expectations reflected in forward-looking statements are reasonable, it can give no assurance that the expectations of any forward-looking statements will prove to be correct. Known and unknown risks, uncertainties, and other factors which may cause the actual results and future events to differ materially from those expressed or implied by such forward-looking statements. Such factors include, but are not limited to: availability of financing; delay or failure to receive required permits or regulatory approvals; and general business, economic, competitive, political and social uncertainties. Accordingly, readers should not place undue reliance on the forward-looking statements and information contained in this press release. Except as required by law, the Company disclaims any intention and assumes no obligation to update or revise any forward-looking statements to reflect actual results, whether as a result of new information, future events, changes in assumptions, changes in factors affecting such forward- looking statements or otherwise. NEITHER THE TSX VENTURE EXCHANGE (NOR ITS REGULATORY SERVICE PROVIDER) ACCEPTS RESPONSIBILITY FOR THE ADEQUACY OR ACCURACY OF THIS RELEASE SOURCE  Arizona Metals Corp.",
    "primary_commodity": "Au"
  },
  "articleProject": {
    "gid": 3169,
    "project_name": "Kay",
    "location": "Arizona, United States"
  },
  "articleExchange": "TSX",
  "articleCompanyId": 1097,
  "articleTicker": "AMC",
  "articleCompanyName": "Arizona Metals Corp.",
  "allOtherCompanyProjects": [
    {
      "company_id": 1097,
      "gid": 3169,
      "project_name": "Kay",
      "location": "Arizona, United States"
    },
    {
      "company_id": 1097,
      "gid": 5371,
      "project_name": "Sugarloaf Peak",
      "location": "Arizona, United States"
    }
  ],
  "allOtherCompanyNews": [
    {
      "id": 105849,
      "company_id": 1097,
      "title": "Arizona Metals Intersects 44.5 m @ 4.0 g/t AuEq, 18.6 m @ 2.1% CuEq, and 32.0 m @5.3 g/t AuEq in Kay2 Zone",
      "link": "https://contentapi.cision.com/api/v1.0/releases/20250527C0468",
      "date": "2025-05-27T10:00:00.000Z",
      "hidden": false
    },
    {
      "id": 105175,
      "company_id": 1097,
      "title": "Arizona Metals Strengthens Board with New Director Nominee; Announces Director Retirements and Provides Corporate Update",
      "link": "https://contentapi.cision.com/api/v1.0/releases/20250520C2361",
      "date": "2025-05-20T10:00:00.000Z",
      "hidden": false
    },
    {
      "id": 89781,
      "company_id": 1097,
      "title": "Arizona Metals Intersects 34.8 m @ 11.3 g/t AuEq in Kay2 Zone",
      "link": "https://contentapi.cision.com/api/v1.0/releases/20250303C1719",
      "date": "2025-03-03T11:00:00.000Z",
      "hidden": false
    },
    {
      "id": 88338,
      "company_id": 1097,
      "title": "Arizona Metals Provides Corporate Update",
      "link": "https://contentapi.cision.com/api/v1.0/releases/20250219C2844",
      "date": "2025-02-19T11:00:00.000Z",
      "hidden": false
    },
    {
      "id": 86949,
      "company_id": 1097,
      "title": "Arizona Metals Extends Kay2 Zone 450 m Below Discovery Hole at Kay Deposit",
      "link": "https://contentapi.cision.com/api/v1.0/releases/20250205C6362",
      "date": "2025-02-05T22:00:00.000Z",
      "hidden": false
    },
    {
      "id": 82678,
      "company_id": 1097,
      "title": "Arizona Metals Corp. Announces Closing of Bought Deal Public Offering",
      "link": "https://contentapi.cision.com/api/v1.0/releases/20241220C2332",
      "date": "2024-12-20T14:49:00.000Z",
      "hidden": false
    },
    {
      "id": 82540,
      "company_id": 1097,
      "title": "Arizona Metals Corp. Files Final Short Form Prospectus in connection with its Bought Deal Public Offering, Underwriters exercise Over-Allotment Option",
      "link": "https://contentapi.cision.com/api/v1.0/releases/20241219C9393",
      "date": "2024-12-19T17:37:00.000Z",
      "hidden": false
    },
    {
      "id": -160833,
      "company_id": 1097,
      "title": "Arizona Metals Announces Restatement of Q3 Financial Statements",
      "link": "https://contentapi.cision.com/api/v1.0/releases/20241216C0699",
      "date": "2024-12-16T20:08:00.000Z",
      "hidden": false
    },
    {
      "id": -158338,
      "company_id": 1097,
      "title": "Canadian Investment Regulatory Organization Trade Resumption - AMC",
      "link": "https://contentapi.cision.com/api/v1.0/releases/20241203C6555",
      "date": "2024-12-03T12:49:00.000Z",
      "hidden": false
    },
    {
      "id": 80703,
      "company_id": 1097,
      "title": "Arizona Metals Corp. Announces Bought Deal Financing",
      "link": "https://contentapi.cision.com/api/v1.0/releases/20241202C6315",
      "date": "2024-12-02T21:34:00.000Z",
      "hidden": false
    }
  ]
}
