{
  "article": {
    "id": 88944,
    "link": "https://www.accessnewswire.com/newsroom/en/metals-and-mining/mako-mining-receives-conditional-approval-for-the-acquisition-of-the-moss-mine-in--990255",
    "title": " Mako Mining Receives Conditional Approval for the Acquisition of the Moss Mine in Arizona",
    "description": "<p><strong id=\"dateline\">VANCOUVER, BC / <a href='https://www.accessnewswire.com/'>ACCESS Newswire</a> / February 24, 2025 / </strong><strong>Mako Mining Corp.</strong> (TSX-V:MKO)(OTCQX:MAKOF) (&quot;<strong>Mako</strong>&quot; or the &quot;<strong>Company</strong>&quot;) is pleased to provide an update on Mako's proposed acquisition (the &quot;<strong>Acquisition</strong>&quot;) of the Moss Mine in Arizona, through the acquisition of 100% of the issued and outstanding common shares of EG Acquisition LLC (&quot;<strong>EGA</strong>&quot;) from investment funds (the &quot;<strong>Sellers</strong>&quot;) controlled by Mako's controlling shareholder, Wexford Capital LP (&quot;<strong>Wexford</strong>&quot;). Mako is pleased to announce that it has received the conditional approval of the TSX Venture Exchange (the &quot;<strong>TSXV</strong>&quot;) for the Acquisition. Completion of the Acquisition remains subject to Mako satisfying all regulatory requirements and receiving the final approval of the TSXV. Mako is concurrently working on finalizing a definitive share purchase agreement with the Sellers in connection with the Acquisition.</p><p>EGA took over full operational control of the Moss Mine on December 31<sup>st</sup>, 2024, and has a services contract with Mako's operating team who has been assisting EGA. Since that time, consumable inventories have been replenished, critical maintenance has been completed, and a scope of work has been issued to mining contractors to restart mining operations within the next five weeks.</p><p>Since January 2025, gold and silver sales from the Moss Mine have continued unabated with 832 oz. gold and 5,607 oz. silver shipped with an estimated value of US$2.6 million. This significantly exceeds a US$1.6 million cash infusion made by EGA into the operating company at the beginning of January for critical maintenance and repairs.</p><p>While the previously announced non-binding term sheet for the Acquisition (see December 31, 2024 press release) contemplates a purchase price of between US$4.9 million and US$6.4 million (dependent on whether certain royalties are extinguished), all the net cashflow derived from gold and silver sales since December 31<sup>st</sup>, 2024 will accrue to the benefit of Mako under the proposed terms of the Acquisition. In addition, Mako is expected to receive approximately US$1.5 million in cash collateral from Trisura Guarantee Insurance Company in connection with the renegotiation of certain environmental reclamation bonds at the Moss Mine, which will have the impact of lowering the effective purchase price of the Acquisition by such amount.</p><p>On behalf of the Board,</p><p><strong>Akiba Leisman</strong><br /><strong>Chief Executive Officer</strong></p><p><strong>About Mako</strong></p><p>Mako Mining Corp. is a publicly listed gold mining, development and exploration company. The Company operates the high-grade San Albino gold mine in Nueva Segovia, Nicaragua, which ranks as one of the highest-grade open pit gold mines globally and offers district-scale exploration potential. Mako also holds a 100% interest in the PEA-stage Eagle Mountain Project in Guyana, South America. Eagle Mountain is the subject of engineering, environmental and mine permitting activity. Mako is led by an experienced management team, proven in exploration discoveries, mine design and construction, and executing on phased project development strategies in the Americas.</p><p>For further information: Mako Mining Corp., Akiba Leisman, Chief Executive Officer, E-mail: <a rel=\"nofollow\" href=\"mailto:aleisman@makominingcorp.com\">aleisman@makominingcorp.com</a>, phone: (917) 558-5289 or visit our website at <a rel=\"nofollow\" href=\"https://pr.report/7jkp\">www.makominingcorp.com</a> and SEDARPLUS <a rel=\"nofollow\" href=\"https://pr.report/7jkq\">www.sedarplus.ca</a>.</p><p><i><strong>Forward-Looking Information: </strong>Some of the statements contained herein may be considered &quot;forward-looking information&quot; within the meaning of applicable securities laws. Forward-looking information can be identified by words such as, without limitation, &quot;estimate&quot;, &quot;project&quot;, &quot;believe&quot;, &quot;anticipate&quot;, &quot;intend&quot;, &quot;expect&quot;, &quot;plan&quot;, &quot;predict&quot;, &quot;may&quot; or &quot;should&quot; or variations thereon or comparable terminology. The forward-looking information contained herein reflects the Company's current beliefs and expectations, based on management's reasonable assumptions, and includes, without limitation, statements regarding the Company's expectations that it will be in a position to close the Acquisition in March 2025; that operations at the Moss Mine are expected to restart in the next five weeks; Mako's expectation that it will receive approximately US$1.5 million in cash collateral from Trisura Guarantee Insurance Company in connection with the renegotiation of certain environmental reclamation bonds at the Moss Mine. Such forward-looking information is subject to a variety of risks and uncertainties which could cause actual events or results to differ materially from those reflected in the forward-looking information, including, without limitation, that the Acquisition will not be completed on the terms and within the timeline expected, or at all; the cash collateral expected to be received from Trisura Guarantee Insurance Company will not be received; changes in the timelines for resumption of operations at the Moss Mine; and other risks and uncertainties as disclosed in the Company's public disclosure filings on SEDAR+ at www.sedarplus.ca. Such information contained herein represents management's best judgment as of the date hereof, based on information currently available. Mako does not undertake to update any forward-looking information, except in accordance with applicable securities laws.</i></p><p><i>Neither the TSX Venture Exchange nor its Regulation Services Provider (as that term is defined in the policies of the TSX Venture Exchange) accepts responsibility for the adequacy or accuracy of this release.</i></p><p><strong>SOURCE:</strong> Mako Mining Corp.</p><img src='https://app.accessnewswire.com/img.ashx?id=990255' width=\"100%\" /><br /><br />View the original <a href='https://www.accessnewswire.com/newsroom/en/metals-and-mining/mako-mining-receives-conditional-approval-for-the-acquisition-of-the-moss-mine-in--990255'>press release</a> on ACCESS Newswire<br /><br />",
    "search_terms": "Moss,Mako Mining Corp.,MKO",
    "master_gid": 2775,
    "date": "2025-02-24T12:00:00.000Z",
    "tags": "USA|Arizona|||Mergers & Acquisitions,Project Acquisition",
    "image_id": null,
    "hidden": false,
    "company_id": 1498,
    "provider": "accesswire",
    "excerpt": "VANCOUVER, BC /ACCESS Newswire/ February 24, 2025 /Mako Mining Corp.(TSX-V:MKO)(OTCQX:MAKOF) (&quot;Mako&quot; or the &quot;Company&quot;) is pleased to provide an update on Mako's proposed acquisition (the &quot;Acquisition&quot;) of the Moss Mine in Arizona, through the acquisition of 100% of the issued and outstanding common shares of EG Acquisition LLC (&quot;EGA&quot;) from",
    "is_regulatory": false,
    "refined_tags": null,
    "ftp_filename": null,
    "company_name": "Mako Mining Corp.",
    "exchange": "TSXV",
    "root_ticker": "MKO",
    "project_name": "Moss",
    "gid": 2775,
    "location": "Arizona, United States",
    "plan_id": null,
    "description_text": "VANCOUVER, BC / ACCESS Newswire / February 24, 2025 / Mako Mining Corp. (TSX-V:MKO)(OTCQX:MAKOF) (\" Mako \" or the \" Company \") is pleased to provide an update on Mako's proposed acquisition (the \" Acquisition \") of the Moss Mine in Arizona, through the acquisition of 100% of the issued and outstanding common shares of EG Acquisition LLC (\" EGA \") from investment funds (the \" Sellers \") controlled by Mako's controlling shareholder, Wexford Capital LP (\" Wexford \"). Mako is pleased to announce that it has received the conditional approval of the TSX Venture Exchange (the \" TSXV \") for the Acquisition. Completion of the Acquisition remains subject to Mako satisfying all regulatory requirements and receiving the final approval of the TSXV. Mako is concurrently working on finalizing a definitive share purchase agreement with the Sellers in connection with the Acquisition. EGA took over full operational control of the Moss Mine on December 31 st , 2024, and has a services contract with Mako's operating team who has been assisting EGA. Since that time, consumable inventories have been replenished, critical maintenance has been completed, and a scope of work has been issued to mining contractors to restart mining operations within the next five weeks. Since January 2025, gold and silver sales from the Moss Mine have continued unabated with 832 oz. gold and 5,607 oz. silver shipped with an estimated value of US$2.6 million. This significantly exceeds a US$1.6 million cash infusion made by EGA into the operating company at the beginning of January for critical maintenance and repairs. While the previously announced non-binding term sheet for the Acquisition (see December 31, 2024 press release) contemplates a purchase price of between US$4.9 million and US$6.4 million (dependent on whether certain royalties are extinguished), all the net cashflow derived from gold and silver sales since December 31 st , 2024 will accrue to the benefit of Mako under the proposed terms of the Acquisition. In addition, Mako is expected to receive approximately US$1.5 million in cash collateral from Trisura Guarantee Insurance Company in connection with the renegotiation of certain environmental reclamation bonds at the Moss Mine, which will have the impact of lowering the effective purchase price of the Acquisition by such amount. On behalf of the Board, Akiba Leisman Chief Executive Officer About Mako Mako Mining Corp. is a publicly listed gold mining, development and exploration company. The Company operates the high-grade San Albino gold mine in Nueva Segovia, Nicaragua, which ranks as one of the highest-grade open pit gold mines globally and offers district-scale exploration potential. Mako also holds a 100% interest in the PEA-stage Eagle Mountain Project in Guyana, South America. Eagle Mountain is the subject of engineering, environmental and mine permitting activity. Mako is led by an experienced management team, proven in exploration discoveries, mine design and construction, and executing on phased project development strategies in the Americas. For further information: Mako Mining Corp., Akiba Leisman, Chief Executive Officer, E-mail: aleisman@makominingcorp.com , phone: (917) 558-5289 or visit our website at www.makominingcorp.com and SEDARPLUS www.sedarplus.ca . Forward-Looking Information: Some of the statements contained herein may be considered \"forward-looking information\" within the meaning of applicable securities laws. Forward-looking information can be identified by words such as, without limitation, \"estimate\", \"project\", \"believe\", \"anticipate\", \"intend\", \"expect\", \"plan\", \"predict\", \"may\" or \"should\" or variations thereon or comparable terminology. The forward-looking information contained herein reflects the Company's current beliefs and expectations, based on management's reasonable assumptions, and includes, without limitation, statements regarding the Company's expectations that it will be in a position to close the Acquisition in March 2025; that operations at the Moss Mine are expected to restart in the next five weeks; Mako's expectation that it will receive approximately US$1.5 million in cash collateral from Trisura Guarantee Insurance Company in connection with the renegotiation of certain environmental reclamation bonds at the Moss Mine. Such forward-looking information is subject to a variety of risks and uncertainties which could cause actual events or results to differ materially from those reflected in the forward-looking information, including, without limitation, that the Acquisition will not be completed on the terms and within the timeline expected, or at all; the cash collateral expected to be received from Trisura Guarantee Insurance Company will not be received; changes in the timelines for resumption of operations at the Moss Mine; and other risks and uncertainties as disclosed in the Company's public disclosure filings on SEDAR+ at www.sedarplus.ca. Such information contained herein represents management's best judgment as of the date hereof, based on information currently available. Mako does not undertake to update any forward-looking information, except in accordance with applicable securities laws. Neither the TSX Venture Exchange nor its Regulation Services Provider (as that term is defined in the policies of the TSX Venture Exchange) accepts responsibility for the adequacy or accuracy of this release. SOURCE: Mako Mining Corp. View the original press release on ACCESS Newswire",
    "primary_commodity": "Au"
  },
  "articleProject": {
    "gid": 2775,
    "project_name": "Moss",
    "location": "Arizona, United States"
  },
  "articleExchange": "TSXV",
  "articleCompanyId": 1498,
  "articleTicker": "MKO",
  "articleCompanyName": "Mako Mining Corp.",
  "allOtherCompanyProjects": [
    {
      "company_id": 1498,
      "gid": 2983,
      "project_name": "Las Conchitas North",
      "location": "Nueva Segovia, Nicaragua"
    },
    {
      "company_id": 1498,
      "gid": 3089,
      "project_name": "San Albino",
      "location": "Nueva Segovia, Nicaragua"
    }
  ],
  "allOtherCompanyNews": [
    {
      "id": 106517,
      "company_id": 1498,
      "title": "Mako Mining Reports First Quarter 2025 Financial Results, Including Record Mine Operating Cash Flow of US$19.9 million, Adjusted EBITDA of US$16.1 million and EPS of US$0.12/share from 10,817 oz Gold Sold at US$2,915/oz",
      "link": null,
      "date": "2025-06-02T10:50:00.000Z",
      "hidden": false
    },
    {
      "id": 105326,
      "company_id": 1498,
      "title": "Mako Mining Intersects 39.15 g/t Au over 5.9 m (Estimated True Width) 19.2 m Below Surface In its Inaugural Drill Campaign at El Golfo",
      "link": null,
      "date": "2025-05-21T10:45:00.000Z",
      "hidden": false
    },
    {
      "id": 104602,
      "company_id": 1498,
      "title": "Mako Mining Intersects 117.98 g/t Gold over 1.7m (Estimated True Width) at Las Conchitas",
      "link": null,
      "date": "2025-05-14T10:45:00.000Z",
      "hidden": false
    },
    {
      "id": 100353,
      "company_id": 1498,
      "title": "Mako Mining Provides Corporate Update",
      "link": null,
      "date": "2025-04-22T01:25:00.000Z",
      "hidden": false
    },
    {
      "id": 100259,
      "company_id": 1498,
      "title": "Mako Mining Announces Q1 2025 Production Results Generating Record Gold Revenue of US$31.5 million",
      "link": null,
      "date": "2025-04-21T10:45:00.000Z",
      "hidden": false
    },
    {
      "id": 99460,
      "company_id": 1498,
      "title": "April 11thMako Mining Reports Fourth Quarter and Full Year 2024 Financial Results, Including 2024 Adjusted EBITDA(1) of US$42.2 million and EPS of US$0.27 from 39,001 oz Gold Sold at an Average Price of US$2,397/oz",
      "link": null,
      "date": "2025-04-11T10:45:00.000Z",
      "hidden": false
    },
    {
      "id": 92664,
      "company_id": 1498,
      "title": "Mako Mining Completes Acquisition of Moss Mine in Arizona",
      "link": null,
      "date": "2025-03-27T10:50:00.000Z",
      "hidden": false
    },
    {
      "id": 88944,
      "company_id": 1498,
      "title": " Mako Mining Receives Conditional Approval for the Acquisition of the Moss Mine in Arizona",
      "link": "https://www.accessnewswire.com/newsroom/en/metals-and-mining/mako-mining-receives-conditional-approval-for-the-acquisition-of-the-moss-mine-in--990255",
      "date": "2025-02-24T12:00:00.000Z",
      "hidden": false
    },
    {
      "id": 86913,
      "company_id": 1498,
      "title": "Mako Mining Intersects 2.93 g/t Gold over 15.4 metres (ETW) at Eagle Mountain and 3.73 g/t Au over 31.5 m at the Salbora Deposit as Part of a Geotechnical Drill Program",
      "link": "https://www.accessnewswire.com/newsroom/en/metals-and-mining/mako-mining-intersects-293-gt-gold-over-154-metres-etw-at-eagle-mountain-and-373-g-979825",
      "date": "2025-02-05T12:30:00.000Z",
      "hidden": false
    },
    {
      "id": 83811,
      "company_id": 1498,
      "title": "Mako Mining Announces Q4 2024 Production Results Generating Record Gold Revenue of US$ 28.8 million and an Increase in Cash of US$ 9.5 million",
      "link": "https://www.accesswire.com/967480/mako-mining-announces-q4-2024-production-results-generating-record-gold-revenue-of-us-288-million-and-an-increase-in-cash-of-us-95-million",
      "date": "2025-01-13T12:00:00.000Z",
      "hidden": false
    }
  ]
}
