{
  "article": {
    "id": 92664,
    "link": null,
    "title": "Mako Mining Completes Acquisition of Moss Mine in Arizona",
    "description": "\n      <p><strong id=\"dateline\">VANCOUVER, BC / <a href='https://www.accessnewswire.com/'>ACCESS Newswire</a> / March 27, 2025 / </strong><strong>Mako Mining Corp. </strong>(&quot;<strong>Mako</strong>&quot;) (TSXV:MKO)(OTCQX:MAKOF) is pleased to announce that, further to its press releases dated December 31<sup>st</sup>, 2024 and February 24<sup>th</sup>, 2025, it has completed the acquisition of the Moss gold mine located in the historic Oatman District in Arizona.</p><p>The acquisition was completed pursuant to the terms of an interest purchase agreement dated March 26<sup>th</sup>, 2025, between Mako US Corp. as buyer, Wexford EG Acquisition LLC as vendor, EG Acquisition LLC (&quot;<strong>EGA</strong>&quot;) as target and Mako as buyer guarantor, pursuant to which Mako US acquired 100% of the ownership interests in EGA,a recently created private company controlled by Mako's controlling shareholder, Wexford Capital LP (collectively with its managed funds, &quot;<strong>Wexford</strong>&quot;), that acquired 100% of the shares of Golden Vertex Corp. (&quot;<strong>GVC</strong>&quot;), the operating subsidiary of the Moss mine, under a CCAA proceeding and related Chapter 15 proceeding in the United States (the &quot;<strong>Bankruptcy Process</strong>&quot;) on December 31<sup>st</sup>, 2024.</p><p>The aggregate purchase price for the acquisition was US$6.49 million, paid in cash, reflecting Wexford's approximate acquisition and closing costs of US$4.9 million plus US$1.59 million of equity contributions made by Wexford to cover initial operational costs at the beginning of January 2025. This equates to the approximate cost basis of EGA's investment in GVC. Since December 31<sup>st</sup>, 2024, a total of 1,593 ounces of gold and 11,023 ounces of silver have been produced for a value of approximately US$4.8 million, generating net cash of approximately US$3.0 million. Furthermore, Trisura Guarantee Insurance Company has agreed to release approximately US$1.5 million of the US$3.0 million held as collateral for various environmental bonds held at the Moss Mine. The two aforementioned cash inflows have effectively reduced Mako's net cash acquisition cost to approximately US$2.0 million, which is a small fraction of Mako's current monthly cash flow.</p><p>No purchase price adjustments were made in connection with the settlement of the royalty disputes that arose in connection with the Bankruptcy Process, involving the 1% net smelter return royalty at the Moss mine held by affiliates of Sandstorm Gold Ltd. and the 3% net smelter return royalty at the Moss mine held by Patriot Gold Corporation, which are still before the United States Bankruptcy Court for the District of Arizona.</p><p>Akiba Leisman, CEO states that: &quot;Mako now adds a producing asset located in a top tier jurisdiction to its portfolio of mineral properties purchased with a small fraction of cash flow from our operations. The Moss mine has continued to produce gold through its beneficiation facilities, with mining having been recently restarted after a temporarily suspension at the beginning of the Bankruptcy Process. Over the course of the next few months we will continue to debottleneck the mine to take full advantage of record high gold prices&quot;.</p><p>Mako currently operates the high-grade San Albino mine in northern Nicaragua and owns the Eagle Mountain project in Guyana.</p><p><strong>Related Party Transaction</strong></p><p>As the acquisition transaction completed by Mako involved Mako's controlling shareholder, Wexford, the transaction is considered a related party transaction for Mako within the meaning of Multilateral Instrument 61-101- <i>Protection of Minority Security Holders in Special Transactions</i> (&quot;<strong>MI 61-101</strong>&quot;). As a result, the Board of Directors of Mako appointed, and approved the transaction upon the recommendations of, a special committee of independent directors which assisted in the evaluation, negotiation and supervision of all matters relating to the acquisition transaction. The transaction did not have any impact on the percentage of securities of Mako beneficially owned or controlled by Wexford.Pursuant to Section 5.5(a) and 5.7(1)(a) of MI 61-101, Mako was exempt from obtaining a formal valuation and minority approval of its shareholders for the transaction on the basis that the fair market value of the transaction was below 25% of Mako's market capitalization, as determined in accordance with MI 61-101.</p><p><strong><u>About Mako</u></strong></p><p>Mako Mining Corp. is a publicly listed gold mining, development and exploration company. Mako operates the high-grade San Albino gold mine in Nueva Segovia, Nicaragua, which ranks as one of the highest-grade open pit gold mines globally. Mako also owns the Eagle Mountain Gold project in Guyana, South America.</p><p>For further information about Mako, please contact Akiba Leisman, Chief Executive Officer, at (917) 558-5289 or <a rel=\"nofollow\" href=\"mailto:aleisman@makominingcorp.com\">aleisman@makominingcorp.com</a>, or visit our website at <a rel=\"nofollow\" href=\"https://pr.report/8qr1\">www.makominingcorp.com</a> and our profile on SEDAR+ at <a rel=\"nofollow\" href=\"https://pr.report/8qr2\">www.sedarplus.ca</a>.</p><p><i><strong>Forward-Looking Information: </strong>Some of the statements contained herein may be considered &quot;forward-looking information&quot; within the meaning of applicable Canadian securities laws. Forward-looking information can be identified by words such as, without limitation, &quot;estimate&quot;, &quot;project&quot;, &quot;believe&quot;, &quot;anticipate&quot;, &quot;intend&quot;, &quot;expect&quot;, &quot;plan&quot;, &quot;predict&quot;, &quot;may&quot; or &quot;should&quot; or variations thereon or comparable terminology. The forward-looking information contained herein reflects Mako's current beliefs, intentions and expectations, based on management's reasonable beliefs and assumptions as of the date hereof, and includes, without limitation, statements related to Mako's intention to debottleneck the Moss mine in the next few months. The forward-looking information contained in this news release is based upon a number of assumptions, risks and uncertainties, including assumptions, risks and uncertainties in respect of current and future market conditions, the execution of Mako's business strategies, operations in Mako's properties continuing without interruption, and the absence of any other factors that could cause actions, events or results to differ from those anticipated, estimated, intended or implied. Forward-looking information is subject to known and unknown risks, uncertainties and other factors that may cause the actual results, level of activity, performance or achievements to be materially different from those expressed or implied by such forward-looking information. In addition to the risks and uncertainties disclosed herein, other factors include, but are not limited to those set forth under the caption &quot;Risk and Uncertainties&quot; in Mako's management's discussion and analysis for the nine months ended September 30<sup>th</sup>, 2024, and other documents filed under Mako's profile on the SEDAR+ at </i><a rel=\"nofollow\" href=\"https://pr.report/8qr3\"><i>www.sedarplus.ca.</i></a><i> Readers should not place undue reliance on forward-looking information, which speaks only as of the date made. Mako does not undertake to update or revise any forward-looking information, whether as a result of new information, future events or otherwise, except as required by applicable Canadian securities laws. All of the forward-looking information contained in this news release is expressly qualified by the foregoing cautionary statements.</i></p><p><i>Neither the TSX Venture Exchange nor its Regulation Services Provider (as that term is defined in the policies of the TSX Venture Exchange) accepts responsibility for the adequacy or accuracy of this release.</i></p><p><strong>SOURCE: </strong>Mako Mining Corp.</p><br /><br />View the original <a href='https://www.accessnewswire.com/newsroom/en/metals-and-mining/mako-mining-completes-acquisition-of-moss-mine-in-arizona-1006059'>press release</a> on ACCESS Newswire<br /><br />\n      <img src=\"https://app.accessnewswire.com/img.ashx?id=1006059\" width=\"0\" height=\"0\"/>\n    ",
    "search_terms": "Moss,Mako Mining Corp.,MKO",
    "master_gid": 2775,
    "date": "2025-03-27T10:50:00.000Z",
    "tags": "USA|Arizona||Gold|Project Acquisition",
    "image_id": null,
    "hidden": false,
    "company_id": 1498,
    "provider": "accesswire",
    "excerpt": "VANCOUVER, BC / ACCESS Newswire [https://www.accessnewswire.com/] / March 27, 2025 / Mako Mining Corp. (\"Mako\") (TSXV:MKO)(OTCQX:MAKOF) is pleased to announce that, further to its press releases dated December 31st, 2024 and February 24th, 2025, it has completed the acquisition of the Moss gold mine located in the historic Oatman District in Arizona. The acquisition was completed pursuant to the terms of an interest purchase agreement dated March 26th, 2025, between Mako US Corp. as buyer, Wexford EG Acquisition LLC as vendor, EG Acquisition LLC (\"EGA\") as target and Mako as buyer guarantor, pursuant to which Mako US acquired 100% of",
    "is_regulatory": false,
    "refined_tags": [],
    "ftp_filename": "accesswire_1006059_en",
    "company_name": "Mako Mining Corp.",
    "exchange": "TSXV",
    "root_ticker": "MKO",
    "project_name": "Moss",
    "gid": 2775,
    "location": "Arizona, United States",
    "plan_id": null,
    "description_text": "VANCOUVER, BC / ACCESS Newswire / March 27, 2025 / Mako Mining Corp. (\" Mako \") (TSXV:MKO)(OTCQX:MAKOF) is pleased to announce that, further to its press releases dated December 31 st , 2024 and February 24 th , 2025, it has completed the acquisition of the Moss gold mine located in the historic Oatman District in Arizona. The acquisition was completed pursuant to the terms of an interest purchase agreement dated March 26 th , 2025, between Mako US Corp. as buyer, Wexford EG Acquisition LLC as vendor, EG Acquisition LLC (\" EGA \") as target and Mako as buyer guarantor, pursuant to which Mako US acquired 100% of the ownership interests in EGA,a recently created private company controlled by Mako's controlling shareholder, Wexford Capital LP (collectively with its managed funds, \" Wexford \"), that acquired 100% of the shares of Golden Vertex Corp. (\" GVC \"), the operating subsidiary of the Moss mine, under a CCAA proceeding and related Chapter 15 proceeding in the United States (the \" Bankruptcy Process \") on December 31 st , 2024. The aggregate purchase price for the acquisition was US$6.49 million, paid in cash, reflecting Wexford's approximate acquisition and closing costs of US$4.9 million plus US$1.59 million of equity contributions made by Wexford to cover initial operational costs at the beginning of January 2025. This equates to the approximate cost basis of EGA's investment in GVC. Since December 31 st , 2024, a total of 1,593 ounces of gold and 11,023 ounces of silver have been produced for a value of approximately US$4.8 million, generating net cash of approximately US$3.0 million. Furthermore, Trisura Guarantee Insurance Company has agreed to release approximately US$1.5 million of the US$3.0 million held as collateral for various environmental bonds held at the Moss Mine. The two aforementioned cash inflows have effectively reduced Mako's net cash acquisition cost to approximately US$2.0 million, which is a small fraction of Mako's current monthly cash flow. No purchase price adjustments were made in connection with the settlement of the royalty disputes that arose in connection with the Bankruptcy Process, involving the 1% net smelter return royalty at the Moss mine held by affiliates of Sandstorm Gold Ltd. and the 3% net smelter return royalty at the Moss mine held by Patriot Gold Corporation, which are still before the United States Bankruptcy Court for the District of Arizona. Akiba Leisman, CEO states that: \"Mako now adds a producing asset located in a top tier jurisdiction to its portfolio of mineral properties purchased with a small fraction of cash flow from our operations. The Moss mine has continued to produce gold through its beneficiation facilities, with mining having been recently restarted after a temporarily suspension at the beginning of the Bankruptcy Process. Over the course of the next few months we will continue to debottleneck the mine to take full advantage of record high gold prices\". Mako currently operates the high-grade San Albino mine in northern Nicaragua and owns the Eagle Mountain project in Guyana. Related Party Transaction As the acquisition transaction completed by Mako involved Mako's controlling shareholder, Wexford, the transaction is considered a related party transaction for Mako within the meaning of Multilateral Instrument 61-101- Protection of Minority Security Holders in Special Transactions (\" MI 61-101 \"). As a result, the Board of Directors of Mako appointed, and approved the transaction upon the recommendations of, a special committee of independent directors which assisted in the evaluation, negotiation and supervision of all matters relating to the acquisition transaction. The transaction did not have any impact on the percentage of securities of Mako beneficially owned or controlled by Wexford.Pursuant to Section 5.5(a) and 5.7(1)(a) of MI 61-101, Mako was exempt from obtaining a formal valuation and minority approval of its shareholders for the transaction on the basis that the fair market value of the transaction was below 25% of Mako's market capitalization, as determined in accordance with MI 61-101. About Mako Mako Mining Corp. is a publicly listed gold mining, development and exploration company. Mako operates the high-grade San Albino gold mine in Nueva Segovia, Nicaragua, which ranks as one of the highest-grade open pit gold mines globally. Mako also owns the Eagle Mountain Gold project in Guyana, South America. For further information about Mako, please contact Akiba Leisman, Chief Executive Officer, at (917) 558-5289 or aleisman@makominingcorp.com , or visit our website at www.makominingcorp.com and our profile on SEDAR+ at www.sedarplus.ca . Forward-Looking Information: Some of the statements contained herein may be considered \"forward-looking information\" within the meaning of applicable Canadian securities laws. Forward-looking information can be identified by words such as, without limitation, \"estimate\", \"project\", \"believe\", \"anticipate\", \"intend\", \"expect\", \"plan\", \"predict\", \"may\" or \"should\" or variations thereon or comparable terminology. The forward-looking information contained herein reflects Mako's current beliefs, intentions and expectations, based on management's reasonable beliefs and assumptions as of the date hereof, and includes, without limitation, statements related to Mako's intention to debottleneck the Moss mine in the next few months. The forward-looking information contained in this news release is based upon a number of assumptions, risks and uncertainties, including assumptions, risks and uncertainties in respect of current and future market conditions, the execution of Mako's business strategies, operations in Mako's properties continuing without interruption, and the absence of any other factors that could cause actions, events or results to differ from those anticipated, estimated, intended or implied. Forward-looking information is subject to known and unknown risks, uncertainties and other factors that may cause the actual results, level of activity, performance or achievements to be materially different from those expressed or implied by such forward-looking information. In addition to the risks and uncertainties disclosed herein, other factors include, but are not limited to those set forth under the caption \"Risk and Uncertainties\" in Mako's management's discussion and analysis for the nine months ended September 30 th , 2024, and other documents filed under Mako's profile on the SEDAR+ at www.sedarplus.ca. Readers should not place undue reliance on forward-looking information, which speaks only as of the date made. Mako does not undertake to update or revise any forward-looking information, whether as a result of new information, future events or otherwise, except as required by applicable Canadian securities laws. All of the forward-looking information contained in this news release is expressly qualified by the foregoing cautionary statements. Neither the TSX Venture Exchange nor its Regulation Services Provider (as that term is defined in the policies of the TSX Venture Exchange) accepts responsibility for the adequacy or accuracy of this release. SOURCE: Mako Mining Corp. View the original press release on ACCESS Newswire",
    "primary_commodity": "Au"
  },
  "articleProject": {
    "gid": 2775,
    "project_name": "Moss",
    "location": "Arizona, United States"
  },
  "articleExchange": "TSXV",
  "articleCompanyId": 1498,
  "articleTicker": "MKO",
  "articleCompanyName": "Mako Mining Corp.",
  "allOtherCompanyProjects": [
    {
      "company_id": 1498,
      "gid": 2983,
      "project_name": "Las Conchitas North",
      "location": "Nueva Segovia, Nicaragua"
    },
    {
      "company_id": 1498,
      "gid": 3089,
      "project_name": "San Albino",
      "location": "Nueva Segovia, Nicaragua"
    }
  ],
  "allOtherCompanyNews": [
    {
      "id": 106517,
      "company_id": 1498,
      "title": "Mako Mining Reports First Quarter 2025 Financial Results, Including Record Mine Operating Cash Flow of US$19.9 million, Adjusted EBITDA of US$16.1 million and EPS of US$0.12/share from 10,817 oz Gold Sold at US$2,915/oz",
      "link": null,
      "date": "2025-06-02T10:50:00.000Z",
      "hidden": false
    },
    {
      "id": 105326,
      "company_id": 1498,
      "title": "Mako Mining Intersects 39.15 g/t Au over 5.9 m (Estimated True Width) 19.2 m Below Surface In its Inaugural Drill Campaign at El Golfo",
      "link": null,
      "date": "2025-05-21T10:45:00.000Z",
      "hidden": false
    },
    {
      "id": 104602,
      "company_id": 1498,
      "title": "Mako Mining Intersects 117.98 g/t Gold over 1.7m (Estimated True Width) at Las Conchitas",
      "link": null,
      "date": "2025-05-14T10:45:00.000Z",
      "hidden": false
    },
    {
      "id": 100353,
      "company_id": 1498,
      "title": "Mako Mining Provides Corporate Update",
      "link": null,
      "date": "2025-04-22T01:25:00.000Z",
      "hidden": false
    },
    {
      "id": 100259,
      "company_id": 1498,
      "title": "Mako Mining Announces Q1 2025 Production Results Generating Record Gold Revenue of US$31.5 million",
      "link": null,
      "date": "2025-04-21T10:45:00.000Z",
      "hidden": false
    },
    {
      "id": 99460,
      "company_id": 1498,
      "title": "April 11thMako Mining Reports Fourth Quarter and Full Year 2024 Financial Results, Including 2024 Adjusted EBITDA(1) of US$42.2 million and EPS of US$0.27 from 39,001 oz Gold Sold at an Average Price of US$2,397/oz",
      "link": null,
      "date": "2025-04-11T10:45:00.000Z",
      "hidden": false
    },
    {
      "id": 92664,
      "company_id": 1498,
      "title": "Mako Mining Completes Acquisition of Moss Mine in Arizona",
      "link": null,
      "date": "2025-03-27T10:50:00.000Z",
      "hidden": false
    },
    {
      "id": 88944,
      "company_id": 1498,
      "title": " Mako Mining Receives Conditional Approval for the Acquisition of the Moss Mine in Arizona",
      "link": "https://www.accessnewswire.com/newsroom/en/metals-and-mining/mako-mining-receives-conditional-approval-for-the-acquisition-of-the-moss-mine-in--990255",
      "date": "2025-02-24T12:00:00.000Z",
      "hidden": false
    },
    {
      "id": 86913,
      "company_id": 1498,
      "title": "Mako Mining Intersects 2.93 g/t Gold over 15.4 metres (ETW) at Eagle Mountain and 3.73 g/t Au over 31.5 m at the Salbora Deposit as Part of a Geotechnical Drill Program",
      "link": "https://www.accessnewswire.com/newsroom/en/metals-and-mining/mako-mining-intersects-293-gt-gold-over-154-metres-etw-at-eagle-mountain-and-373-g-979825",
      "date": "2025-02-05T12:30:00.000Z",
      "hidden": false
    },
    {
      "id": 83811,
      "company_id": 1498,
      "title": "Mako Mining Announces Q4 2024 Production Results Generating Record Gold Revenue of US$ 28.8 million and an Increase in Cash of US$ 9.5 million",
      "link": "https://www.accesswire.com/967480/mako-mining-announces-q4-2024-production-results-generating-record-gold-revenue-of-us-288-million-and-an-increase-in-cash-of-us-95-million",
      "date": "2025-01-13T12:00:00.000Z",
      "hidden": false
    }
  ]
}
