{
  "ceo_buyer": {
    "value": "Justin Haines",
    "justification": "The buyer is Great Divide Mining (GDM). The CEO of GDM is identified in adelong_3.txt: 'Commenting on the completion of the Farm-in, CEO of GDM, Justin Haines, said...'"
  },
  "interest_acquired_percent": {
    "value": 51,
    "justification": "The 'Farm-in Agreements' rule states to use the final potential ownership. The deal is structured for an initial 15% stake, increasing to 51%. The text states: 'Upon achieving first gold pour, GDM’s interest will increase to 51%.'"
  },
  "currency": {
    "value": "AUD",
    "justification": "The payment is described with a '$' symbol ($300,000). The rule states to infer currency from context. Both companies (ADG and GDM) are listed on the ASX, which implies Australian Dollars (AUD)."
  },
  "cash_payments_raw": {
    "value": 300000,
    "justification": "The text states: 'GDM to invest $300,000 for an initial 15% stake in Challenger Gold Mines (CGM)...' This is a cash-for-equity payment into the project subsidiary."
  },
  "share_payments_raw": {
    "value": null,
    "justification": "The buyer (GDM) is not paying with its own shares. The payment is cash for equity in the subsidiary."
  },
  "cash_and_share_payments_combined_raw": {
    "value": null,
    "justification": "The payment is an explicit cash value, so this field is not applicable per the financial extraction hierarchy."
  },
  "amount_of_shares_issued": {
    "value": null,
    "justification": "The buyer (GDM) is not issuing its own shares as part of the transaction."
  },
  "issued_share_price": {
    "value": null,
    "justification": "No shares from the buyer are being issued, so there is no issue price."
  },
  "exploration_commitment_meters": {
    "value": null,
    "justification": "The agreement includes a commitment for 'Additional exploration and feasibility studies' but does not specify a commitment in meters."
  },
  "exploration_commitment_value_raw": {
    "value": null,
    "justification": "The agreement includes an 'Exploration Commitment' but does not specify a monetary value for it. The $300,000 is for an equity stake and plant refurbishment."
  },
  "exploration_commitment_desc": {
    "value": "Additional exploration and feasibility studies to expand gold resources within the Project Area.",
    "justification": "This is listed as a key term of the agreement in adelong_2.txt: 'Exploration Commitment – Additional exploration and feasibility studies to expand gold resources within the Project Area.'"
  },
  "nsr_acquired_percent": {
    "value": null,
    "justification": "The provided documents do not mention any Net Smelter Royalty (NSR) or equivalent royalty."
  },
  "coverage_area_raw": {
    "value": 70,
    "justification": "The text states: 'Adelong took control of the Adelong Goldfield which covers 70km2...'"
  },
  "coverage_area_unit": {
    "value": "km2",
    "justification": "The text states: 'Adelong took control of the Adelong Goldfield which covers 70km2...'"
  },
  "resource_size_desc": {
    "value": "1,820,000 Tonnes @ 3.21 g/t Au (188,000 oz Gold)",
    "justification": "This value is from the 'TOTAL PROJECT RESOURCES' line in 'Table 1' of file adelong_2.txt. This detailed table represents the most complete raw data, superseding the summary in the highlights. The table shows: Tonnes: 1,820,000, Grade(g/t Au): 3.21, Gold (oz): 188,000."
  },
  "buyer_ticker_and_exchange": {
    "value": "ASX:GDM",
    "justification": "The buyer is identified as 'Great Divide Mining Ltd (ASX:GDM)' in multiple documents, including adelong_3.txt. This matches the highest priority 'EXCHANGE:TICKER' format."
  }
}