{
  "article": {
    "id": 68505,
    "link": "https://www.newsfilecorp.com/release/220035/Indigo-Reports-Transaction-Closing-on-Hot-Uranium-Project-Wyoming",
    "title": "Indigo Reports Transaction Closing on Hot Uranium Project, Wyoming",
    "description": "<img src=\"https://api.newsfilecorp.com/newsinfo/220035/367\" id=\"367\" width=\"2\" height=\"2\" style=\"width: 1px;  height: 1px;border: 0px solid;\" /><p>Vancouver, British Columbia--(Newsfile Corp. - August 15, 2024) - Indigo Exploration Inc. (TSXV: IXI) (OTCQB: IXIXF) FSE: INEN) (the \"Company\") is pleased to announce that further to its news release dated July 9, 2024, it has received TSX Venture Exchange (\"TSXV\") approval for and completed the acquisition of a 100% interest in the Hot Property (the \"Property\"), a highly prospective uranium project located in the past producing Shirley Basin of Wyoming, comprised of 71 unpatented mineral claims covering a 5.75 km<sup>2</sup> area (the \"Acquisition\").</p><p>The Hot Property claims have seen extensive historical exploration dating back to the 1960's with over 200 holes drilled including near-surface intercepts of 1.83 metres of 1.1% U<sub>3</sub>O<sub>8</sub> at a depth of 43.0 metres and 3.35 metres of 0.28% U<sub>3</sub>O<sub>8</sub> at a depth of 26.8 metres. The Project is located adjacent to Uranium Energy Corp.'s (UEC-NYSE) Shirley Basin project, Ur-Energy Inc.'s (URG-NYSE) Shirley Basin mine, and Nuclear Fuels Inc.'s (NF-CSE) Bobcat Uranium Project. Ur-Energy's Shirley Basin project hosts an NI 43-101 Measured and Indicated Resource of 8.8 Mlb U<sub>3</sub>O<sub>8</sub> grading 0.23%<sup>1</sup> and is currently under construction<sup>2</sup>.</p><p><u><b>The Shirley Basin of Wyoming</b></u></p><p>Wyoming represents the largest uranium producing state and contains the greatest uranium ore reserves within the United States. The Shirley Basin located 40 miles southwest of Casper, Wyoming, produced over 51 million pounds of U<sub>3</sub>O<sub>8</sub> from 1960 to 1992 at an average grade of 0.22% U<sub>3</sub>O<sub>8</sub>. The Shirley Basin mines closed not for a lack of resource but due to lower uranium prices. The importance and relevance of the Shirley Basin today is reflected in production resurgence with Ur-Energy's production plans. </p><p style=\"text-align: center;\"><a rel=\"nofollow\" href=\"https://images.newsfilecorp.com/files/3717/220035_0236b77484564be3_001full.jpg\"><img src=\"https://images.newsfilecorp.com/files/3717/220035_0236b77484564be3_001.jpg\" style=\"border-width: 0px;\" alt=\"Cannot view this image? Visit: https://images.newsfilecorp.com/files/3717/220035_0236b77484564be3_001.jpg\" /></a></p><p style=\"text-align: center;\"><u>Figure 1: Shirley Basin Uranium Project Map</u></p><p style=\"text-align: center;\">To view an enhanced version of this graphic, please visit:<br /><a rel=\"nofollow\" href=\"https://images.newsfilecorp.com/files/3717/220035_0236b77484564be3_001full.jpg\">https://images.newsfilecorp.com/files/3717/220035_0236b77484564be3_001full.jpg</a></p><p><u><b>Hot Property</b></u></p><p>The Hot Property is strategically located just 800m east (0.5 mile) of an historic production area and 1.8km (1.1 miles) from Ur-Energy's uranium resource. Indigo uncovered 202 drill logs from public records from holes drilled in the 1950's on ground now covered by the Hot Property. One intercept (H1-Zeb-44) encountered 1.83m of 1.1% U<sub>3</sub>O<sub>8</sub> at a depth of 43.0m and a second hole (H6-Zeb-44) encountered 3.35m of 0.28% U<sub>3</sub>O<sub>8</sub> at a depth of 26.8m. Of the 202 holes, approximately 46% intercepted shallow uranium mineralization. Depth to mineralization ranges from 3m to 130m but average 46m deep in Eocene-aged Wind River Formation, the uranium host unit in the Shirley Basin. The Hot Property is particularly promising as one third of the mineralized holes on the property have two or more uranium intercepts. </p><p>Company geologists have designed an initial 50-hole reverse circulation drill program and has submitted a Notice of Intent permit application to the BLM for permitting of the RC drill program. </p><p><font style=\"font-size: 11px;\"><sup>1&#160;</sup>Updated Initial Assessment Technical Report Summary on Shirley Basin ISR Uranium Project, Carbon County Wyoming, USA dated March 4, 2024 and prepared by Western Water Consultants, Inc.</font></p><p><font style=\"font-size: 11px;\"><font style=\"font-size: 11px;\"><sup><font style=\"font-size: 9px;\">2</font></sup>&#160;</font><font style=\"font-size: 11px;\">Ur-Energy Announces Decision to Build Out Shirley Basin Mine: Press Release dated March 13, 2024</font></font></p><p><u><b>Terms of Transaction</b></u></p><p>Pursuant to the Acquisition, the Company has acquired a 100% interest in a private limited liability Arizona company which holds the Property claims. The Company has paid an aggregate of CDN$20,000 and made a share issuance of 200,000 shares of the Company to earn the 100% interest, without any NSR royalty. In addition to the Acquisition costs, the Company will assume the annual land holding costs for the Property, which will amount to US$14,200 before September 1, 2024. The transaction closed on August 14, 2024.</p><div id=\"contactInfo\"><p>On Behalf of the Board of Directors,</p><p><i>\"Paul Cowley\", </i>President and CEO</p><p><i>For further information, please contact: Paul Cowley: (604) 340-7711     Website:  <a href=\"https://api.newsfilecorp.com/redirect/nVbmZs3ArY\">www.indigoexploration.com</a></i></p></div><p style=\"text-align: center;\"><i>Bradley Parkes, P.Geo., VP Exploration and Director of Indigo Exploration Inc., is the Qualified Person as defined in</i></p><p style=\"text-align: center;\"><i>National Instrument 43-101, who has read and approved the technical content of this news release.</i></p><p><i>This news release includes certain forward-looking statements as well as management's objectives, strategies, beliefs and intentions. Forward looking statements are frequently identified by such words as \"may\", \"will\", \"plan\", \"expect\", \"anticipate\", \"estimate\", \"intend\" and similar words referring to future events and results. Forward-looking statements are based on the current opinions and expectations of management. All forward-looking information is inherently uncertain and subject to a variety of assumptions, risks and uncertainties, including the speculative nature of mineral exploration and development, fluctuating commodity prices, competitive risks and the availability of financing, as described in more detail in our recent securities filings available at <a href=\"https://api.newsfilecorp.com/redirect/K8OzKir4DZ\">www.sedar.com</a>. Actual events or results may differ materially from those projected in the forward-looking statements and we caution against placing undue reliance thereon. The forward-looking statements contained in this press release are made as of the date hereof.</i></p><p style=\"text-align: center;\"><i>Neither the TSX Venture Exchange nor its Regulations Services Provider (as that term is defined in the policies of the TSX Venture Exchange) accept responsibility for the adequacy or accuracy of this release.</i></p><p id=\"corporateLinkBack\">To view the source version of this press release, please visit <a href=\"https://api.newsfilecorp.com/redirect/EymqYc78PN\">https://www.newsfilecorp.com/release/220035</a></p>",
    "search_terms": "Hot,Noble Plains Uranium Corp.,IXI",
    "master_gid": 7937,
    "date": "2024-08-15T13:20:00.000Z",
    "tags": "USA|Wyoming||Uranium|Project Acquisition",
    "image_id": null,
    "hidden": false,
    "company_id": 1416,
    "provider": "newsfilecorp",
    "excerpt": "Vancouver, British Columbia--(Newsfile Corp. - August 15, 2024) - Indigo Exploration Inc. (TSXV: IXI) (OTCQB: IXIXF) FSE: INEN) (the \"Company\") is pleased to announce that further to its news release dated July 9, 2024, it has received TSX Venture Exchange (\"TSXV\") approval for and completed the acquisition of a 100%",
    "is_regulatory": false,
    "refined_tags": [
      "Mergers & Acquisitions"
    ],
    "ftp_filename": null,
    "company_name": "Indigo Exploration Inc.",
    "exchange": "TSXV",
    "root_ticker": "NOBL",
    "project_name": "Hot",
    "gid": 7937,
    "location": null,
    "plan_id": null,
    "description_text": "Vancouver, British Columbia--(Newsfile Corp. - August 15, 2024) - Indigo Exploration Inc. (TSXV: IXI) (OTCQB: IXIXF) FSE: INEN) (the \"Company\") is pleased to announce that further to its news release dated July 9, 2024, it has received TSX Venture Exchange (\"TSXV\") approval for and completed the acquisition of a 100% interest in the Hot Property (the \"Property\"), a highly prospective uranium project located in the past producing Shirley Basin of Wyoming, comprised of 71 unpatented mineral claims covering a 5.75 km 2 area (the \"Acquisition\"). The Hot Property claims have seen extensive historical exploration dating back to the 1960's with over 200 holes drilled including near-surface intercepts of 1.83 metres of 1.1% U 3 O 8 at a depth of 43.0 metres and 3.35 metres of 0.28% U 3 O 8 at a depth of 26.8 metres. The Project is located adjacent to Uranium Energy Corp.'s (UEC-NYSE) Shirley Basin project, Ur-Energy Inc.'s (URG-NYSE) Shirley Basin mine, and Nuclear Fuels Inc.'s (NF-CSE) Bobcat Uranium Project. Ur-Energy's Shirley Basin project hosts an NI 43-101 Measured and Indicated Resource of 8.8 Mlb U 3 O 8 grading 0.23% 1 and is currently under construction 2 . The Shirley Basin of Wyoming Wyoming represents the largest uranium producing state and contains the greatest uranium ore reserves within the United States. The Shirley Basin located 40 miles southwest of Casper, Wyoming, produced over 51 million pounds of U 3 O 8 from 1960 to 1992 at an average grade of 0.22% U 3 O 8 . The Shirley Basin mines closed not for a lack of resource but due to lower uranium prices. The importance and relevance of the Shirley Basin today is reflected in production resurgence with Ur-Energy's production plans. Figure 1: Shirley Basin Uranium Project Map To view an enhanced version of this graphic, please visit: https://images.newsfilecorp.com/files/3717/220035_0236b77484564be3_001full.jpg Hot Property The Hot Property is strategically located just 800m east (0.5 mile) of an historic production area and 1.8km (1.1 miles) from Ur-Energy's uranium resource. Indigo uncovered 202 drill logs from public records from holes drilled in the 1950's on ground now covered by the Hot Property. One intercept (H1-Zeb-44) encountered 1.83m of 1.1% U 3 O 8 at a depth of 43.0m and a second hole (H6-Zeb-44) encountered 3.35m of 0.28% U 3 O 8 at a depth of 26.8m. Of the 202 holes, approximately 46% intercepted shallow uranium mineralization. Depth to mineralization ranges from 3m to 130m but average 46m deep in Eocene-aged Wind River Formation, the uranium host unit in the Shirley Basin. The Hot Property is particularly promising as one third of the mineralized holes on the property have two or more uranium intercepts. Company geologists have designed an initial 50-hole reverse circulation drill program and has submitted a Notice of Intent permit application to the BLM for permitting of the RC drill program. 1 Updated Initial Assessment Technical Report Summary on Shirley Basin ISR Uranium Project, Carbon County Wyoming, USA dated March 4, 2024 and prepared by Western Water Consultants, Inc. 2 Ur-Energy Announces Decision to Build Out Shirley Basin Mine: Press Release dated March 13, 2024 Terms of Transaction Pursuant to the Acquisition, the Company has acquired a 100% interest in a private limited liability Arizona company which holds the Property claims. The Company has paid an aggregate of CDN$20,000 and made a share issuance of 200,000 shares of the Company to earn the 100% interest, without any NSR royalty. In addition to the Acquisition costs, the Company will assume the annual land holding costs for the Property, which will amount to US$14,200 before September 1, 2024. The transaction closed on August 14, 2024. On Behalf of the Board of Directors, \"Paul Cowley\", President and CEO For further information, please contact: Paul Cowley: (604) 340-7711     Website: www.indigoexploration.com Bradley Parkes, P.Geo., VP Exploration and Director of Indigo Exploration Inc., is the Qualified Person as defined in National Instrument 43-101, who has read and approved the technical content of this news release. This news release includes certain forward-looking statements as well as management's objectives, strategies, beliefs and intentions. Forward looking statements are frequently identified by such words as \"may\", \"will\", \"plan\", \"expect\", \"anticipate\", \"estimate\", \"intend\" and similar words referring to future events and results. Forward-looking statements are based on the current opinions and expectations of management. All forward-looking information is inherently uncertain and subject to a variety of assumptions, risks and uncertainties, including the speculative nature of mineral exploration and development, fluctuating commodity prices, competitive risks and the availability of financing, as described in more detail in our recent securities filings available at www.sedar.com . Actual events or results may differ materially from those projected in the forward-looking statements and we caution against placing undue reliance thereon. The forward-looking statements contained in this press release are made as of the date hereof. Neither the TSX Venture Exchange nor its Regulations Services Provider (as that term is defined in the policies of the TSX Venture Exchange) accept responsibility for the adequacy or accuracy of this release. To view the source version of this press release, please visit https://www.newsfilecorp.com/release/220035",
    "primary_commodity": "U"
  },
  "articleProject": {
    "gid": 7937,
    "project_name": "Hot",
    "location": null
  },
  "articleExchange": "TSXV",
  "articleCompanyId": 1416,
  "articleTicker": "NOBL",
  "articleCompanyName": "Noble Plains Uranium Corp.",
  "allOtherCompanyProjects": [
    {
      "company_id": 1416,
      "gid": 5257,
      "project_name": "Leduc-Legal",
      "location": "Alberta, Canada"
    },
    {
      "company_id": 1416,
      "gid": 10667,
      "project_name": "Shirley Central",
      "location": "Wyoming, United States"
    },
    {
      "company_id": 1416,
      "gid": 7937,
      "project_name": "Hot",
      "location": null
    },
    {
      "company_id": 1416,
      "gid": 4665,
      "project_name": "Fox Creek",
      "location": "Alberta, Canada"
    }
  ],
  "allOtherCompanyNews": [
    {
      "id": 106815,
      "company_id": 1416,
      "title": "Noble Plains Uranium Secures Strategic Ground in Heart of Shirley Basin Uranium District",
      "link": null,
      "date": "2025-06-03T13:41:00.000Z",
      "hidden": false
    },
    {
      "id": -201575,
      "company_id": 1416,
      "title": "Indigo Exploration Inc. Announces Name Change to Noble Plains Uranium Corp.",
      "link": null,
      "date": "2025-05-21T11:00:00.000Z",
      "hidden": false
    },
    {
      "id": 105194,
      "company_id": 1416,
      "title": "Indigo Exploration Inc. Announces Name Change to Noble Plains Uranium Corp.",
      "link": null,
      "date": "2025-05-20T11:00:00.000Z",
      "hidden": false
    },
    {
      "id": -199135,
      "company_id": 1416,
      "title": "Indigo Exploration Appoints New President and Grants Stock Options",
      "link": null,
      "date": "2025-05-05T12:00:00.000Z",
      "hidden": false
    },
    {
      "id": 98196,
      "company_id": 1416,
      "title": "Indigo Exploration Closes $1,325,444 Over-Subscribed Private Placement Financing",
      "link": null,
      "date": "2025-03-31T21:59:00.000Z",
      "hidden": false
    },
    {
      "id": 91182,
      "company_id": 1416,
      "title": "Indigo Exploration Announces Extension of Private Placement",
      "link": null,
      "date": "2025-03-13T22:52:00.000Z",
      "hidden": false
    },
    {
      "id": -172570,
      "company_id": 1416,
      "title": "Indigo Exploration Announces Date for Share Consolidation",
      "link": "https://www.newsfilecorp.com/release/243499/Indigo-Exploration-Announces-Date-for-Share-Consolidation",
      "date": "2025-03-05T22:59:00.000Z",
      "hidden": false
    },
    {
      "id": 85962,
      "company_id": 1416,
      "title": "Indigo Exploration Inc. Announces Share Consolidation and Financing",
      "link": "https://www.newsfilecorp.com/release/238942/Indigo-Exploration-Inc.-Announces-Share-Consolidation-and-Financing",
      "date": "2025-01-30T14:00:00.000Z",
      "hidden": false
    },
    {
      "id": 85284,
      "company_id": 1416,
      "title": "Indigo Encounters More than 160 Uranium Intercepts from Phase 1 Drilling on Shirley Basin Project, Wyoming",
      "link": "https://www.newsfilecorp.com/release/238508/Indigo-Encounters-More-than-160-Uranium-Intercepts-from-Phase-1-Drilling-on-Shirley-Basin-Project-Wyoming",
      "date": "2025-01-27T14:15:00.000Z",
      "hidden": false
    },
    {
      "id": 84379,
      "company_id": 1416,
      "title": "Indigo Completes Phase 1 Drilling on its Uranium Project in Shirley Basin, Wyoming",
      "link": "https://www.newsfilecorp.com/release/237437/Indigo-Completes-Phase-1-Drilling-on-its-Uranium-Project-in-Shirley-Basin-Wyoming",
      "date": "2025-01-16T17:03:00.000Z",
      "hidden": false
    }
  ]
}