{
  "article": {
    "id": 98706,
    "link": null,
    "title": "Alamos Gold Announces the Sale of Quartz Mountain Gold Project for Total Consideration of up to $21 million and 9.9% Equity in Q-Gold Resources",
    "description": "<html><head></head><body><div class=\"mw_release\"><p align=\"left\">All amounts are in United States dollars, unless otherwise stated.</p>  <p align=\"justify\">TORONTO, April  03, 2025  (GLOBE NEWSWIRE) -- <strong>Alamos Gold Inc.</strong> (<strong>TSX:AGI; NYSE:AGI</strong>) (“Alamos” or the “Company”) announced today that it has entered into a binding agreement to sell its non-core Quartz Mountain Gold Project (“Quartz Mountain”) located in Lake County, Oregon to Q-Gold Resources Ltd. (TSXV:QGR) (“Q-Gold”) for total consideration of up to $21 million and a 9.9% equity interest in Q-Gold (the “Transaction”). The Transaction is comprised of the following:</p> <table style=\"border-collapse: collapse; width:100%; border-collapse:collapse ;\"><tbody><tr><td style=\"vertical-align: top ; \">i.</td><td colspan=\"3\" style=\"text-align: justify ;  vertical-align: middle; vertical-align: top ; \">$2.85 million in cash and 9.9% of common share equity in Q-Gold upon closing of the Transaction</td></tr><tr><td style=\"max-width:3%; width:3%; min-width:3%;;vertical-align: top ; \">&nbsp;</td><td style=\"max-width:3%; width:3%; min-width:3%;;vertical-align: top ; \">&nbsp;</td><td style=\"max-width:3%; width:3%; min-width:3%;;vertical-align: top ; \">&nbsp;</td><td style=\"max-width:91%; width:91%; min-width:91%;;vertical-align: top ; \">&nbsp;</td></tr><tr><td style=\"vertical-align: top ; \">ii.</td><td colspan=\"3\" style=\"text-align: justify ;  vertical-align: middle; vertical-align: top ; \">$8.15 million of Guaranteed Payments in cash or common shares, at Alamos’ election, as follows:</td></tr><tr><td style=\"vertical-align: top ; \">&nbsp;</td><td style=\"vertical-align: top ; \">&nbsp;</td><td style=\"vertical-align: top ; \">&nbsp;</td><td style=\"vertical-align: top ; \">&nbsp;</td></tr><tr><td style=\"vertical-align: top ; \">&nbsp;</td><td style=\"vertical-align: top ; \">&nbsp;</td><td style=\"text-align: center ;  vertical-align: middle; vertical-align: top ; \">○</td><td style=\"text-align: justify ;  vertical-align: middle; vertical-align: top ; \">$3.15 million payable one year after the closing of the Transaction</td></tr><tr><td style=\"vertical-align: top ; \">&nbsp;</td><td style=\"vertical-align: top ; \">&nbsp;</td><td style=\"text-align: center ;  vertical-align: middle; vertical-align: top ; \">○</td><td style=\"text-align: justify ;  vertical-align: middle; vertical-align: top ; \">$2.5 million payable two years after the closing of the Transaction</td></tr><tr><td style=\"vertical-align: top ; \">&nbsp;</td><td style=\"vertical-align: top ; \">&nbsp;</td><td style=\"text-align: center ;  vertical-align: middle; vertical-align: top ; \">○</td><td style=\"text-align: justify ;  vertical-align: middle; vertical-align: top ; \">$2.5 million payable three years after the closing of the Transaction</td></tr><tr><td style=\"vertical-align: top ; \">&nbsp;</td><td style=\"vertical-align: top ; \">&nbsp;</td><td style=\"vertical-align: top ; \">&nbsp;</td><td style=\"vertical-align: top ; \">&nbsp;</td></tr><tr><td style=\"vertical-align: top ; \">iii.</td><td colspan=\"3\" style=\"text-align: justify ;  vertical-align: middle; vertical-align: top ; \">$10 million of Milestone Payments in cash or common shares, at Alamos’ election, as follows:</td></tr><tr><td style=\"vertical-align: top ; \">&nbsp;</td><td style=\"vertical-align: top ; \">&nbsp;</td><td style=\"vertical-align: top ; \">&nbsp;</td><td style=\"vertical-align: top ; \">&nbsp;</td></tr><tr><td style=\"vertical-align: top ; \">&nbsp;</td><td style=\"vertical-align: top ; \">&nbsp;</td><td style=\"text-align: center ;  vertical-align: middle; vertical-align: top ; \">○</td><td style=\"text-align: justify ;  vertical-align: middle; vertical-align: top ; \">$5 million payable upon the earlier of (i) completion of a Feasibility Study, or (ii) announcing a construction decision on Quartz Mountain</td></tr><tr><td style=\"vertical-align: top ; \">&nbsp;</td><td style=\"vertical-align: top ; \">&nbsp;</td><td style=\"text-align: center ;  vertical-align: middle; vertical-align: top ; \">○</td><td style=\"text-align: justify ;  vertical-align: middle; vertical-align: top ; \">$5 million payable upon receiving the key permits required for the construction and operation of Quartz Mountain</td></tr><tr><td style=\"vertical-align: top ; \">&nbsp;</td><td style=\"vertical-align: top ; \">&nbsp;</td><td style=\"text-align: center ;  vertical-align: middle; vertical-align: top ; \">&nbsp;</td><td style=\"text-align: justify ;  vertical-align: middle; vertical-align: top ; \">&nbsp;</td></tr></tbody></table> <p align=\"justify\">“The sale of Quartz Mountain is consistent with our strategy of monetizing non-core assets as we develop our portfolio of high-return growth projects including the Phase 3+ Expansion at Island Gold, Lynn Lake, and PDA,” said John A. McCluskey, President and Chief Executive Officer.</p>  <p align=\"justify\">“As a Forbes &amp; Manhattan backed company, Q-Gold is well positioned to advance Quartz Mountain and we look forward to participating in the future success of the project as a significant shareholder,” Mr. McCluskey added.</p>  <p align=\"justify\">The Q-Gold common shares to be issued to Alamos upon closing of the Transaction, or at a later date, are to be based on a 10-day volume weighted average trading price prior to the date of issuance. Torys LLP is acting as legal advisor to Alamos.</p>  <p align=\"justify\">The Transaction is expected to close in the second quarter of 2025 and is subject to customary closing conditions for a transaction of this nature.</p>  <p align=\"justify\"><strong>About Alamos</strong></p>  <p align=\"justify\">Alamos is a Canadian-based intermediate gold producer with diversified production from three operating mines in North America. This includes the Island Gold District and the Young-Davidson mine in northern Ontario, Canada, and the Mulatos District in Sonora State, Mexico. Additionally, the Company has a significant portfolio of development stage projects, including the Phase 3+ Expansion at Island Gold, and the Lynn Lake project in Manitoba, Canada. Alamos employs more than 2,400 people and is committed to the highest standards of sustainable development. The Company’s shares are traded on the TSX and NYSE under the symbol “AGI”.</p>  <p align=\"justify\">FOR FURTHER INFORMATION, PLEASE CONTACT:</p>  <p align=\"justify\"><strong>Scott K. Parsons</strong> <br>Senior Vice President, Corporate Development &amp; Investor Relations <br>(416) 368-9932 x 5439</p>  <p align=\"justify\"><strong>Khalid Elhaj</strong><br>Vice President, Business Development &amp; Investor Relations<br>(416) 368-9932 x 5427<br><a href=\"mailto:ir@alamosgold.com\" rel=\"nofollow\" target=\"_blank\">ir@alamosgold.com</a>&nbsp;</p>  <p align=\"justify\"><em>The TSX and NYSE have not reviewed and do not accept responsibility for the adequacy or accuracy of this release.</em></p>  <p align=\"justify\"><strong>Cautionary Note regarding Forward-Looking Statements</strong></p>  <p align=\"justify\">This news release contains or incorporates by reference “forward-looking statements” and “forward-looking information” as defined under applicable Canadian and U.S. securities laws. All statements in this news release other than statements of historical fact, which address events, results, outcomes or developments that Alamos expects to occur are, or may be deemed to be, forward-looking statements. Forward-looking statements are generally, but not always, identified by the use of forward-looking terminology such as \"expect\", “anticipate”, assume”, \"plan\", “future”, \"estimate\", “prospective” or “potential” or variations of such words and phrases and similar expressions or statements that certain actions, events or results \"may\", \"could\", \"would\", \"might\" or \"will\" be taken, occur or be achieved or the negative connotation of such terms. Forward-looking statements contained in this news release are based on expectations, estimates and projections as at the date of this news release.</p>  <p align=\"justify\">Forward-looking statements in this news release include, without limitation, information and expectations as to strategy, plans, future financial and operating performance regarding: closing of the Transaction and expected timing of the closing; total quantum of consideration payable to Alamos for the Transaction; Q-Gold being well positioned to advance the Quartz Mountain Project; anticipated future success of the Quartz Mountain Project; and the nature of the Phase 3+ Expansion at Island Gold and the Lynn Lake and PDA projects as high-return growth projects.</p>  <p align=\"justify\">Alamos cautions that forward-looking statements are necessarily based upon several factors and assumptions that, while considered reasonable by management at the time of making such statements, are inherently subject to significant business, economic, technical, legal, political and competitive uncertainties and contingencies. Known and unknown factors could cause actual results to differ materially from those projected in the forward-looking statements, and undue reliance should not be placed on such statements and information.</p>  <p align=\"justify\">These factors and assumptions include, but are not limited to: failure by either party to meet requisite closing conditions for the Transaction; actions required to trigger Milestone Payments not being implemented or coming to fruition; changes within Q-Gold, or issues with respect to permitting and/or construction causing non-advancement of the Quartz Mountain project; the actual results of current exploration activities; conclusions of economic and geological evaluations; changes in project parameters as plans continue to be refined; operations may be exposed to serious illness, disease, epidemics and/or pandemics, any regulatory responses to same, and any of their associated impacts on the broader market; changes in national and local government legislation, controls or regulations; failure to comply with environmental and health and safety laws and regulations; labour and contractor availability (and being able to secure the same on favourable terms); ability to sell or deliver gold doré bars; disruptions in the maintenance or provision of required infrastructure and information technology systems; fluctuations in the price of gold or certain other commodities such as, diesel fuel, natural gas, and electricity; operating or technical difficulties in connection with mining or development activities, including geotechnical challenges and changes to production estimates (which assume accuracy of projected ore grade, mining rates, recovery timing and recovery rate estimates and may be impacted by unscheduled maintenance); changes in foreign exchange rates (particularly the Canadian dollar, U.S. dollar, Mexican peso and Turkish Lira); the impact of inflation, the implementation of tariffs, trade barriers and/or regulatory costs; employee and community relations; litigation and administrative proceedings; disruptions affecting operations; availability of and increased costs associated with mining inputs and labour; risks associated with the start-up of new mines; delays with the Phase 3+ Expansion Project at the Island Gold mine; delays in the development or updating of mine plans; delays in the construction of the Lynn Lake Project or the Puerto Del Aire Project; changes that may be required to the intended method of accessing and mining the deposit at Puerto Del Aire and Lynn Lake projects; inherent risks and hazards associated with mining and mineral processing including environmental hazards, industrial accidents, unusual or unexpected formations, pressures and cave-ins; the risk that the Company’s mines may not perform as planned; uncertainty with the Company's ability to secure additional capital to execute its business plans; the speculative nature of mineral exploration and development; risks in obtaining and maintaining necessary licenses, permits and authorizations for the Company’s development stage and operating assets; risk that required amendments to existing permits for the Lynn Lake project to accommodate the Burnt Timber and Linkwood deposits may not be obtained; contests over title to properties; expropriation or nationalization of property; political or economic developments in Canada, Mexico, the United States, Türkiye and other jurisdictions in which the Company may carry on business in the future; increased costs and risks related to the potential impact of climate change; the costs and timing of construction and development of new deposits; effects of construction decisions, risk of loss due to sabotage, protests and other civil disturbances; the impact of global liquidity and credit availability and the values of assets and liabilities based on projected future cash flows; and business opportunities that may be pursued by the Company.</p>  <p align=\"justify\">For a more detailed discussion of such risks and other factors that may affect the Company's ability to achieve the expectations set forth in the forward-looking statements contained in this news release, see the Company’s latest 40-F/Annual Information Form and Management’s Discussion and Analysis, each under the heading “Risk Factors”, available on the SEDAR+ website at www.sedarplus.ca or on EDGAR at www.sec.gov. The foregoing should be reviewed in conjunction with the information and risk factors and assumptions found in this news release.</p>  <p align=\"justify\">The Company disclaims any intention or obligation to update or revise any forward-looking statements, whether written or oral, or whether as a result of new information, future events or otherwise, except as required by applicable law.</p> <img alt=\"\" class=\"__GNW8366DE3E__IMG\" src=\"https://www.globenewswire.com/newsroom/ti?nf=OTQxNjc3OSM2ODUwMjQyIzIwMDkyMjI=\"> <br><img alt=\"\" src=\"https://ml.globenewswire.com/media/ZTc1YjZjZWMtMzUxYi00NjllLTgyNTgtNWRlZjY3NzU1ZWU2LTEwMjA3OTUtMjAyNS0wNC0wMy1lbg==/tiny/Alamos-Gold-Inc-.png\" referrerpolicy=\"no-referrer-when-downgrade\"></div></body></html>",
    "search_terms": "Quartz Mountain,Alamos Gold Inc.,AGI",
    "master_gid": 10182,
    "date": "2025-04-03T21:00:00.000Z",
    "tags": "USA|Oregon||Gold|Project Acquisition",
    "image_id": null,
    "hidden": false,
    "company_id": 865,
    "provider": "globenewswire",
    "excerpt": "Alamos Gold Inc. (TSX:AGI; NYSE:AGI) (“Alamos” or the “Company”) announced today that it has entered into a binding agreement to sell its non-core Quartz Mountain Gold Project (“Quartz Mountain”) located in Lake County, Oregon to Q-Gold Resources...",
    "is_regulatory": false,
    "refined_tags": null,
    "ftp_filename": null,
    "company_name": "Alamos Gold Inc.",
    "exchange": "TSX",
    "root_ticker": "AGI",
    "project_name": "Quartz Mountain",
    "gid": 10182,
    "location": "Oregon, United States",
    "plan_id": null,
    "description_text": "All amounts are in United States dollars, unless otherwise stated. TORONTO, April  03, 2025  (GLOBE NEWSWIRE) -- Alamos Gold Inc. ( TSX:AGI; NYSE:AGI ) (“Alamos” or the “Company”) announced today that it has entered into a binding agreement to sell its non-core Quartz Mountain Gold Project (“Quartz Mountain”) located in Lake County, Oregon to Q-Gold Resources Ltd. (TSXV:QGR) (“Q-Gold”) for total consideration of up to $21 million and a 9.9% equity interest in Q-Gold (the “Transaction”). The Transaction is comprised of the following: i. $2.85 million in cash and 9.9% of common share equity in Q-Gold upon closing of the Transaction ii. $8.15 million of Guaranteed Payments in cash or common shares, at Alamos’ election, as follows: ○ $3.15 million payable one year after the closing of the Transaction ○ $2.5 million payable two years after the closing of the Transaction ○ $2.5 million payable three years after the closing of the Transaction iii. $10 million of Milestone Payments in cash or common shares, at Alamos’ election, as follows: ○ $5 million payable upon the earlier of (i) completion of a Feasibility Study, or (ii) announcing a construction decision on Quartz Mountain ○ $5 million payable upon receiving the key permits required for the construction and operation of Quartz Mountain “The sale of Quartz Mountain is consistent with our strategy of monetizing non-core assets as we develop our portfolio of high-return growth projects including the Phase 3+ Expansion at Island Gold, Lynn Lake, and PDA,” said John A. McCluskey, President and Chief Executive Officer. “As a Forbes & Manhattan backed company, Q-Gold is well positioned to advance Quartz Mountain and we look forward to participating in the future success of the project as a significant shareholder,” Mr. McCluskey added. The Q-Gold common shares to be issued to Alamos upon closing of the Transaction, or at a later date, are to be based on a 10-day volume weighted average trading price prior to the date of issuance. Torys LLP is acting as legal advisor to Alamos. The Transaction is expected to close in the second quarter of 2025 and is subject to customary closing conditions for a transaction of this nature. About Alamos Alamos is a Canadian-based intermediate gold producer with diversified production from three operating mines in North America. This includes the Island Gold District and the Young-Davidson mine in northern Ontario, Canada, and the Mulatos District in Sonora State, Mexico. Additionally, the Company has a significant portfolio of development stage projects, including the Phase 3+ Expansion at Island Gold, and the Lynn Lake project in Manitoba, Canada. Alamos employs more than 2,400 people and is committed to the highest standards of sustainable development. The Company’s shares are traded on the TSX and NYSE under the symbol “AGI”. FOR FURTHER INFORMATION, PLEASE CONTACT: Scott K. Parsons Senior Vice President, Corporate Development & Investor Relations (416) 368-9932 x 5439 Khalid Elhaj Vice President, Business Development & Investor Relations (416) 368-9932 x 5427 ir@alamosgold.com The TSX and NYSE have not reviewed and do not accept responsibility for the adequacy or accuracy of this release. Cautionary Note regarding Forward-Looking Statements This news release contains or incorporates by reference “forward-looking statements” and “forward-looking information” as defined under applicable Canadian and U.S. securities laws. All statements in this news release other than statements of historical fact, which address events, results, outcomes or developments that Alamos expects to occur are, or may be deemed to be, forward-looking statements. Forward-looking statements are generally, but not always, identified by the use of forward-looking terminology such as \"expect\", “anticipate”, assume”, \"plan\", “future”, \"estimate\", “prospective” or “potential” or variations of such words and phrases and similar expressions or statements that certain actions, events or results \"may\", \"could\", \"would\", \"might\" or \"will\" be taken, occur or be achieved or the negative connotation of such terms. Forward-looking statements contained in this news release are based on expectations, estimates and projections as at the date of this news release. Forward-looking statements in this news release include, without limitation, information and expectations as to strategy, plans, future financial and operating performance regarding: closing of the Transaction and expected timing of the closing; total quantum of consideration payable to Alamos for the Transaction; Q-Gold being well positioned to advance the Quartz Mountain Project; anticipated future success of the Quartz Mountain Project; and the nature of the Phase 3+ Expansion at Island Gold and the Lynn Lake and PDA projects as high-return growth projects. Alamos cautions that forward-looking statements are necessarily based upon several factors and assumptions that, while considered reasonable by management at the time of making such statements, are inherently subject to significant business, economic, technical, legal, political and competitive uncertainties and contingencies. Known and unknown factors could cause actual results to differ materially from those projected in the forward-looking statements, and undue reliance should not be placed on such statements and information. These factors and assumptions include, but are not limited to: failure by either party to meet requisite closing conditions for the Transaction; actions required to trigger Milestone Payments not being implemented or coming to fruition; changes within Q-Gold, or issues with respect to permitting and/or construction causing non-advancement of the Quartz Mountain project; the actual results of current exploration activities; conclusions of economic and geological evaluations; changes in project parameters as plans continue to be refined; operations may be exposed to serious illness, disease, epidemics and/or pandemics, any regulatory responses to same, and any of their associated impacts on the broader market; changes in national and local government legislation, controls or regulations; failure to comply with environmental and health and safety laws and regulations; labour and contractor availability (and being able to secure the same on favourable terms); ability to sell or deliver gold doré bars; disruptions in the maintenance or provision of required infrastructure and information technology systems; fluctuations in the price of gold or certain other commodities such as, diesel fuel, natural gas, and electricity; operating or technical difficulties in connection with mining or development activities, including geotechnical challenges and changes to production estimates (which assume accuracy of projected ore grade, mining rates, recovery timing and recovery rate estimates and may be impacted by unscheduled maintenance); changes in foreign exchange rates (particularly the Canadian dollar, U.S. dollar, Mexican peso and Turkish Lira); the impact of inflation, the implementation of tariffs, trade barriers and/or regulatory costs; employee and community relations; litigation and administrative proceedings; disruptions affecting operations; availability of and increased costs associated with mining inputs and labour; risks associated with the start-up of new mines; delays with the Phase 3+ Expansion Project at the Island Gold mine; delays in the development or updating of mine plans; delays in the construction of the Lynn Lake Project or the Puerto Del Aire Project; changes that may be required to the intended method of accessing and mining the deposit at Puerto Del Aire and Lynn Lake projects; inherent risks and hazards associated with mining and mineral processing including environmental hazards, industrial accidents, unusual or unexpected formations, pressures and cave-ins; the risk that the Company’s mines may not perform as planned; uncertainty with the Company's ability to secure additional capital to execute its business plans; the speculative nature of mineral exploration and development; risks in obtaining and maintaining necessary licenses, permits and authorizations for the Company’s development stage and operating assets; risk that required amendments to existing permits for the Lynn Lake project to accommodate the Burnt Timber and Linkwood deposits may not be obtained; contests over title to properties; expropriation or nationalization of property; political or economic developments in Canada, Mexico, the United States, Türkiye and other jurisdictions in which the Company may carry on business in the future; increased costs and risks related to the potential impact of climate change; the costs and timing of construction and development of new deposits; effects of construction decisions, risk of loss due to sabotage, protests and other civil disturbances; the impact of global liquidity and credit availability and the values of assets and liabilities based on projected future cash flows; and business opportunities that may be pursued by the Company. For a more detailed discussion of such risks and other factors that may affect the Company's ability to achieve the expectations set forth in the forward-looking statements contained in this news release, see the Company’s latest 40-F/Annual Information Form and Management’s Discussion and Analysis, each under the heading “Risk Factors”, available on the SEDAR+ website at www.sedarplus.ca or on EDGAR at www.sec.gov. The foregoing should be reviewed in conjunction with the information and risk factors and assumptions found in this news release. The Company disclaims any intention or obligation to update or revise any forward-looking statements, whether written or oral, or whether as a result of new information, future events or otherwise, except as required by applicable law.",
    "primary_commodity": "Au"
  },
  "articleProject": {
    "gid": 10182,
    "project_name": "Quartz Mountain",
    "location": "Oregon, United States"
  },
  "articleExchange": "TSX",
  "articleCompanyId": 865,
  "articleTicker": "AGI",
  "articleCompanyName": "Alamos Gold Inc.",
  "allOtherCompanyProjects": [
    {
      "company_id": 865,
      "gid": 6991,
      "project_name": "Camyurt",
      "location": "Turkey"
    },
    {
      "company_id": 865,
      "gid": 2198,
      "project_name": "Lynn Lake",
      "location": "Manitoba, Canada"
    },
    {
      "company_id": 865,
      "gid": 3740,
      "project_name": "Mulatos",
      "location": "Sonora, Mexico"
    },
    {
      "company_id": 865,
      "gid": 5555,
      "project_name": "Agi Dagi",
      "location": "Turkey"
    },
    {
      "company_id": 865,
      "gid": 1522,
      "project_name": "Island Gold",
      "location": "Ontario, Canada"
    },
    {
      "company_id": 865,
      "gid": 5554,
      "project_name": "Kirazli",
      "location": "Turkey"
    },
    {
      "company_id": 865,
      "gid": 1521,
      "project_name": "Young-Davidson",
      "location": "Ontario, Canada"
    },
    {
      "company_id": 865,
      "gid": 10182,
      "project_name": "Quartz Mountain",
      "location": "Oregon, United States"
    }
  ],
  "allOtherCompanyNews": [
    {
      "id": 106420,
      "company_id": 865,
      "title": "Alamos Gold Announces Results of the Annual General and Special Meeting of Shareholders and Changes to its Board of Directors",
      "link": null,
      "date": "2025-05-30T17:00:00.000Z",
      "hidden": false
    },
    {
      "id": 106200,
      "company_id": 865,
      "title": "Alamos Gold Declares Quarterly Dividend",
      "link": null,
      "date": "2025-05-29T10:55:00.000Z",
      "hidden": false
    },
    {
      "id": 102868,
      "company_id": 865,
      "title": "Alamos Gold Reports First Quarter 2025 Results",
      "link": null,
      "date": "2025-04-30T21:00:00.000Z",
      "hidden": false
    },
    {
      "id": 98706,
      "company_id": 865,
      "title": "Alamos Gold Announces the Sale of Quartz Mountain Gold Project for Total Consideration of up to $21 million and 9.9% Equity in Q-Gold Resources",
      "link": null,
      "date": "2025-04-03T21:00:00.000Z",
      "hidden": false
    },
    {
      "id": 98278,
      "company_id": 865,
      "title": "Alamos Gold Provides Notice of First Quarter 2025 Results and Conference Call, and Annual General and Special Meeting of Shareholders",
      "link": null,
      "date": "2025-04-01T10:55:00.000Z",
      "hidden": false
    },
    {
      "id": 98169,
      "company_id": 865,
      "title": "Alamos Gold Provides Notice of Completion of Annual Filings",
      "link": null,
      "date": "2025-03-31T19:00:00.000Z",
      "hidden": false
    },
    {
      "id": 89399,
      "company_id": 865,
      "title": "Alamos Gold Declares Quarterly Dividend",
      "link": "https://www.globenewswire.com/news-release/2025/02/27/3033668/0/en/Alamos-Gold-Declares-Quarterly-Dividend.html",
      "date": "2025-02-27T11:55:00.000Z",
      "hidden": false
    },
    {
      "id": 88501,
      "company_id": 865,
      "title": "Alamos Gold Reports Fourth Quarter and Year-End 2024 Results",
      "link": "https://www.globenewswire.com/news-release/2025/02/19/3029218/0/en/Alamos-Gold-Reports-Fourth-Quarter-and-Year-End-2024-Results.html",
      "date": "2025-02-19T22:00:00.000Z",
      "hidden": false
    },
    {
      "id": 88250,
      "company_id": 865,
      "title": "Alamos Gold Reports Mineral Reserves and Resources for the Year-Ended 2024",
      "link": "https://www.globenewswire.com/news-release/2025/02/18/3028376/0/en/Alamos-Gold-Reports-Mineral-Reserves-and-Resources-for-the-Year-Ended-2024.html",
      "date": "2025-02-18T22:00:00.000Z",
      "hidden": false
    },
    {
      "id": 87804,
      "company_id": 865,
      "title": "Alamos Gold Announces Development Plan for High-Return Burnt Timber and Linkwood Satellite Deposits",
      "link": "https://www.globenewswire.com/news-release/2025/02/13/3026336/0/en/Alamos-Gold-Announces-Development-Plan-for-High-Return-Burnt-Timber-and-Linkwood-Satellite-Deposits.html",
      "date": "2025-02-13T22:00:00.000Z",
      "hidden": false
    }
  ]
}
