{
  "article": {
    "id": 54078,
    "link": "https://www.accesswire.com/viewarticle.aspx?id=864471&lang=en",
    "title": "Usha Resources Executes Letter of Intent To Sell Up to 90% of the Jackpot Lake Lithium Brine Project for Total Consideration of up to US$26,025,000",
    "description": "<p><strong id=\"dateline\">VANCOUVER, BC / ACCESSWIRE / May 17, 2024 / </strong><strong>Usha Resources Ltd. (&quot;USHA&quot; or the &quot;Company&quot;) (TSXV:USHA)(OTCQB:USHAF)(FSE:JO0)</strong>, a North American lithium exploration company, is pleased to announce that it has entered into a Letter of Intent (the &quot;<strong>LOI</strong>&quot;) with Stardust Power, Inc. (&quot;<strong>Stardust Power</strong>&quot;) dated March 15, 2024 granting Stardust Power the right to earn up to a 90% interest subject to a 2% Net Smelter Royalty (&quot;<strong>NSR</strong>&quot;) in Usha's Jackpot Lake Lithium Brine Project (&quot;<strong>Jackpot Lake</strong>&quot; or the &quot;<strong>Project</strong>&quot;).</p><p>If the parties enter into definitive agreements covering the transaction, (i) depending on the earn-in level, the total consideration could total up to US$26,025,000 over five years inclusive of payments comprising US$1,525,000 cash, US$750,000 stock, US$15,750,000 stock or cash at Stardust Power's election, and a work commitment of (US$8M). Upon completion of the full earn-in including NSR buyback, Usha would retain 10% of the Project and a 2% NSR and would be carried in the Joint Venture (&quot;<strong>JV</strong>&quot;) formed between Usha and Stardust Power until a formal Decision to Mine is reached following completion of a Feasibility Study. Stardust would be permitted to buy back 1% NSR for a cash payment of US$7.5M.</p><p>A non-refundable sum of US$75,000 has been paid to Usha by Stardust Power pursuant to the LOI. The LOI is non-binding, other than Usha's agreement to not engage or communicate with any other party with respect to the Project through September 2024. The transaction is subject to the satisfaction of a number of conditions, including Stardust Power's satisfactory commercial and legal due diligence, the negotiation and execution of definitive agreements (the &quot;<strong>Definitive Agreement</strong>&quot;) and the approval of the TSX Venture Exchange. The Company cautions that there is no guarantee that the Definitive Agreement will be completed or that the other conditions will be satisfied including the listing of Stardust Power on NASDAQ.</p><p>Stardust Power is developing a lithium refinery facility in Muskogee, Oklahoma, with capacity of producing up to 50,000 tons per annum of battery grade lithium carbonate (&quot;<strong>BGLC</strong>&quot;) once fully operational. Stardust Power's battery-grade lithium refinery will be designed and manufactured to foster lower carbon energy independence for the United States. Stardust Power seeks to become a sustainable, cost-effective supplier of BGLC, primarily for the electric vehicle (&quot;<strong>EV</strong>&quot;) market, through the development of its innovative, large central refinery (the &quot;<strong>Facility</strong>&quot;) optimized for multiple inputs of different types of lithium brine, including concentrated lithium brine, lithium chloride, or technical and crude grade lithium feedstocks. Once completed, Stardust Power expects to secure multiple sources of feedstock from various lithium producers, with the Facility becoming one of the largest lithium refineries in the United States.</p><p>Stardust Power is expected to become a publicly traded company on Nasdaq under the ticker symbol &quot;SDST&quot; via a planned business combination with Global Partner Acquisition Corp II (NASDAQ:GPAC), a special purpose acquisition company. The transaction is expected to be completed during the first half of 2024.<sup> 1</sup></p><p>Deepak Varshney, CEO of Usha commented: &quot;The development of the Jackpot Lake Lithium Brine Project is a key focus of our company. We demonstrated in 2023 that there was significant potential at this Project, and we look forward to returning to the Project this year to build on last year's successes.&quot;</p><p>Mr. Varshney continued: &quot;Our strategic vision at Usha has always been to acquire and monetize undervalued assets. With the recent success of companies such as Abitibi Metals, we have been evaluating opportunities to acquire advanced-stage copper and/or gold projects to create further shareholder value in a similar fashion. A number of project reviews have already been completed, and the Company looks forward to keeping shareholders up to date on the progress of its strategy.&quot;</p><p>Pursuant to the LOI, the Company has agreed to pay 2818390 Ontario Corp (the &quot;Finder&quot;) a finder's fee for the Finder's assistance with the proposed sale of the Jackpot Lake Project equal to (i) 10% on the first $300,000 in Transaction Value, (ii) 7.5% on $300,000 to $1,000,000 in Transaction Value, and (iii) 5% on the Transaction Value over $1,000,000 in the consideration received directly from Stardust Power, Inc. by Usha.</p><p><strong>Jackpot Lake Lithium Brine Property</strong></p><p>USHA's Jackpot Lake Lithium Brine Project is located within Clark County, 35 kilometers northeast of Las Vegas, Nevada, and is comprised of 442 optioned and staked mineral claims that total 8,714 acres (approximately 35.3 km<sup>2</sup>).</p><p>The Project's geologic setting is similar to that of Albemarle's Silver Peak Nevada Lithium Mine, the only producing lithium mine in North America, which has operated continuously since 1966, where sediments from lithium‑rich surrounding source rocks accumulate and fill the deposit leading to a potential concentration of lithium brine due to successive evaporation and concentration events.</p><p>Modelling indicates that the Project target comprises the entirety of the Company's core optioned claim block (2,800 acres; 11.3 km<sup>2</sup>) and is open in all directions for expansion. The target is shallow, predominantly above bedrock depths of 600 meters, and is approximately 450 meters thick. The total basin within which the target is situated is estimated to be approximately 10,900 acres of which the Company now controls 8,714 acres.</p><p><strong>Qualified Person</strong></p><p>The technical content of this news release has been reviewed and approved by Mr. Deepak Varshney, P.Geo., a qualified person as defined by National Instrument 43-101 Standards of Disclosure for Mineral Projects (&quot;NI 43-101&quot;).</p><p><strong>About Usha Resources Ltd.</strong></p><p>Usha Resources Ltd. is a North American mineral acquisition and exploration company focused on the development of quality lithium metal properties that are drill-ready with high-upside and expansion potential. Based in Vancouver, BC, Usha's portfolio of strategic properties provides target-rich diversification and includes Jackpot Lake, a lithium brine project in Nevada and White Willow, a lithium pegmatite project in Ontario that is the flagship among its growing portfolio of hard-rock lithium assets. Usha trades on the TSX Venture Exchange under the symbol USHA, the OTCQB Exchange under the symbol USHAF and the Frankfurt Stock Exchange under the symbol JO0.</p><p><strong>USHA RESOURCES LTD.</strong></p><p>&quot;Deepak Varshney&quot; CEO and Director</p><p>For more information, please call 778-899-1780, email <a rel=\"nofollow\" href=\"mailto:info@usharesources.com\">info@usharesources.com</a> or visit <a rel=\"nofollow\" href=\"https://pr.report/M0FWsu-7\">www.usharesources.com</a>.</p><p><i>Neither TSX Venture Exchange nor its Regulation Services Provider (as that term is defined in policies of the TSX Venture Exchange) accepts responsibility for the adequacy or accuracy of this release.</i></p><p><strong>About Stardust Power Inc.</strong></p><p>Stardust Power Inc. is a development stage manufacturer and refiner of battery-grade lithium products designed to supply the EV industry and help secure America's leadership in the energy transition. Stardust Power is developing a strategically central lithium refinery in Muskogee, Oklahoma with the anticipated capacity of producing up to 50,000 tonnes per annum of battery-grade lithium. Committed to sustainability at each point in the process. Stardust Power is expected to become a publicly traded company on Nasdaq under the ticker symbol &quot;SDST&quot; via a planned business combination with Global Partner Acquisition Corp II (&quot;GPAC II&quot;) (NASDAQ:GPAC), a special purpose acquisition company.</p><p><strong>Forward-looking statements:</strong></p><p><i>This news release may include &quot;forward-looking information&quot; under applicable Canadian securities legislation. Forward-looking information includes, but is not limited to, statements about entering into a Definitive Agreement and completion of the Jackpot Lake transaction with Stardust Power, strategic plans, future work programs and objectives and expected results from such work programs. Forward-looking information necessarily involve known and unknown risks, including, without limitation: Usha and Stardust entering into the Definitive Agreement; risks associated with general economic conditions; inability to access sufficient capital from internal and external sources, and/or inability to access sufficient capital on favourable terms; and other risks.</i></p><p><i>Such forward-looking information reflects management's current beliefs and are based on a number of estimates and/or assumptions made by and information currently available to the Company that, while considered reasonable, are subject to known and unknown risks, uncertainties, and other factors that may cause the actual results and future events to differ materially from those expressed or implied by such forward-looking information. Readers are cautioned that such forward-looking information are neither promises nor guarantees and are subject to known and unknown risks and uncertainties including, but not limited to, general business, economic, competitive, political and social uncertainties, uncertain and volatile equity and capital markets, lack of available capital, actual results of exploration activities, environmental risks, future prices of base and other metals, operating risks, accidents, labour issues, delays in obtaining governmental approvals and permits, and other risks in the mining industry.</i></p><p><i>The Company is presently an exploration stage company. Exploration is highly speculative in nature, involves many risks, requires substantial expenditures, and may not result in the discovery of mineral deposits that can be mined profitably. Furthermore, the Company currently has no reserves on any of its properties. As a result, there can be no assurance that such forward-looking statements will prove to be accurate, and actual results and future events could differ materially from those anticipated in such statements.</i> <br />____________________________________</p><p>i. <a rel=\"nofollow\" href=\"https://pr.report/NxdX2QpG\">https://www.sec.gov/Archives/edgar/data/1831979/000119312524134360/d656463ds4a.htm</a></p><p><strong>SOURCE:</strong> Usha Resources Ltd.</p><img src='https://www.accesswire.com/img.ashx?id=864471'/><br><br>View the original <a href='https://www.accesswire.com/864471/usha-resources-executes-letter-of-intent-to-sell-up-to-90-of-the-jackpot-lake-lithium-brine-project-for-total-consideration-of-up-to-us26025000'>press release</a> on accesswire.com<br><br>",
    "search_terms": "Jackpot Lake,Usha Resources Ltd.,USHA",
    "master_gid": 2762,
    "date": "2024-05-17T11:00:00.000Z",
    "tags": "|||Lithium|Project Acquisition",
    "image_id": null,
    "hidden": false,
    "company_id": 1827,
    "provider": "accesswire",
    "excerpt": "VANCOUVER, BC / ACCESSWIRE / May 17, 2024 /Usha Resources Ltd. (&quot;USHA&quot; or the &quot;Company&quot;) (TSXV:USHA)(OTCQB:USHAF)(FSE:JO0), a North American lithium exploration company, is pleased to announce that it has entered into a Letter of Intent (the &quot;LOI&quot;) with Stardust Power, Inc. (&quot;Stardust Power&quot;) dated March 15, 2024 granting Stardust Power",
    "is_regulatory": false,
    "refined_tags": [
      "Project Acquisition"
    ],
    "ftp_filename": null,
    "company_name": "Stardust Power, Inc.",
    "exchange": "TSXV",
    "root_ticker": "USHA",
    "project_name": "Jackpot Lake",
    "gid": 2762,
    "location": "Nevada, United States",
    "plan_id": null,
    "description_text": "VANCOUVER, BC / ACCESSWIRE / May 17, 2024 / Usha Resources Ltd. (\"USHA\" or the \"Company\") (TSXV:USHA)(OTCQB:USHAF)(FSE:JO0) , a North American lithium exploration company, is pleased to announce that it has entered into a Letter of Intent (the \" LOI \") with Stardust Power, Inc. (\" Stardust Power \") dated March 15, 2024 granting Stardust Power the right to earn up to a 90% interest subject to a 2% Net Smelter Royalty (\" NSR \") in Usha's Jackpot Lake Lithium Brine Project (\" Jackpot Lake \" or the \" Project \"). If the parties enter into definitive agreements covering the transaction, (i) depending on the earn-in level, the total consideration could total up to US$26,025,000 over five years inclusive of payments comprising US$1,525,000 cash, US$750,000 stock, US$15,750,000 stock or cash at Stardust Power's election, and a work commitment of (US$8M). Upon completion of the full earn-in including NSR buyback, Usha would retain 10% of the Project and a 2% NSR and would be carried in the Joint Venture (\" JV \") formed between Usha and Stardust Power until a formal Decision to Mine is reached following completion of a Feasibility Study. Stardust would be permitted to buy back 1% NSR for a cash payment of US$7.5M. A non-refundable sum of US$75,000 has been paid to Usha by Stardust Power pursuant to the LOI. The LOI is non-binding, other than Usha's agreement to not engage or communicate with any other party with respect to the Project through September 2024. The transaction is subject to the satisfaction of a number of conditions, including Stardust Power's satisfactory commercial and legal due diligence, the negotiation and execution of definitive agreements (the \" Definitive Agreement \") and the approval of the TSX Venture Exchange. The Company cautions that there is no guarantee that the Definitive Agreement will be completed or that the other conditions will be satisfied including the listing of Stardust Power on NASDAQ. Stardust Power is developing a lithium refinery facility in Muskogee, Oklahoma, with capacity of producing up to 50,000 tons per annum of battery grade lithium carbonate (\" BGLC \") once fully operational. Stardust Power's battery-grade lithium refinery will be designed and manufactured to foster lower carbon energy independence for the United States. Stardust Power seeks to become a sustainable, cost-effective supplier of BGLC, primarily for the electric vehicle (\" EV \") market, through the development of its innovative, large central refinery (the \" Facility \") optimized for multiple inputs of different types of lithium brine, including concentrated lithium brine, lithium chloride, or technical and crude grade lithium feedstocks. Once completed, Stardust Power expects to secure multiple sources of feedstock from various lithium producers, with the Facility becoming one of the largest lithium refineries in the United States. Stardust Power is expected to become a publicly traded company on Nasdaq under the ticker symbol \"SDST\" via a planned business combination with Global Partner Acquisition Corp II (NASDAQ:GPAC), a special purpose acquisition company. The transaction is expected to be completed during the first half of 2024. 1 Deepak Varshney, CEO of Usha commented: \"The development of the Jackpot Lake Lithium Brine Project is a key focus of our company. We demonstrated in 2023 that there was significant potential at this Project, and we look forward to returning to the Project this year to build on last year's successes.\" Mr. Varshney continued: \"Our strategic vision at Usha has always been to acquire and monetize undervalued assets. With the recent success of companies such as Abitibi Metals, we have been evaluating opportunities to acquire advanced-stage copper and/or gold projects to create further shareholder value in a similar fashion. A number of project reviews have already been completed, and the Company looks forward to keeping shareholders up to date on the progress of its strategy.\" Pursuant to the LOI, the Company has agreed to pay 2818390 Ontario Corp (the \"Finder\") a finder's fee for the Finder's assistance with the proposed sale of the Jackpot Lake Project equal to (i) 10% on the first $300,000 in Transaction Value, (ii) 7.5% on $300,000 to $1,000,000 in Transaction Value, and (iii) 5% on the Transaction Value over $1,000,000 in the consideration received directly from Stardust Power, Inc. by Usha. Jackpot Lake Lithium Brine Property USHA's Jackpot Lake Lithium Brine Project is located within Clark County, 35 kilometers northeast of Las Vegas, Nevada, and is comprised of 442 optioned and staked mineral claims that total 8,714 acres (approximately 35.3 km 2 ). The Project's geologic setting is similar to that of Albemarle's Silver Peak Nevada Lithium Mine, the only producing lithium mine in North America, which has operated continuously since 1966, where sediments from lithium‑rich surrounding source rocks accumulate and fill the deposit leading to a potential concentration of lithium brine due to successive evaporation and concentration events. Modelling indicates that the Project target comprises the entirety of the Company's core optioned claim block (2,800 acres; 11.3 km 2 ) and is open in all directions for expansion. The target is shallow, predominantly above bedrock depths of 600 meters, and is approximately 450 meters thick. The total basin within which the target is situated is estimated to be approximately 10,900 acres of which the Company now controls 8,714 acres. Qualified Person The technical content of this news release has been reviewed and approved by Mr. Deepak Varshney, P.Geo., a qualified person as defined by National Instrument 43-101 Standards of Disclosure for Mineral Projects (\"NI 43-101\"). About Usha Resources Ltd. Usha Resources Ltd. is a North American mineral acquisition and exploration company focused on the development of quality lithium metal properties that are drill-ready with high-upside and expansion potential. Based in Vancouver, BC, Usha's portfolio of strategic properties provides target-rich diversification and includes Jackpot Lake, a lithium brine project in Nevada and White Willow, a lithium pegmatite project in Ontario that is the flagship among its growing portfolio of hard-rock lithium assets. Usha trades on the TSX Venture Exchange under the symbol USHA, the OTCQB Exchange under the symbol USHAF and the Frankfurt Stock Exchange under the symbol JO0. USHA RESOURCES LTD. \"Deepak Varshney\" CEO and Director For more information, please call 778-899-1780, email info@usharesources.com or visit www.usharesources.com . Neither TSX Venture Exchange nor its Regulation Services Provider (as that term is defined in policies of the TSX Venture Exchange) accepts responsibility for the adequacy or accuracy of this release. About Stardust Power Inc. Stardust Power Inc. is a development stage manufacturer and refiner of battery-grade lithium products designed to supply the EV industry and help secure America's leadership in the energy transition. Stardust Power is developing a strategically central lithium refinery in Muskogee, Oklahoma with the anticipated capacity of producing up to 50,000 tonnes per annum of battery-grade lithium. Committed to sustainability at each point in the process. Stardust Power is expected to become a publicly traded company on Nasdaq under the ticker symbol \"SDST\" via a planned business combination with Global Partner Acquisition Corp II (\"GPAC II\") (NASDAQ:GPAC), a special purpose acquisition company. Forward-looking statements: This news release may include \"forward-looking information\" under applicable Canadian securities legislation. Forward-looking information includes, but is not limited to, statements about entering into a Definitive Agreement and completion of the Jackpot Lake transaction with Stardust Power, strategic plans, future work programs and objectives and expected results from such work programs. Forward-looking information necessarily involve known and unknown risks, including, without limitation: Usha and Stardust entering into the Definitive Agreement; risks associated with general economic conditions; inability to access sufficient capital from internal and external sources, and/or inability to access sufficient capital on favourable terms; and other risks. Such forward-looking information reflects management's current beliefs and are based on a number of estimates and/or assumptions made by and information currently available to the Company that, while considered reasonable, are subject to known and unknown risks, uncertainties, and other factors that may cause the actual results and future events to differ materially from those expressed or implied by such forward-looking information. Readers are cautioned that such forward-looking information are neither promises nor guarantees and are subject to known and unknown risks and uncertainties including, but not limited to, general business, economic, competitive, political and social uncertainties, uncertain and volatile equity and capital markets, lack of available capital, actual results of exploration activities, environmental risks, future prices of base and other metals, operating risks, accidents, labour issues, delays in obtaining governmental approvals and permits, and other risks in the mining industry. The Company is presently an exploration stage company. Exploration is highly speculative in nature, involves many risks, requires substantial expenditures, and may not result in the discovery of mineral deposits that can be mined profitably. Furthermore, the Company currently has no reserves on any of its properties. As a result, there can be no assurance that such forward-looking statements will prove to be accurate, and actual results and future events could differ materially from those anticipated in such statements. ____________________________________ i. https://www.sec.gov/Archives/edgar/data/1831979/000119312524134360/d656463ds4a.htm SOURCE: Usha Resources Ltd. View the original press release on accesswire.com",
    "primary_commodity": "Li"
  },
  "articleProject": {
    "gid": 2762,
    "project_name": "Jackpot Lake",
    "location": "Nevada, United States"
  },
  "articleExchange": "TSXV",
  "articleCompanyId": 1827,
  "articleTicker": "USHA",
  "articleCompanyName": "Usha Resources Ltd.",
  "allOtherCompanyProjects": [
    {
      "company_id": 1827,
      "gid": 2762,
      "project_name": "Jackpot Lake",
      "location": "Nevada, United States"
    },
    {
      "company_id": 1827,
      "gid": 4710,
      "project_name": "Gathering & Triangle Lake",
      "location": "Ontario, Canada"
    },
    {
      "company_id": 1827,
      "gid": 3625,
      "project_name": "Nicobat",
      "location": "Ontario, Canada"
    },
    {
      "company_id": 1827,
      "gid": 4709,
      "project_name": "Mead",
      "location": "Ontario, Canada"
    },
    {
      "company_id": 1827,
      "gid": 4711,
      "project_name": "Bluett",
      "location": "Ontario, Canada"
    },
    {
      "company_id": 1827,
      "gid": 6766,
      "project_name": "Abiwin",
      "location": "Ontario, Canada"
    },
    {
      "company_id": 1827,
      "gid": 4303,
      "project_name": "White Willow",
      "location": "Ontario, Canada"
    }
  ],
  "allOtherCompanyNews": [
    {
      "id": 107943,
      "company_id": 1827,
      "title": "Usha Resources Announces Change in Directors",
      "link": "https://app.quotemedia.com/data/downloadFiling?webmasterId=104408&ref=684b437065364e471318d7e3&type=PDFC&formType=002-002-001089-003001&formDescription=News+release&dateFiled=2025-06-12",
      "date": "2025-06-12T21:15:28.000Z",
      "hidden": false
    },
    {
      "id": 104524,
      "company_id": 1827,
      "title": "Usha Resources Ltd. and Totec Resources Ltd. Announce Strategic Partnership via Letter of Intent for White Willow Property Qualifying Transaction",
      "link": "https://app.quotemedia.com/data/downloadFiling?webmasterId=104408&ref=682394aac7b00a074f006742&type=PDFC&formType=002-002-001089-003001&formDescription=News+release&dateFiled=2025-05-13",
      "date": "2025-05-13T18:51:22.000Z",
      "hidden": false
    },
    {
      "id": -200629,
      "company_id": 1827,
      "title": "Canadian Investment Regulatory Organization Trading Halt - USHA",
      "link": "https://contentapi.cision.com/api/v1.0/releases/20250513C0262",
      "date": "2025-05-13T17:37:00.000Z",
      "hidden": false
    },
    {
      "id": 104353,
      "company_id": 1827,
      "title": "Usha Resources Sells Projects to Molten Metals for 19.9% Stake, Extends Exclusivity for the Sale of the Jackpot Lake Project for Total Consideration of up to US$26,025,000",
      "link": null,
      "date": "2025-05-12T11:00:00.000Z",
      "hidden": false
    },
    {
      "id": 103495,
      "company_id": 1827,
      "title": "Usha Announces Amendment to Property Option Agreement and Issuance of Shares",
      "link": "https://app.quotemedia.com/data/downloadFiling?webmasterId=104408&ref=6818dfb00f64360fbb0be022&type=PDFC&formType=002-002-001089-003001&formDescription=News+release&dateFiled=2025-05-05",
      "date": "2025-05-05T15:56:32.000Z",
      "hidden": false
    },
    {
      "id": 82094,
      "company_id": 1827,
      "title": "Usha Resources Announces Receipt of Intervention Permit for Upcoming Drill Program at the Southern Arm Copper-Gold VMS Property",
      "link": "https://www.accesswire.com/955461/usha-resources-announces-receipt-of-intervention-permit-for-upcoming-drill-program-at-the-southern-arm-copper-gold-vms-property",
      "date": "2024-12-16T13:00:00.000Z",
      "hidden": false
    },
    {
      "id": 80928,
      "company_id": 1827,
      "title": "Usha Resources Announces Initiation of Induced Polarization Survey at the Drill Ready Southern Arm Copper-Gold VMS Property",
      "link": "https://www.accesswire.com/950046/usha-resources-announces-initiation-of-induced-polarization-survey-at-the-drill-ready-southern-arm-copper-gold-vms-property",
      "date": "2024-12-04T13:13:00.000Z",
      "hidden": false
    },
    {
      "id": 79430,
      "company_id": 1827,
      "title": "Usha Resources Announces Induced Polarization Survey Ahead of Maiden Drill Program at the Southern Arm Copper-Gold VMS Property",
      "link": "https://contentapi.cision.com/api/v1.0/releases/20241120C3149",
      "date": "2024-11-20T13:00:00.000Z",
      "hidden": false
    },
    {
      "id": 78746,
      "company_id": 1827,
      "title": "Usha Resources Announces Completion of Phase 1 Fieldwork at the Southern Arm Copper-Gold VMS Property",
      "link": "https://www.accesswire.com/942499/usha-resources-announces-completion-of-phase-1-fieldwork-at-the-southern-arm-copper-gold-vms-property",
      "date": "2024-11-14T12:00:00.000Z",
      "hidden": false
    },
    {
      "id": 97357,
      "company_id": 1827,
      "title": "Usha Resources Announces Closing of Non-Brokered Private Placement",
      "link": "https://app.quotemedia.com/data/downloadFiling?webmasterId=104408&ref=66d8d0d67ebceb625f45d640&type=PDFC&formType=002-002-001089-003001&formDescription=News+release&dateFiled=2024-09-04",
      "date": "2024-09-04T21:27:50.000Z",
      "hidden": false
    }
  ]
}