{
  "article": {
    "id": 31826,
    "link": "https://www.accesswire.com/viewarticle.aspx?id=741061&lang=en",
    "title": "Intrepid Metals Introduces the Corral Copper Project, a New District Scale, Exploration Project in Arizona",
    "description": "<ul><li><i><strong>Over 50,000 metres of historical drilling has been completed within the district, with significant shallow copper intercepts, including 126.2 metres of 1.24% copper</strong></i></li><li><i><strong>A robust land package of over 8,500 acres (13 square miles) of mineral rights and over 1,700 acres of surface rights and ownership from patented rights</strong></i></li><li><i><strong>Anglo American retains an interest on a portion of the project</strong></i></li></ul><p><strong>VANCOUVER, BC / ACCESSWIRE / February 28, 2023 / Intrepid Metals Corp. (TSXV:INTR) (\"Intrepid\" or the \"Company\")</strong> is pleased to introduce its new district scale, advanced exploration copper property, the Corral Copper Project, in Cochise County, Arizona. The project area is located approximately 20 miles from the Company's Tombstone South property and has over 50,000 metres (\"m\") of drilling, with shallow mineralization of copper, silver, zinc, and gold.</p><p><strong>FIGURE 1: Aerial View of Corral Copper Showing Road Access</strong></p><p><img src=\"https://www.accesswire.com/users/newswire/images/741061/image.png\" alt=\"Intrepid Metals Corp., Monday, February 27, 2023, Press release picture\"></p><p>\"After many months of developing relationships with local stakeholders, we are very pleased to introduce the Corral Copper Project in Cochise County, Arizona,\" said Ken Brophy, CEO of Intrepid. \"We are excited to have secured such a robust land package in an area with historical mining that includes patented mining claims, private surface rights, federal mineral claims and Arizona State Mineral Exploration Permits.\"</p><p>\"There has been considerable interest from both junior exploration and large mining companies - including Anglo American - however, fractured land ownership structures, and a variety of commercial disputes in the district, have previously acted as a barrier in the advancement of the district,\" continued Brophy. \"We have invested significant time to learn from local stakeholders about the fragmented land ownership and historical conflicts as we take steps to consolidate key land positions. This area is one which we have been interested in since completing our change of business in May of 2022 and believe it will be a great strategic fit with our Tombstone South and Mesa Well properties, as we remain focused on drill ready copper and silver projects within a tier one mining state like Arizona.\"</p><p><strong>Consolidation of the District</strong><br>Intrepid has concluded transactions for 100% ownership with two of the largest individual land holders in the Corral district and remains actively engaged with other stakeholders to further consolidate land holdings in the area. The Corral Copper Project combines two previously announced agreements, both of which have been approved by the TSX.V: the definitive agreement with Cave Creek Copper Inc. announced on <a href=\"https://pr.report/TOmNM749\">February 15, 2023</a>; and the purchase and sale agreement with Excelsior Mining Corp announced on <a href=\"https://pr.report/OjWx362i\">August 26, 2022</a>. Many members of the Intrepid team have a long history of working in the State of Arizona and Cochise County in particular, and this experience is key as the Company expands its asset base in the County.</p><p><strong>Previous Work on Site</strong><br>Over 50,000m of historical drilling has been completed within the district, with significant near surface intercepts, including 126.2m (30.4m to 156.6m) of 1.24% copper in Hole 20_01, drilled by Santa Fe Pacific Mining Inc in 1990. This drill result is historical in nature and based on assay information from Ski Line Labs Inc. Intrepid has not yet undertaken any independent investigation of the sampling nor has it independently analyzed the results of the historical exploration work in order to verify the results. Intrepid considers these historical drill results relevant, as the Company will use this data as a guide to plan future exploration programs. Intrepid also considers the data to be reliable for these purposes; however, the Company's future exploration work will include verification of the data through drilling.</p><p><strong>FIGURE 2: Intrepid's High Quality Assets Within Arizona</strong></p><p><img src=\"https://www.accesswire.com/users/newswire/images/741061/image-1.png\" alt=\"Intrepid Metals Corp., Monday, February 27, 2023, Press release picture\"></p><p><strong>About Corral Copper</strong></p><p>The Corral Copper Project is a district scale advanced exploration and development opportunity in Cochise County, Arizona. Corral Copper is located 15 miles east of the famous mining town of Tombstone and 22 miles north of the historical Bisbee mining camp which has produced more than 8 billion pounds of copper with grades of up to 23%. Production from the Bisbee mining camp is not necessarily indicative of the mineral potential at the Corral Copper Project.</p><p>The district has a mining history dating back to the late 1800s, with several small mines extracting copper from the area in the early 1900s, producing several thousand tons with grades up to 9.2% copper ore. Between 1950 and 2008, various companies explored parts of the district, but the effort was uncoordinated, non-synergistic and focused on discrete land positions and commodities due to the fragmented ownership. Intrepid has been able to secure data from various sources which provides a solid foundation in creating geological interpretations and identifying new target areas.</p><p>Anglo American explored the district from 2016 to 2019, conducted mapping and airborne geophysics identifying prospective new target areas through the district. Further to its announcement in <a href=\"https://pr.report/L8lcOIQW\">August 2022</a>, Intrepid has acquired a data package from Excelsior Mining Holdings Inc, subject to the terms, conditions and limitations agreed between Excelsior and Anglo American in 2021, including a right of first refusal in favour of Anglo American over a portion of the project area in certain circumstances.</p><p>Intrepid is confident that by combining modern exploration techniques with historical data and with a clear focus on responsible development, the Corral Copper Project can quickly become an advanced exploration stage project and move towards feasibility level studies. More details about the Corral Copper Property and the plans for 2023 will be released soon.</p><p>Dr. Chris Osterman, P. Geo, a consultant of the Company, is a Qualified Person (\"QP\") as defined by National Instrument 43-101. Dr. Osterman has reviewed and is responsible for the technical information disclosed in this news release.</p><p><strong>About Intrepid Metals Corp.</strong></p><p>Intrepid Metals Corp. is a Canadian exploration company focused on exploring for potential high-grade copper, silver, lead, and zinc mineral projects in proximity to producing mines in south-eastern Arizona, USA. The Company has acquired several drill ready projects, including the Corral Copper Project (a district scale advanced exploration and development opportunity), the Tombstone South Project (within the historical Tombstone mining district with geological similarities to the Taylor Deposit, which was purchased for $1.3B in 2018) both of which are located in Cochise County, Arizona and the Mesa Well Project located in the Laramide Copper Porphyry Belt in Arizona. Intrepid is actively looking to acquire additional projects in Arizona and the American Southwest and has assembled an exceptional team with considerable experience in evaluating and developing exploration projects within North America. Intrepid is traded on the TSX Venture Exchange (TSX-V) under the symbol \"INTR\". For more information, visit <a href=\"https://pr.report/6zpKqmoJ\">www.intrepidmetals.com</a>.</p><p><strong>INTREPID METALS CORP.</strong><br>On behalf of the Company<br>\"Ken Brophy\"<br>CEO</p><p><strong>For further information regarding this news release, please contact:</strong></p><p>Ken Brophy<br>CEO<br>604-681-8030<br><a href=\"mailto:info@intrepidmetals.com\">info@intrepidmetals.com</a></p><p>Caroline Sawamoto<br>Investor Relations<br><a href=\"mailto:info@intrepidmetals.com\">invest@intrepidmetals.com</a></p><p><i><strong>Cautionary Note Regarding Forward-Looking Information</strong></i></p><p><i>Certain statements contained in this release constitute forward-looking information within the meaning of applicable Canadian securities laws. Such forward-looking statements relate to: (i) future exploration plans; (ii) details about potential mineralization; (iii) the exploration potential of the Corral Copper Property; and (iv) potential future production.</i></p><p><i>In certain cases, forward-looking information can be identified by the use of words such as \"plans\", \"expects\", \"budget\", \"scheduled\", \"estimates\", \"forecasts\", \"intends\", \"anticipates\" or \"believes\", or variations of such words and phrases or state that certain actions, events or results \"may\", \"could\", \"would\", \"might\", \"occur\" or \"be achieved\" suggesting future outcomes, or other expectations, beliefs, plans, objectives, assumptions, intentions or statements about future events or performance. Forward-looking information contained in this news release is based on certain factors and assumptions regarding, among other things, the results of exploration activities, expectations and anticipated impact of the COVID-19 outbreak, commodity prices, the timing and amount of future exploration and development expenditures, the availability of labour and materials, receipt of and compliance with necessary regulatory approvals and permits, the estimation of insurance coverage, and assumptions with respect to currency fluctuations, environmental risks, title disputes or claims, and other similar matters. While the Company considers these assumptions to be reasonable based on information currently available to it, they may prove to be incorrect.</i></p><p><i>Forward looking information involves known and unknown risks, uncertainties and other factors which may cause the actual results, performance or achievements of the Company to be materially different from any future results, performance or achievements expressed or implied by the forward-looking information. Such factors include risks inherent in the exploration and development of mineral deposits, including risks relating to the ability to access infrastructure, risks relating to changes in commodity prices, risks related to current global financial conditions, risks related to current global financial conditions and the impact of COVID-19 on the Company's business, reliance on key personnel, operational risks inherent in the conduct of exploration and development activities, including the risk of accidents, labour disputes and cave-ins, regulatory risks including the risk that permits may not be obtained in a timely fashion or at all, financing, capitalization and liquidity risks, risks related to disputes concerning property titles and interests, environmental risks and the additional risks identified in the \"Risk Factors\" section of the Company's reports and filings with applicable Canadian securities regulators.</i></p><p><i>Although the Company has attempted to identify important factors that could cause actual actions, events or results to differ materially from those described in forward-looking information, there may be other factors that cause actions, events or results not to be as anticipated, estimated or intended. Accordingly, readers should not place undue reliance on forward-looking information. The forward-looking information is made as of the date of this news release. Except as required by applicable securities laws, the Company does not undertake any obligation to publicly update or revise any forward-looking information.</i></p><p><i>Neither the TSX Venture Exchange nor its Regulation Services Provider (as that term is defined in the policies of the TSX Venture Exchange) has reviewed or accepts responsibility for the adequacy or accuracy of this release.</i></p><p><strong>SOURCE:</strong> Intrepid Metals Corp.</p><br><br>View source version on accesswire.com: <br><a href='https://www.accesswire.com/741061/Intrepid-Metals-Introduces-the-Corral-Copper-Project-a-New-District-Scale-Exploration-Project-in-Arizona'>https://www.accesswire.com/741061/Intrepid-Metals-Introduces-the-Corral-Copper-Project-a-New-District-Scale-Exploration-Project-in-Arizona</a><br><br>",
    "search_terms": "Corral Copper,Intrepid Metals Corp.,INTR",
    "master_gid": 4161,
    "date": "2023-02-28T12:30:00.000Z",
    "tags": "|||Copper|Project Acquisition",
    "image_id": null,
    "hidden": false,
    "company_id": 2016,
    "provider": "accesswire",
    "excerpt": "Over 50,000 metres of historical drilling has been completed within the district, with significant shallow copper intercepts, including 126.2 metres of 1.24% copperA robust land package of over 8,500 acres (13 square miles) of mineral rights and over 1,700 acres of surface rights and ownership from patented rightsAnglo American retains",
    "is_regulatory": false,
    "refined_tags": [
      "Project Acquisition"
    ],
    "ftp_filename": null,
    "company_name": "Intrepid Metals Corp.",
    "exchange": "TSXV",
    "root_ticker": "INTR",
    "project_name": "Corral Copper",
    "gid": 4161,
    "location": "Arizona, United States",
    "plan_id": null,
    "description_text": "Over 50,000 metres of historical drilling has been completed within the district, with significant shallow copper intercepts, including 126.2 metres of 1.24% copper A robust land package of over 8,500 acres (13 square miles) of mineral rights and over 1,700 acres of surface rights and ownership from patented rights Anglo American retains an interest on a portion of the project VANCOUVER, BC / ACCESSWIRE / February 28, 2023 / Intrepid Metals Corp. (TSXV:INTR) (\"Intrepid\" or the \"Company\") is pleased to introduce its new district scale, advanced exploration copper property, the Corral Copper Project, in Cochise County, Arizona. The project area is located approximately 20 miles from the Company's Tombstone South property and has over 50,000 metres (\"m\") of drilling, with shallow mineralization of copper, silver, zinc, and gold. FIGURE 1: Aerial View of Corral Copper Showing Road Access \"After many months of developing relationships with local stakeholders, we are very pleased to introduce the Corral Copper Project in Cochise County, Arizona,\" said Ken Brophy, CEO of Intrepid. \"We are excited to have secured such a robust land package in an area with historical mining that includes patented mining claims, private surface rights, federal mineral claims and Arizona State Mineral Exploration Permits.\" \"There has been considerable interest from both junior exploration and large mining companies - including Anglo American - however, fractured land ownership structures, and a variety of commercial disputes in the district, have previously acted as a barrier in the advancement of the district,\" continued Brophy. \"We have invested significant time to learn from local stakeholders about the fragmented land ownership and historical conflicts as we take steps to consolidate key land positions. This area is one which we have been interested in since completing our change of business in May of 2022 and believe it will be a great strategic fit with our Tombstone South and Mesa Well properties, as we remain focused on drill ready copper and silver projects within a tier one mining state like Arizona.\" Consolidation of the District Intrepid has concluded transactions for 100% ownership with two of the largest individual land holders in the Corral district and remains actively engaged with other stakeholders to further consolidate land holdings in the area. The Corral Copper Project combines two previously announced agreements, both of which have been approved by the TSX.V: the definitive agreement with Cave Creek Copper Inc. announced on February 15, 2023 ; and the purchase and sale agreement with Excelsior Mining Corp announced on August 26, 2022 . Many members of the Intrepid team have a long history of working in the State of Arizona and Cochise County in particular, and this experience is key as the Company expands its asset base in the County. Previous Work on Site Over 50,000m of historical drilling has been completed within the district, with significant near surface intercepts, including 126.2m (30.4m to 156.6m) of 1.24% copper in Hole 20_01, drilled by Santa Fe Pacific Mining Inc in 1990. This drill result is historical in nature and based on assay information from Ski Line Labs Inc. Intrepid has not yet undertaken any independent investigation of the sampling nor has it independently analyzed the results of the historical exploration work in order to verify the results. Intrepid considers these historical drill results relevant, as the Company will use this data as a guide to plan future exploration programs. Intrepid also considers the data to be reliable for these purposes; however, the Company's future exploration work will include verification of the data through drilling. FIGURE 2: Intrepid's High Quality Assets Within Arizona About Corral Copper The Corral Copper Project is a district scale advanced exploration and development opportunity in Cochise County, Arizona. Corral Copper is located 15 miles east of the famous mining town of Tombstone and 22 miles north of the historical Bisbee mining camp which has produced more than 8 billion pounds of copper with grades of up to 23%. Production from the Bisbee mining camp is not necessarily indicative of the mineral potential at the Corral Copper Project. The district has a mining history dating back to the late 1800s, with several small mines extracting copper from the area in the early 1900s, producing several thousand tons with grades up to 9.2% copper ore. Between 1950 and 2008, various companies explored parts of the district, but the effort was uncoordinated, non-synergistic and focused on discrete land positions and commodities due to the fragmented ownership. Intrepid has been able to secure data from various sources which provides a solid foundation in creating geological interpretations and identifying new target areas. Anglo American explored the district from 2016 to 2019, conducted mapping and airborne geophysics identifying prospective new target areas through the district. Further to its announcement in August 2022 , Intrepid has acquired a data package from Excelsior Mining Holdings Inc, subject to the terms, conditions and limitations agreed between Excelsior and Anglo American in 2021, including a right of first refusal in favour of Anglo American over a portion of the project area in certain circumstances. Intrepid is confident that by combining modern exploration techniques with historical data and with a clear focus on responsible development, the Corral Copper Project can quickly become an advanced exploration stage project and move towards feasibility level studies. More details about the Corral Copper Property and the plans for 2023 will be released soon. Dr. Chris Osterman, P. Geo, a consultant of the Company, is a Qualified Person (\"QP\") as defined by National Instrument 43-101. Dr. Osterman has reviewed and is responsible for the technical information disclosed in this news release. About Intrepid Metals Corp. Intrepid Metals Corp. is a Canadian exploration company focused on exploring for potential high-grade copper, silver, lead, and zinc mineral projects in proximity to producing mines in south-eastern Arizona, USA. The Company has acquired several drill ready projects, including the Corral Copper Project (a district scale advanced exploration and development opportunity), the Tombstone South Project (within the historical Tombstone mining district with geological similarities to the Taylor Deposit, which was purchased for $1.3B in 2018) both of which are located in Cochise County, Arizona and the Mesa Well Project located in the Laramide Copper Porphyry Belt in Arizona. Intrepid is actively looking to acquire additional projects in Arizona and the American Southwest and has assembled an exceptional team with considerable experience in evaluating and developing exploration projects within North America. Intrepid is traded on the TSX Venture Exchange (TSX-V) under the symbol \"INTR\". For more information, visit www.intrepidmetals.com . INTREPID METALS CORP. On behalf of the Company \"Ken Brophy\" CEO For further information regarding this news release, please contact: Ken Brophy CEO 604-681-8030 info@intrepidmetals.com Caroline Sawamoto Investor Relations invest@intrepidmetals.com Cautionary Note Regarding Forward-Looking Information Certain statements contained in this release constitute forward-looking information within the meaning of applicable Canadian securities laws. Such forward-looking statements relate to: (i) future exploration plans; (ii) details about potential mineralization; (iii) the exploration potential of the Corral Copper Property; and (iv) potential future production. In certain cases, forward-looking information can be identified by the use of words such as \"plans\", \"expects\", \"budget\", \"scheduled\", \"estimates\", \"forecasts\", \"intends\", \"anticipates\" or \"believes\", or variations of such words and phrases or state that certain actions, events or results \"may\", \"could\", \"would\", \"might\", \"occur\" or \"be achieved\" suggesting future outcomes, or other expectations, beliefs, plans, objectives, assumptions, intentions or statements about future events or performance. Forward-looking information contained in this news release is based on certain factors and assumptions regarding, among other things, the results of exploration activities, expectations and anticipated impact of the COVID-19 outbreak, commodity prices, the timing and amount of future exploration and development expenditures, the availability of labour and materials, receipt of and compliance with necessary regulatory approvals and permits, the estimation of insurance coverage, and assumptions with respect to currency fluctuations, environmental risks, title disputes or claims, and other similar matters. While the Company considers these assumptions to be reasonable based on information currently available to it, they may prove to be incorrect. Forward looking information involves known and unknown risks, uncertainties and other factors which may cause the actual results, performance or achievements of the Company to be materially different from any future results, performance or achievements expressed or implied by the forward-looking information. Such factors include risks inherent in the exploration and development of mineral deposits, including risks relating to the ability to access infrastructure, risks relating to changes in commodity prices, risks related to current global financial conditions, risks related to current global financial conditions and the impact of COVID-19 on the Company's business, reliance on key personnel, operational risks inherent in the conduct of exploration and development activities, including the risk of accidents, labour disputes and cave-ins, regulatory risks including the risk that permits may not be obtained in a timely fashion or at all, financing, capitalization and liquidity risks, risks related to disputes concerning property titles and interests, environmental risks and the additional risks identified in the \"Risk Factors\" section of the Company's reports and filings with applicable Canadian securities regulators. Although the Company has attempted to identify important factors that could cause actual actions, events or results to differ materially from those described in forward-looking information, there may be other factors that cause actions, events or results not to be as anticipated, estimated or intended. Accordingly, readers should not place undue reliance on forward-looking information. The forward-looking information is made as of the date of this news release. Except as required by applicable securities laws, the Company does not undertake any obligation to publicly update or revise any forward-looking information. Neither the TSX Venture Exchange nor its Regulation Services Provider (as that term is defined in the policies of the TSX Venture Exchange) has reviewed or accepts responsibility for the adequacy or accuracy of this release. SOURCE: Intrepid Metals Corp. View source version on accesswire.com: https://www.accesswire.com/741061/Intrepid-Metals-Introduces-the-Corral-Copper-Project-a-New-District-Scale-Exploration-Project-in-Arizona",
    "primary_commodity": "Cu"
  },
  "articleProject": {
    "gid": 4161,
    "project_name": "Corral Copper",
    "location": "Arizona, United States"
  },
  "articleExchange": "TSXV",
  "articleCompanyId": 2016,
  "articleTicker": "INTR",
  "articleCompanyName": "Intrepid Metals Corp.",
  "allOtherCompanyProjects": [
    {
      "company_id": 2016,
      "gid": 5943,
      "project_name": "Wendover",
      "location": "Utah, United States"
    },
    {
      "company_id": 2016,
      "gid": 4161,
      "project_name": "Corral Copper",
      "location": "Arizona, United States"
    },
    {
      "company_id": 2016,
      "gid": 7621,
      "project_name": "Tombstone",
      "location": null
    }
  ],
  "allOtherCompanyNews": [
    {
      "id": 105875,
      "company_id": 2016,
      "title": "Intrepid Metals Intercepts 27.50% Copper, 10.15 gpt Gold, and 192 gpt Silver Over 0.55m in First Drill Hole of 2025 at Corral Copper",
      "link": null,
      "date": "2025-05-27T11:00:00.000Z",
      "hidden": false
    },
    {
      "id": 105246,
      "company_id": 2016,
      "title": "Intrepid Metals Completes Tombstone Amendment",
      "link": null,
      "date": "2025-05-20T21:00:00.000Z",
      "hidden": false
    },
    {
      "id": 104211,
      "company_id": 2016,
      "title": "Intrepid Metals Engages Independent Trading Group as Market Maker",
      "link": null,
      "date": "2025-05-09T21:30:00.000Z",
      "hidden": false
    },
    {
      "id": 102108,
      "company_id": 2016,
      "title": "Intrepid Metals Commences Drill Program at Corral Copper",
      "link": null,
      "date": "2025-04-29T11:00:00.000Z",
      "hidden": false
    },
    {
      "id": 100386,
      "company_id": 2016,
      "title": "Intrepid Metals Receives Drill Permits and Resumes Exploration Activities at Corral Copper",
      "link": null,
      "date": "2025-04-22T11:00:00.000Z",
      "hidden": false
    },
    {
      "id": 99778,
      "company_id": 2016,
      "title": "Intrepid Metals Identifies Several New Porphyry Copper-Gold Targets at Corral Copper",
      "link": null,
      "date": "2025-04-15T11:00:00.000Z",
      "hidden": false
    },
    {
      "id": 93040,
      "company_id": 2016,
      "title": "Intrepid Metals Announces Closing of Oversubscribed $5 Million Private Placement of Units",
      "link": null,
      "date": "2025-03-31T11:00:00.000Z",
      "hidden": false
    },
    {
      "id": 91662,
      "company_id": 2016,
      "title": "Intrepid Metals Announces Listed Issuer Financing Exemption (LIFE) Private Placement of Units",
      "link": null,
      "date": "2025-03-18T11:00:00.000Z",
      "hidden": false
    },
    {
      "id": 84107,
      "company_id": 2016,
      "title": "Rio Tinto and Ivanhoe Electric Acquire Land Positions on Eastern and Western Flanks of Intrepid Metals Corral Copper Property in Arizona",
      "link": "https://www.newsfilecorp.com/release/237181/Rio-Tinto-and-Ivanhoe-Electric-Acquire-Land-Positions-on-Eastern-and-Western-Flanks-of-Intrepid-Metals-Corral-Copper-Property-in-Arizona",
      "date": "2025-01-15T12:00:00.000Z",
      "hidden": false
    },
    {
      "id": 82629,
      "company_id": 2016,
      "title": "Intrepid Metals Appoints Mr. Richard Lock to Board of Directors",
      "link": "https://www.newsfilecorp.com/release/234560/Intrepid-Metals-Appoints-Mr.-Richard-Lock-to-Board-of-Directors",
      "date": "2024-12-19T21:10:00.000Z",
      "hidden": false
    }
  ]
}
