{
  "article": {
    "id": 40782,
    "link": "https://www.accesswire.com/viewarticle.aspx?id=783001&lang=en",
    "title": "Intrepid Metals Completes Consolidation of Established Copper and Gold Mineralized Trend in Arizona",
    "description": "<ul><li><i>Signs an agreement to acquire a 100% interest in the MAN Property in Cochise County, Arizona</i></li><li><i>MAN Property hosts 80 previous drill holes and 19,449 meters of assay data, within 622 acres of patented mining claims and BLM lode claims</i></li><li><i>Several high-grade copper and gold intercepts from historic drilling, including;</i><ul><li><i>Hole 28_08 included <strong>53.03 meters of 1.63% Cu and 1.45 g/t Au</strong></i></li><li><i>Hole 28_01 included <strong>72.03 meters of 0.75% Cu, 0.34 g/t Au and 14.47 g/t Ag</strong></i></li></ul></li><li><i>With the addition of the MAN Property, the Corral Copper Project now totals over 9,600 acres (15 Square miles), including 1,800 acres of patented mining claims and surface rights</i></li></ul><p><strong>VANCOUVER, BC / ACCESSWIRE / September 12, 2023 / Intrepid Metals Corp. (TSXV:INTR) (OTCQB:IMTCF) (&quot;Intrepid&quot; or the &quot;Company&quot;</strong>) is pleased to announce it has entered into an option agreement (the &quot;<strong>Agreement</strong>&quot;) to acquire a 100% interest in the MAN Property (the &quot;<strong>Property</strong>&quot;) from Mining and Mineral Opportunity Ltd. (&quot;<strong>MMO</strong>&quot;) completing a pivotal land consolidation exercise of an established trend of known mineralization within its Corral Copper Project, in Cochise County, Arizona. The Corral Copper Project area is located approximately 20 miles from the Company's Tombstone South property and includes 50,000 metres (&quot;<strong>m</strong>&quot;) of historical drilling data, with shallow mineralization of copper, silver, gold, and zinc.</p><p><strong>FIGURE 1: Aerial View of Historical Mining Activity at Corral Copper Project</strong></p><figure class=\"image image_resized\" style=\"width:100%;display:table;text-align:center;margin:0.9em auto\" width=\"100%\"><img src=\"https://www.accesswire.com/users/newswire/images/783001/im3.jpg\" width=\"100%\" /></figure><div style=\"clear: both\"> </div><div> </div><div> </div><div> </div><div> </div><div> </div><div> </div><p>&quot;This latest acquisition will effectively complete the consolidation of a 3 km trend of known copper, gold, silver and zinc mineralization within our larger Corral Copper Project area,&quot; said Ken Brophy, CEO of Intrepid. &quot;I would like to thank everyone involved in concluding the agreement for this transaction as we can now begin to meaningfully unlock the value within the district. We will now control over 9,500 acres, with 1,800 acres made up of patented mining claims and additional surface rights that host the mineralized trend. With the historical assay data to guide us, we are excited to start drilling Corral and quickly move the historical drilling to NI 43-101 standards.&quot;</p><p>&quot;When I brought Intrepid to the market in 2022, it was my hope that we would be able to do what others had failed to do: namely consolidate this district, where substantial historical drilling had been undertaken with excellent results, but where fragmented land ownership had prevented further capital investment required for establishing a coherent mineralized footprint for the region,&quot; added Mark Morabito, Chair of Intrepid. &quot;We have an exceptional team with a long history of working in the State of Arizona and Cochise County in particular, where permitting for mining projects has recently occurred. The remainder of 2023 and the first several months of 2024 will be very busy for our team as they set about reproducing and expanding the established mineralized footprint through extensive drilling.&quot;</p><p><strong>Historical Drilling Highlights from MAN</strong></p><p>Copper (&quot;<strong>Cu</strong>&quot;) highlights, as well as corresponding gold (&quot;<strong>Au</strong>&quot;) and silver (&quot;<strong>Ag</strong>&quot;) grades from historical drilling on the MAN property include:</p><ul><li><strong>53.03m of 1.63% Cu</strong> and 1.45 grams per tonne (&quot;g/t&quot;) Au (117.35m to 170.38m) in Hole 28_08</li><li><strong>72.03m of 0.75% Cu</strong>, 0.34 g/t Au and 14.47 g/t Ag (57.91m to 129.94m) in Hole 28_01</li><li><strong>74.98m of 0.73% Cu </strong>(74.98m to 149.96m) in Hole M_35</li><li><strong>38.70m of 2.14% Cu</strong> (98.76m to 137.46m) in Hole M_01</li><li><strong>106.68m of 0.65% Cu</strong> and 0.34% Au (109.73m to 216.41m) in Hole 28_09</li></ul><p><strong>Consolidation of the District</strong></p><p>Intrepid has concluded agreements for 100% ownership with four different land holders in the Corral district and has the core area consolidated. Management remains engaged with other stakeholders and may consolidate additional land holdings in the area as it advances its programs. The Corral Copper Project combines three previously announced agreements that have been approved by the TSX Venture Exchange: the Purchase and Sale Agreement of the Sara Claim Group announced on <a href=\"https://pr.report/NR9w3-F8\">April 27, 2023</a>; the Definitive Agreement with Cave Creek Copper Inc. announced on <a href=\"https://pr.report/sklbOJN5\">February 15, 2023</a>; and the Purchase and Sale Agreement with Excelsior Mining Corp announced on <a href=\"https://pr.report/a89NbSxD\">August 26, 2022</a>.</p><p><strong>Previous Exploration</strong></p><p>Over 50,000m of historical drilling has been completed within the district since the late 1950s, with exploration efforts being fragmented based on land ownership. Historical drilling has encountered significant near surface intercepts. All drill results are historical in nature and based on assay information from Skyline Labs Inc. Intrepid has not yet undertaken any independent investigation of the sampling nor has it independently analyzed the results of the historical exploration work in order to verify the results. Intrepid considers these historical drill results relevant, as the Company will use this data as a guide to plan future exploration programs. Intrepid also considers the data to be reliable for these purposes; however, the Company's future exploration work will include verification of the data through drilling.</p><p><strong>FIGURE 2: Leapfrog Modelling of Historic Copper and Gold Values Within the 3km Trend </strong><br /><strong>(Historical results have not been prepared in accordance with NI 43-101)</strong></p><figure class=\"image image_resized\" style=\"width:100%;display:table;text-align:center;margin:0.9em auto\" width=\"100%\"><img src=\"https://www.accesswire.com/users/newswire/images/783001/screenshot 2023-09-11 at 5.39.55 pm.png\" width=\"100%\" /></figure><div style=\"clear: both\"> </div><div> </div><div> </div><div> </div><div> </div><div> </div><p><br /><strong>Agreement Terms</strong></p><p>The terms of the Agreement give Intrepid the option to acquire a 100% interest in the Property in return for certain cash and common share (&quot;<strong>Share</strong>&quot;) payments to MMO. The consideration is as follows and all dollar values are United States dollars:</p><div style=\"text-align:center;\" align=\"center\" alignment=\"center\"><figure class=\"image image_resized\" style=\"width:100%;display:table;text-align:center;margin:0.9em auto\" width=\"100%\"><img src=\"https://www.accesswire.com/users/newswire/images/783001/screenshot 2023-09-11 at 7.12.33 pm.png\" width=\"100%\" /></figure></div><p>Intrepid will take over as operator of the Property and will be responsible for future exploration work and maintaining the Properties in good standing. The Agreement is subject to the approval of the TSX Venture Exchange (&quot;<strong>TSXV</strong>&quot;).</p><p><strong>About Corral Copper</strong></p><p>The Corral Copper Project is a district scale advanced exploration and development opportunity in Cochise County, Arizona. Corral Copper is located 15 miles east of the famous mining town of Tombstone and 22 miles north of the historical Bisbee mining camp which has produced more than 8 billion pounds of copper with grades of up to 23%. Production from the Bisbee mining camp is not necessarily indicative of the mineral potential at the Corral Copper Project.</p><p>The district has a mining history dating back to the late 1800s, with several small mines extracting copper from the area in the early 1900s, producing several thousand tons with grades up to 9.2% copper ore. Between 1950 and 2008, various companies explored partsof the district, but the effort was uncoordinated, non-synergistic and focused on discrete land positions and commodities due to the fragmented ownership. Intrepid has been able to secure data from various sources which provides a solid foundation in creating geological interpretations and identifying new target areas.</p><p>Intrepid is confident that by combining modern exploration techniques with historical data and with a clear focus on responsible development, the Corral Copper Project can quickly become an advanced exploration stage project and move towards feasibility level studies. More details about the Corral Copper Property and the plans for 2023 will be released soon.</p><p>Dr. Chris Osterman, P. Geo, a consultant of the Company, is a Qualified Person (&quot;QP&quot;) as defined by National Instrument 43-101. Dr. Osterman has reviewed and is responsible for the technical information disclosed in this news release, including the statements with respect to data verification.</p><p><strong>About Intrepid Metals Corp.</strong></p><p>Intrepid Metals Corp. is a Canadian company focused on exploring for high-grade essential metals such as copper, silver, lead, and zinc mineral projects in proximity to established mining jurisdictions in southeastern Arizona, USA. The Company has acquired or has agreements to acquire several drill ready projects, including the Corral Copper Project (a district scale advanced exploration and development opportunity with significant shallow historical drill results), the Tombstone South Project (within the historical Tombstone mining district with geological similarities to the Taylor Deposit, which was purchased for $1.3B in 2018) both of which are located in Cochise County, Arizona and the Mesa Well Project (located in the Laramide Copper Porphyry Belt in Arizona). Intrepid has assembled an exceptional team with considerable experience with exploration, developing, and permitting new projects within North America. Intrepid is traded on the TSX Venture Exchange (TSX-V) under the symbol &quot;INTR&quot; and on the OTCQB Venture Market under the symbol &quot;IMTCF&quot;. For more information, visit <a href=\"https://pr.report/rznqN461\">www.intrepidmetals.com</a>.</p><p style=\"text-align:center;\"><strong>INTREPID METALS CORP.</strong><br />On behalf of the Company<br />&quot;Ken Brophy&quot;<br />CEO</p><p><strong>For further information regarding this news release, please contact:</strong></p><p>Ken Brophy<br />CEO<br />604-681-8030<br /><a href=\"mailto:info@intrepidmetals.com\">info@intrepidmetals.com</a></p><p>Caroline Sawamoto<br />Investor Relations<br /><a href=\"mailto:info@intrepidmetals.com\">invest@intrepidmetals.com</a></p><p><i><strong>Cautionary Note Regarding Forward-Looking Information</strong></i></p><p><i>Certain statements contained in this release constitute forward-looking information within the meaning of applicable Canadian securities laws. Such forward-looking statements relate to: (i) future exploration plans; (ii) details about potential mineralization; (iii) the exploration potential of the Corral Copper Property; (iv) potential future production; and (v) TSXV approval of the Agreement.</i></p><p><i>In certain cases, forward-looking information can be identified by the use of words such as &quot;plans&quot;, &quot;expects&quot;, &quot;budget&quot;, &quot;scheduled&quot;, &quot;estimates&quot;, &quot;forecasts&quot;, &quot;intends&quot;, &quot;anticipates&quot; or &quot;believes&quot;, or variations of such words and phrases or state that certain actions, events or results &quot;may&quot;, &quot;could&quot;, &quot;would&quot;, &quot;might&quot;, &quot;occur&quot; or &quot;be achieved&quot; suggesting future outcomes, or other expectations, beliefs, plans, objectives, assumptions, intentions or statements about future events or performance. Forward-looking information contained in this news release is based on certain factors and assumptions regarding, among other things, the Company can raise additional financing to continue operations; the results of exploration activities, expectations and anticipated impact of the COVID-19 outbreak, the TSXV approves the Agreement, commodity prices, the timing and amount of future exploration and development expenditures, the availability of labour and materials, receipt of and compliance with necessary regulatory approvals and permits, the estimation of insurance coverage, and assumptions with respect to currency fluctuations, environmental risks, title disputes or claims, and other similar matters. While the Company considers these assumptions to be reasonable based on information currently available to it, they may prove to be incorrect.</i></p><p><i>Forward looking information involves known and unknown risks, uncertainties and other factors which may cause the actual results, performance or achievements of the Company to be materially different from any future results, performance or achievements expressed or implied by the forward-looking information. Such factors include risks inherent in the exploration and development of mineral deposits, including risks relating to the ability to access infrastructure, risks relating to the failure to access financing, risks relating to changes in commodity prices, risks related to current global financial conditions, risks related to current global financial conditions and the impact of COVID-19 on the Company's business, reliance on key personnel, operational risks inherent in the conduct of exploration and development activities, including the risk of accidents, labour disputes and cave-ins, regulatory risks including the risk that permits may not be obtained in a timely fashion or at all, financing, capitalization and liquidity risks, risks related to disputes concerning property titles and interests, environmental risks and the additional risks identified in the &quot;Risk Factors&quot; section of the Company's reports and filings with applicable Canadian securities regulators.</i></p><p><i>Although the Company has attempted to identify important factors that could cause actual actions, events or results to differ materially from those described in forward-looking information, there may be other factors that cause actions, events or results not to be as anticipated, estimated or intended. Accordingly, readers should not place undue reliance on forward-looking information. The forward-looking information is made as of the date of this news release. Except as required by applicable securities laws, the Company does not undertake any obligation to publicly update or revise any forward-looking information.</i></p><p><i>Neither the TSX Venture Exchange nor its Regulation Services Provider (as that term is defined in the policies of the TSX Venture Exchange) has reviewed or accepts responsibility for the adequacy or accuracy of this release.</i></p><p><strong>SOURCE: </strong>Intrepid Metals Corp.</p><br><br>View source version on accesswire.com: <br><a href='https://www.accesswire.com/783001/intrepid-metals-completes-consolidation-of-established-copper-and-gold-mineralized-trend-in-arizona'>https://www.accesswire.com/783001/intrepid-metals-completes-consolidation-of-established-copper-and-gold-mineralized-trend-in-arizona</a><br><br>",
    "search_terms": "Corral Copper,Intrepid Metals Corp.,INTR",
    "master_gid": 4161,
    "date": "2023-09-12T11:30:00.000Z",
    "tags": "|||Copper,Gold|Project Acquisition",
    "image_id": null,
    "hidden": false,
    "company_id": 2016,
    "provider": "accesswire",
    "excerpt": "Signs an agreement to acquire a 100% interest in the MAN Property in Cochise County, ArizonaMAN Property hosts 80 previous drill holes and 19,449 meters of assay data, within 622 acres of patented mining claims and BLM lode claimsSeveral high-grade copper and gold intercepts from historic drilling, including;Hole 28_08 included53.03",
    "is_regulatory": false,
    "refined_tags": [
      "Project Acquisition"
    ],
    "ftp_filename": null,
    "company_name": "Intrepid Metals Corp.",
    "exchange": "TSXV",
    "root_ticker": "INTR",
    "project_name": "Corral Copper",
    "gid": 4161,
    "location": "Arizona, United States",
    "plan_id": null,
    "description_text": "Signs an agreement to acquire a 100% interest in the MAN Property in Cochise County, Arizona MAN Property hosts 80 previous drill holes and 19,449 meters of assay data, within 622 acres of patented mining claims and BLM lode claims Several high-grade copper and gold intercepts from historic drilling, including; Hole 28_08 included 53.03 meters of 1.63% Cu and 1.45 g/t Au Hole 28_01 included 72.03 meters of 0.75% Cu, 0.34 g/t Au and 14.47 g/t Ag With the addition of the MAN Property, the Corral Copper Project now totals over 9,600 acres (15 Square miles), including 1,800 acres of patented mining claims and surface rights VANCOUVER, BC / ACCESSWIRE / September 12, 2023 / Intrepid Metals Corp. (TSXV:INTR) (OTCQB:IMTCF) (\"Intrepid\" or the \"Company\" ) is pleased to announce it has entered into an option agreement (the \" Agreement \") to acquire a 100% interest in the MAN Property (the \" Property \") from Mining and Mineral Opportunity Ltd. (\" MMO \") completing a pivotal land consolidation exercise of an established trend of known mineralization within its Corral Copper Project, in Cochise County, Arizona. The Corral Copper Project area is located approximately 20 miles from the Company's Tombstone South property and includes 50,000 metres (\" m \") of historical drilling data, with shallow mineralization of copper, silver, gold, and zinc. FIGURE 1: Aerial View of Historical Mining Activity at Corral Copper Project \"This latest acquisition will effectively complete the consolidation of a 3 km trend of known copper, gold, silver and zinc mineralization within our larger Corral Copper Project area,\" said Ken Brophy, CEO of Intrepid. \"I would like to thank everyone involved in concluding the agreement for this transaction as we can now begin to meaningfully unlock the value within the district. We will now control over 9,500 acres, with 1,800 acres made up of patented mining claims and additional surface rights that host the mineralized trend. With the historical assay data to guide us, we are excited to start drilling Corral and quickly move the historical drilling to NI 43-101 standards.\" \"When I brought Intrepid to the market in 2022, it was my hope that we would be able to do what others had failed to do: namely consolidate this district, where substantial historical drilling had been undertaken with excellent results, but where fragmented land ownership had prevented further capital investment required for establishing a coherent mineralized footprint for the region,\" added Mark Morabito, Chair of Intrepid. \"We have an exceptional team with a long history of working in the State of Arizona and Cochise County in particular, where permitting for mining projects has recently occurred. The remainder of 2023 and the first several months of 2024 will be very busy for our team as they set about reproducing and expanding the established mineralized footprint through extensive drilling.\" Historical Drilling Highlights from MAN Copper (\" Cu \") highlights, as well as corresponding gold (\" Au \") and silver (\" Ag \") grades from historical drilling on the MAN property include: 53.03m of 1.63% Cu and 1.45 grams per tonne (\"g/t\") Au (117.35m to 170.38m) in Hole 28_08 72.03m of 0.75% Cu , 0.34 g/t Au and 14.47 g/t Ag (57.91m to 129.94m) in Hole 28_01 74.98m of 0.73% Cu (74.98m to 149.96m) in Hole M_35 38.70m of 2.14% Cu (98.76m to 137.46m) in Hole M_01 106.68m of 0.65% Cu and 0.34% Au (109.73m to 216.41m) in Hole 28_09 Consolidation of the District Intrepid has concluded agreements for 100% ownership with four different land holders in the Corral district and has the core area consolidated. Management remains engaged with other stakeholders and may consolidate additional land holdings in the area as it advances its programs. The Corral Copper Project combines three previously announced agreements that have been approved by the TSX Venture Exchange: the Purchase and Sale Agreement of the Sara Claim Group announced on April 27, 2023 ; the Definitive Agreement with Cave Creek Copper Inc. announced on February 15, 2023 ; and the Purchase and Sale Agreement with Excelsior Mining Corp announced on August 26, 2022 . Previous Exploration Over 50,000m of historical drilling has been completed within the district since the late 1950s, with exploration efforts being fragmented based on land ownership. Historical drilling has encountered significant near surface intercepts. All drill results are historical in nature and based on assay information from Skyline Labs Inc. Intrepid has not yet undertaken any independent investigation of the sampling nor has it independently analyzed the results of the historical exploration work in order to verify the results. Intrepid considers these historical drill results relevant, as the Company will use this data as a guide to plan future exploration programs. Intrepid also considers the data to be reliable for these purposes; however, the Company's future exploration work will include verification of the data through drilling. FIGURE 2: Leapfrog Modelling of Historic Copper and Gold Values Within the 3km Trend (Historical results have not been prepared in accordance with NI 43-101) Agreement Terms The terms of the Agreement give Intrepid the option to acquire a 100% interest in the Property in return for certain cash and common share (\" Share \") payments to MMO. The consideration is as follows and all dollar values are United States dollars: Intrepid will take over as operator of the Property and will be responsible for future exploration work and maintaining the Properties in good standing. The Agreement is subject to the approval of the TSX Venture Exchange (\" TSXV \"). About Corral Copper The Corral Copper Project is a district scale advanced exploration and development opportunity in Cochise County, Arizona. Corral Copper is located 15 miles east of the famous mining town of Tombstone and 22 miles north of the historical Bisbee mining camp which has produced more than 8 billion pounds of copper with grades of up to 23%. Production from the Bisbee mining camp is not necessarily indicative of the mineral potential at the Corral Copper Project. The district has a mining history dating back to the late 1800s, with several small mines extracting copper from the area in the early 1900s, producing several thousand tons with grades up to 9.2% copper ore. Between 1950 and 2008, various companies explored partsof the district, but the effort was uncoordinated, non-synergistic and focused on discrete land positions and commodities due to the fragmented ownership. Intrepid has been able to secure data from various sources which provides a solid foundation in creating geological interpretations and identifying new target areas. Intrepid is confident that by combining modern exploration techniques with historical data and with a clear focus on responsible development, the Corral Copper Project can quickly become an advanced exploration stage project and move towards feasibility level studies. More details about the Corral Copper Property and the plans for 2023 will be released soon. Dr. Chris Osterman, P. Geo, a consultant of the Company, is a Qualified Person (\"QP\") as defined by National Instrument 43-101. Dr. Osterman has reviewed and is responsible for the technical information disclosed in this news release, including the statements with respect to data verification. About Intrepid Metals Corp. Intrepid Metals Corp. is a Canadian company focused on exploring for high-grade essential metals such as copper, silver, lead, and zinc mineral projects in proximity to established mining jurisdictions in southeastern Arizona, USA. The Company has acquired or has agreements to acquire several drill ready projects, including the Corral Copper Project (a district scale advanced exploration and development opportunity with significant shallow historical drill results), the Tombstone South Project (within the historical Tombstone mining district with geological similarities to the Taylor Deposit, which was purchased for $1.3B in 2018) both of which are located in Cochise County, Arizona and the Mesa Well Project (located in the Laramide Copper Porphyry Belt in Arizona). Intrepid has assembled an exceptional team with considerable experience with exploration, developing, and permitting new projects within North America. Intrepid is traded on the TSX Venture Exchange (TSX-V) under the symbol \"INTR\" and on the OTCQB Venture Market under the symbol \"IMTCF\". For more information, visit www.intrepidmetals.com . INTREPID METALS CORP. On behalf of the Company \"Ken Brophy\" CEO For further information regarding this news release, please contact: Ken Brophy CEO 604-681-8030 info@intrepidmetals.com Caroline Sawamoto Investor Relations invest@intrepidmetals.com Cautionary Note Regarding Forward-Looking Information Certain statements contained in this release constitute forward-looking information within the meaning of applicable Canadian securities laws. Such forward-looking statements relate to: (i) future exploration plans; (ii) details about potential mineralization; (iii) the exploration potential of the Corral Copper Property; (iv) potential future production; and (v) TSXV approval of the Agreement. In certain cases, forward-looking information can be identified by the use of words such as \"plans\", \"expects\", \"budget\", \"scheduled\", \"estimates\", \"forecasts\", \"intends\", \"anticipates\" or \"believes\", or variations of such words and phrases or state that certain actions, events or results \"may\", \"could\", \"would\", \"might\", \"occur\" or \"be achieved\" suggesting future outcomes, or other expectations, beliefs, plans, objectives, assumptions, intentions or statements about future events or performance. Forward-looking information contained in this news release is based on certain factors and assumptions regarding, among other things, the Company can raise additional financing to continue operations; the results of exploration activities, expectations and anticipated impact of the COVID-19 outbreak, the TSXV approves the Agreement, commodity prices, the timing and amount of future exploration and development expenditures, the availability of labour and materials, receipt of and compliance with necessary regulatory approvals and permits, the estimation of insurance coverage, and assumptions with respect to currency fluctuations, environmental risks, title disputes or claims, and other similar matters. While the Company considers these assumptions to be reasonable based on information currently available to it, they may prove to be incorrect. Forward looking information involves known and unknown risks, uncertainties and other factors which may cause the actual results, performance or achievements of the Company to be materially different from any future results, performance or achievements expressed or implied by the forward-looking information. Such factors include risks inherent in the exploration and development of mineral deposits, including risks relating to the ability to access infrastructure, risks relating to the failure to access financing, risks relating to changes in commodity prices, risks related to current global financial conditions, risks related to current global financial conditions and the impact of COVID-19 on the Company's business, reliance on key personnel, operational risks inherent in the conduct of exploration and development activities, including the risk of accidents, labour disputes and cave-ins, regulatory risks including the risk that permits may not be obtained in a timely fashion or at all, financing, capitalization and liquidity risks, risks related to disputes concerning property titles and interests, environmental risks and the additional risks identified in the \"Risk Factors\" section of the Company's reports and filings with applicable Canadian securities regulators. Although the Company has attempted to identify important factors that could cause actual actions, events or results to differ materially from those described in forward-looking information, there may be other factors that cause actions, events or results not to be as anticipated, estimated or intended. Accordingly, readers should not place undue reliance on forward-looking information. The forward-looking information is made as of the date of this news release. Except as required by applicable securities laws, the Company does not undertake any obligation to publicly update or revise any forward-looking information. Neither the TSX Venture Exchange nor its Regulation Services Provider (as that term is defined in the policies of the TSX Venture Exchange) has reviewed or accepts responsibility for the adequacy or accuracy of this release. SOURCE: Intrepid Metals Corp. View source version on accesswire.com: https://www.accesswire.com/783001/intrepid-metals-completes-consolidation-of-established-copper-and-gold-mineralized-trend-in-arizona",
    "primary_commodity": "Cu"
  },
  "articleProject": {
    "gid": 4161,
    "project_name": "Corral Copper",
    "location": "Arizona, United States"
  },
  "articleExchange": "TSXV",
  "articleCompanyId": 2016,
  "articleTicker": "INTR",
  "articleCompanyName": "Intrepid Metals Corp.",
  "allOtherCompanyProjects": [
    {
      "company_id": 2016,
      "gid": 5943,
      "project_name": "Wendover",
      "location": "Utah, United States"
    },
    {
      "company_id": 2016,
      "gid": 4161,
      "project_name": "Corral Copper",
      "location": "Arizona, United States"
    },
    {
      "company_id": 2016,
      "gid": 7621,
      "project_name": "Tombstone",
      "location": null
    }
  ],
  "allOtherCompanyNews": [
    {
      "id": 105875,
      "company_id": 2016,
      "title": "Intrepid Metals Intercepts 27.50% Copper, 10.15 gpt Gold, and 192 gpt Silver Over 0.55m in First Drill Hole of 2025 at Corral Copper",
      "link": null,
      "date": "2025-05-27T11:00:00.000Z",
      "hidden": false
    },
    {
      "id": 105246,
      "company_id": 2016,
      "title": "Intrepid Metals Completes Tombstone Amendment",
      "link": null,
      "date": "2025-05-20T21:00:00.000Z",
      "hidden": false
    },
    {
      "id": 104211,
      "company_id": 2016,
      "title": "Intrepid Metals Engages Independent Trading Group as Market Maker",
      "link": null,
      "date": "2025-05-09T21:30:00.000Z",
      "hidden": false
    },
    {
      "id": 102108,
      "company_id": 2016,
      "title": "Intrepid Metals Commences Drill Program at Corral Copper",
      "link": null,
      "date": "2025-04-29T11:00:00.000Z",
      "hidden": false
    },
    {
      "id": 100386,
      "company_id": 2016,
      "title": "Intrepid Metals Receives Drill Permits and Resumes Exploration Activities at Corral Copper",
      "link": null,
      "date": "2025-04-22T11:00:00.000Z",
      "hidden": false
    },
    {
      "id": 99778,
      "company_id": 2016,
      "title": "Intrepid Metals Identifies Several New Porphyry Copper-Gold Targets at Corral Copper",
      "link": null,
      "date": "2025-04-15T11:00:00.000Z",
      "hidden": false
    },
    {
      "id": 93040,
      "company_id": 2016,
      "title": "Intrepid Metals Announces Closing of Oversubscribed $5 Million Private Placement of Units",
      "link": null,
      "date": "2025-03-31T11:00:00.000Z",
      "hidden": false
    },
    {
      "id": 91662,
      "company_id": 2016,
      "title": "Intrepid Metals Announces Listed Issuer Financing Exemption (LIFE) Private Placement of Units",
      "link": null,
      "date": "2025-03-18T11:00:00.000Z",
      "hidden": false
    },
    {
      "id": 84107,
      "company_id": 2016,
      "title": "Rio Tinto and Ivanhoe Electric Acquire Land Positions on Eastern and Western Flanks of Intrepid Metals Corral Copper Property in Arizona",
      "link": "https://www.newsfilecorp.com/release/237181/Rio-Tinto-and-Ivanhoe-Electric-Acquire-Land-Positions-on-Eastern-and-Western-Flanks-of-Intrepid-Metals-Corral-Copper-Property-in-Arizona",
      "date": "2025-01-15T12:00:00.000Z",
      "hidden": false
    },
    {
      "id": 82629,
      "company_id": 2016,
      "title": "Intrepid Metals Appoints Mr. Richard Lock to Board of Directors",
      "link": "https://www.newsfilecorp.com/release/234560/Intrepid-Metals-Appoints-Mr.-Richard-Lock-to-Board-of-Directors",
      "date": "2024-12-19T21:10:00.000Z",
      "hidden": false
    }
  ]
}
