{
  "article": {
    "id": 71193,
    "link": "https://www.newsfilecorp.com/release/222961/SLB-Completes-Earnin-for-Pure-Energys-Clayton-Valley-Lithium-Project",
    "title": "SLB Completes Earn-in for Pure Energy's Clayton Valley Lithium Project",
    "description": "<img src=\"https://api.newsfilecorp.com/newsinfo/222961/367\" id=\"367\" width=\"2\" height=\"2\" style=\"width: 1px;  height: 1px;border: 0px solid;\" /><p>Vancouver, British Columbia--(Newsfile Corp. - September 11, 2024) - <b>Pure Energy Minerals Ltd. (TSXV: PE) (OTCQB: PEMIF)</b> (\"Pure Energy\" or \"the Company\") is pleased to report that its partner, SLB (NYSE: SLB), has completed a comprehensive technology demonstration and testing program as required  to earn-in to the Company's 100%- owned Clayton Valley lithium brine project (\"CV Project\") in Esmeralda County, Nevada.  Pure Energy and SLB formed a partnership in May of 2019, which provides for SLB to design, permit, develop and build a state-of-the-art pilot plant for Direct Lithium Extraction (\"DLE\") of lithium brines from the Clayton Valley property.  The sustainable lithium Demonstration Plant, operated by SLB, currently is producing lithium carbonate (Li2CO3) product, a direct component of lithium batteries in mobile phones, electric vehicles and energy storage.</p><p>SLB has demonstrated completion of specific technical milestones to qualify the earn-in to 100% ownership of the CV Project, which include continuous production of lithium carbonate for an extended period and achieving a material quantity of lithium product  in excess of a required purity threshold, which was verified by a third party. For further details regarding SLB's participation, please refer to Pure Energy's Annual General and Special Meeting Management Information Circular dated April 4, 2019, available on <a href=\"https://api.newsfilecorp.com/redirect/kOVBqF0e8M\">www.sedarplus.ca</a>.</p><p>Upon completion of all earn-in terms, SLB may take ownership of the CV Project claims and Pure Energy will receive a 3% net smelter return (\"NSR\") royalty payable on all commodities extracted from the Project, net of advance royalty payments made to the Company. </p><p>Pure Energy acquired its Clayton Valley mineral properties over an eleven-year period from 2012 - 2023 by staking open ground and through option agreements with neighboring claimholders. The property comprises 950 placer mineral claims over 9.450 hectares (23,360 acres) in good standing, granted by the US Bureau of Land Management (\"BLM\"). These constitute one of the largest mineral landholdings within Clayton Valley.  During the period 2014-2019, nine bore holes were completed by Pure Energy, of which the production-scale hole CV-9 provides brine flow to the pilot plant.  A Preliminary Economic Assessment (\"PEA\") study, as amended, was published in April of 2018, incorporating results from the initial eight bore holes, and an additional seven holes subsequently were acquired together with properties. Pure Energy initiated the permitting process for development of a pilot plant in 2017. </p><p>During the past five years, SLB worked closely with the BLM and the State of Nevada to obtain necessary permits for construction and operation of the pilot plant, in addition to meeting all environmental requirements for site and resource use.  Construction was initiated in Q1 2023 and the first product of Li2CO3 occurred in March of 2024.  </p><p>\"The CV Project Pilot Plant represents one of the largest and most advanced DLE plant of its kind in United States\", remarked Joseph Mullin, CEO of Pure Energy Minerals. \"We are very excited for Pure Energy to be part of SLB's development of clean energy technologies through its New Energy business.  Our partnership has been productive, professional and beneficial to both entities.\" </p><p>The information in this news release has been reviewed and approved by Mary L. Little, MMSA QP#01503, who is a Qualified Person as defined by National Instrument 43-101.  Ms. Little is a director of the Company and therefore is not considered to be independent.</p><p>On behalf of the Board of Directors,<br />\"Joseph Mullin\"<br />CEO, Pure Energy Minerals Ltd.</p><div id=\"contactInfo\"><p><b>CONTACT:</b></p><p>Pure Energy Minerals Limited (<a href=\"https://api.newsfilecorp.com/redirect/BpozDiGxrv\">www.pureenergyminerals.com</a>)<br />Email: <a href=\"mailto:info@pureenergyminerals.com\">info@pureenergyminerals.com</a><br />Telephone - +1 604 608 6611</p></div><p><b>Cautionary Statements and Forward-Looking Information</b></p><p>The information in this news release contains forward-looking statements that are subject to a number of known and unknown risks, uncertainties and other factors that may cause actual results to differ materially from those anticipated in our forward-looking statements. Factors that could cause such differences include changes in world commodity markets, equity markets, costs and supply of materials relevant to the mining industry, change in government and changes to regulations affecting the mining industry. Forward-looking statements in this release may include future exploration and development of the Clayton Valley Project. Although we believe the expectations reflected in our forward-looking statements are reasonable, results may vary, and we cannot guarantee future results, levels of activity, performance or achievements.</p><p>The Company does not undertake to update any forward-looking information, except as required by applicable laws.</p><p><i>Neither TSX Venture Exchange nor its Regulation Services Provider (as that term is defined in the policies of TSX Venture Exchange) accepts responsibility for the adequacy or accuracy of this release.</i></p><p id=\"corporateLinkBack\">To view the source version of this press release, please visit <a href=\"https://api.newsfilecorp.com/redirect/55VPDc4Eej\">https://www.newsfilecorp.com/release/222961</a></p>",
    "search_terms": "Clayton Valley,Pure Energy Minerals Ltd.,PE",
    "master_gid": 2610,
    "date": "2024-09-11T13:21:00.000Z",
    "tags": "USA|Nevada||Lithium|Project Acquisition",
    "image_id": null,
    "hidden": false,
    "company_id": 945,
    "provider": "newsfilecorp",
    "excerpt": "Vancouver, British Columbia--(Newsfile Corp. - September 11, 2024) -Pure Energy Minerals Ltd. (TSXV: PE) (OTCQB: PEMIF)(\"Pure Energy\" or \"the Company\") is pleased to report that its partner, SLB (NYSE: SLB), has completed a comprehensive technology demonstration and testing program as required to earn-in to the Company's 100%- owned Clayton Valley",
    "is_regulatory": false,
    "refined_tags": null,
    "ftp_filename": null,
    "company_name": "Cruz Battery Metals Corp.",
    "exchange": "TSXV",
    "root_ticker": "PE",
    "project_name": "Clayton Valley",
    "gid": 2610,
    "location": "Nevada, United States",
    "plan_id": null,
    "description_text": "Vancouver, British Columbia--(Newsfile Corp. - September 11, 2024) - Pure Energy Minerals Ltd. (TSXV: PE) (OTCQB: PEMIF) (\"Pure Energy\" or \"the Company\") is pleased to report that its partner, SLB (NYSE: SLB), has completed a comprehensive technology demonstration and testing program as required  to earn-in to the Company's 100%- owned Clayton Valley lithium brine project (\"CV Project\") in Esmeralda County, Nevada.  Pure Energy and SLB formed a partnership in May of 2019, which provides for SLB to design, permit, develop and build a state-of-the-art pilot plant for Direct Lithium Extraction (\"DLE\") of lithium brines from the Clayton Valley property.  The sustainable lithium Demonstration Plant, operated by SLB, currently is producing lithium carbonate (Li2CO3) product, a direct component of lithium batteries in mobile phones, electric vehicles and energy storage. SLB has demonstrated completion of specific technical milestones to qualify the earn-in to 100% ownership of the CV Project, which include continuous production of lithium carbonate for an extended period and achieving a material quantity of lithium product  in excess of a required purity threshold, which was verified by a third party. For further details regarding SLB's participation, please refer to Pure Energy's Annual General and Special Meeting Management Information Circular dated April 4, 2019, available on www.sedarplus.ca . Upon completion of all earn-in terms, SLB may take ownership of the CV Project claims and Pure Energy will receive a 3% net smelter return (\"NSR\") royalty payable on all commodities extracted from the Project, net of advance royalty payments made to the Company. Pure Energy acquired its Clayton Valley mineral properties over an eleven-year period from 2012 - 2023 by staking open ground and through option agreements with neighboring claimholders. The property comprises 950 placer mineral claims over 9.450 hectares (23,360 acres) in good standing, granted by the US Bureau of Land Management (\"BLM\"). These constitute one of the largest mineral landholdings within Clayton Valley.  During the period 2014-2019, nine bore holes were completed by Pure Energy, of which the production-scale hole CV-9 provides brine flow to the pilot plant.  A Preliminary Economic Assessment (\"PEA\") study, as amended, was published in April of 2018, incorporating results from the initial eight bore holes, and an additional seven holes subsequently were acquired together with properties. Pure Energy initiated the permitting process for development of a pilot plant in 2017. During the past five years, SLB worked closely with the BLM and the State of Nevada to obtain necessary permits for construction and operation of the pilot plant, in addition to meeting all environmental requirements for site and resource use.  Construction was initiated in Q1 2023 and the first product of Li2CO3 occurred in March of 2024. \"The CV Project Pilot Plant represents one of the largest and most advanced DLE plant of its kind in United States\", remarked Joseph Mullin, CEO of Pure Energy Minerals. \"We are very excited for Pure Energy to be part of SLB's development of clean energy technologies through its New Energy business.  Our partnership has been productive, professional and beneficial to both entities.\" The information in this news release has been reviewed and approved by Mary L. Little, MMSA QP#01503, who is a Qualified Person as defined by National Instrument 43-101.  Ms. Little is a director of the Company and therefore is not considered to be independent. On behalf of the Board of Directors, \"Joseph Mullin\" CEO, Pure Energy Minerals Ltd. CONTACT: Pure Energy Minerals Limited ( www.pureenergyminerals.com ) Email: info@pureenergyminerals.com Telephone - +1 604 608 6611 Cautionary Statements and Forward-Looking Information The information in this news release contains forward-looking statements that are subject to a number of known and unknown risks, uncertainties and other factors that may cause actual results to differ materially from those anticipated in our forward-looking statements. Factors that could cause such differences include changes in world commodity markets, equity markets, costs and supply of materials relevant to the mining industry, change in government and changes to regulations affecting the mining industry. Forward-looking statements in this release may include future exploration and development of the Clayton Valley Project. Although we believe the expectations reflected in our forward-looking statements are reasonable, results may vary, and we cannot guarantee future results, levels of activity, performance or achievements. The Company does not undertake to update any forward-looking information, except as required by applicable laws. Neither TSX Venture Exchange nor its Regulation Services Provider (as that term is defined in the policies of TSX Venture Exchange) accepts responsibility for the adequacy or accuracy of this release. To view the source version of this press release, please visit https://www.newsfilecorp.com/release/222961",
    "primary_commodity": "Li"
  },
  "articleProject": {
    "gid": 2610,
    "project_name": "Clayton Valley",
    "location": "Nevada, United States"
  },
  "articleExchange": "TSXV",
  "articleCompanyId": 945,
  "articleTicker": "PE",
  "articleCompanyName": "Pure Energy Minerals Ltd.",
  "allOtherCompanyProjects": [
    {
      "company_id": 945,
      "gid": 2610,
      "project_name": "Clayton Valley",
      "location": "Nevada, United States"
    }
  ],
  "allOtherCompanyNews": [
    {
      "id": 105667,
      "company_id": 945,
      "title": "Pure Energy Minerals Announces New Director",
      "link": null,
      "date": "2025-05-24T01:18:00.000Z",
      "hidden": false
    },
    {
      "id": 79670,
      "company_id": 945,
      "title": "Pure Energy Minerals Announces Director Change",
      "link": "https://www.newsfilecorp.com/release/230981/Pure-Energy-Minerals-Announces-Director-Change",
      "date": "2024-11-21T23:23:00.000Z",
      "hidden": false
    },
    {
      "id": 75729,
      "company_id": 945,
      "title": "Pure Energy Minerals Announces Board Change",
      "link": "https://www.newsfilecorp.com/release/227500/Pure-Energy-Minerals-Announces-Board-Change",
      "date": "2024-10-23T00:23:00.000Z",
      "hidden": false
    },
    {
      "id": 71193,
      "company_id": 945,
      "title": "SLB Completes Earn-in for Pure Energy's Clayton Valley Lithium Project",
      "link": "https://www.newsfilecorp.com/release/222961/SLB-Completes-Earnin-for-Pure-Energys-Clayton-Valley-Lithium-Project",
      "date": "2024-09-11T13:21:00.000Z",
      "hidden": false
    },
    {
      "id": 70414,
      "company_id": 945,
      "title": "Pure Energy Signs Letter of Intent to Option Railroad Valley Property from Ameriwest Lithium Inc",
      "link": "https://www.newsfilecorp.com/release/222138/Pure-Energy-Signs-Letter-of-Intent-to-Option-Railroad-Valley-Property-from-Ameriwest-Lithium-Inc",
      "date": "2024-09-04T21:00:00.000Z",
      "hidden": false
    },
    {
      "id": 69160,
      "company_id": 945,
      "title": "Pure Energy Minerals Grants Stock Options",
      "link": "https://www.newsfilecorp.com/release/220890/Pure-Energy-Minerals-Grants-Stock-Options",
      "date": "2024-08-23T00:20:00.000Z",
      "hidden": false
    },
    {
      "id": 64002,
      "company_id": 945,
      "title": "Pure Energy Minerals Provides Update for Clayton Valley Lithium Brine Project",
      "link": "https://www.newsfilecorp.com/release/215223/Pure-Energy-Minerals-Provides-Update-for-Clayton-Valley-Lithium-Brine-Project",
      "date": "2024-07-02T13:03:00.000Z",
      "hidden": false
    },
    {
      "id": 55499,
      "company_id": 945,
      "title": "Pure Energy Minerals Announces AGM Voting Results and the Election of Two New Directors to the Board",
      "link": "https://www.newsfilecorp.com/release/212410/Pure-Energy-Minerals-Announces-AGM-Voting-Results-and-the-Election-of-Two-New-Directors-to-the-Board",
      "date": "2024-06-11T12:30:00.000Z",
      "hidden": false
    },
    {
      "id": 54188,
      "company_id": 945,
      "title": "Pure Energy Minerals to Hold Annual Meeting June 5, 2024",
      "link": "https://www.newsfilecorp.com/release/209922/Pure-Energy-Minerals-to-Hold-Annual-Meeting-June-5-2024",
      "date": "2024-05-21T12:30:00.000Z",
      "hidden": false
    },
    {
      "id": 44521,
      "company_id": 945,
      "title": "Pure Energy Minerals Appoints Patrick Galletti to Board of Directors",
      "link": "https://www.newsfilecorp.com/release/188177/Pure-Energy-Minerals-Appoints-Patrick-Galletti-to-Board-of-Directors",
      "date": "2023-11-21T01:42:00.000Z",
      "hidden": false
    }
  ]
}