{
  "article": {
    "id": 7368,
    "link": "https://www.globenewswire.com/news-release/2017/05/31/1004654/0/en/Pure-Energy-Closes-Acquisition-of-Clayton-Valley-Properties-and-2-Million-Strategic-Investment-From-Lithium-X.html",
    "title": "Pure Energy Closes Acquisition of Clayton Valley Properties and $2 Million Strategic Investment From Lithium X",
    "description": "<p align=\"justify\">VANCOUVER, British Columbia, May  31, 2017  (GLOBE NEWSWIRE) -- Pure Energy Minerals Limited (TSX-V:PE) (FRANKFURT:A111EG) (OTCQB:PEMIF) (the “Company” or “Pure Energy”) is pleased to announce that it has closed its previously announced transactions with Lithium X Energy Corp (“Lithium X”), GeoXplor Corp. (“GeoXplor”), and Clayton Valley Lithium Inc. (“CVL”, together with GeoXplor, the “Optionors”) and has acquired Lithium X’s interest in 756 unpatented mineral claims covering approximately 15,000 acres (the “LIX Claims”) in Clayton Valley, Nevada (the “Acquisition”). With the addition of the LIX Claims, Pure Energy will have an interest in 1,104 unpatented mineral claims covering approximately 26,000 acres in Esmeralda County, now dubbed the Clayton Valley Lithium Brine Project (“CV Project”). &#160;<br /></p>  <p><strong>Highlights of the Transactions</strong></p>  <ul type=\"disc\"><li>Consolidates dominant land positions in North America’s only productive lithium district&#160;<br />- Surrounds Albemarle’s Silver Peak Lithium Mine on the north and south&#160;<br />- Control of &gt;26,000 acres of Federal mining claims</li><li>Adds new exploration targets with demonstrated lithium brine in Clayton Valley north</li><li>Resource growth potential only 1.1km west of newly identified CV-8 higher grade brine&#160;</li><li>Significantly decreases royalties on many Clayton Valley south claims</li><li>Reduces costs of exploration by assuming operatorship over the entire expanded project</li><li>Acquisition includes 100% ownership of&#160; &gt;9,500 acres of mining claims at Clayton Valley west</li><li>Strengthens Pure Energy board with the addition of Bassam Moubarak from Lithium X</li></ul>  <p align=\"justify\">In order to complete the Acquisition, Pure Energy issued to Lithium X 20,038,182 common shares (the “Consideration Shares”) and 2,022,290 common share purchase warrants (the “Consideration Warrants”). Lithium X also completed a $2 million strategic investment in Pure Energy pursuant to which the Company issued 3,571,428 units (“Units”) at a price of $0.56 per Unit (the “Investment”). Each Unit is comprised of one common share (an “Investment Share”) and one-half of one common share purchase warrant (each whole warrant, an “Investment Warrant”). Each Consideration Warrant and each Investment Warrant is exercisable to acquire one common share at an exercise price of $0.75 per common share for a period of 3 years, provided that, subject to certain restrictions, Pure Energy may accelerate the expiry date of the Consideration Warrants and Investment Warrants, as applicable, by providing Lithium X 30 days’ notice upon the occurrence of the 20<sup>th</sup> consecutive trading day on which the closing price of the Company’s common shares on the TSX Venture Exchange is equal to or greater than $1.25. In addition, Lithium X has agreed that it will not, directly or indirectly, sell or transfer: (i) any of the Consideration Warrants for a period of 12 months; and (ii) any of the Consideration Shares except in accordance with a release schedule whereby 50% of the Consideration Shares may be sold after 12 months, and a further 25% each 3 months thereafter, provided that the release schedule shall be accelerated if the closing price of the common shares on the TSXV is equal to or greater than $1.12 for a period of 20 consecutive trading days.</p>  <p align=\"justify\">Pure Energy also completed the initial payment obligations pursuant to a new option agreement (the “Option Agreement”) with the Optionors that superseded and terminated pre-existing option agreements with Pure Energy and Lithium X. Pursuant to the Option Agreement, Pure Energy assumes operatorship on the properties and will have the option to acquire a 100% interest in 359 unpatented mineral claims covering approximately 10,000 acres. The initial payments included the issuance to GeoXplor of 1,250,000 common shares of the Company and a cash payment of US$375,000.</p>  <p align=\"justify\">In connection with the Investment, the Company and Lithium X entered into an investor rights agreement (the “Investor Rights Agreement”) which provides that, for so long as Lithium X maintains a 5% partially-diluted interest, it shall have: (i) a right maintain its pro rata interest ownership in the Company; and (ii) a right to nominate one director to the Company’s board. The Investor Rights Agreement also provides that Lithium X will vote in favour of all matters proposed by management of the Company for a period of 24 months. Lithium X has also agreed to certain provisions to facilitate the orderly sale of any common shares held by it.&#160;</p>  <p align=\"justify\">The Company is also pleased to announce that in accordance with the Investor Rights Agreement, it has appointed Bassam Moubarak as a director. Mr. Moubarak is the Chief Financial Officer of Lithium X. Mr. Moubarak is a Chartered Professional Accountant who has held senior executive positions for various mining companies for over 10 years including most recently Goldrock Mines Corp. where he played a key role in its sale to Fortuna Silver Mines Inc. for $180 million. He was Chief Financial Officer of Petaquilla Minerals Ltd. where he was instrumental in raising in excess of $120 million to develop and bring into production the Molejon Gold Mine. He also played a key role in the sale of Petaquilla Copper Ltd. to Inmet Mining Corporation for $400 million and negotiated the sale of Golden Arrow Resources Corporation's 1% net smelter royalty on the Gualcamayo Gold Mine to Premier Royalty Inc. for $17.75 million.</p>  <p align=\"justify\">For further details relating to the Acquisition, the Investment and the Option Agreement, please refer to the Company’s comprehensive news release dated May 11, 2017.</p>  <p align=\"justify\">The Consideration Shares, Investment Shares, Consideration Warrants, Investment Warrants and the shares issued to GeoXplor are subject to a four-month hold period in accordance with applicable securities laws. Upon issuance, the Consideration Shares and Investment Shares will represent 19.99% of the issued and outstanding common shares of the Company. Upon issuance, the Investment Shares, Consideration Shares, Investment Warrants and Consideration Warrants will represent 22.5% of the issued and outstanding common shares of the Company on an as-converted partially diluted basis.&#160; Lithium X has agreed that it will not exercise any Investment Warrants or Consideration Warrants if, upon exercise, Lithium X would become a ‘Control Person’ or the exercise would result in a ‘Change of Control’ of Pure Energy (as such terms are defined in the policies of the TSXV) unless Pure Energy has obtained the prior approval of its shareholders and of the TSXV, as applicable.</p>  <p><strong>About Pure Energy Minerals Limited</strong></p>  <p align=\"justify\">Pure Energy is a lithium resource developer that is driven to become a low-cost supplier for the growing lithium battery industry.&#160;The Company’s current focus is on the development of the CV Project and the adjoining Glory Lithium Clay Project in Clayton Valley, Nevada.&#160;Pure Energy also recently acquired a purchase option on a major new lithium brine project in the Lithium Triangle of South America, the Terra Cotta Project (“TCP”).&#160; The TCP is located on Pocitos Salar in Salta, Argentina, where it enjoys some of the best infrastructure and access of any lithium brine exploration project in Argentina.</p>  <p align=\"justify\">Pure Energy has developed core strengths in innovative development and processing technologies for lithium brines and lithium mineral deposits.&#160; Key attributes and activities include:</p>  <ul type=\"disc\"><li>A large, strategic land position with excellent infrastructure in a first-class mining jurisdiction: approximately 10,700 hectares (26,000 acres) in Clayton Valley, Esmeralda County, Nevada, located a 3-hour drive from the Gigafactory;</li><li>The only lithium brine resource in North America except for Albemarle’s adjoining Silver Peak lithium brine mine, which is the only producing lithium operation in North America;</li><li>An inferred mineral resource containing approximately 816,000 metric tonnes of Lithium Carbonate Equivalent (LCE) at an average grade of approximately 102 mg/L lithium, reported in accordance with NI 43-101 (see July 2015 Inferred Resource Report);</li><li>An advanced program of testing the efficacy and economics of modern, environmentally-responsible processing technologies to convert the CV brines into high purity lithium products for new energy storage uses;</li><li>A new early stage exploration program on the 13,000-hectare (32,000 acre) Terra Cotta Project (TCP), located on Pocitos Salar in Salta Province; and</li><li>An active business development program, applying Company expertise to the evaluation of new lithium targets around the world.</li></ul>  <p>On behalf of the Board of Directors,</p>  <p>“Patrick Highsmith”<br /> Chief Executive Officer<br /> <br />CONTACT:</p>  <p>Pure Energy Minerals Limited (<a href=\"https://www.globenewswire.com/Tracker?data=li0kF9u5vCQy0fPJRkYXo20zKmUQq9h3AFpBLLX57eVENec5MQp-fO6sQpcx2vHpuGjb9wMqqpnkeJ7qV4ma9oXj4sfYtI9EFExrpV8slVBpNDhjfZaMs3l3UXbK_sI4\" rel=\"nofollow\" target=\"_blank\" title=\"www.pureenergyminerals.com\">www.pureenergyminerals.com</a>)<br />Email: <a href=\"https://www.globenewswire.com/Tracker?data=1GLsObSm0Ww7rIcFPSv8dyugfvzGg_Spy2LJiJjB5jQw-MsgK3pXno1VIj7RM7lxB9iQlso8HGqO6BVqiR48a_IHJVb5QTOnRonIUODKLKormp_yYTo79H4Qc3trrn4U\" rel=\"nofollow\" target=\"_blank\" title=\"info@pureenergyminerals.com\">info@pureenergyminerals.com</a><br />Telephone – 604 608 6611, ext 5</p>  <p align=\"justify\">Forward Looking Statements: The information in this news release contains forward looking statements that are subject to a number of known and unknown risks, uncertainties and other factors that may cause actual results to differ materially from those anticipated in our forward looking statements. Factors that could cause such differences include: changes in world commodity markets, equity markets, costs and supply of materials relevant to the mining industry, change in government and changes to regulations affecting the mining industry. Forward-looking statements in this release include statements regarding: future issuances of securities; future payments under the Option Agreement; the preparation and delivery of a feasibility study; and the benefits of the Acquisition, the Investment and the transactions contemplated by the Option Agreement. Although we believe the expectations reflected in our forward looking statements are reasonable, results may vary, and we cannot guarantee future results, levels of activity, performance or achievements.&#160;</p>  <p align=\"justify\">Neither TSX Venture Exchange nor its Regulation Services Provider (as that term is defined in the policies of TSX Venture Exchange) accepts responsibility for the adequacy or accuracy of this release.</p>",
    "search_terms": "Clayton Valley,Pure Energy Minerals Ltd.,PE",
    "master_gid": 2610,
    "date": "2017-05-31T07:02:00.000Z",
    "tags": "USA|Nevada|Clayton Valley|Silver,Lithium|Project Acquisition",
    "image_id": null,
    "hidden": false,
    "company_id": 945,
    "provider": null,
    "excerpt": "VANCOUVER, British Columbia, May  31, 2017  (GLOBE NEWSWIRE) -- Pure Energy Minerals Limited (TSX-V:PE) (FRANKFURT:A111EG) (OTCQB:PEMIF) (the “Company” or “Pure Energy”) is pleased to announce that it has closed its previously announced transactions with Lithium X Energy Corp (“Lithium X”), GeoXplor Corp. (“GeoXplor”), and Clayton Valley Lithium Inc.",
    "is_regulatory": false,
    "refined_tags": [
      "Project Acquisition"
    ],
    "ftp_filename": null,
    "company_name": "Cruz Battery Metals Corp.",
    "exchange": "TSXV",
    "root_ticker": "PE",
    "project_name": "Clayton Valley",
    "gid": 2610,
    "location": "Nevada, United States",
    "plan_id": null,
    "description_text": "VANCOUVER, British Columbia, May  31, 2017  (GLOBE NEWSWIRE) -- Pure Energy Minerals Limited (TSX-V:PE) (FRANKFURT:A111EG) (OTCQB:PEMIF) (the “Company” or “Pure Energy”) is pleased to announce that it has closed its previously announced transactions with Lithium X Energy Corp (“Lithium X”), GeoXplor Corp. (“GeoXplor”), and Clayton Valley Lithium Inc. (“CVL”, together with GeoXplor, the “Optionors”) and has acquired Lithium X’s interest in 756 unpatented mineral claims covering approximately 15,000 acres (the “LIX Claims”) in Clayton Valley, Nevada (the “Acquisition”). With the addition of the LIX Claims, Pure Energy will have an interest in 1,104 unpatented mineral claims covering approximately 26,000 acres in Esmeralda County, now dubbed the Clayton Valley Lithium Brine Project (“CV Project”). Highlights of the Transactions Consolidates dominant land positions in North America’s only productive lithium district - Surrounds Albemarle’s Silver Peak Lithium Mine on the north and south - Control of >26,000 acres of Federal mining claims Adds new exploration targets with demonstrated lithium brine in Clayton Valley north Resource growth potential only 1.1km west of newly identified CV-8 higher grade brine Significantly decreases royalties on many Clayton Valley south claims Reduces costs of exploration by assuming operatorship over the entire expanded project Acquisition includes 100% ownership of  >9,500 acres of mining claims at Clayton Valley west Strengthens Pure Energy board with the addition of Bassam Moubarak from Lithium X In order to complete the Acquisition, Pure Energy issued to Lithium X 20,038,182 common shares (the “Consideration Shares”) and 2,022,290 common share purchase warrants (the “Consideration Warrants”). Lithium X also completed a $2 million strategic investment in Pure Energy pursuant to which the Company issued 3,571,428 units (“Units”) at a price of $0.56 per Unit (the “Investment”). Each Unit is comprised of one common share (an “Investment Share”) and one-half of one common share purchase warrant (each whole warrant, an “Investment Warrant”). Each Consideration Warrant and each Investment Warrant is exercisable to acquire one common share at an exercise price of $0.75 per common share for a period of 3 years, provided that, subject to certain restrictions, Pure Energy may accelerate the expiry date of the Consideration Warrants and Investment Warrants, as applicable, by providing Lithium X 30 days’ notice upon the occurrence of the 20 th consecutive trading day on which the closing price of the Company’s common shares on the TSX Venture Exchange is equal to or greater than $1.25. In addition, Lithium X has agreed that it will not, directly or indirectly, sell or transfer: (i) any of the Consideration Warrants for a period of 12 months; and (ii) any of the Consideration Shares except in accordance with a release schedule whereby 50% of the Consideration Shares may be sold after 12 months, and a further 25% each 3 months thereafter, provided that the release schedule shall be accelerated if the closing price of the common shares on the TSXV is equal to or greater than $1.12 for a period of 20 consecutive trading days. Pure Energy also completed the initial payment obligations pursuant to a new option agreement (the “Option Agreement”) with the Optionors that superseded and terminated pre-existing option agreements with Pure Energy and Lithium X. Pursuant to the Option Agreement, Pure Energy assumes operatorship on the properties and will have the option to acquire a 100% interest in 359 unpatented mineral claims covering approximately 10,000 acres. The initial payments included the issuance to GeoXplor of 1,250,000 common shares of the Company and a cash payment of US$375,000. In connection with the Investment, the Company and Lithium X entered into an investor rights agreement (the “Investor Rights Agreement”) which provides that, for so long as Lithium X maintains a 5% partially-diluted interest, it shall have: (i) a right maintain its pro rata interest ownership in the Company; and (ii) a right to nominate one director to the Company’s board. The Investor Rights Agreement also provides that Lithium X will vote in favour of all matters proposed by management of the Company for a period of 24 months. Lithium X has also agreed to certain provisions to facilitate the orderly sale of any common shares held by it. The Company is also pleased to announce that in accordance with the Investor Rights Agreement, it has appointed Bassam Moubarak as a director. Mr. Moubarak is the Chief Financial Officer of Lithium X. Mr. Moubarak is a Chartered Professional Accountant who has held senior executive positions for various mining companies for over 10 years including most recently Goldrock Mines Corp. where he played a key role in its sale to Fortuna Silver Mines Inc. for $180 million. He was Chief Financial Officer of Petaquilla Minerals Ltd. where he was instrumental in raising in excess of $120 million to develop and bring into production the Molejon Gold Mine. He also played a key role in the sale of Petaquilla Copper Ltd. to Inmet Mining Corporation for $400 million and negotiated the sale of Golden Arrow Resources Corporation's 1% net smelter royalty on the Gualcamayo Gold Mine to Premier Royalty Inc. for $17.75 million. For further details relating to the Acquisition, the Investment and the Option Agreement, please refer to the Company’s comprehensive news release dated May 11, 2017. The Consideration Shares, Investment Shares, Consideration Warrants, Investment Warrants and the shares issued to GeoXplor are subject to a four-month hold period in accordance with applicable securities laws. Upon issuance, the Consideration Shares and Investment Shares will represent 19.99% of the issued and outstanding common shares of the Company. Upon issuance, the Investment Shares, Consideration Shares, Investment Warrants and Consideration Warrants will represent 22.5% of the issued and outstanding common shares of the Company on an as-converted partially diluted basis.  Lithium X has agreed that it will not exercise any Investment Warrants or Consideration Warrants if, upon exercise, Lithium X would become a ‘Control Person’ or the exercise would result in a ‘Change of Control’ of Pure Energy (as such terms are defined in the policies of the TSXV) unless Pure Energy has obtained the prior approval of its shareholders and of the TSXV, as applicable. About Pure Energy Minerals Limited Pure Energy is a lithium resource developer that is driven to become a low-cost supplier for the growing lithium battery industry. The Company’s current focus is on the development of the CV Project and the adjoining Glory Lithium Clay Project in Clayton Valley, Nevada. Pure Energy also recently acquired a purchase option on a major new lithium brine project in the Lithium Triangle of South America, the Terra Cotta Project (“TCP”).  The TCP is located on Pocitos Salar in Salta, Argentina, where it enjoys some of the best infrastructure and access of any lithium brine exploration project in Argentina. Pure Energy has developed core strengths in innovative development and processing technologies for lithium brines and lithium mineral deposits.  Key attributes and activities include: A large, strategic land position with excellent infrastructure in a first-class mining jurisdiction: approximately 10,700 hectares (26,000 acres) in Clayton Valley, Esmeralda County, Nevada, located a 3-hour drive from the Gigafactory; The only lithium brine resource in North America except for Albemarle’s adjoining Silver Peak lithium brine mine, which is the only producing lithium operation in North America; An inferred mineral resource containing approximately 816,000 metric tonnes of Lithium Carbonate Equivalent (LCE) at an average grade of approximately 102 mg/L lithium, reported in accordance with NI 43-101 (see July 2015 Inferred Resource Report); An advanced program of testing the efficacy and economics of modern, environmentally-responsible processing technologies to convert the CV brines into high purity lithium products for new energy storage uses; A new early stage exploration program on the 13,000-hectare (32,000 acre) Terra Cotta Project (TCP), located on Pocitos Salar in Salta Province; and An active business development program, applying Company expertise to the evaluation of new lithium targets around the world. On behalf of the Board of Directors, “Patrick Highsmith” Chief Executive Officer CONTACT: Pure Energy Minerals Limited ( www.pureenergyminerals.com ) Email: info@pureenergyminerals.com Telephone – 604 608 6611, ext 5 Forward Looking Statements: The information in this news release contains forward looking statements that are subject to a number of known and unknown risks, uncertainties and other factors that may cause actual results to differ materially from those anticipated in our forward looking statements. Factors that could cause such differences include: changes in world commodity markets, equity markets, costs and supply of materials relevant to the mining industry, change in government and changes to regulations affecting the mining industry. Forward-looking statements in this release include statements regarding: future issuances of securities; future payments under the Option Agreement; the preparation and delivery of a feasibility study; and the benefits of the Acquisition, the Investment and the transactions contemplated by the Option Agreement. Although we believe the expectations reflected in our forward looking statements are reasonable, results may vary, and we cannot guarantee future results, levels of activity, performance or achievements. Neither TSX Venture Exchange nor its Regulation Services Provider (as that term is defined in the policies of TSX Venture Exchange) accepts responsibility for the adequacy or accuracy of this release.",
    "primary_commodity": "Li"
  },
  "articleProject": {
    "gid": 2610,
    "project_name": "Clayton Valley",
    "location": "Nevada, United States"
  },
  "articleExchange": "TSXV",
  "articleCompanyId": 945,
  "articleTicker": "PE",
  "articleCompanyName": "Pure Energy Minerals Ltd.",
  "allOtherCompanyProjects": [
    {
      "company_id": 945,
      "gid": 2610,
      "project_name": "Clayton Valley",
      "location": "Nevada, United States"
    }
  ],
  "allOtherCompanyNews": [
    {
      "id": 105667,
      "company_id": 945,
      "title": "Pure Energy Minerals Announces New Director",
      "link": null,
      "date": "2025-05-24T01:18:00.000Z",
      "hidden": false
    },
    {
      "id": 79670,
      "company_id": 945,
      "title": "Pure Energy Minerals Announces Director Change",
      "link": "https://www.newsfilecorp.com/release/230981/Pure-Energy-Minerals-Announces-Director-Change",
      "date": "2024-11-21T23:23:00.000Z",
      "hidden": false
    },
    {
      "id": 75729,
      "company_id": 945,
      "title": "Pure Energy Minerals Announces Board Change",
      "link": "https://www.newsfilecorp.com/release/227500/Pure-Energy-Minerals-Announces-Board-Change",
      "date": "2024-10-23T00:23:00.000Z",
      "hidden": false
    },
    {
      "id": 71193,
      "company_id": 945,
      "title": "SLB Completes Earn-in for Pure Energy's Clayton Valley Lithium Project",
      "link": "https://www.newsfilecorp.com/release/222961/SLB-Completes-Earnin-for-Pure-Energys-Clayton-Valley-Lithium-Project",
      "date": "2024-09-11T13:21:00.000Z",
      "hidden": false
    },
    {
      "id": 70414,
      "company_id": 945,
      "title": "Pure Energy Signs Letter of Intent to Option Railroad Valley Property from Ameriwest Lithium Inc",
      "link": "https://www.newsfilecorp.com/release/222138/Pure-Energy-Signs-Letter-of-Intent-to-Option-Railroad-Valley-Property-from-Ameriwest-Lithium-Inc",
      "date": "2024-09-04T21:00:00.000Z",
      "hidden": false
    },
    {
      "id": 69160,
      "company_id": 945,
      "title": "Pure Energy Minerals Grants Stock Options",
      "link": "https://www.newsfilecorp.com/release/220890/Pure-Energy-Minerals-Grants-Stock-Options",
      "date": "2024-08-23T00:20:00.000Z",
      "hidden": false
    },
    {
      "id": 64002,
      "company_id": 945,
      "title": "Pure Energy Minerals Provides Update for Clayton Valley Lithium Brine Project",
      "link": "https://www.newsfilecorp.com/release/215223/Pure-Energy-Minerals-Provides-Update-for-Clayton-Valley-Lithium-Brine-Project",
      "date": "2024-07-02T13:03:00.000Z",
      "hidden": false
    },
    {
      "id": 55499,
      "company_id": 945,
      "title": "Pure Energy Minerals Announces AGM Voting Results and the Election of Two New Directors to the Board",
      "link": "https://www.newsfilecorp.com/release/212410/Pure-Energy-Minerals-Announces-AGM-Voting-Results-and-the-Election-of-Two-New-Directors-to-the-Board",
      "date": "2024-06-11T12:30:00.000Z",
      "hidden": false
    },
    {
      "id": 54188,
      "company_id": 945,
      "title": "Pure Energy Minerals to Hold Annual Meeting June 5, 2024",
      "link": "https://www.newsfilecorp.com/release/209922/Pure-Energy-Minerals-to-Hold-Annual-Meeting-June-5-2024",
      "date": "2024-05-21T12:30:00.000Z",
      "hidden": false
    },
    {
      "id": 44521,
      "company_id": 945,
      "title": "Pure Energy Minerals Appoints Patrick Galletti to Board of Directors",
      "link": "https://www.newsfilecorp.com/release/188177/Pure-Energy-Minerals-Appoints-Patrick-Galletti-to-Board-of-Directors",
      "date": "2023-11-21T01:42:00.000Z",
      "hidden": false
    }
  ]
}