{
  "article": {
    "id": 83796,
    "link": "https://www.newsfilecorp.com/release/236920/RETRANSMISSION-Cruz-Battery-Metals-Acquires-the-Central-Clayton-Valley-Lithium-Brine-Project-in-Nevada-Completely-Surrounded-by-SLBs-Property",
    "title": "RETRANSMISSION: Cruz Battery Metals Acquires the Central Clayton Valley Lithium Brine Project in Nevada Completely Surrounded by SLB's Property",
    "description": "<img src=\"https://api.newsfilecorp.com/newsinfo/236920/367\" id=\"367\" width=\"2\" height=\"2\" style=\"width: 1px;  height: 1px;border: 0px solid;\" /><p>Vancouver, British Columbia--(Newsfile Corp. - January 13, 2025) - Cruz Battery Metals Corp.&#160;(CSE: CRUZ) (OTC Pink: BKTPF) (FSE: A40YSN) (the \"Company\" or \"Cruz\") announces it plans to acquire, from arm's length vendors, the 580-acre 'Central Clayton Valley Lithium Brine Project' located in the heart of Clayton Valley in Esmeralda County, Nevada, USA. This new project consists of 29 claims completely surrounded by SLB's (formerly Schlumberger Limited) Clayton Valley lithium brine project. Cruz will now have a footprint of 820 acres prospective for lithium brine in Clayton Valley, Nevada. This acquisition is subject to all regulatory approvals.</p><p style=\"text-align: center;\"><a rel=\"nofollow\" href=\"https://images.newsfilecorp.com/files/4754/236920_c01b52ab34e46955_002full.jpg\"><img src=\"https://images.newsfilecorp.com/files/4754/236920_c01b52ab34e46955_002.jpg\" style=\"border-width: 0px;\" alt=\"Cannot view this image? Visit: https://images.newsfilecorp.com/files/4754/236920_c01b52ab34e46955_002.jpg\" /></a><br /><br />To view an enhanced version of this graphic, please visit:<br /><a rel=\"nofollow\" href=\"https://images.newsfilecorp.com/files/4754/236920_c01b52ab34e46955_002full.jpg\">https://images.newsfilecorp.com/files/4754/236920_c01b52ab34e46955_002full.jpg</a></p><p>James Nelson, President of Cruz, commented, \"We believe there are several reasons why the Central Clayton Valley Lithium Brine Project has potentially major upside value. These claims are located with access to the deepest part of the Clayton Valley lithium brine basin in Esmeralda County, Nevada, and are completely inside of SLB's (formerly Schlumberger) claims. We are very pleased to acquire this project at a time when SLB has successfully completed the 100% earn-in of Pure Energy Ltd.'s Clayton Valley lithium brine project and has recently demonstrated successful ongoing, high purity direct lithium extraction (DLE) production from this basin. In addition, the incoming Trump administration brings with it a lot of 'Made in America' sentiment. It's clear that a reduction of USA reliance on foreign resources will be a priority for the Trump administration. We believe this will provide a tail wind in the demand for domestic lithium production. As Albemarle's Clayton Valley Lithium Brine operation is currently the only lithium production in North America, we see this opportunity as a potential major catalyst for other lithium players to build up a domestic resource with what will be seemingly less regulatory restrictions and political red tape to go through. Management is excited as we enter a period of increased corporate activity in 2025 and the potential growth this year may bring for Cruz shareholders.\"</p><p>According to a CNBC article dated January 2, 2025, China's push to develop its own electric cars hit a tipping point in July, with the share of new energy vehicles sold <a href=\"https://api.newsfilecorp.com/redirect/q8veoSnKkK\">accounted for more than half all passenger cars sold that month</a>, according to the passenger car association. New energy vehicles include battery-only and hybrid-powered cars. The trend persisted through November, which saw a <a href=\"https://api.newsfilecorp.com/redirect/nV3eBUAMGj\" target=\"_blank\">penetration rate of 52.3%</a>, according to association data. </p><p>On January 3, 2025, GM announced that for the fourth quarter, sales were up 21% from the year-earlier period. Electric vehicle sales jumped 50% for the quarter and 125% for the year, roughly doubling our market share over the course of the year. GM was the #2 seller of EVs in the U.S. across the second half of 2024. </p><p>Mr. Nelson went on to say, \"Despite the ferociously negative sentiment around lithium and EV's over the last two years, the recent data clearly shows that EV sales are increasing and the momentum for EV sales globally is in fact strengthening, not weakening. Therefore, we feel domestically sourced lithium projects in 2025 will garner significantly more market interest than the previous two years.\" </p><p>Announced on September 11, 2024, Pure Energy Minerals Ltd.'s partner, SLB, has now completed a comprehensive technology demonstration and testing program as required to earn-in to the company's 100-per-cent-owned Clayton Valley lithium brine project (CV project) in Esmeralda County, Nevada. </p><p>Pure Energy and SLB formed a partnership in May, 2019, which provides for SLB to design, permit, develop and build a state-of-the-art pilot plant for direct lithium extraction (DLE) of lithium brines from the Clayton Valley property. The sustainable lithium demonstration plant, operated by SLB, currently is producing lithium carbonate (Li2CO3) product, a direct component of lithium batteries in mobile phones, electric vehicles and energy storage.</p><p>SLB has demonstrated completion of specific technical milestones to qualify the earn-in to 100-per-cent ownership of the CV project, which include continuous production of lithium carbonate for an extended period and achieving a material quantity of lithium product in excess of a required purity threshold, which was verified by a third party.</p><p>The Company has agreed to acquire the Central Clayton Valley Lithium Brine Project for compensation of one hundred fifteen thousand in cash, which covers BLM fees and staking costs, and the issuance of seven million shares that carry a four-month hold, payable on closing. This acquisition is subject to all regulatory approvals.</p><p><b>Qualified Person</b></p><p>The technical contents of this release were reviewed and approved by Frank Bain, PGeo, a director of the Company and qualified person as defined by National Instrument 43-101. </p><p><b>About Cruz Battery Metals Corp.</b></p><p>Cruz currently has several battery metals focused projects located in the USA. Cruz's Nevada lithium projects consist of the 4,938-acre 'Solar Lithium Project', the 240-acre 'Clayton Valley Lithium Brine Project', and the recently acquired 580-acre 'Central Clayton Valley Lithium Brine Project'. Cruz also has the 124-acre 'Idaho Cobalt Belt Project'. Management cautions that past results or discoveries on properties in proximity to Cruz may not necessarily be indicative of the presence of mineralization on the Company's properties. </p><p>If you would like to be added to Cruz's news distribution list, please send your email address to <a href=\"mailto:info@cruzbatterymetals.com\">info@cruzbatterymetals.com</a>.</p><p><b>Cruz Battery Metals Corp.</b></p><p><i>\"James Nelson\"</i></p><p>James Nelson<br />President, Chief Executive Officer, Secretary and Director</p><div id=\"contactInfo\"><p><b>For more information regarding this news release, please contact:</b><br />James Nelson, CEO and Director<br />T: 604-899-9150<br />Toll free: 1-855-599-9150<br />E: <a href=\"mailto:info@cruzbatterymetals.com\">info@cruzbatterymetals.com</a><br />W: <a href=\"https://api.newsfilecorp.com/redirect/K8a4rS4Jpw\">www.cruzbatterymetals.com</a><br />Twitter: @CruzBattMetals</p></div><p><i><b>The CSE has neither approved nor disapproved of the contents of this press release.</b></i></p><p><i><b>Forward-Looking Statements</b></i></p><p><i>Certain information in this news release may contain forward-looking statements that involve substantial known and unknown risks and uncertainties. Forward-looking statements are often identified by terms such as \"will\", \"may\", \"should\", \"anticipate\", \"expects\" and similar expressions. All statements other than statements of historical fact included in this news release are forward-looking statements that involve risks and uncertainties. There can be no assurance that such statements will prove to be accurate and actual results and future events could differ materially from those anticipated in such statements. Forward-looking statements in this news release include, but are not limited to, statements regarding the completion of the Arrangement as proposed, or at all, the record date, the effective date, CSE listing approval, and the business focus of each of Cruz and Makenita following the Arrangement. Important factors that could cause actual results to differ materially from the Company's expectations include unanticipated market, economic and other conditions which may adversely affect the Company's ability to complete the Arrangement on the terms set out in the Arrangement Agreement with Makenita, or at all, and other risks detailed from time to time in the filings made by the Company with the securities regulatory authorities. The reader is cautioned that assumptions used in the preparation of any forward-looking information may prove to be incorrect. Events or circumstances may cause actual results to differ materially from those predicted, as a result of numerous known and unknown risks, uncertainties, and other factors, many of which are beyond the control of the Company. The reader is cautioned not to place undue reliance on any forward-looking information. Such information, although considered reasonable by management at the time of preparation, may prove to be incorrect and actual results may differ materially from those anticipated. Forward-looking statements contained in this news release are expressly qualified by this cautionary statement. The forward-looking statements contained in this news release are made as of the date of this news release and the Company disclaims any intention or obligation to update or revise such information, except as required by applicable law.</i></p><p>References:</p><p><a href=\"https://api.newsfilecorp.com/redirect/Ey7NgT8jJp\">https://www.cnbc.com/2025/01/02/chinas-electric-car-boom-is-increasingly-more-about-hybrids.html</a></p><p><a href=\"https://api.newsfilecorp.com/redirect/x35xNimKNr\">https://investor.gm.com/news-releases/news-release-details/gm-posts-4-sales-growth-2024-market-share-keeps-expanding</a></p><p id=\"corporateNewsLogoContainer\"><img src=\"https://images.newsfilecorp.com/files/4754/236920_4754_lg_200.jpg\" alt=\"Corporate Logo\" id=\"corporateNewsLogo\" /></p><p id=\"corporateLinkBack\">To view the source version of this press release, please visit <a href=\"https://api.newsfilecorp.com/redirect/7WOojsAM1W\">https://www.newsfilecorp.com/release/236920</a></p>",
    "search_terms": "Clayton Valley,Cruz Battery Metals Corp.,CRUZ",
    "master_gid": 2282,
    "date": "2025-01-13T08:01:00.000Z",
    "tags": "USA|Nevada||Lithium|Project Acquisition",
    "image_id": null,
    "hidden": false,
    "company_id": 77,
    "provider": "newsfilecorp",
    "excerpt": "Vancouver, British Columbia--(Newsfile Corp. - January 13, 2025) - Cruz Battery Metals Corp.&#160;(CSE: CRUZ) (OTC Pink: BKTPF) (FSE: A40YSN) (the \"Company\" or \"Cruz\") announces it plans to acquire, from arm's length vendors, the 580-acre 'Central Clayton Valley Lithium Brine Project' located in the heart of Clayton Valley in Esmeralda County,",
    "is_regulatory": false,
    "refined_tags": [],
    "ftp_filename": null,
    "company_name": "Cruz Battery Metals Corp.",
    "exchange": "CSE",
    "root_ticker": "CRUZ",
    "project_name": "Clayton Valley",
    "gid": 2282,
    "location": "Nevada, USA",
    "plan_id": null,
    "description_text": "Vancouver, British Columbia--(Newsfile Corp. - January 13, 2025) - Cruz Battery Metals Corp. (CSE: CRUZ) (OTC Pink: BKTPF) (FSE: A40YSN) (the \"Company\" or \"Cruz\") announces it plans to acquire, from arm's length vendors, the 580-acre 'Central Clayton Valley Lithium Brine Project' located in the heart of Clayton Valley in Esmeralda County, Nevada, USA. This new project consists of 29 claims completely surrounded by SLB's (formerly Schlumberger Limited) Clayton Valley lithium brine project. Cruz will now have a footprint of 820 acres prospective for lithium brine in Clayton Valley, Nevada. This acquisition is subject to all regulatory approvals. To view an enhanced version of this graphic, please visit: https://images.newsfilecorp.com/files/4754/236920_c01b52ab34e46955_002full.jpg James Nelson, President of Cruz, commented, \"We believe there are several reasons why the Central Clayton Valley Lithium Brine Project has potentially major upside value. These claims are located with access to the deepest part of the Clayton Valley lithium brine basin in Esmeralda County, Nevada, and are completely inside of SLB's (formerly Schlumberger) claims. We are very pleased to acquire this project at a time when SLB has successfully completed the 100% earn-in of Pure Energy Ltd.'s Clayton Valley lithium brine project and has recently demonstrated successful ongoing, high purity direct lithium extraction (DLE) production from this basin. In addition, the incoming Trump administration brings with it a lot of 'Made in America' sentiment. It's clear that a reduction of USA reliance on foreign resources will be a priority for the Trump administration. We believe this will provide a tail wind in the demand for domestic lithium production. As Albemarle's Clayton Valley Lithium Brine operation is currently the only lithium production in North America, we see this opportunity as a potential major catalyst for other lithium players to build up a domestic resource with what will be seemingly less regulatory restrictions and political red tape to go through. Management is excited as we enter a period of increased corporate activity in 2025 and the potential growth this year may bring for Cruz shareholders.\" According to a CNBC article dated January 2, 2025, China's push to develop its own electric cars hit a tipping point in July, with the share of new energy vehicles sold accounted for more than half all passenger cars sold that month , according to the passenger car association. New energy vehicles include battery-only and hybrid-powered cars. The trend persisted through November, which saw a penetration rate of 52.3% , according to association data. On January 3, 2025, GM announced that for the fourth quarter, sales were up 21% from the year-earlier period. Electric vehicle sales jumped 50% for the quarter and 125% for the year, roughly doubling our market share over the course of the year. GM was the #2 seller of EVs in the U.S. across the second half of 2024. Mr. Nelson went on to say, \"Despite the ferociously negative sentiment around lithium and EV's over the last two years, the recent data clearly shows that EV sales are increasing and the momentum for EV sales globally is in fact strengthening, not weakening. Therefore, we feel domestically sourced lithium projects in 2025 will garner significantly more market interest than the previous two years.\" Announced on September 11, 2024, Pure Energy Minerals Ltd.'s partner, SLB, has now completed a comprehensive technology demonstration and testing program as required to earn-in to the company's 100-per-cent-owned Clayton Valley lithium brine project (CV project) in Esmeralda County, Nevada. Pure Energy and SLB formed a partnership in May, 2019, which provides for SLB to design, permit, develop and build a state-of-the-art pilot plant for direct lithium extraction (DLE) of lithium brines from the Clayton Valley property. The sustainable lithium demonstration plant, operated by SLB, currently is producing lithium carbonate (Li2CO3) product, a direct component of lithium batteries in mobile phones, electric vehicles and energy storage. SLB has demonstrated completion of specific technical milestones to qualify the earn-in to 100-per-cent ownership of the CV project, which include continuous production of lithium carbonate for an extended period and achieving a material quantity of lithium product in excess of a required purity threshold, which was verified by a third party. The Company has agreed to acquire the Central Clayton Valley Lithium Brine Project for compensation of one hundred fifteen thousand in cash, which covers BLM fees and staking costs, and the issuance of seven million shares that carry a four-month hold, payable on closing. This acquisition is subject to all regulatory approvals. Qualified Person The technical contents of this release were reviewed and approved by Frank Bain, PGeo, a director of the Company and qualified person as defined by National Instrument 43-101. About Cruz Battery Metals Corp. Cruz currently has several battery metals focused projects located in the USA. Cruz's Nevada lithium projects consist of the 4,938-acre 'Solar Lithium Project', the 240-acre 'Clayton Valley Lithium Brine Project', and the recently acquired 580-acre 'Central Clayton Valley Lithium Brine Project'. Cruz also has the 124-acre 'Idaho Cobalt Belt Project'. Management cautions that past results or discoveries on properties in proximity to Cruz may not necessarily be indicative of the presence of mineralization on the Company's properties. If you would like to be added to Cruz's news distribution list, please send your email address to info@cruzbatterymetals.com . Cruz Battery Metals Corp. \"James Nelson\" James Nelson President, Chief Executive Officer, Secretary and Director For more information regarding this news release, please contact: James Nelson, CEO and Director T: 604-899-9150 Toll free: 1-855-599-9150 E: info@cruzbatterymetals.com W: www.cruzbatterymetals.com Twitter: @CruzBattMetals The CSE has neither approved nor disapproved of the contents of this press release. Forward-Looking Statements Certain information in this news release may contain forward-looking statements that involve substantial known and unknown risks and uncertainties. Forward-looking statements are often identified by terms such as \"will\", \"may\", \"should\", \"anticipate\", \"expects\" and similar expressions. All statements other than statements of historical fact included in this news release are forward-looking statements that involve risks and uncertainties. There can be no assurance that such statements will prove to be accurate and actual results and future events could differ materially from those anticipated in such statements. Forward-looking statements in this news release include, but are not limited to, statements regarding the completion of the Arrangement as proposed, or at all, the record date, the effective date, CSE listing approval, and the business focus of each of Cruz and Makenita following the Arrangement. Important factors that could cause actual results to differ materially from the Company's expectations include unanticipated market, economic and other conditions which may adversely affect the Company's ability to complete the Arrangement on the terms set out in the Arrangement Agreement with Makenita, or at all, and other risks detailed from time to time in the filings made by the Company with the securities regulatory authorities. The reader is cautioned that assumptions used in the preparation of any forward-looking information may prove to be incorrect. Events or circumstances may cause actual results to differ materially from those predicted, as a result of numerous known and unknown risks, uncertainties, and other factors, many of which are beyond the control of the Company. The reader is cautioned not to place undue reliance on any forward-looking information. Such information, although considered reasonable by management at the time of preparation, may prove to be incorrect and actual results may differ materially from those anticipated. Forward-looking statements contained in this news release are expressly qualified by this cautionary statement. The forward-looking statements contained in this news release are made as of the date of this news release and the Company disclaims any intention or obligation to update or revise such information, except as required by applicable law. References: https://www.cnbc.com/2025/01/02/chinas-electric-car-boom-is-increasingly-more-about-hybrids.html https://investor.gm.com/news-releases/news-release-details/gm-posts-4-sales-growth-2024-market-share-keeps-expanding To view the source version of this press release, please visit https://www.newsfilecorp.com/release/236920",
    "primary_commodity": "Li"
  },
  "articleProject": {
    "gid": 2282,
    "project_name": "Clayton Valley",
    "location": "Nevada, USA"
  },
  "articleExchange": "CSE",
  "articleCompanyId": 77,
  "articleTicker": "CRUZ",
  "articleCompanyName": "Cruz Battery Metals Corp.",
  "allOtherCompanyProjects": [
    {
      "company_id": 77,
      "gid": 2282,
      "project_name": "Clayton Valley",
      "location": "Nevada, USA"
    },
    {
      "company_id": 77,
      "gid": 7678,
      "project_name": "Hector",
      "location": null
    },
    {
      "company_id": 77,
      "gid": 674,
      "project_name": "War Eagle",
      "location": "British Columbia, Canada"
    },
    {
      "company_id": 77,
      "gid": 2292,
      "project_name": "Solar",
      "location": "Nevada, USA"
    }
  ],
  "allOtherCompanyNews": [
    {
      "id": 84850,
      "company_id": 77,
      "title": "Cruz Battery Metals Closes the Central Clayton Valley Lithium Brine Project Acquisition",
      "link": "https://www.newsfilecorp.com/release/238004/Cruz-Battery-Metals-Closes-the-Central-Clayton-Valley-Lithium-Brine-Project-Acquisition",
      "date": "2025-01-22T08:01:00.000Z",
      "hidden": false
    },
    {
      "id": 83796,
      "company_id": 77,
      "title": "RETRANSMISSION: Cruz Battery Metals Acquires the Central Clayton Valley Lithium Brine Project in Nevada Completely Surrounded by SLB's Property",
      "link": "https://www.newsfilecorp.com/release/236920/RETRANSMISSION-Cruz-Battery-Metals-Acquires-the-Central-Clayton-Valley-Lithium-Brine-Project-in-Nevada-Completely-Surrounded-by-SLBs-Property",
      "date": "2025-01-13T08:01:00.000Z",
      "hidden": false
    },
    {
      "id": 83663,
      "company_id": 77,
      "title": "Cruz Battery Metals Acquires the Central Clayton Valley Lithium Brine Project in Nevada Completely Surrounded by SLB's Property",
      "link": "https://www.newsfilecorp.com/release/236679/Cruz-Battery-Metals-Acquires-the-Central-Clayton-Valley-Lithium-Brine-Project-in-Nevada-Completely-Surrounded-by-SLBs-Property",
      "date": "2025-01-10T08:01:00.000Z",
      "hidden": false
    },
    {
      "id": -162359,
      "company_id": 77,
      "title": "Cruz Battery Metals and Makenita Resources Announce Closing of Plan of Arrangement and CSE Conditional Approval for the Makenita Shares",
      "link": "https://www.newsfilecorp.com/release/235025/Cruz-Battery-Metals-and-Makenita-Resources-Announce-Closing-of-Plan-of-Arrangement-and-CSE-Conditional-Approval-for-the-Makenita-Shares",
      "date": "2024-12-24T00:03:00.000Z",
      "hidden": false
    },
    {
      "id": 82299,
      "company_id": 77,
      "title": "RETRANSMISSION: Cruz Battery Metals Provides Update on Proposed Spin Out of Hector Property by way of Plan of Arrangement and Announces Share Distribution Date of December 23, 2024",
      "link": "https://www.newsfilecorp.com/release/234283/RETRANSMISSION-Cruz-Battery-Metals-Provides-Update-on-Proposed-Spin-Out-of-Hector-Property-by-way-of-Plan-of-Arrangement-and-Announces-Share-Distribution-Date-of-December-23-2024",
      "date": "2024-12-18T08:01:00.000Z",
      "hidden": false
    },
    {
      "id": 82206,
      "company_id": 77,
      "title": "Cruz Battery Metals Provides Update on Proposed Spin Out of Hector Property by way of Plan of Arrangement and Announces Share Distribution Date of December 23, 2024",
      "link": "https://www.newsfilecorp.com/release/234091/Cruz-Battery-Metals-Provides-Update-on-Proposed-Spin-Out-of-Hector-Property-by-way-of-Plan-of-Arrangement-and-Announces-Share-Distribution-Date-of-December-23-2024",
      "date": "2024-12-17T13:00:00.000Z",
      "hidden": false
    },
    {
      "id": 76228,
      "company_id": 77,
      "title": "RETRANSMISSION: Cruz Announces Record Date of October 29th for Spin-Out of Hector Silver-Cobalt Project",
      "link": "https://www.newsfilecorp.com/release/227993/RETRANSMISSION-Cruz-Announces-Record-Date-of-October-29th-for-SpinOut-of-Hector-SilverCobalt-Project",
      "date": "2024-10-28T07:01:00.000Z",
      "hidden": false
    },
    {
      "id": 76047,
      "company_id": 77,
      "title": "Cruz Announces Record Date of October 29th for Spin-Out of Hector Silver-Cobalt Project",
      "link": "https://www.newsfilecorp.com/release/227719/Cruz-Announces-Record-Date-of-October-29th-for-SpinOut-of-Hector-SilverCobalt-Project",
      "date": "2024-10-25T07:01:00.000Z",
      "hidden": false
    },
    {
      "id": 73876,
      "company_id": 77,
      "title": "RETRANSMISSION: Cruz Announces Record Date for Spin-Out of Hector Silver-Cobalt Project",
      "link": "https://www.newsfilecorp.com/release/225680/RETRANSMISSION-Cruz-Announces-Record-Date-for-SpinOut-of-Hector-SilverCobalt-Project",
      "date": "2024-10-07T07:01:00.000Z",
      "hidden": false
    },
    {
      "id": 73772,
      "company_id": 77,
      "title": "Cruz Announces Record Date for Spin-Out of Hector Silver-Cobalt Project",
      "link": "https://www.newsfilecorp.com/release/225540/Cruz-Announces-Record-Date-for-SpinOut-of-Hector-SilverCobalt-Project",
      "date": "2024-10-04T07:01:00.000Z",
      "hidden": false
    }
  ]
}
