{
  "article": {
    "id": 55241,
    "link": "https://www.globenewswire.com/news-release/2024/06/06/2894542/0/en/Abacus-Acquires-100-of-the-Willow-Porphyry-Copper-Property.html",
    "title": "Abacus Acquires 100% of the Willow Porphyry Copper Property",
    "description": "<p align=\"justify\">VANCOUVER, British Columbia, June  06, 2024  (GLOBE NEWSWIRE) -- Abacus Mining &amp; Exploration Corporation (“Abacus” or “The Company”) (TSXV:AME) is pleased to announce that it has signed an Agreement with Almadex Minerals Ltd. and its wholly-owned Nevada subsidiary Almadex America Inc. (“Almadex”), to acquire a 100% ownership interest in the Willow porphyry copper property located in Yerington, Nevada, (“Willow Property”) and data associated with the Willow Property (the “Willow Data”).<br /></p>  <p align=\"justify\">Under the terms of the Agreement, which is subject to TSX Venture Exchange (“TSX-V”) approval, Abacus will issue common shares of Abacus (“Shares”) to Almadex, as to:</p>  <ul type=\"disc\"><li style=\"margin-top:5pt; margin-bottom:5pt; text-align:justify;\">7,500,000 shares in the capital of the Company (“Shares”) (the “Initial Shares”) on closing of the transaction, expected to be on or about June 30, 2024 (the “Closing Date”); and,</li><li style=\"margin-top:5pt; margin-bottom:5pt; text-align:justify;\">on July 31, 2025 (the “Top-Up Date”), such number of Shares owned by Almadex immediately following the completion of the transaction on the Closing Date, then divided by the number of Shares outstanding on the Top-Up Date, equals 0.08, rounded down to the nearest whole Share (the “Top-Up Shares”).</li></ul>  <p align=\"justify\">Title to the claims comprising the Willow Property will be transferred to Abacus on issuance of the Initial Shares, and Abacus will, as soon as reasonably practicable following the Closing Date and in any event no later than December 31, 2025, complete the drilling of a minimum 600 metre exploratory hole on the Willow Property within an area agreed upon with Almadex.</p>  <p align=\"justify\">The Willow Property is subject to a 2% NSR from future production of minerals from the Willow Property.</p>  <p align=\"justify\">“<em>An option agreement on Willow was signed in early 2017 between Abacus and Almadex, allowing Abacus to earn an aggregate 75% interest in Willow by meeting certain spending thresholds and by issuing shares,”</em> commented Paul G. Anderson, President and CEO of Abacus. “<em>This Agreement removes the spending commitments, and it consolidates ownership of a very prospective porphyry copper property which remains poorly drill tested.”</em></p>  <p align=\"justify\">Abacus completed geological, geochemical and geophysical work on Willow beginning in 2017, identifying an extensive zone of intense silicic and advanced argillic alteration, marked by coincident geological, geochemical and geophysical signatures typical of a porphyry Cu-Mo deposit.</p>  <p align=\"justify\">The Company drilled two diamond drill holes in 2018, which intersected the Luhr Hill granite, which is the host rock of the four known porphyry copper-molybdenum (Cu-Mo) deposits in the Yerington camp. The holes hit short intervals of copper in the 0.1 to 0.2% range with elevated Mo.</p>  <p align=\"justify\">In 2021, three additional core holes intersected broader intervals of the Luhr Hill granite with <em>significant</em> composited intervals of low-grade copper and molybdenum mineralization. The results indicate close proximity to a porphyry copper center and clearly indicate that further drilling is warranted.</p>  <p align=\"justify\">Cu-Mo porphyry deposits at Yerington occur at the contact of the Luhr Hill granite porphyry and surrounding volcanic rocks, or else close to the granite but associated with porphyry dyke swarms further into the volcanic package. As there are no known instances of this granite in the camp without an associated porphyry, the discovery of Luhr Hill granite on Willow marks a key new discovery, which means that there is a very high likelihood of a Cu-Mo deposit being found on Willow.</p>  <p align=\"justify\">The Company’s target is essentially identical to the two largest porphyry deposits in the Yerington camp, namely the past-producing Yerington mine and the undeveloped Ann Mason deposit. Because the target at Willow is covered by later volcanism, prospecting by drill and sampling for geochemistry is the only effective means of trying to locate a porphyry center, and this often takes several drill campaigns to achieve, with each successive campaign vectoring closer to a porphyry center.</p>  <p align=\"justify\">Of the known porphyries in the camp, the Ann Mason deposit lies adjacent and east of Willow and is held by HudBay Minerals. In 2021, Hudbay announced an updated PEA on Ann Mason with a revised M&amp;I resource of 2.2 billion tonnes at 0.34% Cu. *</p>  <p align=\"justify\">Lion Copper and Gold control the Yerington, Bear and MacArthur porphyries adjacent and to the east of Ann Mason. Anaconda mined the Yerington porphyry between 1952 until 1978, producing 1.6 billion pounds of copper. MacArthur ((M&amp;I of 159MT at 0.212% Cu) has seen some past production and is currently undergoing a Prefeasibility Study. In March of 2022, Lion announced that Rio Tinto had taken an option on the company’s Yerington assets, and it announced the results of a new PEA in March of this year. *</p>  <p align=\"justify\">The Company in addition has a lease on the Nev-Lorraine claims contiguous to Willow, giving it the right to explore and to elect to purchase these claims outright over a ten-year period.</p>  <p align=\"justify\">Abacus also holds a 20% ownership interest in the Ajax copper-gold porphyry project, located near Kamloops, British Columbia., which is managed by base metal major KGHM Polska Miedź S.A., who hold the remaining 80%. The Ajax Project contains significant quantities of copper and gold, within a NI 43-101 Proven and Probable Mineral Reserve of 426 Mt at 0.29% Cu, 0.19 g/t Au and 0.39 g/t Ag. Contained metal is in the order of 2.7 Bil lbs Cu, 2.6 Moz Au and 5.3 Moz Ag**.</p>  <p align=\"justify\">* Data is from the respective Company websites.</p>  <p align=\"justify\">** Wardrop Engineering Inc. 2012. Ajax Copper/Gold Project, Kamloops, British Columbia – Feasibility Study Technical Report. Doc. No. 1054610300-REP-R0004-02. January 2012.</p>  <p align=\"justify\">The technical information in this news release has been reviewed and approved by Paul G. Anderson, M.Sc. P.Geo., a Qualified Person within the meaning of National Instrument 43-101.</p>  <p align=\"justify\">On Behalf of the Board,<br /><strong>ABACUS MINING &amp; EXPLORATION CORPORATION</strong></p>  <p>Paul G. Anderson, P.Geo.<br />President, CEO, Director<br />(604) 682-0301</p>  <p align=\"justify\"><strong>About Abacus</strong><br /><strong>Abacus</strong> <strong>is</strong> <strong>a</strong> <strong>mineral</strong> <strong>exploration</strong> <strong>and</strong> <strong>mine</strong> <strong>development</strong> <strong>company</strong> <strong>currently</strong> <strong>focused</strong> <strong>on</strong> <strong>copper</strong> <strong>and</strong> <strong>gold</strong> <strong>in</strong> <strong>B.C.</strong> <strong>and Nevada. The Company’s main asset is a 20% ownership interest, together with KGHM Polska Miedź S.A. (80%), in</strong> <strong>the</strong> <strong>proposed</strong> <strong>copper-gold</strong> <strong>Ajax</strong> <strong>Mine</strong> <strong>located</strong> <strong>southwest</strong> <strong>of</strong> <strong>Kamloops,</strong> <strong>B.C.,</strong> <strong>which</strong> <strong>has</strong> <strong>undergone</strong> <strong>a</strong> <strong>joint</strong> <strong>provincial and</strong> <strong>federal</strong> <strong>environmental</strong> <strong>assessment</strong> <strong>process.</strong> <strong>On</strong> <strong>December</strong> <strong>14,</strong> <strong>2017,</strong> <strong>a</strong> <strong>decision</strong> <strong>was</strong> <strong>made</strong> <strong>by</strong> <strong>the</strong> <strong>B.C.</strong> <strong>Minister of Environment and Climate Change Strategy and the Minister of Energy, Mines and Petroleum Resources to decline</strong> <strong>to</strong> <strong>issue</strong> <strong>an</strong> <strong>environmental</strong> <strong>assessment</strong> <strong>certificate</strong> <strong>for</strong> <strong>the</strong> <strong>Project. KGHM</strong> <strong>have</strong> <strong>recently</strong> <strong>reopened</strong> <strong>an</strong> <strong>office</strong> <strong>in Kamloops,</strong> <strong>B.C.</strong> <strong>to</strong> <strong>facilitate</strong> <strong>First</strong> <strong>Nation,</strong> <strong>community</strong> <strong>and</strong> <strong>governmental</strong> <strong>engagement</strong> <strong>in</strong> <strong>order</strong> <strong>to</strong> <strong>advance</strong> <strong>the</strong> <strong>project towards a potential resubmission of the environmental</strong> <strong>application.</strong></p>  <p align=\"justify\">Abacus is in the process of acquiring a 100% interest in the Willow copper-gold property located near Yerington, Nevada, and it also controls the contiguous Nev-Lorraine claims subject to a ten-year lease agreement.</p>  <p align=\"justify\">For the latest reports and information on Abacus’ projects, please refer to the Company’s website at <a href=\"http://www.amemining.com/\" rel=\"nofollow\" target=\"_blank\" title=\"\"><u>www.amemining.com</u>.</a></p>  <p align=\"justify\"><strong><em>Forward-Looking Information</em></strong><br /><em>This release includes certain statements that are deemed “forward-looking statements”. All statements in this release, other than statements of historical</em> <em>facts,</em> <em>that</em> <em>address</em> <em>events</em> <em>or</em> <em>developments</em> <em>that</em> <em>Abacus</em> <em>expects</em> <em>to</em> <em>occur,</em> <em>are</em> <em>forward-looking</em> <em>statements.</em> <em>Forward-looking</em> <em>statements</em> <em>are statements</em> <em>that</em> <em>are</em> <em>not</em> <em>historical</em> <em>facts</em> <em>and</em> <em>are</em> <em>generally,</em> <em>but</em> <em>not</em> <em>always,</em> <em>identified</em> <em>by</em> <em>the</em> <em>words</em> <em>“expects”,</em> <em>“plans”,</em> <em>“anticipates”,</em> <em>“believes”,</em> <em>“intends”, “estimates”, “projects”, “potential” and similar expressions, or that events or conditions “will”, “would”, “may”, “could” or “should” occur. Although the Company believes the expectations expressed in such forward-looking statements are based on reasonable assumptions, such statements are not guarantees</em> <em>of</em> <em>future</em> <em>performance</em> <em>and</em> <em>actual</em> <em>results</em> <em>may</em> <em>differ</em> <em>materially</em> <em>from</em> <em>those</em> <em>in</em> <em>the</em> <em>forward-looking</em> <em>statements.</em> <em>Factors</em> <em>that</em> <em>could</em> <em>cause</em> <em>the actual results to differ materially from those in forward-looking statements include changes to commodity prices, mine and metallurgical recovery, operating and capital costs, foreign exchange rates, ability to obtain required permits on a timely basis, exploitation and exploration successes, continued</em> <em>availability</em> <em>of</em> <em>capital</em> <em>and</em> <em>financing,</em> <em>and</em> <em>general</em> <em>economic,</em> <em>market</em> <em>or</em> <em>business</em> <em>conditions.</em> <em>Investors</em> <em>are</em> <em>cautioned</em> <em>that</em> <em>any</em> <em>such</em> <em>statements are not guarantees of future performance and actual results or developments may differ materially from those projected in the forward-looking statements.</em> <em>Forward-looking</em> <em>statements</em> <em>are</em> <em>based</em> <em>on</em> <em>the</em> <em>beliefs,</em> <em>estimates</em> <em>and</em> <em>opinions</em> <em>of</em> <em>the</em> <em>Company's</em> <em>management</em> <em>on</em> <em>the</em> <em>date</em> <em>the</em> <em>statements are made. Except as required by applicable securities laws, the Company undertakes no obligation to update these forward-looking statements in the</em> <em>event</em> <em>that</em> <em>management's</em> <em>beliefs,</em> <em>estimates</em> <em>or</em> <em>opinions,</em> <em>or</em> <em>other</em> <em>factors,</em> <em>should</em> <em>change.</em></p>  <p align=\"justify\"><em>Neither TSX Venture Exchange nor its Regulation Services Provider (as that term is defined in the policies of the TSX Venture Exchange) accepts responsibility for the adequacy or accuracy of this release.</em></p>  <br /><img src='https://ml.globenewswire.com/media/ZTI0MmYxZDctZDEzYi00ZDZlLWJmODAtYzg2ODE0OGI3NWRmLTEwOTgwNTY=/tiny/Abacus-Mining-and-Exploration-.png' referrerpolicy='no-referrer-when-downgrade' />",
    "search_terms": "Willow,Abacus Mining & Exploration Corporation,AME",
    "master_gid": 4465,
    "date": "2024-06-06T11:00:00.000Z",
    "tags": "USA|Nevada||Copper|Project Acquisition",
    "image_id": null,
    "hidden": false,
    "company_id": 1025,
    "provider": null,
    "excerpt": "VANCOUVER, British Columbia, June 06, 2024 (GLOBE NEWSWIRE) -- Abacus Mining &amp; Exploration Corporation (“Abacus” or “The Company”) (TSXV:AME) is pleased to announce that it has signed an Agreement with Almadex Minerals Ltd. and its wholly-owned Nevada subsidiary Almadex America Inc. (“Almadex”), to acquire a 100% ownership interest in the",
    "is_regulatory": false,
    "refined_tags": [
      "Project Acquisition"
    ],
    "ftp_filename": null,
    "company_name": "Abacus Mining & Exploration Corporation",
    "exchange": "TSXV",
    "root_ticker": "AME",
    "project_name": "Willow",
    "gid": 4465,
    "location": "Nevada, United States",
    "plan_id": null,
    "description_text": "VANCOUVER, British Columbia, June  06, 2024  (GLOBE NEWSWIRE) -- Abacus Mining & Exploration Corporation (“Abacus” or “The Company”) (TSXV:AME) is pleased to announce that it has signed an Agreement with Almadex Minerals Ltd. and its wholly-owned Nevada subsidiary Almadex America Inc. (“Almadex”), to acquire a 100% ownership interest in the Willow porphyry copper property located in Yerington, Nevada, (“Willow Property”) and data associated with the Willow Property (the “Willow Data”). Under the terms of the Agreement, which is subject to TSX Venture Exchange (“TSX-V”) approval, Abacus will issue common shares of Abacus (“Shares”) to Almadex, as to: 7,500,000 shares in the capital of the Company (“Shares”) (the “Initial Shares”) on closing of the transaction, expected to be on or about June 30, 2024 (the “Closing Date”); and, on July 31, 2025 (the “Top-Up Date”), such number of Shares owned by Almadex immediately following the completion of the transaction on the Closing Date, then divided by the number of Shares outstanding on the Top-Up Date, equals 0.08, rounded down to the nearest whole Share (the “Top-Up Shares”). Title to the claims comprising the Willow Property will be transferred to Abacus on issuance of the Initial Shares, and Abacus will, as soon as reasonably practicable following the Closing Date and in any event no later than December 31, 2025, complete the drilling of a minimum 600 metre exploratory hole on the Willow Property within an area agreed upon with Almadex. The Willow Property is subject to a 2% NSR from future production of minerals from the Willow Property. “ An option agreement on Willow was signed in early 2017 between Abacus and Almadex, allowing Abacus to earn an aggregate 75% interest in Willow by meeting certain spending thresholds and by issuing shares,” commented Paul G. Anderson, President and CEO of Abacus. “ This Agreement removes the spending commitments, and it consolidates ownership of a very prospective porphyry copper property which remains poorly drill tested.” Abacus completed geological, geochemical and geophysical work on Willow beginning in 2017, identifying an extensive zone of intense silicic and advanced argillic alteration, marked by coincident geological, geochemical and geophysical signatures typical of a porphyry Cu-Mo deposit. The Company drilled two diamond drill holes in 2018, which intersected the Luhr Hill granite, which is the host rock of the four known porphyry copper-molybdenum (Cu-Mo) deposits in the Yerington camp. The holes hit short intervals of copper in the 0.1 to 0.2% range with elevated Mo. In 2021, three additional core holes intersected broader intervals of the Luhr Hill granite with significant composited intervals of low-grade copper and molybdenum mineralization. The results indicate close proximity to a porphyry copper center and clearly indicate that further drilling is warranted. Cu-Mo porphyry deposits at Yerington occur at the contact of the Luhr Hill granite porphyry and surrounding volcanic rocks, or else close to the granite but associated with porphyry dyke swarms further into the volcanic package. As there are no known instances of this granite in the camp without an associated porphyry, the discovery of Luhr Hill granite on Willow marks a key new discovery, which means that there is a very high likelihood of a Cu-Mo deposit being found on Willow. The Company’s target is essentially identical to the two largest porphyry deposits in the Yerington camp, namely the past-producing Yerington mine and the undeveloped Ann Mason deposit. Because the target at Willow is covered by later volcanism, prospecting by drill and sampling for geochemistry is the only effective means of trying to locate a porphyry center, and this often takes several drill campaigns to achieve, with each successive campaign vectoring closer to a porphyry center. Of the known porphyries in the camp, the Ann Mason deposit lies adjacent and east of Willow and is held by HudBay Minerals. In 2021, Hudbay announced an updated PEA on Ann Mason with a revised M&I resource of 2.2 billion tonnes at 0.34% Cu. * Lion Copper and Gold control the Yerington, Bear and MacArthur porphyries adjacent and to the east of Ann Mason. Anaconda mined the Yerington porphyry between 1952 until 1978, producing 1.6 billion pounds of copper. MacArthur ((M&I of 159MT at 0.212% Cu) has seen some past production and is currently undergoing a Prefeasibility Study. In March of 2022, Lion announced that Rio Tinto had taken an option on the company’s Yerington assets, and it announced the results of a new PEA in March of this year. * The Company in addition has a lease on the Nev-Lorraine claims contiguous to Willow, giving it the right to explore and to elect to purchase these claims outright over a ten-year period. Abacus also holds a 20% ownership interest in the Ajax copper-gold porphyry project, located near Kamloops, British Columbia., which is managed by base metal major KGHM Polska Miedź S.A., who hold the remaining 80%. The Ajax Project contains significant quantities of copper and gold, within a NI 43-101 Proven and Probable Mineral Reserve of 426 Mt at 0.29% Cu, 0.19 g/t Au and 0.39 g/t Ag. Contained metal is in the order of 2.7 Bil lbs Cu, 2.6 Moz Au and 5.3 Moz Ag**. * Data is from the respective Company websites. ** Wardrop Engineering Inc. 2012. Ajax Copper/Gold Project, Kamloops, British Columbia – Feasibility Study Technical Report. Doc. No. 1054610300-REP-R0004-02. January 2012. The technical information in this news release has been reviewed and approved by Paul G. Anderson, M.Sc. P.Geo., a Qualified Person within the meaning of National Instrument 43-101. On Behalf of the Board, ABACUS MINING & EXPLORATION CORPORATION Paul G. Anderson, P.Geo. President, CEO, Director (604) 682-0301 About Abacus Abacus is a mineral exploration and mine development company currently focused on copper and gold in B.C. and Nevada. The Company’s main asset is a 20% ownership interest, together with KGHM Polska Miedź S.A. (80%), in the proposed copper-gold Ajax Mine located southwest of Kamloops, B.C., which has undergone a joint provincial and federal environmental assessment process. On December 14, 2017, a decision was made by the B.C. Minister of Environment and Climate Change Strategy and the Minister of Energy, Mines and Petroleum Resources to decline to issue an environmental assessment certificate for the Project. KGHM have recently reopened an office in Kamloops, B.C. to facilitate First Nation, community and governmental engagement in order to advance the project towards a potential resubmission of the environmental application. Abacus is in the process of acquiring a 100% interest in the Willow copper-gold property located near Yerington, Nevada, and it also controls the contiguous Nev-Lorraine claims subject to a ten-year lease agreement. For the latest reports and information on Abacus’ projects, please refer to the Company’s website at www.amemining.com . Forward-Looking Information This release includes certain statements that are deemed “forward-looking statements”. All statements in this release, other than statements of historical facts, that address events or developments that Abacus expects to occur, are forward-looking statements. Forward-looking statements are statements that are not historical facts and are generally, but not always, identified by the words “expects”, “plans”, “anticipates”, “believes”, “intends”, “estimates”, “projects”, “potential” and similar expressions, or that events or conditions “will”, “would”, “may”, “could” or “should” occur. Although the Company believes the expectations expressed in such forward-looking statements are based on reasonable assumptions, such statements are not guarantees of future performance and actual results may differ materially from those in the forward-looking statements. Factors that could cause the actual results to differ materially from those in forward-looking statements include changes to commodity prices, mine and metallurgical recovery, operating and capital costs, foreign exchange rates, ability to obtain required permits on a timely basis, exploitation and exploration successes, continued availability of capital and financing, and general economic, market or business conditions. Investors are cautioned that any such statements are not guarantees of future performance and actual results or developments may differ materially from those projected in the forward-looking statements. Forward-looking statements are based on the beliefs, estimates and opinions of the Company's management on the date the statements are made. Except as required by applicable securities laws, the Company undertakes no obligation to update these forward-looking statements in the event that management's beliefs, estimates or opinions, or other factors, should change. Neither TSX Venture Exchange nor its Regulation Services Provider (as that term is defined in the policies of the TSX Venture Exchange) accepts responsibility for the adequacy or accuracy of this release.",
    "primary_commodity": "Cu"
  },
  "articleProject": {
    "gid": 4465,
    "project_name": "Willow",
    "location": "Nevada, United States"
  },
  "articleExchange": "TSXV",
  "articleCompanyId": 1025,
  "articleTicker": "AME",
  "articleCompanyName": "Abacus Mining & Exploration Corporation",
  "allOtherCompanyProjects": [
    {
      "company_id": 1025,
      "gid": 4465,
      "project_name": "Willow",
      "location": "Nevada, United States"
    }
  ],
  "allOtherCompanyNews": [
    {
      "id": 106775,
      "company_id": 1025,
      "title": "Abacus Announces Appointment of Niina Makela as Chief Financial Officer",
      "link": "https://app.quotemedia.com/data/downloadFiling?webmasterId=104408&ref=683dce4401b9f63af36ed1e2&type=PDFC&formType=002-002-001089-003001&formDescription=News+release&dateFiled=2025-06-02",
      "date": "2025-06-02T16:16:04.000Z",
      "hidden": false
    },
    {
      "id": -197849,
      "company_id": 1025,
      "title": "Abacus Announces Further Increase to Financing",
      "link": "https://app.quotemedia.com/data/downloadFiling?webmasterId=104408&ref=67eef576a703046db13be931&type=PDFC&formType=002-002-001089-003001&formDescription=News+release&dateFiled=2025-04-03",
      "date": "2025-04-03T13:54:14.000Z",
      "hidden": false
    },
    {
      "id": -197850,
      "company_id": 1025,
      "title": "Abacus completes non-brokered private placement",
      "link": "https://app.quotemedia.com/data/downloadFiling?webmasterId=104408&ref=67eef4f1a6d53e25df1880e6&type=PDFC&formType=002-002-001089-003001&formDescription=News+release&dateFiled=2025-04-03",
      "date": "2025-04-03T13:52:01.000Z",
      "hidden": false
    },
    {
      "id": 102727,
      "company_id": 1025,
      "title": "Abacus Announces Increase to Financing",
      "link": "https://app.quotemedia.com/data/downloadFiling?webmasterId=104408&ref=67e7746e09997413821d3e2f&type=PDFC&formType=002-002-001089-003001&formDescription=News+release&dateFiled=2025-03-28",
      "date": "2025-03-28T21:17:50.000Z",
      "hidden": false
    },
    {
      "id": 89605,
      "company_id": 1025,
      "title": "Abacus Announces Financing",
      "link": "https://www.globenewswire.com/news-release/2025/02/28/3034634/0/en/Abacus-Announces-Financing.html",
      "date": "2025-02-28T12:00:00.000Z",
      "hidden": false
    },
    {
      "id": -180387,
      "company_id": 1025,
      "title": "Abacus Announces Grant of Stock Options",
      "link": "https://app.quotemedia.com/data/downloadFiling?webmasterId=104408&ref=67bcca2a336d09562c2f8e91&type=PDFC&formType=002-002-001089-003001&formDescription=News+release&dateFiled=2025-02-24",
      "date": "2025-02-24T19:36:10.000Z",
      "hidden": false
    },
    {
      "id": -180386,
      "company_id": 1025,
      "title": "Abacus Closes Second Tranche of Equity Offering",
      "link": "https://app.quotemedia.com/data/downloadFiling?webmasterId=104408&ref=6710535d96119641e0222a41&type=PDFC&formType=002-002-001089-003001&formDescription=News+release&dateFiled=2024-10-16",
      "date": "2024-10-16T23:59:25.000Z",
      "hidden": false
    },
    {
      "id": -180385,
      "company_id": 1025,
      "title": "Abacus Announces Extension to Financing",
      "link": "https://app.quotemedia.com/data/downloadFiling?webmasterId=104408&ref=66eca9689305a533aa27ac79&type=PDFC&formType=002-002-001089-003001&formDescription=News+release&dateFiled=2024-09-19",
      "date": "2024-09-19T22:44:56.000Z",
      "hidden": false
    },
    {
      "id": -180384,
      "company_id": 1025,
      "title": "Abacus Closes First Tranche of Equity Offering",
      "link": "https://app.quotemedia.com/data/downloadFiling?webmasterId=104408&ref=66c4c80063665147ac1f293a&type=PDFC&formType=002-002-001089-003001&formDescription=News+release&dateFiled=2024-08-20",
      "date": "2024-08-20T16:44:48.000Z",
      "hidden": false
    },
    {
      "id": 65824,
      "company_id": 1025,
      "title": "Abacus Announces Financing",
      "link": "https://www.globenewswire.com/news-release/2024/07/23/2917082/0/en/Abacus-Announces-Financing.html",
      "date": "2024-07-23T11:00:00.000Z",
      "hidden": false
    }
  ]
}
