{
  "article": {
    "id": 64016,
    "link": "https://www.globenewswire.com/news-release/2024/07/02/2907753/0/en/Abacus-Announces-Closing-of-the-Willow-Porphyry-Copper-Property-and-Amends-Certain-Terms-of-the-Acquisition-Agreement.html",
    "title": "Abacus Announces Closing of the Willow Porphyry Copper Property and Amends Certain Terms of the Acquisition Agreement",
    "description": "<p align=\"justify\">VANCOUVER, British Columbia, July  02, 2024  (GLOBE NEWSWIRE) -- Abacus Mining &amp; Exploration Corporation (“Abacus” or “The Company”) (TSXV:AME) announces that further to its news release dated June 4, 2024, it has amended, at the request of the TSX-Venture Exchange (the “Exchange”), certain terms of the June 4, 2024 agreement (the “June 4, 2024 Agreement”) with Almadex Minerals Ltd. and its wholly-owned Nevada subsidiary Almadex America Inc. (“Almadex”), to acquire a 100% ownership interest in the Willow porphyry copper property located in Yerington, Nevada, (“Willow Property”) and data associated with the Willow Property (the “Willow Data”) (the “Amending Agreement”).<br /></p>    <p align=\"justify\">Pursuant to the terms of the Amending Agreement:</p>    <ul type=\"disc\"><li style=\"margin-top:5pt; margin-bottom:5pt; text-align:justify;\">the Company has issued 9,546,922 common shares of Abacus to Almadex</li><li style=\"margin-top:5pt; margin-bottom:5pt; text-align:justify;\">the requirement, under the June 4, 2024 Agreement to issue the Top-Up Shares to Almadex on July 31, 2025, has been removed</li><li style=\"margin-top:5pt; margin-bottom:5pt; text-align:justify;\">the NSR has been increased from 2.0% from future production of minerals from the Willow Property under the June 4, 2024 Agreement, to 2.5%, of which the Company can buy back 0.5% for $500,000 for a period of 2 years from the Closing date, which consideration may be paid, at the Company’s election, either in cash or, subject to prior Exchange approval at the time of election, equivalent shares in the capital of the Company.<br /></li></ul>    <p align=\"justify\"><em>“The revised Agreement has the effect of immediately fixing the number of shares to be issued to Almadex”</em> commented Paul G. Anderson, President and CEO of Abacus. “<em>The Company has now consolidated ownership of a very prospective porphyry copper property in a very active district, which remains poorly drill tested</em>.”</p>    <p align=\"justify\">Work done to date by Abacus leads the company to believe that Willow contains a fifth porphyry within the Yerington camp. Of the known porphyries in the camp, the Ann Mason deposit lies adjacent and east of Willow and is held by HudBay Minerals. In 2021, Hudbay announced an updated PEA on Ann Mason with a revised M&amp;I resource of 2.2 billion tonnes at 0.34% Cu. *</p>    <p align=\"justify\">Lion Copper and Gold control the Yerington, Bear and MacArthur porphyries adjacent and to the east of Ann Mason. Anaconda mined the Yerington porphyry between 1952 until 1978, producing 1.6 billion pounds of copper. MacArthur (M&amp;I of 159MT at 0.212% Cu) has seen some past production and is currently undergoing a Prefeasibility Study. In March of 2022, Lion announced that Rio Tinto had taken an option on the company’s Yerington assets, and it announced the results of a new PEA in March of this year. *</p>    <p align=\"justify\">The Company in addition to Willow has a lease on the Nev-Lorraine claims contiguous to Willow, giving it the right to explore and to elect to purchase these claims outright over a ten-year period.</p>    <p align=\"justify\">Abacus also holds a 20% ownership interest in the Ajax copper-gold porphyry project, located near Kamloops, British Columbia., which is managed by base metal major KGHM Polska Miedź S.A., who hold the remaining 80%. The Ajax Project contains significant quantities of copper and gold, within a NI 43-101 Proven and Probable Mineral Reserve of 426 Mt at 0.29% Cu, 0.19 g/t Au and 0.39 g/t Ag. Contained metal is in the order of 2.7 Bil lbs Cu, 2.6 Moz Au and 5.3 Moz Ag**.</p>    <p align=\"justify\">* Data is from the respective Company websites.</p>    <p align=\"justify\">** Wardrop Engineering Inc. 2012. Ajax Copper/Gold Project, Kamloops, British Columbia – Feasibility Study Technical Report. Doc. No. 1054610300-REP-R0004-02. January 2012.</p>    <p align=\"justify\">The technical information in this news release has been reviewed and approved by Paul G. Anderson, M.Sc. P.Geo., a Qualified Person within the meaning of National Instrument 43-101.</p>    <p align=\"justify\">On Behalf of the Board,<br /><strong>ABACUS MINING &amp; EXPLORATION CORPORATION</strong></p>    <p align=\"justify\">Paul G. Anderson, P. Geo.<br />President, CEO and Director<br />(604) 682 - 0301</p>    <p align=\"justify\"><strong>About Abacus</strong><br />Abacus is a mineral exploration and mine development company currently focused on copper and gold in B.C. and Nevada. The Company’s main asset is a 20% ownership interest, together with KGHM Polska Miedź S.A. (80%), in the proposed copper-gold Ajax Mine located southwest of Kamloops, B.C., which has undergone a joint provincial and federal environmental assessment process. On December 14, 2017, a decision was made by the B.C. Minister of Environment and Climate Change Strategy and the Minister of Energy, Mines and Petroleum Resources to decline to issue an environmental assessment certificate for the Project. KGHM have recently reopened an office in Kamloops, B.C. to facilitate First Nation, community and governmental engagement in order to advance the project towards a potential resubmission of the environmental application.</p>    <p align=\"justify\">Abacus also owns a 100% interest in the Willow copper-gold property located near Yerington, Nevada, and it controls the contiguous Nev-Lorraine claims subject to a ten-year lease agreement.</p>    <p align=\"justify\">For the latest reports and information on Abacus’ projects, please refer to the Company’s website at <a href=\"http://www.amemining.com/\" rel=\"nofollow\" target=\"_blank\" title=\"\"><u>www.amemining.com</u></a>.</p>    <p align=\"justify\"><strong><em>Forward-Looking Information</em></strong><br /><em>This release includes certain statements that are deemed “forward-looking statements”. All statements in this release, other than statements of historical</em> <em>facts,</em> <em>that</em> <em>address</em> <em>events</em> <em>or</em> <em>developments</em> <em>that</em> <em>Abacus</em> <em>expects</em> <em>to</em> <em>occur,</em> <em>are</em> <em>forward-looking</em> <em>statements.</em> <em>Forward-looking</em> <em>statements</em> <em>are statements</em> <em>that</em> <em>are</em> <em>not</em> <em>historical</em> <em>facts</em> <em>and</em> <em>are</em> <em>generally,</em> <em>but</em> <em>not</em> <em>always,</em> <em>identified</em> <em>by</em> <em>the</em> <em>words</em> <em>“expects”,</em> <em>“plans”,</em> <em>“anticipates”,</em> <em>“believes”,</em> <em>“intends”, “estimates”, “projects”, “potential” and similar expressions, or that events or conditions “will”, “would”, “may”, “could” or “should” occur. Although the Company believes the expectations expressed in such forward-looking statements are based on reasonable assumptions, such statements are not guarantees</em> <em>of</em> <em>future</em> <em>performance</em> <em>and</em> <em>actual</em> <em>results</em> <em>may</em> <em>differ</em> <em>materially</em> <em>from</em> <em>those</em> <em>in</em> <em>the</em> <em>forward-looking</em> <em>statements.</em> <em>Factors</em> <em>that</em> <em>could</em> <em>cause</em> <em>the actual results to differ materially from those in forward-looking statements include changes to commodity prices, mine and metallurgical recovery, operating and capital costs, foreign exchange rates, ability to obtain required permits on a timely basis, exploitation and exploration successes, continued</em> <em>availability</em> <em>of</em> <em>capital</em> <em>and</em> <em>financing,</em> <em>and</em> <em>general</em> <em>economic,</em> <em>market</em> <em>or</em> <em>business</em> <em>conditions.</em> <em>Investors</em> <em>are</em> <em>cautioned</em> <em>that</em> <em>any</em> <em>such</em> <em>statements are not guarantees of future performance and actual results or developments may differ materially from those projected in the forward-looking statements.</em> <em>Forward-looking</em> <em>statements</em> <em>are</em> <em>based</em> <em>on</em> <em>the</em> <em>beliefs,</em> <em>estimates</em> <em>and</em> <em>opinions</em> <em>of</em> <em>the</em> <em>Company's</em> <em>management</em> <em>on</em> <em>the</em> <em>date</em> <em>the</em> <em>statements are made. Except as required by applicable securities laws, the Company undertakes no obligation to update these forward-looking statements in the</em> <em>event</em> <em>that</em> <em>management's</em> <em>beliefs,</em> <em>estimates</em> <em>or</em> <em>opinions,</em> <em>or</em> <em>other</em> <em>factors,</em> <em>should</em> <em>change.</em></p>    <p align=\"justify\"><em>Neither TSX Venture Exchange nor its Regulation Services Provider (as that term is defined in the policies of the TSX Venture Exchange) accepts responsibility for the adequacy or accuracy of this release.</em></p>  <br /><img src='https://ml.globenewswire.com/media/ZGE2ODViZmItNDBjOS00OWFmLTk4MGMtMmUwNGIyYjc5ODI4LTEwOTgwNTY=/tiny/Abacus-Mining-and-Exploration-.png' referrerpolicy='no-referrer-when-downgrade' />",
    "search_terms": "Willow,Abacus Mining & Exploration Corporation,AME",
    "master_gid": 4465,
    "date": "2024-07-02T19:08:00.000Z",
    "tags": "USA|Nevada|||Project Acquisition",
    "image_id": null,
    "hidden": false,
    "company_id": 1025,
    "provider": "globenewswire",
    "excerpt": "VANCOUVER, British Columbia, July 02, 2024 (GLOBE NEWSWIRE) -- Abacus Mining &amp; Exploration Corporation (“Abacus” or “The Company”) (TSXV:AME) announces that further to its news release dated June 4, 2024, it has amended, at the request of the TSX-Venture Exchange (the “Exchange”), certain terms of the June 4, 2024 agreement",
    "is_regulatory": false,
    "refined_tags": [],
    "ftp_filename": null,
    "company_name": "Abacus Mining & Exploration Corporation",
    "exchange": "TSXV",
    "root_ticker": "AME",
    "project_name": "Willow",
    "gid": 4465,
    "location": "Nevada, United States",
    "plan_id": null,
    "description_text": "VANCOUVER, British Columbia, July  02, 2024  (GLOBE NEWSWIRE) -- Abacus Mining & Exploration Corporation (“Abacus” or “The Company”) (TSXV:AME) announces that further to its news release dated June 4, 2024, it has amended, at the request of the TSX-Venture Exchange (the “Exchange”), certain terms of the June 4, 2024 agreement (the “June 4, 2024 Agreement”) with Almadex Minerals Ltd. and its wholly-owned Nevada subsidiary Almadex America Inc. (“Almadex”), to acquire a 100% ownership interest in the Willow porphyry copper property located in Yerington, Nevada, (“Willow Property”) and data associated with the Willow Property (the “Willow Data”) (the “Amending Agreement”). Pursuant to the terms of the Amending Agreement: the Company has issued 9,546,922 common shares of Abacus to Almadex the requirement, under the June 4, 2024 Agreement to issue the Top-Up Shares to Almadex on July 31, 2025, has been removed the NSR has been increased from 2.0% from future production of minerals from the Willow Property under the June 4, 2024 Agreement, to 2.5%, of which the Company can buy back 0.5% for $500,000 for a period of 2 years from the Closing date, which consideration may be paid, at the Company’s election, either in cash or, subject to prior Exchange approval at the time of election, equivalent shares in the capital of the Company. “The revised Agreement has the effect of immediately fixing the number of shares to be issued to Almadex” commented Paul G. Anderson, President and CEO of Abacus. “ The Company has now consolidated ownership of a very prospective porphyry copper property in a very active district, which remains poorly drill tested .” Work done to date by Abacus leads the company to believe that Willow contains a fifth porphyry within the Yerington camp. Of the known porphyries in the camp, the Ann Mason deposit lies adjacent and east of Willow and is held by HudBay Minerals. In 2021, Hudbay announced an updated PEA on Ann Mason with a revised M&I resource of 2.2 billion tonnes at 0.34% Cu. * Lion Copper and Gold control the Yerington, Bear and MacArthur porphyries adjacent and to the east of Ann Mason. Anaconda mined the Yerington porphyry between 1952 until 1978, producing 1.6 billion pounds of copper. MacArthur (M&I of 159MT at 0.212% Cu) has seen some past production and is currently undergoing a Prefeasibility Study. In March of 2022, Lion announced that Rio Tinto had taken an option on the company’s Yerington assets, and it announced the results of a new PEA in March of this year. * The Company in addition to Willow has a lease on the Nev-Lorraine claims contiguous to Willow, giving it the right to explore and to elect to purchase these claims outright over a ten-year period. Abacus also holds a 20% ownership interest in the Ajax copper-gold porphyry project, located near Kamloops, British Columbia., which is managed by base metal major KGHM Polska Miedź S.A., who hold the remaining 80%. The Ajax Project contains significant quantities of copper and gold, within a NI 43-101 Proven and Probable Mineral Reserve of 426 Mt at 0.29% Cu, 0.19 g/t Au and 0.39 g/t Ag. Contained metal is in the order of 2.7 Bil lbs Cu, 2.6 Moz Au and 5.3 Moz Ag**. * Data is from the respective Company websites. ** Wardrop Engineering Inc. 2012. Ajax Copper/Gold Project, Kamloops, British Columbia – Feasibility Study Technical Report. Doc. No. 1054610300-REP-R0004-02. January 2012. The technical information in this news release has been reviewed and approved by Paul G. Anderson, M.Sc. P.Geo., a Qualified Person within the meaning of National Instrument 43-101. On Behalf of the Board, ABACUS MINING & EXPLORATION CORPORATION Paul G. Anderson, P. Geo. President, CEO and Director (604) 682 - 0301 About Abacus Abacus is a mineral exploration and mine development company currently focused on copper and gold in B.C. and Nevada. The Company’s main asset is a 20% ownership interest, together with KGHM Polska Miedź S.A. (80%), in the proposed copper-gold Ajax Mine located southwest of Kamloops, B.C., which has undergone a joint provincial and federal environmental assessment process. On December 14, 2017, a decision was made by the B.C. Minister of Environment and Climate Change Strategy and the Minister of Energy, Mines and Petroleum Resources to decline to issue an environmental assessment certificate for the Project. KGHM have recently reopened an office in Kamloops, B.C. to facilitate First Nation, community and governmental engagement in order to advance the project towards a potential resubmission of the environmental application. Abacus also owns a 100% interest in the Willow copper-gold property located near Yerington, Nevada, and it controls the contiguous Nev-Lorraine claims subject to a ten-year lease agreement. For the latest reports and information on Abacus’ projects, please refer to the Company’s website at www.amemining.com . Forward-Looking Information This release includes certain statements that are deemed “forward-looking statements”. All statements in this release, other than statements of historical facts, that address events or developments that Abacus expects to occur, are forward-looking statements. Forward-looking statements are statements that are not historical facts and are generally, but not always, identified by the words “expects”, “plans”, “anticipates”, “believes”, “intends”, “estimates”, “projects”, “potential” and similar expressions, or that events or conditions “will”, “would”, “may”, “could” or “should” occur. Although the Company believes the expectations expressed in such forward-looking statements are based on reasonable assumptions, such statements are not guarantees of future performance and actual results may differ materially from those in the forward-looking statements. Factors that could cause the actual results to differ materially from those in forward-looking statements include changes to commodity prices, mine and metallurgical recovery, operating and capital costs, foreign exchange rates, ability to obtain required permits on a timely basis, exploitation and exploration successes, continued availability of capital and financing, and general economic, market or business conditions. Investors are cautioned that any such statements are not guarantees of future performance and actual results or developments may differ materially from those projected in the forward-looking statements. Forward-looking statements are based on the beliefs, estimates and opinions of the Company's management on the date the statements are made. Except as required by applicable securities laws, the Company undertakes no obligation to update these forward-looking statements in the event that management's beliefs, estimates or opinions, or other factors, should change. Neither TSX Venture Exchange nor its Regulation Services Provider (as that term is defined in the policies of the TSX Venture Exchange) accepts responsibility for the adequacy or accuracy of this release.",
    "primary_commodity": "Cu"
  },
  "articleProject": {
    "gid": 4465,
    "project_name": "Willow",
    "location": "Nevada, United States"
  },
  "articleExchange": "TSXV",
  "articleCompanyId": 1025,
  "articleTicker": "AME",
  "articleCompanyName": "Abacus Mining & Exploration Corporation",
  "allOtherCompanyProjects": [
    {
      "company_id": 1025,
      "gid": 4465,
      "project_name": "Willow",
      "location": "Nevada, United States"
    }
  ],
  "allOtherCompanyNews": [
    {
      "id": 106775,
      "company_id": 1025,
      "title": "Abacus Announces Appointment of Niina Makela as Chief Financial Officer",
      "link": "https://app.quotemedia.com/data/downloadFiling?webmasterId=104408&ref=683dce4401b9f63af36ed1e2&type=PDFC&formType=002-002-001089-003001&formDescription=News+release&dateFiled=2025-06-02",
      "date": "2025-06-02T16:16:04.000Z",
      "hidden": false
    },
    {
      "id": -197849,
      "company_id": 1025,
      "title": "Abacus Announces Further Increase to Financing",
      "link": "https://app.quotemedia.com/data/downloadFiling?webmasterId=104408&ref=67eef576a703046db13be931&type=PDFC&formType=002-002-001089-003001&formDescription=News+release&dateFiled=2025-04-03",
      "date": "2025-04-03T13:54:14.000Z",
      "hidden": false
    },
    {
      "id": -197850,
      "company_id": 1025,
      "title": "Abacus completes non-brokered private placement",
      "link": "https://app.quotemedia.com/data/downloadFiling?webmasterId=104408&ref=67eef4f1a6d53e25df1880e6&type=PDFC&formType=002-002-001089-003001&formDescription=News+release&dateFiled=2025-04-03",
      "date": "2025-04-03T13:52:01.000Z",
      "hidden": false
    },
    {
      "id": 102727,
      "company_id": 1025,
      "title": "Abacus Announces Increase to Financing",
      "link": "https://app.quotemedia.com/data/downloadFiling?webmasterId=104408&ref=67e7746e09997413821d3e2f&type=PDFC&formType=002-002-001089-003001&formDescription=News+release&dateFiled=2025-03-28",
      "date": "2025-03-28T21:17:50.000Z",
      "hidden": false
    },
    {
      "id": 89605,
      "company_id": 1025,
      "title": "Abacus Announces Financing",
      "link": "https://www.globenewswire.com/news-release/2025/02/28/3034634/0/en/Abacus-Announces-Financing.html",
      "date": "2025-02-28T12:00:00.000Z",
      "hidden": false
    },
    {
      "id": -180387,
      "company_id": 1025,
      "title": "Abacus Announces Grant of Stock Options",
      "link": "https://app.quotemedia.com/data/downloadFiling?webmasterId=104408&ref=67bcca2a336d09562c2f8e91&type=PDFC&formType=002-002-001089-003001&formDescription=News+release&dateFiled=2025-02-24",
      "date": "2025-02-24T19:36:10.000Z",
      "hidden": false
    },
    {
      "id": -180386,
      "company_id": 1025,
      "title": "Abacus Closes Second Tranche of Equity Offering",
      "link": "https://app.quotemedia.com/data/downloadFiling?webmasterId=104408&ref=6710535d96119641e0222a41&type=PDFC&formType=002-002-001089-003001&formDescription=News+release&dateFiled=2024-10-16",
      "date": "2024-10-16T23:59:25.000Z",
      "hidden": false
    },
    {
      "id": -180385,
      "company_id": 1025,
      "title": "Abacus Announces Extension to Financing",
      "link": "https://app.quotemedia.com/data/downloadFiling?webmasterId=104408&ref=66eca9689305a533aa27ac79&type=PDFC&formType=002-002-001089-003001&formDescription=News+release&dateFiled=2024-09-19",
      "date": "2024-09-19T22:44:56.000Z",
      "hidden": false
    },
    {
      "id": -180384,
      "company_id": 1025,
      "title": "Abacus Closes First Tranche of Equity Offering",
      "link": "https://app.quotemedia.com/data/downloadFiling?webmasterId=104408&ref=66c4c80063665147ac1f293a&type=PDFC&formType=002-002-001089-003001&formDescription=News+release&dateFiled=2024-08-20",
      "date": "2024-08-20T16:44:48.000Z",
      "hidden": false
    },
    {
      "id": 65824,
      "company_id": 1025,
      "title": "Abacus Announces Financing",
      "link": "https://www.globenewswire.com/news-release/2024/07/23/2917082/0/en/Abacus-Announces-Financing.html",
      "date": "2024-07-23T11:00:00.000Z",
      "hidden": false
    }
  ]
}
