{
  "article": {
    "id": 41613,
    "link": "https://www.newsfilecorp.com/release/182163/Silver-Hammer-Reaches-Definitive-Agreement-to-Acquire-the-Permitted-Shafter-Silver-Mine-Project-and-Announces-Proposed-Reorganization",
    "title": "Silver Hammer Reaches Definitive Agreement to Acquire the Permitted Shafter Silver Mine Project and Announces Proposed Reorganization",
    "description": "<img src=\"https://api.newsfilecorp.com/newsinfo/182163/367\" id=\"367\" width=\"2\" height=\"2\" style=\"width: 1px;  height: 1px;border: 0px solid;\" /><p>Vancouver, British Columbia--(Newsfile Corp. - September 28, 2023) - <b>Silver Hammer Mining Corp. (CSE: HAMR)</b> (the \"<b>Company</b>\" or \"<b>Silver Hammer</b>\") is pleased to announce that it has entered into a definitive share purchase agreement dated September 27, 2023 (the \"<b>Purchase Agreement</b>\") to acquire a 100% interest in the Shafter silver deposit (the \"<b>Shafter Project</b>\" or the \"<b>Project</b>\"), a previously producing high-grade silver mine located in Presidio County in Southwest Texas, from Aurcana Silver Corporation (\"<b>Aurcana</b>\") (the \"<b>Transaction</b>\"). The consideration to be paid by Silver Hammer for the Shafter Project includes cash of US$800,000 (less certain exclusivity fees and prepaid expenses), 23,000,000 shares, certain contingent payments (detailed below), and for the settlement of existing debt, the issuance of $4,000,000 in secured convertible debentures and 8,000,000 units (each comprising of a common share and &#189; warrant at $0.33 for 2 years).</p><p><b>Highlights of the Shafter Project and Transaction:</b></p><ul style=\"list-style-type: disc;\"><li>All material operational permits remain in place at the past-producing high-grade silver mine, which is located in western Texas, USA. </li><li>Past producer most recently in production from 2012-13 when operated by Aurcana. Approximately US$50 million was spent historically by Aurcana; in addition, Aurcana purchased the Shafter Project in 2008 for US$25 million. An estimated US$160 million has been invested in the property since the discovery of the deposit in the late 1800's. </li><li>Updated NI 43-101 Mineral Resource technical report with an Effective Date of September 15, 2023, including Measured and Indicated resources of 10.8 million ounces (\"oz\") of silver (\"Ag\") in 1.152 million tons grading 9.38 oz/ton Ag, and Inferred resources of 6.3 million oz of silver in 0.823 million tons grading 7.67 oz/ton Ag.</li><li>The silver deposit at the Shafter Project is classified as a carbonate replacement deposit (\"<b>CRD</b>\") and the geology at the project is similar to some the world's largest CRDs located just to the southwest in northern Mexico, including the Santa Eulalia Mine and Cinco de Mayo Project. Additional exploration upside was identified at regional priority targets from previous step-out drill holes to the southwest, which identified silver and gold mineralization.</li><li>There are opportunities to expand the current mineral resource within the project boundaries, as the Project has not been systematically explored, and the source of the Shafter CRD has never been identified.</li><li>Benefits from extensive site infrastructure including full access through portal/decline and extensive underground workings, ventilation and access shaft/hoist, and full processing plant including a 3,000 ton per day ball mill.</li><li>Project controls existing water rights, with an available local labor force, power grid located at site, a low royalty burden, and strong community relations and support.</li><li>Team of seasoned mining, metallurgical and exploration executives assembled to assist Silver Hammer as advisors and internal consultants.</li></ul><p><i>\"The acquisition of the high-grade silver Shafter complex and permitted mine is a transformational point in Silver Hammer's transition and goal to become North America's next silver producer. Shafter contains an established mineral resource of approximately 10.8 million ounces of silver in the measured and indicated category and an additional inferred silver resource of approximately 6.3 million ounces. To ensure the project is advanced towards the development and production stages, Silver Hammer has attracted key senior level technical geological and mining advisors including previous VP Exploration and VP/COO Mining experts that held executive roles with Hudbay Minerals, Coeur Mining, Silver Standard, Centerra, Mag Silver, Probe Mines, Hecla, and Royal Oak Mines,\"</i> <b>commented Peter A. Ball, President and CEO of Silver Hammer Mining.</b> <i>\"In addition to containing a significant silver resource, the Shafter Project is located in a politically safe jurisdiction in Texas, USA, is located adjacent to a paved highway with significant infrastructure including power grid through the middle of the Project, full control of water rights, a local work force and supportive community.\"</i></p><p><b>Appointment of New Board Member</b></p><p>The Company is pleased to announce the appointment of Donald J. Birak as a newly appointed Director of Silver Hammer, replacing Joness Lang, who has stepped down from the Director role but will remain as a strategic advisor to assist the Company in ongoing corporate development initiatives. The Company appreciates Mr. Lang's significant contribution to the Company since its inception and agreeing to remain with the Company as a strategic advisor during this exciting phase of growth for the Company. </p><p>Mr. Birak joined the Company as a senior technical advisor earlier in 2023, and brings more than 45 years of experience in mineral exploration and operations, including the roles of Senior Vice-President of Exploration with Coeur Mining (2004 to 2013) responsible for global Greenfields and Brownfields exploration, Vice President of Exploration for AngloGold North America (1998 to 2004), Independence Mining Company (1995 to 1998), and Hudson Bay Mining &#38; Smelting Ltd. (1992 to 1995) and Chief Geologist &#38; Exploration Geologist for Freeport-McMoRan Gold Company (1978 to 1991), Mr. Birak brings a wealth of knowledge and expertise to the Silver Hammer team, and specifically to the advancement of the Shafter Silver Project.</p><p><b>Newly Formed Executive Technical Team and Strategic Advisors</b></p><p>Silver Hammer has recently assembled a highly experience technical team to complete due diligence to fully evaluate and to assist in advancing the Shafter Project through an accelerated strategy to complete a mineral resource expansion, initiate mine development towards future production by 2027. The team is made up of the following seasoned executives:</p><ul style=\"list-style-type: disc;\"><li>Lawrence Roulston, Director - 40+ years in project evaluation and experience mining executive. Currently President and CEO of MTB Metals Corp. and Chairman of Metalla Royalties.</li></ul><ul style=\"list-style-type: disc;\"><li>Ron Burk, Director - 40+ years in senior level precious metals exploration roles including VP Exploration for Silver Standard and Centerra. Silver Standard previously owned the Shafter deposit until 2008.</li></ul><ul style=\"list-style-type: disc;\"><li>Don Birak, newly appointed Director - 45+ years in senior level precious metals exploration roles including Sr. VP Exploration for Coeur Mining, and VP Exploration for AngloGold North America and Hudson Bay Mining Smelting.</li></ul><ul style=\"list-style-type: disc;\"><li>Dr. Peter Megaw, Geological Advisor - 45+ years in senior level precious metals exploration roles and recognized Carbonate Replacement Deposit (\"CRD\") systems. A co-founder of MAG Silver. Dr. Megaw's PhD work focused on the Santa Eulalia Ag-Pb-Zn District in Mexico, and he is credited with numerous discoveries in Mexico including Platosa (Excellon), Juanicipio-Fresnillo (Fresnillo/MAG Silver), and Pozo-Seco/Cinco de Mayo (MAG Silver).</li></ul><ul style=\"list-style-type: disc;\"><li>Damir Cukor, Geological Advisor - 35+ years in resource development, project management, resource modelling and advisory roles.</li></ul><ul style=\"list-style-type: disc;\"><li>Michael Willett, Mining Advisor - Seasoned mining executive with 35+ years in mine engineering, development, and operations including senior level project evaluation and advisory roles for project re-starts with various mining companies across North America. Most recently Mr. Willett held the position of Vice President of Operations and Projects for Battle North Gold and was part of that team which successfully sold the company to Evolution Mining for $343 Million in 2021.</li></ul><ul style=\"list-style-type: disc;\"><li>Adrian McNutt, Mining and Metallurgical Advisor - Experienced mining executive and metallurgical consultant with 35+ years in the evaluation and precious metals operations across the Americas including executive positions as COO of Royal Oak Mines, and Century Mining.</li></ul><ul style=\"list-style-type: disc;\"><li>Mike Petrina, P. Eng, Mining Advisor - 35+ years in the mining sector including senior level executive roles of VP Mining MAG Silver, VP Operations Probe Mining, VP Mining Hawthorne Gold, and multiple mine engineering advisory roles.</li></ul><ul style=\"list-style-type: disc;\"><li>Mike Gross, Mining Advisor - 45+ years with experience as a mine operator, operations executive and exploration executive in the Americas including VP Mining for Hecla Mining.</li></ul><p><b>The Company has engaged Echelon Capital Markets as its financial advisor with respect to the Transaction.</b></p><p><b>The Shafter Project</b></p><p>The Shafter silver mine has all material permits in place with extensive surface infrastructure and underground workings including portal/decline and shaft access and a processing facility rated at approximately 1,500 tons per day. The project is located in west Texas and is fully accessible via paved highway from El Paso, Texas. Shafter has estimated measured and indicated resources of 10,803,000 ounces of silver and an inferred resource of 6,315,000 ounces of silver as summarized in Table 1. This estimate has been prepared for Silver Hammer Mining Inc. by RESPEC and is dated effective September 15, 2023 (the \"<b>Updated Mineral Resource Estimate</b>\") and an NI 43-101 Technical Report will be filed on SEDAR+ within 45 days of the date hereof. </p><p><b>Table 1: Mineral Resource Table effective September 15, 2023</b></p><table cellspacing=\"0\" cellpadding=\"3\" border=\"0\" style=\"width: 100%; border-collapse: collapse; border-width: 1px; border-style: solid; border-color: #000000;\"><tbody><tr><td style=\"border-width: 1px; border-style: solid; border-color: #000000; width: 30%; text-align: center; vertical-align: top; font-size: 10px;\"><b>Estimated Resources*</b></td><td style=\"border-width: 1px; border-style: solid; border-color: #000000; width: 16%; text-align: center; vertical-align: top; font-size: 10px;\"><b>Tons</b></td><td style=\"border-width: 1px; border-style: solid; border-color: #000000; width: 13%; text-align: center; vertical-align: top; font-size: 10px;\"><b>oz/ton</b><br /><b>Ag</b></td><td style=\"border-width: 1px; border-style: solid; border-color: #000000; width: 13%; text-align: center; vertical-align: top; font-size: 10px;\"><b>Tonnes</b></td><td style=\"border-width: 1px; border-style: solid; border-color: #000000; width: 13%; text-align: center; vertical-align: top; font-size: 10px;\"><b>g/tonne</b><br /><b>Ag</b></td><td style=\"border-width: 1px; border-style: solid; border-color: #000000; width: 13%; text-align: center; vertical-align: top; font-size: 10px;\"><b>Contained</b><br /><b> Ag Ounces</b></td></tr><tr><td style=\"border-width: 1px; border-style: solid; border-color: #000000; width: 30%; font-size: 10px;\"><b>Measured</b></td><td style=\"text-align: right; border-width: 1px; border-style: solid; border-color: #000000; width: 16%; font-size: 10px;\">97,000</td><td style=\"text-align: center; border-width: 1px; border-style: solid; border-color: #000000; width: 13%; font-size: 10px;\">8.95</td><td style=\"text-align: right; border-width: 1px; border-style: solid; border-color: #000000; width: 13%; font-size: 10px;\">88,000</td><td style=\"text-align: center; border-width: 1px; border-style: solid; border-color: #000000; width: 13%; font-size: 10px;\">306.9</td><td style=\"text-align: right; border-width: 1px; border-style: solid; border-color: #000000; width: 13%; font-size: 10px;\">868,000</td></tr><tr><td style=\"border-width: 1px; border-style: solid; border-color: #000000; width: 30%; font-size: 10px;\"><b>Indicated</b></td><td style=\"text-align: right; border-width: 1px; border-style: solid; border-color: #000000; width: 16%; font-size: 10px;\">1,055,000</td><td style=\"text-align: center; border-width: 1px; border-style: solid; border-color: #000000; width: 13%; font-size: 10px;\">9.42</td><td style=\"text-align: right; border-width: 1px; border-style: solid; border-color: #000000; width: 13%; font-size: 10px;\">957,000</td><td style=\"text-align: center; border-width: 1px; border-style: solid; border-color: #000000; width: 13%; font-size: 10px;\">323.0</td><td style=\"text-align: right; border-width: 1px; border-style: solid; border-color: #000000; width: 13%; font-size: 10px;\">9,935,000</td></tr><tr><td style=\"border-width: 1px; border-style: solid; border-color: #000000; width: 30%; text-align: right; vertical-align: middle; font-size: 10px;\"><b>Measured &#38; Indicated</b></td><td style=\"text-align: right; border-width: 1px; border-style: solid; border-color: #000000; width: 16%; font-size: 10px;\">1,152,000</td><td style=\"text-align: center; border-width: 1px; border-style: solid; border-color: #000000; width: 13%; font-size: 10px;\">9.38</td><td style=\"text-align: right; border-width: 1px; border-style: solid; border-color: #000000; width: 13%; font-size: 10px;\">1,045,000</td><td style=\"text-align: center; border-width: 1px; border-style: solid; border-color: #000000; width: 13%; font-size: 10px;\">321.3</td><td style=\"text-align: right; border-width: 1px; border-style: solid; border-color: #000000; width: 13%; font-size: 10px;\">10,803,000</td></tr><tr><td style=\"border-width: 1px; border-style: solid; border-color: #000000; width: 30%; font-size: 10px;\"><b>Inferred</b></td><td style=\"text-align: right; border-width: 1px; border-style: solid; border-color: #000000; width: 16%; font-size: 10px;\">823,000</td><td style=\"text-align: center; border-width: 1px; border-style: solid; border-color: #000000; width: 13%; font-size: 10px;\">7.67</td><td style=\"text-align: right; border-width: 1px; border-style: solid; border-color: #000000; width: 13%; font-size: 10px;\">747,000</td><td style=\"text-align: center; border-width: 1px; border-style: solid; border-color: #000000; width: 13%; font-size: 10px;\">263.0</td><td style=\"text-align: right; border-width: 1px; border-style: solid; border-color: #000000; width: 13%; font-size: 10px;\">6,315,000</td></tr></tbody></table><p>&#160;</p><p><i><font style=\"font-size: 11px;\">*Updated Mineral Resource by RESPEC has effective date of September 15, 2023.</font></i></p><ol style=\"list-style-type: decimal; font-size: 11px;\"><li><i><font style=\"font-size: 11px;\">The Updated Mineral Resource Estimate is reported by Mr. Michael S. Lindholm, Principal Geologist for RESPEC in short tons.</font></i></li><li><i><font style=\"font-size: 11px;\">The Updated Mineral Resource Estimate was prepared in accordance with Canadian Institute of Mining, Metallurgy and Petroleum Definition Standards - For Mineral Resources and Mineral Reserves adopted May 10, 2014, and in accordance with National Instrument 43-101 \"Standards of Disclosure for Mineral Projects\" (\"<b>NI43-101</b>\").</font></i></li><li><i><font style=\"font-size: 11px;\">Mineral Resources are comprised of model blocks greater than or equal to the 4.2 oz Ag/ton cutoff.</font></i></li><li><i><font style=\"font-size: 11px;\">Mineral Resources that are not Mineral Reserves do not have demonstrated economic viability.</font></i></li><li><i><font style=\"font-size: 11px;\">Mineral Resources potentially amenable to underground mining methods are reported using a silver price of US$23.50/oz, a throughput rate of 800 tons/day, assumed metallurgical recoveries of 84% for Ag, mining costs of US$60/ton mined, processing costs of US$19.88/ton processed, refining costs of US$0.50/oz Ag produced, and general and administrative costs of US$6.94/ton processed. Silver commodity price selected based on analysis of the three-year running average at the end of August 2023.</font></i></li><li><i><font style=\"font-size: 11px;\">Rounding may result in apparent discrepancies between tons, grade, and contained metal content.</font></i></li><li><i><font style=\"font-size: 11px;\">The estimate of Mineral Resources may be materially affected by environmental permitting, legal title, taxation, socio-political, marketing or other relevant issues, however, none are apparent at this time.</font></i></li></ol><p><b>Shafter History:</b></p><ul><li>The Shafter district was first discovered in 1880 or 1881, and the Presidio Mining Company was formed in 1881. Silver was produced from the Presidio mine from 1883 to 1926, when the American Metal Co. acquired the Shafter property and continued production (American Metal Co. subsequently merged with Climax Molybdenum Company to form American Metal Climax, Inc. (\"AMAX\"). </li><li>From 1883 to 1942, when the Presidio mine was closed, total recorded production was 2.307 million tons of ore containing 35.153 million ounces of silver at an average grade of 15.24oz Ag/ton. </li><li>AMAX, Gold Fields Mining Corporation (\"Gold Fields\"), and Rio Grande Mining Company (\"RGMC\") successively held the Shafter property and conducted extensive exploration programs from 1926 to 1999. Gold Fields identified the northeastern, down-dip extension of the Shafter deposit, extending more than 5,000ft from the deepest development workings in the Presidio mine, through a systematic surface-drilling program. During the 1970s, Gold Fields constructed a 1,052ft deep shaft to access and explore the northeastern extension. </li><li>Aurcana purchased RGMC and the Shafter property in July 2008 for US$25 million. RGMC is now a wholly owned subsidiary of Aurcana. Aurcana began exploration at Shafter in 2011 and has conducted geophysical surveying, drilling, mapping, and geochemical sampling since that time. Aurcana drilled 65 surface and 101 underground holes from 2011 through October 2013. </li><li>A total of 1,694 drill holes are included in the resource database for the Shafter Project, of which 1,048 were drilled by AMAX, 403 were drilled by Gold Fields, 88 were drilled by RGMC prior to their acquisition by Aurcana, and 155 holes were drilled by RGMC since their acquisition by Aurcana.</li><li>These holes include 435 surface core holes, 1,171 underground core holes, and 88 reverse circulation holes. An additional eleven underground core holes were drilled by Aurcana in late 2013 after the database was finalized for use, but before the current resource estimate was completed. Aurcana also drilled five exploration holes in 2017 outside of the current resource area. These 2013 and 2017 holes do not impact the current resource estimate and are not included within the current drill database. </li><li>Aurcana reopened access into the Presidio mine on June 1, 2012, and production commenced on December 14, 2012, after spending approximately US$50 million including a portal/decline access, mill, and operations modifications. In conjunction with its underground operations, Aurcana began open-pit mining of lower-grade mineralization from the Mina Grande pit at the Presidio mine on April 23, 2012. </li><li>Mining was discontinued after the plant commissioning and testing phase were complete, due mostly in part to lower silver prices reaching close to US$17/oz and rushed production start-up issues. The mine was put on care and maintenance in December 2013.</li><li>An estimated US$160 million has been invested in the property since the discovery of the deposit in the late 1800's.</li><li>Significant opportunity exists regionally noting the geological setting of the Shafter Silver Deposit is on the eastern margin of the Chihuahua Trough, which is host to several world-class CRD (Carbonate Replacement Deposits) including the Santa Eulalia Mine (Grupo Mexico), Cinco de Mayo project (MAG Silver), and the Plomosas Property, a polymetallic deposit (GR Silver Mining).</li></ul><p><b>Transaction Details</b></p><p>In connection with the Purchase Agreement, the Company will first complete a reorganization (the \"<b>Reorganization</b>\") whereby all of the Company's outstanding shares will be acquired by a newly incorporated company, Silver Hammer Metals Corp. (\"<b>Newco</b>\"), and shareholders of the Company will receive common shares of Newco (\"<b>Newco</b> <b>Shares</b>\") in exchange for their Company shares. Newco will then acquire all of the outstanding shares in the capital of Rio Grande Mining Corporation (\"<b>Rio Grande</b>\"), a subsidiary of Aurcana that owns the assets, property, rights and undertakings of and relating to the Shafter Project (the \"<b>Shafter Acquisition</b>\"). The Reorganization is expected to be implemented by way of a court-approved plan of arrangement under the <i>Business Corporations Act</i> (British Columbia) (the \"<b>Plan of Arrangement</b>\"), which will result in the Company becoming a wholly-owned subsidiary of Newco. Under the Plan of Arrangement, each common share of the Company will be exchanged for one Newco Share and the convertible securities of the Company will become exercisable for securities of Newco on an equivalent basis. The Reorganization is subject to approval of the Supreme Court of British Columbia and the shareholders of Silver Hammer.</p><p>On closing of the Transaction, in consideration for the shares of Rio Grande, Aurcana will receive a cash payment of US$800,000 (less certain exclusivity fees and prepaid expenses) and 23,000,000 Newco Shares at a deemed price of $0.25 per Newco Share. In addition, upon the completion of the next equity financing completed by Newco following the closing, Aurcana will receive an additional cash payment of US$375,000. Aurcana may also receive additional post-closing payments, payable in cash or shares, subject to the achievement of certain milestones within 48 months of closing of the Shafter Acquisition in the aggregate amount of up to US$3,000,0000, as follows: (a) up to US$1,000,000 will be payable in connection with the first public announcement of a new mineral resource estimate on the Shafter Project which includes measured and indicated mineral resources of at least 18 million ounces, (b) US$1,000,000 will be payable upon the Shafter Project entering commercial production, (c) US$500,000 will be payable if the spot price of silver is equal to or greater than US$30 per ounce for a period of 60 consecutive days, and (d) an additional US$500,000 will be payable if both (b) and (c), above, are met. </p><p>Newco has also entered into an agreement with noteholders of Rio Grande to settle certain outstanding debt of Rio Grande in connection with the Shafter Acquisition (the \"<b>Debt Settlement</b>\"). Pursuant to the Debt Settlement, Newco will acquire all of the outstanding notes of Rio Grande in the aggregate principal amount of $6,517,662 (the \"<b>Rio Grande Notes</b>\") in consideration for (a) an aggregate of 4,000 debenture units of Newco, each consisting of one $1,000 principal amount secured convertible debenture of Newco, representing $4,000,000 in total (the \"<b>Debentures</b>\"), and 2,000 common share purchase warrants of Newco (the \"<b>Warrants</b>\"), (b) an aggregate of 8,000,000 units of Newco, each consisting of one Newco Share and one-half of a Warrant, and (c) additional securities of Newco on the same terms as the Concurrent Financing (as described below) in settlement of all interest accrued on the Rio Grande Notes from August 31, 2023 to closing. The Debentures will be convertible into Newco Shares at the conversion price of $0.25 per Newco Share and each Warrant will entitle the holder thereof to purchase one Newco Share at the exercise price of $0.33 per Newco Share for a period of 24 months from closing.</p><p>On closing of the Transaction, Newco and Aurcana will enter into an investor rights agreement (the \"<b>Investor Rights Agreement</b>\") pursuant to which Newco and Aurcana will agree to certain investor rights and restrictions relating to the Newco Shares to be issued to Aurcana pursuant to the Shafter Acquisition. Under the Investor Rights Agreement, Aurcana will have the right to nominate one member of the Board of Directors of Newco, increasing to two directors if at any time Aurcana holds greater than 35% of the outstanding Newco Shares. Aurcana will agree to certain standstill restrictions and to vote its Newco Shares in accordance with recommendations of management and for a period of 24 months. In addition, the Newco Shares issued to Aurcana will be subject to voluntary resale restrictions with 25% of the Newco Shares being locked-up for 4 months from closing, 25% of the Newco Shares being locked-up for 8 months and the remaining 50% of the Newco Shares being locked up for a period of 12 months.</p><p>In connection with the Shafter Acquisition and pursuant to the terms of the Purchase Agreement, Silver Hammer will arrange a concurrent equity financing for minimum gross proceeds of CAN$3,000,000 (the \"<b>Concurrent Financing</b>\"). The terms of the Concurrent Financing will be disclosed in a subsequent news release once finalized.</p><p>Completion of the Shafter Acquisition is subject to a number of conditions, including: (i) the receipt of all required approvals of the shareholders of Aurcana and the Company; (ii) the receipt of all necessary regulatory and third party consents, approvals and authorizations, including all necessary stock exchange approvals; (iii) the Completion of the Concurrent Financing for minimum gross proceeds of CAN$3,000,000, (iv) the completion of the Reorganization and the Debt Settlement, (v) conditional approval of the CSE for the listing of the Newco Shares, including the Newco Shares to be issued in connection with the Shafter Acquisition, the Reorganization and the Debt Settlement, and (vi) other standard closing conditions for a transaction of this nature. The Transaction is an arm's length transaction. Upon completion of the Transaction, the Reorganization and the Debt Settlement, Silver Hammer shareholders are expected to own approximately 63% of the Newco Shares on a non-diluted basis (excluding securities to be issued pursuant to the Concurrent Financing).</p><p><b>Trading Halt</b></p><p>Trading of the Company's common Shares has been halted as a result of the announcement of the proposed Transaction and the Company expects that trading will remain halted pending closing of the Transaction, subject to earlier resumption upon CSE acceptance of the proposed Transaction and the filing of required materials in accordance with the policies of the CSE, if and as applicable. </p><p>Additional information concerning the proposed Shafter Acquisition, the Reorganization, the Debt Settlement, the Shafter Project, and Newco will be provided in the management proxy circular of the Company to be prepared and delivered to shareholders of Silver Hammer, which will be available in due course under the Company's SEDAR+ profile. </p><p><b>Qualified Person</b></p><p>All scientific and technical information in this press release has been prepared or reviewed and approved by Damir Cukor, P. Geo, an independent geological consultant of the Company, Linda Dufour, P.Eng, an independent metallurgical consultant of the Company, and Michael S. Lindholm, CPG of RESPEC. Each of Mr. Cukor, Ms. Dufour, and Mr. Lindholm are \"qualified persons\" for the purposes of NI 43-101. Mr. Cukor is the Qualified Person for all technical information in this news release, excluding the Updated Mineral Resource Estimate.</p><p><b>About Silver Hammer Mining Corp.</b></p><p>Silver Hammer Mining Corp. is a junior resource company focused on advancing past-producing high-grade silver projects in the United States. Silver Hammer controls 100% of the Silver Strand Mine in the Coeur d'Alene Mining District in Idaho, USA, as well both the Eliza Silver Project and the Silverton Silver Mine in Nevada and the Lacy Gold Project in British Columbia, Canada. Silver Hammer's primary focus is defining and developing silver deposits near past-producing mines that have not been adequately tested. The Company's portfolio also provides exposure to copper and gold discoveries.</p><p><b>On Behalf of the Board of Silver Hammer Mining Corp.</b></p><p>Peter A. Ball<br />President &#38; CEO, Director<br />E: <a href=\"mailto:peter@silverhammermining.com\">peter@silverhammermining.com</a></p><p><b>For investor relations inquiries, contact:</b></p><p>Peter A. Ball<br />President &#38; CEO<br />778.344.4653<br />E: <a href=\"mailto:investors@silverhammermining.com\">investors@silverhammermining.com</a></p><p><i><b>Forward-Looking Information</b></i></p><p>This press release contains \"forward-looking information\" within the meaning of applicable Canadian securities legislation. Forward-looking information in this press release includes, without limitation, statements relating to the completion of the Shafter Acquisition, the completion of the Concurrent Financing, the completion of the Debt Settlement and the Reorganization. Completion of the Shafter Acquisition, the Reorganization and the Debt Settlement are subject to a number of conditions, as described elsewhere in this news release. There can be no assurance that these transactions will be completed as proposed or at all. These statements are based upon assumptions that are subject to significant risks and uncertainties, including risks regarding the mining industry, commodity prices, market conditions, general economic factors, management's ability to manage and to operate the business, and explore and develop the projects, of the resulting issuer, and the equity markets generally. Because of these risks and uncertainties and as a result of a variety of factors, the actual results, expectations, achievements or performance of each of the Company and Aurcana may differ materially from those anticipated and indicated by these forward-looking statements. Any number of factors could cause actual results to differ materially from these forward-looking statements as well as future results. Although each of the Company believes that the expectations reflected in forward looking statements are reasonable, they can give no assurances that the expectations of any forward-looking statements will prove to be correct. Except as required by law, the Company disclaims any intention and assume no obligation to update or revise any forward-looking statements to reflect actual results, whether as a result of new information, future events, changes in assumptions, changes in factors affecting such forward-looking statements or otherwise.</p><p>This press release does not constitute an offer to sell or a solicitation of an offer to sell any of the securities in the United States. The securities have not been and will not be registered under the United States Securities Act of 1933, as amended (the \"<b>U.S. Securities Act</b>\") or any state securities laws and may not be offered or sold within the United States or to U.S. Persons unless registered under the U.S. Securities Act and applicable state securities laws or an exemption from such registration is available.</p><p style=\"text-align: center;\"><i>NOT FOR DISTRIBUTION TO UNITED STATES NEWSWIRE SERVICES OR FOR RELEASE, PUBLICATION, DISTRIBUTION OR DISSEMINATION, DIRECTLY OR INDIRECTLY, IN WHOLE OR IN PART, IN OR INTO THE UNITED STATES</i></p><p id=\"corporateNewsLogoContainer\"><img src=\"https://images.newsfilecorp.com/files/9597/182163_c8c16164f4f54828_logo.jpg\" id=\"corporateNewsLogo\" alt=\"Corporate Logo\" /></p><p id=\"corporateLinkBack\">To view the source version of this press release, please visit <a href=\"https://api.newsfilecorp.com/redirect/DZ2nOHg8RB\">https://www.newsfilecorp.com/release/182163</a></p>",
    "search_terms": "Shafter,Silver Hammer Mining Corp ,HAMR",
    "master_gid": 5473,
    "date": "2023-09-28T11:30:00.000Z",
    "tags": "USA|Texas||Silver|Company Update,Project Acquisition",
    "image_id": null,
    "hidden": false,
    "company_id": 1725,
    "provider": null,
    "excerpt": "Vancouver, British Columbia--(Newsfile Corp. - September 28, 2023) -Silver Hammer Mining Corp. (CSE: HAMR)(the \"Company\" or \"Silver Hammer\") is pleased to announce that it has entered into a definitive share purchase agreement dated September 27, 2023 (the \"Purchase Agreement\") to acquire a 100% interest in the Shafter silver deposit (the",
    "is_regulatory": false,
    "refined_tags": [
      "Project Acquisition",
      "Company Update"
    ],
    "ftp_filename": null,
    "company_name": "Silver Hammer Mining Corp",
    "exchange": "CSE",
    "root_ticker": "HAMR",
    "project_name": "Shafter",
    "gid": 5473,
    "location": "Texas, United States",
    "plan_id": null,
    "description_text": "Vancouver, British Columbia--(Newsfile Corp. - September 28, 2023) - Silver Hammer Mining Corp. (CSE: HAMR) (the \" Company \" or \" Silver Hammer \") is pleased to announce that it has entered into a definitive share purchase agreement dated September 27, 2023 (the \" Purchase Agreement \") to acquire a 100% interest in the Shafter silver deposit (the \" Shafter Project \" or the \" Project \"), a previously producing high-grade silver mine located in Presidio County in Southwest Texas, from Aurcana Silver Corporation (\" Aurcana \") (the \" Transaction \"). The consideration to be paid by Silver Hammer for the Shafter Project includes cash of US$800,000 (less certain exclusivity fees and prepaid expenses), 23,000,000 shares, certain contingent payments (detailed below), and for the settlement of existing debt, the issuance of $4,000,000 in secured convertible debentures and 8,000,000 units (each comprising of a common share and ½ warrant at $0.33 for 2 years). Highlights of the Shafter Project and Transaction: All material operational permits remain in place at the past-producing high-grade silver mine, which is located in western Texas, USA. Past producer most recently in production from 2012-13 when operated by Aurcana. Approximately US$50 million was spent historically by Aurcana; in addition, Aurcana purchased the Shafter Project in 2008 for US$25 million. An estimated US$160 million has been invested in the property since the discovery of the deposit in the late 1800's. Updated NI 43-101 Mineral Resource technical report with an Effective Date of September 15, 2023, including Measured and Indicated resources of 10.8 million ounces (\"oz\") of silver (\"Ag\") in 1.152 million tons grading 9.38 oz/ton Ag, and Inferred resources of 6.3 million oz of silver in 0.823 million tons grading 7.67 oz/ton Ag. The silver deposit at the Shafter Project is classified as a carbonate replacement deposit (\" CRD \") and the geology at the project is similar to some the world's largest CRDs located just to the southwest in northern Mexico, including the Santa Eulalia Mine and Cinco de Mayo Project. Additional exploration upside was identified at regional priority targets from previous step-out drill holes to the southwest, which identified silver and gold mineralization. There are opportunities to expand the current mineral resource within the project boundaries, as the Project has not been systematically explored, and the source of the Shafter CRD has never been identified. Benefits from extensive site infrastructure including full access through portal/decline and extensive underground workings, ventilation and access shaft/hoist, and full processing plant including a 3,000 ton per day ball mill. Project controls existing water rights, with an available local labor force, power grid located at site, a low royalty burden, and strong community relations and support. Team of seasoned mining, metallurgical and exploration executives assembled to assist Silver Hammer as advisors and internal consultants. \"The acquisition of the high-grade silver Shafter complex and permitted mine is a transformational point in Silver Hammer's transition and goal to become North America's next silver producer. Shafter contains an established mineral resource of approximately 10.8 million ounces of silver in the measured and indicated category and an additional inferred silver resource of approximately 6.3 million ounces. To ensure the project is advanced towards the development and production stages, Silver Hammer has attracted key senior level technical geological and mining advisors including previous VP Exploration and VP/COO Mining experts that held executive roles with Hudbay Minerals, Coeur Mining, Silver Standard, Centerra, Mag Silver, Probe Mines, Hecla, and Royal Oak Mines,\" commented Peter A. Ball, President and CEO of Silver Hammer Mining. \"In addition to containing a significant silver resource, the Shafter Project is located in a politically safe jurisdiction in Texas, USA, is located adjacent to a paved highway with significant infrastructure including power grid through the middle of the Project, full control of water rights, a local work force and supportive community.\" Appointment of New Board Member The Company is pleased to announce the appointment of Donald J. Birak as a newly appointed Director of Silver Hammer, replacing Joness Lang, who has stepped down from the Director role but will remain as a strategic advisor to assist the Company in ongoing corporate development initiatives. The Company appreciates Mr. Lang's significant contribution to the Company since its inception and agreeing to remain with the Company as a strategic advisor during this exciting phase of growth for the Company. Mr. Birak joined the Company as a senior technical advisor earlier in 2023, and brings more than 45 years of experience in mineral exploration and operations, including the roles of Senior Vice-President of Exploration with Coeur Mining (2004 to 2013) responsible for global Greenfields and Brownfields exploration, Vice President of Exploration for AngloGold North America (1998 to 2004), Independence Mining Company (1995 to 1998), and Hudson Bay Mining & Smelting Ltd. (1992 to 1995) and Chief Geologist & Exploration Geologist for Freeport-McMoRan Gold Company (1978 to 1991), Mr. Birak brings a wealth of knowledge and expertise to the Silver Hammer team, and specifically to the advancement of the Shafter Silver Project. Newly Formed Executive Technical Team and Strategic Advisors Silver Hammer has recently assembled a highly experience technical team to complete due diligence to fully evaluate and to assist in advancing the Shafter Project through an accelerated strategy to complete a mineral resource expansion, initiate mine development towards future production by 2027. The team is made up of the following seasoned executives: Lawrence Roulston, Director - 40+ years in project evaluation and experience mining executive. Currently President and CEO of MTB Metals Corp. and Chairman of Metalla Royalties. Ron Burk, Director - 40+ years in senior level precious metals exploration roles including VP Exploration for Silver Standard and Centerra. Silver Standard previously owned the Shafter deposit until 2008. Don Birak, newly appointed Director - 45+ years in senior level precious metals exploration roles including Sr. VP Exploration for Coeur Mining, and VP Exploration for AngloGold North America and Hudson Bay Mining Smelting. Dr. Peter Megaw, Geological Advisor - 45+ years in senior level precious metals exploration roles and recognized Carbonate Replacement Deposit (\"CRD\") systems. A co-founder of MAG Silver. Dr. Megaw's PhD work focused on the Santa Eulalia Ag-Pb-Zn District in Mexico, and he is credited with numerous discoveries in Mexico including Platosa (Excellon), Juanicipio-Fresnillo (Fresnillo/MAG Silver), and Pozo-Seco/Cinco de Mayo (MAG Silver). Damir Cukor, Geological Advisor - 35+ years in resource development, project management, resource modelling and advisory roles. Michael Willett, Mining Advisor - Seasoned mining executive with 35+ years in mine engineering, development, and operations including senior level project evaluation and advisory roles for project re-starts with various mining companies across North America. Most recently Mr. Willett held the position of Vice President of Operations and Projects for Battle North Gold and was part of that team which successfully sold the company to Evolution Mining for $343 Million in 2021. Adrian McNutt, Mining and Metallurgical Advisor - Experienced mining executive and metallurgical consultant with 35+ years in the evaluation and precious metals operations across the Americas including executive positions as COO of Royal Oak Mines, and Century Mining. Mike Petrina, P. Eng, Mining Advisor - 35+ years in the mining sector including senior level executive roles of VP Mining MAG Silver, VP Operations Probe Mining, VP Mining Hawthorne Gold, and multiple mine engineering advisory roles. Mike Gross, Mining Advisor - 45+ years with experience as a mine operator, operations executive and exploration executive in the Americas including VP Mining for Hecla Mining. The Company has engaged Echelon Capital Markets as its financial advisor with respect to the Transaction. The Shafter Project The Shafter silver mine has all material permits in place with extensive surface infrastructure and underground workings including portal/decline and shaft access and a processing facility rated at approximately 1,500 tons per day. The project is located in west Texas and is fully accessible via paved highway from El Paso, Texas. Shafter has estimated measured and indicated resources of 10,803,000 ounces of silver and an inferred resource of 6,315,000 ounces of silver as summarized in Table 1. This estimate has been prepared for Silver Hammer Mining Inc. by RESPEC and is dated effective September 15, 2023 (the \" Updated Mineral Resource Estimate \") and an NI 43-101 Technical Report will be filed on SEDAR+ within 45 days of the date hereof. Table 1: Mineral Resource Table effective September 15, 2023 Estimated Resources* Tons oz/ton Ag Tonnes g/tonne Ag Contained Ag Ounces Measured 97,000 8.95 88,000 306.9 868,000 Indicated 1,055,000 9.42 957,000 323.0 9,935,000 Measured & Indicated 1,152,000 9.38 1,045,000 321.3 10,803,000 Inferred 823,000 7.67 747,000 263.0 6,315,000 *Updated Mineral Resource by RESPEC has effective date of September 15, 2023. The Updated Mineral Resource Estimate is reported by Mr. Michael S. Lindholm, Principal Geologist for RESPEC in short tons. The Updated Mineral Resource Estimate was prepared in accordance with Canadian Institute of Mining, Metallurgy and Petroleum Definition Standards - For Mineral Resources and Mineral Reserves adopted May 10, 2014, and in accordance with National Instrument 43-101 \"Standards of Disclosure for Mineral Projects\" (\" NI43-101 \"). Mineral Resources are comprised of model blocks greater than or equal to the 4.2 oz Ag/ton cutoff. Mineral Resources that are not Mineral Reserves do not have demonstrated economic viability. Mineral Resources potentially amenable to underground mining methods are reported using a silver price of US$23.50/oz, a throughput rate of 800 tons/day, assumed metallurgical recoveries of 84% for Ag, mining costs of US$60/ton mined, processing costs of US$19.88/ton processed, refining costs of US$0.50/oz Ag produced, and general and administrative costs of US$6.94/ton processed. Silver commodity price selected based on analysis of the three-year running average at the end of August 2023. Rounding may result in apparent discrepancies between tons, grade, and contained metal content. The estimate of Mineral Resources may be materially affected by environmental permitting, legal title, taxation, socio-political, marketing or other relevant issues, however, none are apparent at this time. Shafter History: The Shafter district was first discovered in 1880 or 1881, and the Presidio Mining Company was formed in 1881. Silver was produced from the Presidio mine from 1883 to 1926, when the American Metal Co. acquired the Shafter property and continued production (American Metal Co. subsequently merged with Climax Molybdenum Company to form American Metal Climax, Inc. (\"AMAX\"). From 1883 to 1942, when the Presidio mine was closed, total recorded production was 2.307 million tons of ore containing 35.153 million ounces of silver at an average grade of 15.24oz Ag/ton. AMAX, Gold Fields Mining Corporation (\"Gold Fields\"), and Rio Grande Mining Company (\"RGMC\") successively held the Shafter property and conducted extensive exploration programs from 1926 to 1999. Gold Fields identified the northeastern, down-dip extension of the Shafter deposit, extending more than 5,000ft from the deepest development workings in the Presidio mine, through a systematic surface-drilling program. During the 1970s, Gold Fields constructed a 1,052ft deep shaft to access and explore the northeastern extension. Aurcana purchased RGMC and the Shafter property in July 2008 for US$25 million. RGMC is now a wholly owned subsidiary of Aurcana. Aurcana began exploration at Shafter in 2011 and has conducted geophysical surveying, drilling, mapping, and geochemical sampling since that time. Aurcana drilled 65 surface and 101 underground holes from 2011 through October 2013. A total of 1,694 drill holes are included in the resource database for the Shafter Project, of which 1,048 were drilled by AMAX, 403 were drilled by Gold Fields, 88 were drilled by RGMC prior to their acquisition by Aurcana, and 155 holes were drilled by RGMC since their acquisition by Aurcana. These holes include 435 surface core holes, 1,171 underground core holes, and 88 reverse circulation holes. An additional eleven underground core holes were drilled by Aurcana in late 2013 after the database was finalized for use, but before the current resource estimate was completed. Aurcana also drilled five exploration holes in 2017 outside of the current resource area. These 2013 and 2017 holes do not impact the current resource estimate and are not included within the current drill database. Aurcana reopened access into the Presidio mine on June 1, 2012, and production commenced on December 14, 2012, after spending approximately US$50 million including a portal/decline access, mill, and operations modifications. In conjunction with its underground operations, Aurcana began open-pit mining of lower-grade mineralization from the Mina Grande pit at the Presidio mine on April 23, 2012. Mining was discontinued after the plant commissioning and testing phase were complete, due mostly in part to lower silver prices reaching close to US$17/oz and rushed production start-up issues. The mine was put on care and maintenance in December 2013. An estimated US$160 million has been invested in the property since the discovery of the deposit in the late 1800's. Significant opportunity exists regionally noting the geological setting of the Shafter Silver Deposit is on the eastern margin of the Chihuahua Trough, which is host to several world-class CRD (Carbonate Replacement Deposits) including the Santa Eulalia Mine (Grupo Mexico), Cinco de Mayo project (MAG Silver), and the Plomosas Property, a polymetallic deposit (GR Silver Mining). Transaction Details In connection with the Purchase Agreement, the Company will first complete a reorganization (the \" Reorganization \") whereby all of the Company's outstanding shares will be acquired by a newly incorporated company, Silver Hammer Metals Corp. (\" Newco \"), and shareholders of the Company will receive common shares of Newco (\" Newco Shares \") in exchange for their Company shares. Newco will then acquire all of the outstanding shares in the capital of Rio Grande Mining Corporation (\" Rio Grande \"), a subsidiary of Aurcana that owns the assets, property, rights and undertakings of and relating to the Shafter Project (the \" Shafter Acquisition \"). The Reorganization is expected to be implemented by way of a court-approved plan of arrangement under the Business Corporations Act (British Columbia) (the \" Plan of Arrangement \"), which will result in the Company becoming a wholly-owned subsidiary of Newco. Under the Plan of Arrangement, each common share of the Company will be exchanged for one Newco Share and the convertible securities of the Company will become exercisable for securities of Newco on an equivalent basis. The Reorganization is subject to approval of the Supreme Court of British Columbia and the shareholders of Silver Hammer. On closing of the Transaction, in consideration for the shares of Rio Grande, Aurcana will receive a cash payment of US$800,000 (less certain exclusivity fees and prepaid expenses) and 23,000,000 Newco Shares at a deemed price of $0.25 per Newco Share. In addition, upon the completion of the next equity financing completed by Newco following the closing, Aurcana will receive an additional cash payment of US$375,000. Aurcana may also receive additional post-closing payments, payable in cash or shares, subject to the achievement of certain milestones within 48 months of closing of the Shafter Acquisition in the aggregate amount of up to US$3,000,0000, as follows: (a) up to US$1,000,000 will be payable in connection with the first public announcement of a new mineral resource estimate on the Shafter Project which includes measured and indicated mineral resources of at least 18 million ounces, (b) US$1,000,000 will be payable upon the Shafter Project entering commercial production, (c) US$500,000 will be payable if the spot price of silver is equal to or greater than US$30 per ounce for a period of 60 consecutive days, and (d) an additional US$500,000 will be payable if both (b) and (c), above, are met. Newco has also entered into an agreement with noteholders of Rio Grande to settle certain outstanding debt of Rio Grande in connection with the Shafter Acquisition (the \" Debt Settlement \"). Pursuant to the Debt Settlement, Newco will acquire all of the outstanding notes of Rio Grande in the aggregate principal amount of $6,517,662 (the \" Rio Grande Notes \") in consideration for (a) an aggregate of 4,000 debenture units of Newco, each consisting of one $1,000 principal amount secured convertible debenture of Newco, representing $4,000,000 in total (the \" Debentures \"), and 2,000 common share purchase warrants of Newco (the \" Warrants \"), (b) an aggregate of 8,000,000 units of Newco, each consisting of one Newco Share and one-half of a Warrant, and (c) additional securities of Newco on the same terms as the Concurrent Financing (as described below) in settlement of all interest accrued on the Rio Grande Notes from August 31, 2023 to closing. The Debentures will be convertible into Newco Shares at the conversion price of $0.25 per Newco Share and each Warrant will entitle the holder thereof to purchase one Newco Share at the exercise price of $0.33 per Newco Share for a period of 24 months from closing. On closing of the Transaction, Newco and Aurcana will enter into an investor rights agreement (the \" Investor Rights Agreement \") pursuant to which Newco and Aurcana will agree to certain investor rights and restrictions relating to the Newco Shares to be issued to Aurcana pursuant to the Shafter Acquisition. Under the Investor Rights Agreement, Aurcana will have the right to nominate one member of the Board of Directors of Newco, increasing to two directors if at any time Aurcana holds greater than 35% of the outstanding Newco Shares. Aurcana will agree to certain standstill restrictions and to vote its Newco Shares in accordance with recommendations of management and for a period of 24 months. In addition, the Newco Shares issued to Aurcana will be subject to voluntary resale restrictions with 25% of the Newco Shares being locked-up for 4 months from closing, 25% of the Newco Shares being locked-up for 8 months and the remaining 50% of the Newco Shares being locked up for a period of 12 months. In connection with the Shafter Acquisition and pursuant to the terms of the Purchase Agreement, Silver Hammer will arrange a concurrent equity financing for minimum gross proceeds of CAN$3,000,000 (the \" Concurrent Financing \"). The terms of the Concurrent Financing will be disclosed in a subsequent news release once finalized. Completion of the Shafter Acquisition is subject to a number of conditions, including: (i) the receipt of all required approvals of the shareholders of Aurcana and the Company; (ii) the receipt of all necessary regulatory and third party consents, approvals and authorizations, including all necessary stock exchange approvals; (iii) the Completion of the Concurrent Financing for minimum gross proceeds of CAN$3,000,000, (iv) the completion of the Reorganization and the Debt Settlement, (v) conditional approval of the CSE for the listing of the Newco Shares, including the Newco Shares to be issued in connection with the Shafter Acquisition, the Reorganization and the Debt Settlement, and (vi) other standard closing conditions for a transaction of this nature. The Transaction is an arm's length transaction. Upon completion of the Transaction, the Reorganization and the Debt Settlement, Silver Hammer shareholders are expected to own approximately 63% of the Newco Shares on a non-diluted basis (excluding securities to be issued pursuant to the Concurrent Financing). Trading Halt Trading of the Company's common Shares has been halted as a result of the announcement of the proposed Transaction and the Company expects that trading will remain halted pending closing of the Transaction, subject to earlier resumption upon CSE acceptance of the proposed Transaction and the filing of required materials in accordance with the policies of the CSE, if and as applicable. Additional information concerning the proposed Shafter Acquisition, the Reorganization, the Debt Settlement, the Shafter Project, and Newco will be provided in the management proxy circular of the Company to be prepared and delivered to shareholders of Silver Hammer, which will be available in due course under the Company's SEDAR+ profile. Qualified Person All scientific and technical information in this press release has been prepared or reviewed and approved by Damir Cukor, P. Geo, an independent geological consultant of the Company, Linda Dufour, P.Eng, an independent metallurgical consultant of the Company, and Michael S. Lindholm, CPG of RESPEC. Each of Mr. Cukor, Ms. Dufour, and Mr. Lindholm are \"qualified persons\" for the purposes of NI 43-101. Mr. Cukor is the Qualified Person for all technical information in this news release, excluding the Updated Mineral Resource Estimate. About Silver Hammer Mining Corp. Silver Hammer Mining Corp. is a junior resource company focused on advancing past-producing high-grade silver projects in the United States. Silver Hammer controls 100% of the Silver Strand Mine in the Coeur d'Alene Mining District in Idaho, USA, as well both the Eliza Silver Project and the Silverton Silver Mine in Nevada and the Lacy Gold Project in British Columbia, Canada. Silver Hammer's primary focus is defining and developing silver deposits near past-producing mines that have not been adequately tested. The Company's portfolio also provides exposure to copper and gold discoveries. On Behalf of the Board of Silver Hammer Mining Corp. Peter A. Ball President & CEO, Director E: peter@silverhammermining.com For investor relations inquiries, contact: Peter A. Ball President & CEO 778.344.4653 E: investors@silverhammermining.com Forward-Looking Information This press release contains \"forward-looking information\" within the meaning of applicable Canadian securities legislation. Forward-looking information in this press release includes, without limitation, statements relating to the completion of the Shafter Acquisition, the completion of the Concurrent Financing, the completion of the Debt Settlement and the Reorganization. Completion of the Shafter Acquisition, the Reorganization and the Debt Settlement are subject to a number of conditions, as described elsewhere in this news release. There can be no assurance that these transactions will be completed as proposed or at all. These statements are based upon assumptions that are subject to significant risks and uncertainties, including risks regarding the mining industry, commodity prices, market conditions, general economic factors, management's ability to manage and to operate the business, and explore and develop the projects, of the resulting issuer, and the equity markets generally. Because of these risks and uncertainties and as a result of a variety of factors, the actual results, expectations, achievements or performance of each of the Company and Aurcana may differ materially from those anticipated and indicated by these forward-looking statements. Any number of factors could cause actual results to differ materially from these forward-looking statements as well as future results. Although each of the Company believes that the expectations reflected in forward looking statements are reasonable, they can give no assurances that the expectations of any forward-looking statements will prove to be correct. Except as required by law, the Company disclaims any intention and assume no obligation to update or revise any forward-looking statements to reflect actual results, whether as a result of new information, future events, changes in assumptions, changes in factors affecting such forward-looking statements or otherwise. This press release does not constitute an offer to sell or a solicitation of an offer to sell any of the securities in the United States. The securities have not been and will not be registered under the United States Securities Act of 1933, as amended (the \" U.S. Securities Act \") or any state securities laws and may not be offered or sold within the United States or to U.S. Persons unless registered under the U.S. Securities Act and applicable state securities laws or an exemption from such registration is available. NOT FOR DISTRIBUTION TO UNITED STATES NEWSWIRE SERVICES OR FOR RELEASE, PUBLICATION, DISTRIBUTION OR DISSEMINATION, DIRECTLY OR INDIRECTLY, IN WHOLE OR IN PART, IN OR INTO THE UNITED STATES To view the source version of this press release, please visit https://www.newsfilecorp.com/release/182163",
    "primary_commodity": "Ag"
  },
  "articleProject": {
    "gid": 5473,
    "project_name": "Shafter",
    "location": "Texas, United States"
  },
  "articleExchange": "CSE",
  "articleCompanyId": 1725,
  "articleTicker": "HAMR",
  "articleCompanyName": "Silver Hammer Mining Corp ",
  "allOtherCompanyProjects": [
    {
      "company_id": 1725,
      "gid": 4757,
      "project_name": "Silverton",
      "location": "Nevada, United States"
    },
    {
      "company_id": 1725,
      "gid": 2861,
      "project_name": "Silver Strand",
      "location": "Idaho, United States"
    },
    {
      "company_id": 1725,
      "gid": 2862,
      "project_name": "Eliza",
      "location": "Nevada, United States"
    },
    {
      "company_id": 1725,
      "gid": 4908,
      "project_name": "Lacy",
      "location": "British Columbia, Canada"
    }
  ],
  "allOtherCompanyNews": [
    {
      "id": -198106,
      "company_id": 1725,
      "title": "Silver Hammer Announces Closing of Non-Brokered Private Placement of Units",
      "link": "https://app.quotemedia.com/data/downloadFiling?webmasterId=104408&ref=680662baf2842f4d0d6a3813&type=PDFC&formType=002-002-001089-003001&formDescription=News+release&dateFiled=2025-04-21",
      "date": "2025-04-21T08:22:34.000Z",
      "hidden": false
    },
    {
      "id": -198107,
      "company_id": 1725,
      "title": "Silver Hammer Announces Non-Brokered Private Placement",
      "link": "https://app.quotemedia.com/data/downloadFiling?webmasterId=104408&ref=67f92f071d986d122d2351f2&type=PDFC&formType=002-002-001089-003001&formDescription=News+release&dateFiled=2025-04-11",
      "date": "2025-04-11T08:02:31.000Z",
      "hidden": false
    },
    {
      "id": -189385,
      "company_id": 1725,
      "title": "Silver Hammer Completes Debt Settlements",
      "link": "https://app.quotemedia.com/data/downloadFiling?webmasterId=104408&ref=67f55b0fae944c013e658ec1&type=PDFC&formType=002-002-001089-003001&formDescription=News+release&dateFiled=2025-04-08",
      "date": "2025-04-08T17:21:19.000Z",
      "hidden": false
    },
    {
      "id": -198108,
      "company_id": 1725,
      "title": "Silver Hammer Announces Debt Settlements",
      "link": "https://app.quotemedia.com/data/downloadFiling?webmasterId=104408&ref=67ead1e3358bb24b5a36b357&type=PDFC&formType=002-002-001089-003001&formDescription=News+release&dateFiled=2025-03-31",
      "date": "2025-03-31T10:33:23.000Z",
      "hidden": false
    },
    {
      "id": -184481,
      "company_id": 1725,
      "title": "Silver Hammer Announces First Tranche Closing of Non-Brokered Private Placement of Units",
      "link": "https://app.quotemedia.com/data/downloadFiling?webmasterId=104408&ref=6760b616e6351730ef638b74&type=PDFC&formType=002-002-001089-003001&formDescription=News+release&dateFiled=2024-12-16",
      "date": "2024-12-16T23:21:58.000Z",
      "hidden": false
    },
    {
      "id": -184480,
      "company_id": 1725,
      "title": "Silver Hammer Announces Non-Brokered Private Placement of Units",
      "link": "https://app.quotemedia.com/data/downloadFiling?webmasterId=104408&ref=671fe855ae005a1861044ae2&type=PDFC&formType=002-002-001089-003001&formDescription=News+release&dateFiled=2024-10-28",
      "date": "2024-10-28T19:39:01.000Z",
      "hidden": false
    },
    {
      "id": -184478,
      "company_id": 1725,
      "title": "Silver Hammer Completes Debt Settlements",
      "link": "https://app.quotemedia.com/data/downloadFiling?webmasterId=104408&ref=66fc6b207a35b256082598dd&type=PDFC&formType=002-002-001089-003001&formDescription=News+release&dateFiled=2024-10-01",
      "date": "2024-10-01T21:35:28.000Z",
      "hidden": false
    },
    {
      "id": -184479,
      "company_id": 1725,
      "title": "Silver Hammer Provides Update on Current Non-Brokered Private Placement and Announces Debt Settlements",
      "link": "https://app.quotemedia.com/data/downloadFiling?webmasterId=104408&ref=66f1e1fbe29ad904f37db50b&type=PDFC&formType=002-002-001089-003001&formDescription=News+release&dateFiled=2024-09-23",
      "date": "2024-09-23T21:47:39.000Z",
      "hidden": false
    },
    {
      "id": 67307,
      "company_id": 1725,
      "title": "Silver Hammer Announces Non-Brokered Private Placement of Units",
      "link": "https://www.thenewswire.com/press-releases?id=1LPRFXYJE",
      "date": "2024-07-31T20:15:00.000Z",
      "hidden": false
    },
    {
      "id": -184477,
      "company_id": 1725,
      "title": "Silver Hammer Announces Non-Brokered Private Placement",
      "link": "https://app.quotemedia.com/data/downloadFiling?webmasterId=104408&ref=6654fee34e3abb507e5737ec&type=PDFC&formType=002-002-001089-003001&formDescription=News+release&dateFiled=2024-05-27",
      "date": "2024-05-27T21:45:07.000Z",
      "hidden": false
    }
  ]
}