{
  "article": {
    "id": 43619,
    "link": "https://www.thenewswire.com/press-releases?id=1AJ6Fanbz",
    "title": "Nuclear Fuels Stakes Historic Uranium Resource in Shirley Basin, Wyoming",
    "description": "<table style='width:fit-content; border: none;'><tr style='background: none;'><td colspan='10' style='padding: 0; margin: 0; border: none; background: none;' valign='bottom'><a target='_blank' href='https://nuclearfuels.energy/'><img src=\"https://www.thenewswire.com/data/tnw/clients/logos/1BNMFGqyK.png?t=1676484884\" alt=\"Nuclear Fuels Inc.\" /></a></td></tr><tr style='background: none;'><td style='width: 34px; padding: 0; margin: 0; border: none; background: none;' valign='bottom'><a target='_blank' href='https://thenewswire.com/api/apps/tnw/r?i=1BNMFGqyK&amp;m=fac'><img src=\"https://www.thenewswire.com/data/tnw/img/fac.png\" /></a></td><td style='width: 34px; padding: 0; margin: 0; border: none; background: none;' valign='bottom'><a target='_blank' href='https://thenewswire.com/api/apps/tnw/r?i=1BNMFGqyK&amp;m=twi'><img src=\"https://www.thenewswire.com/data/tnw/img/twi.png\" /></a></td><td style='width: 34px; padding: 0; margin: 0; border: none; background: none;' valign='bottom'><a target='_blank' href='https://thenewswire.com/api/apps/tnw/r?i=1BNMFGqyK&amp;m=lin'><img src=\"https://www.thenewswire.com/data/tnw/img/lin.png\" /></a></td><td style='width: 34px; padding: 0; margin: 0; border: none; background: none;' valign='bottom'><a target='_blank' href='https://thenewswire.com/api/apps/tnw/r?i=1BNMFGqyK&amp;m=ins'><img src=\"https://www.thenewswire.com/data/tnw/img/ins.png\" /></a></td><td style='padding: 0; margin: 0; border: none; background: none;'></td></tr></table> \n<p style='text-align:justify; '>\n<span style='font-weight:bold; '>Vancouver, British Columbia – </span><span style='font-weight:bold; '>TheNewswire -</span><span style='font-weight:bold; '> November 6, 2023 – Nuclear Fuels Inc. (CSE:NF) (“Nuclear Fuels” or the “Company”) </span><span style=''>announced today that the Company has expanded its Wyoming uranium holdings with the staking of the Bobcat Uranium Project located in the Shirley Basin. The Bobcat Uranium Project hosts a historic resource of 474,309 lbs. of uranium*.</span>\n</p>\n\n<p style='text-align:justify; '>\n<span style='font-weight:bold; '>Highlights: </span>\n</p>\n\r\n<ul>\r\n<li>\n<p style='text-align:justify; '>\n<span style=''>The Bobcat Uranium Project includes over 1,600 acres of mineral rights covering a mineralized roll front and is open to expansion;</span> \n</p>\n</li><li>\n<p style='text-align:justify; '>\n<span style=''>In the early 1980’s the main Shirley Basin uranium district was credited with 84 million pounds U</span><span style=''> (uranium) in reserves and past production which ceased due to declining uranium price;</span> \n</p>\n</li><li>\n<p style='text-align:justify; '>\n<span style=''>The Shirley Basin is a current focus of In-Situ Recovery (“ISR”) exploration by several uranium exploration companies;</span> \n</p>\n</li><li>\n<p style='text-align:justify; '>\n<span style=''>The Shirley Basin was the site of the first commercial ISR project in the United States;</span> \n</p>\n</li><li>\n<p style='text-align:justify; '>\n<span style=''>The Bobcat project adds to Nuclear Fuels’ project base and adds optionality for the Company in building compliant resources going forward. </span> \n</p>\n</li>\r\n</ul>\r\n \n<p style='text-align:justify; '>\n<span style='font-style:italic; '>*Readers are cautioned that a qualified person has not done sufficient work to classify any of the historical estimates as current mineral resources or mineral reserves as defined by NI 43-101. The Company is not treating the historical estimates as current mineral resources or reserves as defined by NI 43-101. Further compilation of the historic geological and drilling data, resource modelling and additional drilling will be necessary to convert the historic estimates outlined above to NI 43- 101 conforming mineral resources.  The historic resource is based on information from Western Standard (1972).</span>\n</p>\n\n<p style='text-align:justify; '>\n<span style=''>Michael Collins, Chief Executive Officer of Nuclear Fuels stated: “Nuclear Fuels views Wyoming as a key region for successful uranium exploration due to the prolific historic mining and known resources. The Bobcat Uranium Project, identified through proprietary data, helps us achieve our goal to build resources in the State of Wyoming. I also note that drilling at our Kaycee Uranium Project is well underway and progressing ahead of schedule.”</span>\n</p>\n\n<p style='text-align:justify; '>\n<span style=''>To view Wyoming project maps please visit: </span><a href='http://bit.ly/3u6rgo8' target='_blank'><span style=''>bit.ly/3u6rgo8</span></a><span style=''>.</span>\n</p>\n\n<p style='text-align:justify; '>\n<span style='font-weight:bold; '>The Bobcat Uranium Project</span>\n</p>\n\n<p style='text-align:justify; '>\n<span style=''>Located 25 miles south of Casper, Wyoming in Albany County, the Bobcat Project is located in the Shirley Basin. The Shirley Basin was a proven and prolific producer of uranium credited with over 84 million lbs. produced, between 1959 and 1992, from producers including Getty Oil Company, Texaco, Inc., Pathfinder Mines Corporation, Cogema Mining Inc., Although the majority of the district’s production has come from conventional mining, in 1964 the Shirley Basin was home to the first commercial use of the In-Situ Recovery (“ISR”) technique to extract uranium from sandstone-hosted deposits. ISR is now utilized to extract over 60% of all uranium in the world; since the 1990s all uranium mining in Wyoming has used the ISR process. </span>\n</p>\n\n<p style='text-align:justify; '>\n<span style=''>The Bobcat Project was originally explored by Western Resources and joint venture partners in the 1970’s and early 1980’s where it was one of the last uranium projects they continued to hold in the face of low uranium prices.  With our more than 1,600 acres of mineral rights, the Bobcat Project covers a mineralized roll front and is open to expansion.</span>\n</p>\n\n<p style='text-align:justify; '>\n<span style=''>The technical content of this news release has been reviewed and approved by Mark Travis, CPG., a contractor to the Company, and a Qualified Person as defined in National Instrument 43-101.</span>\n</p>\n\n<p style='text-align:justify; '>\n<span style='font-weight:bold; '>About Nuclear Fuels Inc.</span>\n</p>\n\n<p style='text-align:justify; '>\n<span style=''>Nuclear Fuels Inc. (CSE:NF) is committed to aggressive exploration of district-scale In-Situ Recovery (“ISR”) uranium projects in proven and prolific jurisdictions. Focused on its priority Kaycee Project, located in Wyoming’s Powder River Basin, our goal is to advance the project onto a path to production.  enCore Energy Corp. maintains the right to back-in to 51% ownership by paying the Company 2.5X its exploration expenditures and carrying the project to production (recoverable from production).   With existing historic resources through a 33-mile trend, 110+ miles of mapped roll-fronts and 3,800 drill holes, Nuclear Fuels has secured the district under one company’s control for the first time since the early 1980’s. Nuclear Fuels also provides a unique model for development of our other uranium projects and has established a pipeline of future opportunities in known uranium jurisdictions. Our industry leaders work to build America’s uranium resources and provide a domestic fuel for nuclear energy; always on, always available. </span><span style=''>ISR technology extracts uranium in a non-invasive process through the use of groundwater and oxygen, coupled with a proven ion exchange process, to recover the uranium.</span>\n</p>\n\n<p style='text-align:justify; '>\n<a href='' target='_blank'></a><span style='font-weight:bold; '>For</span> <span style='font-weight:bold; '>further</span> <span style='font-weight:bold; '>information:</span>\n</p>\n\n<p style='text-align:justify; '>\n<a href='' target='_blank'></a><span style=''>Michael Collins, Chief Executive Officer </span>\n</p>\n\n<p style='text-align:justify; '>\n<a href='' target='_blank'></a><span style=''>P: 778-763-4670</span>\n</p>\n\n<p style='text-align:justify; '>\n<a href='' target='_blank'></a><span style=''>E: </span><a href='mailto:info@nuclearfuels.energy' target='_blank'><span style=''>info@nuclearfuels.energy</span></a>   \n</p>\n\n<p style='text-align:justify; '>\n<a href='' target='_blank'></a><span style=''>W: </span><a href='http://www.nuclearfuels.energy' target='_blank'><span style=''>www.nuclearfuels.energy</span></a> \n</p>\n\n<p style='text-align:justify; '>\n<span style='font-style:italic; '>The Canadian Securities Exchange has not reviewed this press release and does not accept responsibility for the adequacy or accuracy of this news release.</span>\n</p>\n\n<p style='text-align:justify; '>\n<span style='font-style:italic; '>Certain information in this news release constitutes forward-looking statements under applicable securities laws. Any statements that are contained in this news release that are not statements of historical fact may be deemed to be forward-looking statements. Forward-looking statements are often identified by terms such as “may”, “should”, “anticipate”, “expect”, “potential”, “believe”, “intend” or the negative of these terms and similar expressions. Forward-looking statements in this news release include, but are not limited to, statements relating to planned exploration programs and the results of additional exploration work in seeking to establish mineral resources as defined in NI43-101 on any of our properties. Forward-looking statements necessarily involve known and unknown risks, including, without limitation, risks associated with the completing planned exploration programs and the results of those programs; the ability to access additional capital to fund planned and future operations; regulatory risks including exploration permitting; risks associated with title to our mineral projects; the ability of the company to implement its business strategies; and other risks including risks contained in documents available for review at </span><a href='http://www.sedar.com' target='_blank'><span style='font-style:italic; '>www.sedar.com</span></a><span style='font-style:italic; '> under the Company’s profile. Readers are cautioned not to place undue reliance on forward-looking statements as there can be no assurance that the plans, intentions or expectations upon which they are placed will occur. Such information, although considered reasonable by management at the time of preparation, may prove to be incorrect and actual results may differ materially from those anticipated. Forward-looking statements contained in this news release are expressly qualified by this cautionary statement.</span>\n</p>\n\n\n<p>Copyright (c) 2023 TheNewswire - All rights reserved.</p>\n",
    "search_terms": "Bobcat,Nuclear Fuels Inc.,NF",
    "master_gid": 5686,
    "date": "2023-11-06T12:00:00.000Z",
    "tags": "USA|Wyoming||Uranium|Project Acquisition",
    "image_id": null,
    "hidden": false,
    "company_id": 2582,
    "provider": null,
    "excerpt": " Vancouver, British Columbia –TheNewswire -November 6, 2023 – Nuclear Fuels Inc. (CSE:NF) (“Nuclear Fuels” or the “Company”)announced today that the Company has expanded its Wyoming uranium holdings with the staking of the Bobcat Uranium Project located in the Shirley Basin. The Bobcat Uranium Project hosts a historic resource of 474,309",
    "is_regulatory": false,
    "refined_tags": [
      "Project Acquisition"
    ],
    "ftp_filename": null,
    "company_name": "Nuclear Fuels Inc.",
    "exchange": "CSE",
    "root_ticker": "NF",
    "project_name": "Bobcat",
    "gid": 5686,
    "location": "Wyoming, United States",
    "plan_id": null,
    "description_text": "Vancouver, British Columbia – TheNewswire - November 6, 2023 – Nuclear Fuels Inc. (CSE:NF) (“Nuclear Fuels” or the “Company”) announced today that the Company has expanded its Wyoming uranium holdings with the staking of the Bobcat Uranium Project located in the Shirley Basin. The Bobcat Uranium Project hosts a historic resource of 474,309 lbs. of uranium*. Highlights: The Bobcat Uranium Project includes over 1,600 acres of mineral rights covering a mineralized roll front and is open to expansion; In the early 1980’s the main Shirley Basin uranium district was credited with 84 million pounds U (uranium) in reserves and past production which ceased due to declining uranium price; The Shirley Basin is a current focus of In-Situ Recovery (“ISR”) exploration by several uranium exploration companies; The Shirley Basin was the site of the first commercial ISR project in the United States; The Bobcat project adds to Nuclear Fuels’ project base and adds optionality for the Company in building compliant resources going forward. *Readers are cautioned that a qualified person has not done sufficient work to classify any of the historical estimates as current mineral resources or mineral reserves as defined by NI 43-101. The Company is not treating the historical estimates as current mineral resources or reserves as defined by NI 43-101. Further compilation of the historic geological and drilling data, resource modelling and additional drilling will be necessary to convert the historic estimates outlined above to NI 43- 101 conforming mineral resources.  The historic resource is based on information from Western Standard (1972). Michael Collins, Chief Executive Officer of Nuclear Fuels stated: “Nuclear Fuels views Wyoming as a key region for successful uranium exploration due to the prolific historic mining and known resources. The Bobcat Uranium Project, identified through proprietary data, helps us achieve our goal to build resources in the State of Wyoming. I also note that drilling at our Kaycee Uranium Project is well underway and progressing ahead of schedule.” To view Wyoming project maps please visit: bit.ly/3u6rgo8 . The Bobcat Uranium Project Located 25 miles south of Casper, Wyoming in Albany County, the Bobcat Project is located in the Shirley Basin. The Shirley Basin was a proven and prolific producer of uranium credited with over 84 million lbs. produced, between 1959 and 1992, from producers including Getty Oil Company, Texaco, Inc., Pathfinder Mines Corporation, Cogema Mining Inc., Although the majority of the district’s production has come from conventional mining, in 1964 the Shirley Basin was home to the first commercial use of the In-Situ Recovery (“ISR”) technique to extract uranium from sandstone-hosted deposits. ISR is now utilized to extract over 60% of all uranium in the world; since the 1990s all uranium mining in Wyoming has used the ISR process. The Bobcat Project was originally explored by Western Resources and joint venture partners in the 1970’s and early 1980’s where it was one of the last uranium projects they continued to hold in the face of low uranium prices.  With our more than 1,600 acres of mineral rights, the Bobcat Project covers a mineralized roll front and is open to expansion. The technical content of this news release has been reviewed and approved by Mark Travis, CPG., a contractor to the Company, and a Qualified Person as defined in National Instrument 43-101. About Nuclear Fuels Inc. Nuclear Fuels Inc. (CSE:NF) is committed to aggressive exploration of district-scale In-Situ Recovery (“ISR”) uranium projects in proven and prolific jurisdictions. Focused on its priority Kaycee Project, located in Wyoming’s Powder River Basin, our goal is to advance the project onto a path to production.  enCore Energy Corp. maintains the right to back-in to 51% ownership by paying the Company 2.5X its exploration expenditures and carrying the project to production (recoverable from production).   With existing historic resources through a 33-mile trend, 110+ miles of mapped roll-fronts and 3,800 drill holes, Nuclear Fuels has secured the district under one company’s control for the first time since the early 1980’s. Nuclear Fuels also provides a unique model for development of our other uranium projects and has established a pipeline of future opportunities in known uranium jurisdictions. Our industry leaders work to build America’s uranium resources and provide a domestic fuel for nuclear energy; always on, always available. ISR technology extracts uranium in a non-invasive process through the use of groundwater and oxygen, coupled with a proven ion exchange process, to recover the uranium. For further information: Michael Collins, Chief Executive Officer P: 778-763-4670 E: info@nuclearfuels.energy W: www.nuclearfuels.energy The Canadian Securities Exchange has not reviewed this press release and does not accept responsibility for the adequacy or accuracy of this news release. Certain information in this news release constitutes forward-looking statements under applicable securities laws. Any statements that are contained in this news release that are not statements of historical fact may be deemed to be forward-looking statements. Forward-looking statements are often identified by terms such as “may”, “should”, “anticipate”, “expect”, “potential”, “believe”, “intend” or the negative of these terms and similar expressions. Forward-looking statements in this news release include, but are not limited to, statements relating to planned exploration programs and the results of additional exploration work in seeking to establish mineral resources as defined in NI43-101 on any of our properties. Forward-looking statements necessarily involve known and unknown risks, including, without limitation, risks associated with the completing planned exploration programs and the results of those programs; the ability to access additional capital to fund planned and future operations; regulatory risks including exploration permitting; risks associated with title to our mineral projects; the ability of the company to implement its business strategies; and other risks including risks contained in documents available for review at www.sedar.com under the Company’s profile. Readers are cautioned not to place undue reliance on forward-looking statements as there can be no assurance that the plans, intentions or expectations upon which they are placed will occur. Such information, although considered reasonable by management at the time of preparation, may prove to be incorrect and actual results may differ materially from those anticipated. Forward-looking statements contained in this news release are expressly qualified by this cautionary statement. Copyright (c) 2023 TheNewswire - All rights reserved.",
    "primary_commodity": "U"
  },
  "articleProject": {
    "gid": 5686,
    "project_name": "Bobcat",
    "location": "Wyoming, United States"
  },
  "articleExchange": "CSE",
  "articleCompanyId": 2582,
  "articleTicker": "NF",
  "articleCompanyName": "Nuclear Fuels Inc.",
  "allOtherCompanyProjects": [
    {
      "company_id": 2582,
      "gid": 9951,
      "project_name": "TenSleep",
      "location": "Wyoming, United States"
    },
    {
      "company_id": 2582,
      "gid": 6317,
      "project_name": "Lisbon Valley",
      "location": "Utah, United States"
    },
    {
      "company_id": 2582,
      "gid": 5509,
      "project_name": "Bootheel",
      "location": "Wyoming, United States"
    },
    {
      "company_id": 2582,
      "gid": 5686,
      "project_name": "Bobcat",
      "location": "Wyoming, United States"
    },
    {
      "company_id": 2582,
      "gid": 5506,
      "project_name": "Kaycee",
      "location": "Wyoming, United States"
    },
    {
      "company_id": 2582,
      "gid": 5507,
      "project_name": "Moonshine",
      "location": "Arizona, United States"
    },
    {
      "company_id": 2582,
      "gid": 5508,
      "project_name": "LAB",
      "location": "Newfoundland and Labrador, Canada"
    }
  ],
  "allOtherCompanyNews": [
    {
      "id": 107640,
      "company_id": 2582,
      "title": "Nuclear Fuels Commences 2025 Kaycee Uranium Project Drill Program",
      "link": "https://contentapi.cision.com/api/v1.0/releases/20250611C2680",
      "date": "2025-06-11T11:00:00.000Z",
      "hidden": false
    },
    {
      "id": 107061,
      "company_id": 2582,
      "title": "Premier American Uranium to Acquire Nuclear Fuels, Creating One of America's Largest Pure-Play Uranium Explorers",
      "link": null,
      "date": "2025-06-05T11:00:00.000Z",
      "hidden": false
    },
    {
      "id": 91926,
      "company_id": 2582,
      "title": "Nuclear Fuels Mourns the Passing of Independent Director Eugene Spiering",
      "link": "https://contentapi.cision.com/api/v1.0/releases/20250320C9059",
      "date": "2025-03-20T11:00:00.000Z",
      "hidden": false
    },
    {
      "id": 90128,
      "company_id": 2582,
      "title": "Nuclear Fuels Acquires TenSleep Uranium Project with Athabasca Basin-Style Mineralization in Wyoming's Powder River Basin",
      "link": "https://contentapi.cision.com/api/v1.0/releases/20250303C4965",
      "date": "2025-03-03T12:00:00.000Z",
      "hidden": false
    },
    {
      "id": 85637,
      "company_id": 2582,
      "title": "Nuclear Fuels Announces the Discovery of New Mineralized Zones at the Kaycee Uranium Project",
      "link": "https://contentapi.cision.com/api/v1.0/releases/20250129VA06855",
      "date": "2025-01-29T12:00:00.000Z",
      "hidden": false
    },
    {
      "id": 79461,
      "company_id": 2582,
      "title": "NUCLEAR FUELS ANNOUNCES COMPLETION OF $13.9 MILLION BOUGHT DEAL OFFERING AND NON-BROKERED PRIVATE PLACEMENT WITH ENCORE ENERGY CORP AND STRATEGIC INVESTORS",
      "link": "https://contentapi.cision.com/api/v1.0/releases/20241120C5319",
      "date": "2024-11-20T13:49:00.000Z",
      "hidden": false
    },
    {
      "id": 103054,
      "company_id": 2582,
      "title": "Nuclear Fuels Inc. to Attend the 50th Annual New Orleans Investment Conference",
      "link": "https://app.quotemedia.com/data/downloadFiling?webmasterId=104408&ref=673cde727e8ceb72807b1f21&type=PDFC&formType=002-002-001089-003001&formDescription=News+release&dateFiled=2024-11-19",
      "date": "2024-11-19T10:52:34.000Z",
      "hidden": false
    },
    {
      "id": 77757,
      "company_id": 2582,
      "title": "NUCLEAR FUELS ANNOUNCES ADDITIONAL NON-BROKERED PRIVATE PLACEMENT WITH ENCORE ENERGY CORP AND STRATEGIC INVESTORS",
      "link": "https://contentapi.cision.com/api/v1.0/releases/20241105C9500",
      "date": "2024-11-05T12:00:00.000Z",
      "hidden": false
    },
    {
      "id": -151110,
      "company_id": 2582,
      "title": "Canadian Investment Regulatory Organization Trading Halt - NF",
      "link": "https://contentapi.cision.com/api/v1.0/releases/20241030C7158",
      "date": "2024-10-30T20:20:00.000Z",
      "hidden": false
    },
    {
      "id": -151109,
      "company_id": 2582,
      "title": "Canadian Investment Regulatory Organization Trade Resumption - NF",
      "link": "https://contentapi.cision.com/api/v1.0/releases/20241030C8120",
      "date": "2024-10-30T20:20:00.000Z",
      "hidden": false
    }
  ]
}
