{
  "article": {
    "id": 47201,
    "link": "https://www.accesswire.com/viewarticle.aspx?id=824657&lang=en",
    "title": "Relevant Gold Buys Out Option Completing Acquisition of 700 Leased Hectares at its Flagship Golden Buffalo Project",
    "description": "<p><strong>VANCOUVER, BC / ACCESSWIRE / January 15, 2024</strong> / <strong>Relevant Gold Corp. (TSXV:RGC)(OTCQB:RGCCF)</strong> (&quot;<strong>Relevant Gold</strong>&quot; or the &quot;<strong>Company</strong>&quot;) is pleased to announce the Company has entered into a Purchase Agreement (the &quot;Agreement&quot;) with Golden Buffalo Mining Company (&quot;GBMC&quot;) to complete the acquisition of 88 BLM mining claims (700 ha) (the &quot;Subject Property&quot;) in the core of the Company's 3,766 hectare Golden Buffalo property in the South Pass Gold Field, Wyoming, USA. The Subject Property was previously held under a lease with option to purchase agreement (&quot;Lease Option&quot;) with GBMC. Pursuant to the Agreement, GBMC will receive (i) 1,500,000 common shares of the Company, (ii) up to three potential milestone payments more particularly described below, and (iii) a 3% net smelter return (NSR) royalty on the Subject Property.</p><p>Pursuant to the success-based milestone payments, GBMC will receive (a) a US$1,000,000 cash payment and 500,000 common shares of the Company upon the completion of a NI 43-101 compliant mineral resource estimate exceeding one million ounces of gold on the Subject Property, (b) a US$1,000,000 cash payment upon filing by the Company of a NI 43-101 compliant Feasibility Study for the Subject Property; and (c) a US$9,000,000 cash payment upon the commencement of commercial production of the Subject Property or any portion thereof.</p><p>The Purchase Agreement eliminates the four remaining US$300,000 annual lease payments and replaces the US$15,000,000 purchase price specified in the original Lease Option by issuing 1,500,000 common shares of the Company. Milestone payments are success-based and paid upon achieving each milestone. The NSR remains unchanged from the original Lease Option. 2% of the NSR can be repurchased for US$5,000,000.</p><p><i>&quot;This agreement represents a big win for Relevant Gold in both the short and long-term, allowing us to minimize our burn rate and safeguarding our flagship Golden Buffalo asset. The restructuring moves $16.2M of calendar-triggered payments to success-based milestones,&quot; said Relevant Gold CEO Rob Bergmann. &quot;As a bonus, we get to bring two incredible operators onto the team, both of whom are now entirely aligned with the Company's goals, and who will greatly strengthen our connection to local communities and day-to-day operations.&quot;</i></p><p>The 3,766 hectare Golden Buffalo property is one of the Company's two flagship assets and has returned rock chip assays from trenching highlighted by <strong>168 g/t Au, </strong>followed up in 2022 by a top drilling intercept of<strong> 83.8 g/t Au over 1 metre</strong> in the first ever drilling program where <strong>54% of drill holes</strong> from the 3,500 metre program intersected shear-hosted gold mineralization (see <a href=\"https://pr.report/eaIl4XMz\">Feb. 06, 2023 Press Release</a>).</p><p><strong><u>Technical Team Appointments</u></strong></p><p>In addition to the Agreement, the Company is excited to announce the principals at GBMC will be joining the Relevant Gold team and fill two critical roles: (i) Jerome Hutchison will serve as Communities Advisor and Site Manager and, (ii) Jacob Tyra will serve as Operations Manager. As part of the service agreement, Mr. Hutchison and Mr. Tyra will each be issued 150,000 common share options at an exercise price of $0.20. These options will vest over 12 months and expire on January 09, 2027.</p><p><strong>Jerome Hutchison - Community Advisor and Site Manager</strong></p><p>Mr. Hutchison was born and raised in Riverton, Wyo., and has lived, worked, and established businesses in Riverton and around the state. He formed a start-up company and grew it to an independent franchise with four storefronts throughout the state. Mr. Hutchison is active in the community, serving on multiple homeowner's boards, church boards, athletic boards, and city committees. He started GBMC in 2019 with the acquisition of a gold-rich property in South Pass. His business and community affairs have brought reputable relationships and he's a respected member of the community.</p><p><strong>Jacob Tyra - Operations Manager</strong></p><p>Born and raised in Wyoming, Mr. Tyra has more than 25 years of experience in the hard rock mining industry. He got his start in uranium mining outside of Jeffery City, Wyo., and later worked on mining projects in Nevada, New Mexico, Idaho, Montana, Wyoming, and Alaska where he worked as Superintendent at the Pogo Mine. Mr. Tyra has extensive supervisory, management, and safety training experience. He holds an MSHA blue card certification, an explosives permit, and was a captain in mine rescue teams.</p><p><strong><u>About Relevant Gold Corp.</u></strong></p><p>Relevant Gold Corp. is a North American gold exploration company focused on the acquisition, exploration, discovery, and development of district-scale gold projects in the state of Wyoming - one of the most mining-friendly jurisdictions in the United States and globally. Founded by experienced exploration geologists, Relevant Gold is managed by a highly respected team with a proven record of significant value creation for shareholders.</p><p>On behalf of Relevant Gold Corp.,</p><p>Rob Bergmann, Chief Executive Officer</p><p><strong><u>More information</u></strong></p><p><strong>Neither TSX Venture Exchange nor its Regulation Services Provider accepts responsibility for the adequacy or accuracy of this release.</strong></p><p>For further information about Relevant Gold Corp. or this news release, please visit our website at <a href=\"https://pr.report/xLnb0DpQ\">www.relevantgoldcorp.com</a> or contact Rob Bergmann, President and CEO, or Kristopher Jensen, Manager of Investor Relations, at 763-760-4886 or by email at <a href=\"mailto:ir@relevantgoldcorp.com\">ir@relevantgoldcorp.com</a>.</p><p><strong>Cautionary Note Regarding Forward-Looking Statements</strong></p><p>This news release contains certain statements that constitute forward-looking information within the meaning of applicable securities laws. These statements relate to future events of Relevant Gold Corp. (&quot;Relevant&quot; or &quot;Relevant Gold&quot; or &quot;the Company&quot;). Any statements that express or involve discussions with respect to predictions, expectations, beliefs, plans, projections, objectives, assumptions or future events or performance (often, but not always, using words or phrases such as &quot;seek&quot;, &quot;anticipate&quot;, &quot;plan&quot;, &quot;continue&quot;, &quot;estimate&quot;, &quot;expect&quot;, &quot;forecast&quot;, &quot;may&quot;, &quot;will&quot;, &quot;project&quot;, &quot;predict&quot;, &quot;potential&quot;, &quot;targeting&quot;, &quot;intend&quot;, &quot;could&quot;, &quot;might&quot;, &quot;should&quot;, &quot;believe&quot;, &quot;outlook&quot; and similar expressions) are not statements of historical fact and may be forward-looking information. Forward-looking information involves known and unknown risks, uncertainties, and other factors which may cause the actual results, performance, or achievements of the Company to be materially different from any future results, performance, or achievements expressed or implied by the forward-looking information. Such risks include, among others, the inherent risk of the mining industry; adverse economic and market developments; the risk that the Company will not be successful in completing additional acquisitions; risks relating to the estimation of mineral resources; the possibility that the Company's estimated burn rate may be higher than anticipated; risks of unexpected cost increases; risks of labour shortages; risks relating to exploration and development activities; risks relating to future prices of mineral resources; risks related to work site accidents, risks related to geological uncertainties and variations; risks related to government and community support of the company's projects; risks related to global pandemics and other risks related to the mining industry. The Company believes that the expectations reflected in such forward-looking information are reasonable, but no assurance can be given that these expectations will prove to be correct and such forward窶人ooking information should not be unduly relied upon. These statements speak only as of the date of this news release. The Company does not intend, and does not assume any obligation, to update any forward窶人ooking information except as required by law.</p><p>The scientific and technical contents of this release have been approved by Mr. Brian C. Lentz, CPG #11999, Chief Exploration Officer of the Company, who is a &quot;Qualified Person&quot; as defined by Canadian National Instrument 43-101 (Standards of Disclosure for Mineral Projects). Mr. Lentz is not independent of the Company.</p><p><strong>SOURCE: </strong>Relevant Gold Corp.</p><br><br>View the original <a href='https://www.accesswire.com/824657/relevant-gold-buys-out-option-completing-acquisition-of-700-leased-hectares-at-its-flagship-golden-buffalo-project'>press release</a> on accesswire.com<br><br>",
    "search_terms": "Golden Buffalo,Relevant Gold Corp.,RGC",
    "master_gid": 4001,
    "date": "2024-01-15T11:30:00.000Z",
    "tags": "USA|Wyoming||Gold|Project Acquisition",
    "image_id": null,
    "hidden": false,
    "company_id": 2123,
    "provider": "accesswire",
    "excerpt": "VANCOUVER, BC / ACCESSWIRE / January 15, 2024/Relevant Gold Corp. (TSXV:RGC)(OTCQB:RGCCF)(&quot;Relevant Gold&quot; or the &quot;Company&quot;) is pleased to announce the Company has entered into a Purchase Agreement (the &quot;Agreement&quot;) with Golden Buffalo Mining Company (&quot;GBMC&quot;) to complete the acquisition of 88 BLM mining claims (700 ha) (the &quot;Subject Property&quot;) in",
    "is_regulatory": false,
    "refined_tags": [
      "Project Acquisition"
    ],
    "ftp_filename": null,
    "company_name": "Relevant Gold Corp.",
    "exchange": "TSXV",
    "root_ticker": "RGC",
    "project_name": "Golden Buffalo",
    "gid": 4001,
    "location": "Wyoming, United States",
    "plan_id": null,
    "description_text": "VANCOUVER, BC / ACCESSWIRE / January 15, 2024 / Relevant Gold Corp. (TSXV:RGC)(OTCQB:RGCCF) (\" Relevant Gold \" or the \" Company \") is pleased to announce the Company has entered into a Purchase Agreement (the \"Agreement\") with Golden Buffalo Mining Company (\"GBMC\") to complete the acquisition of 88 BLM mining claims (700 ha) (the \"Subject Property\") in the core of the Company's 3,766 hectare Golden Buffalo property in the South Pass Gold Field, Wyoming, USA. The Subject Property was previously held under a lease with option to purchase agreement (\"Lease Option\") with GBMC. Pursuant to the Agreement, GBMC will receive (i) 1,500,000 common shares of the Company, (ii) up to three potential milestone payments more particularly described below, and (iii) a 3% net smelter return (NSR) royalty on the Subject Property. Pursuant to the success-based milestone payments, GBMC will receive (a) a US$1,000,000 cash payment and 500,000 common shares of the Company upon the completion of a NI 43-101 compliant mineral resource estimate exceeding one million ounces of gold on the Subject Property, (b) a US$1,000,000 cash payment upon filing by the Company of a NI 43-101 compliant Feasibility Study for the Subject Property; and (c) a US$9,000,000 cash payment upon the commencement of commercial production of the Subject Property or any portion thereof. The Purchase Agreement eliminates the four remaining US$300,000 annual lease payments and replaces the US$15,000,000 purchase price specified in the original Lease Option by issuing 1,500,000 common shares of the Company. Milestone payments are success-based and paid upon achieving each milestone. The NSR remains unchanged from the original Lease Option. 2% of the NSR can be repurchased for US$5,000,000. \"This agreement represents a big win for Relevant Gold in both the short and long-term, allowing us to minimize our burn rate and safeguarding our flagship Golden Buffalo asset. The restructuring moves $16.2M of calendar-triggered payments to success-based milestones,\" said Relevant Gold CEO Rob Bergmann. \"As a bonus, we get to bring two incredible operators onto the team, both of whom are now entirely aligned with the Company's goals, and who will greatly strengthen our connection to local communities and day-to-day operations.\" The 3,766 hectare Golden Buffalo property is one of the Company's two flagship assets and has returned rock chip assays from trenching highlighted by 168 g/t Au, followed up in 2022 by a top drilling intercept of 83.8 g/t Au over 1 metre in the first ever drilling program where 54% of drill holes from the 3,500 metre program intersected shear-hosted gold mineralization (see Feb. 06, 2023 Press Release ). Technical Team Appointments In addition to the Agreement, the Company is excited to announce the principals at GBMC will be joining the Relevant Gold team and fill two critical roles: (i) Jerome Hutchison will serve as Communities Advisor and Site Manager and, (ii) Jacob Tyra will serve as Operations Manager. As part of the service agreement, Mr. Hutchison and Mr. Tyra will each be issued 150,000 common share options at an exercise price of $0.20. These options will vest over 12 months and expire on January 09, 2027. Jerome Hutchison - Community Advisor and Site Manager Mr. Hutchison was born and raised in Riverton, Wyo., and has lived, worked, and established businesses in Riverton and around the state. He formed a start-up company and grew it to an independent franchise with four storefronts throughout the state. Mr. Hutchison is active in the community, serving on multiple homeowner's boards, church boards, athletic boards, and city committees. He started GBMC in 2019 with the acquisition of a gold-rich property in South Pass. His business and community affairs have brought reputable relationships and he's a respected member of the community. Jacob Tyra - Operations Manager Born and raised in Wyoming, Mr. Tyra has more than 25 years of experience in the hard rock mining industry. He got his start in uranium mining outside of Jeffery City, Wyo., and later worked on mining projects in Nevada, New Mexico, Idaho, Montana, Wyoming, and Alaska where he worked as Superintendent at the Pogo Mine. Mr. Tyra has extensive supervisory, management, and safety training experience. He holds an MSHA blue card certification, an explosives permit, and was a captain in mine rescue teams. About Relevant Gold Corp. Relevant Gold Corp. is a North American gold exploration company focused on the acquisition, exploration, discovery, and development of district-scale gold projects in the state of Wyoming - one of the most mining-friendly jurisdictions in the United States and globally. Founded by experienced exploration geologists, Relevant Gold is managed by a highly respected team with a proven record of significant value creation for shareholders. On behalf of Relevant Gold Corp., Rob Bergmann, Chief Executive Officer More information Neither TSX Venture Exchange nor its Regulation Services Provider accepts responsibility for the adequacy or accuracy of this release. For further information about Relevant Gold Corp. or this news release, please visit our website at www.relevantgoldcorp.com or contact Rob Bergmann, President and CEO, or Kristopher Jensen, Manager of Investor Relations, at 763-760-4886 or by email at ir@relevantgoldcorp.com . Cautionary Note Regarding Forward-Looking Statements This news release contains certain statements that constitute forward-looking information within the meaning of applicable securities laws. These statements relate to future events of Relevant Gold Corp. (\"Relevant\" or \"Relevant Gold\" or \"the Company\"). Any statements that express or involve discussions with respect to predictions, expectations, beliefs, plans, projections, objectives, assumptions or future events or performance (often, but not always, using words or phrases such as \"seek\", \"anticipate\", \"plan\", \"continue\", \"estimate\", \"expect\", \"forecast\", \"may\", \"will\", \"project\", \"predict\", \"potential\", \"targeting\", \"intend\", \"could\", \"might\", \"should\", \"believe\", \"outlook\" and similar expressions) are not statements of historical fact and may be forward-looking information. Forward-looking information involves known and unknown risks, uncertainties, and other factors which may cause the actual results, performance, or achievements of the Company to be materially different from any future results, performance, or achievements expressed or implied by the forward-looking information. Such risks include, among others, the inherent risk of the mining industry; adverse economic and market developments; the risk that the Company will not be successful in completing additional acquisitions; risks relating to the estimation of mineral resources; the possibility that the Company's estimated burn rate may be higher than anticipated; risks of unexpected cost increases; risks of labour shortages; risks relating to exploration and development activities; risks relating to future prices of mineral resources; risks related to work site accidents, risks related to geological uncertainties and variations; risks related to government and community support of the company's projects; risks related to global pandemics and other risks related to the mining industry. The Company believes that the expectations reflected in such forward-looking information are reasonable, but no assurance can be given that these expectations will prove to be correct and such forward窶人ooking information should not be unduly relied upon. These statements speak only as of the date of this news release. The Company does not intend, and does not assume any obligation, to update any forward窶人ooking information except as required by law. The scientific and technical contents of this release have been approved by Mr. Brian C. Lentz, CPG #11999, Chief Exploration Officer of the Company, who is a \"Qualified Person\" as defined by Canadian National Instrument 43-101 (Standards of Disclosure for Mineral Projects). Mr. Lentz is not independent of the Company. SOURCE: Relevant Gold Corp. View the original press release on accesswire.com",
    "primary_commodity": "Au"
  },
  "articleProject": {
    "gid": 4001,
    "project_name": "Golden Buffalo",
    "location": "Wyoming, United States"
  },
  "articleExchange": "TSXV",
  "articleCompanyId": 2123,
  "articleTicker": "RGC",
  "articleCompanyName": "Relevant Gold Corp.",
  "allOtherCompanyProjects": [
    {
      "company_id": 2123,
      "gid": 5697,
      "project_name": "Bradley Peak",
      "location": "Wyoming, United States"
    },
    {
      "company_id": 2123,
      "gid": 4001,
      "project_name": "Golden Buffalo",
      "location": "Wyoming, United States"
    },
    {
      "company_id": 2123,
      "gid": 4003,
      "project_name": "Lewiston",
      "location": "Wyoming, United States"
    },
    {
      "company_id": 2123,
      "gid": 4004,
      "project_name": "Windy Flats",
      "location": "Wyoming, United States"
    },
    {
      "company_id": 2123,
      "gid": 4005,
      "project_name": "Shield-Carissa",
      "location": "Wyoming, United States"
    }
  ],
  "allOtherCompanyNews": [
    {
      "id": 107633,
      "company_id": 2123,
      "title": "Relevant Gold Permitted and Ready to Drill Bradley Peak",
      "link": null,
      "date": "2025-06-11T10:30:00.000Z",
      "hidden": false
    },
    {
      "id": 91056,
      "company_id": 2123,
      "title": "Relevant Gold Closes Second Tranche of Upsized $8.5 Million Non-Brokered Private Placement Led by Strategic Investors Kinross and Bollinger",
      "link": null,
      "date": "2025-03-13T20:30:00.000Z",
      "hidden": false
    },
    {
      "id": 89718,
      "company_id": 2123,
      "title": "Relevant Gold Closes First Tranche of Upsized $8.5 Million Non-Brokered Private Placement Led by Strategic Investors Kinross and Bollinger",
      "link": "https://www.accessnewswire.com/newsroom/en/metals-and-mining/relevant-gold-closes-first-tranche-of-upsized-85-million-non-brokered-private-plac-993797",
      "date": "2025-02-28T21:30:00.000Z",
      "hidden": false
    },
    {
      "id": 88743,
      "company_id": 2123,
      "title": "Relevant Gold Upsizes Private Placement to $7M",
      "link": "https://www.accessnewswire.com/newsroom/en/metals-and-mining/relevant-gold-upsizes-private-placement-to-7m-988876",
      "date": "2025-02-21T11:30:00.000Z",
      "hidden": false
    },
    {
      "id": 87414,
      "company_id": 2123,
      "title": "Relevant Gold Announces Non-Brokered $5M Private Placement Led By Strategic Investors Kinross and Bollinger",
      "link": "https://www.accessnewswire.com/newsroom/en/metals-and-mining/relevant-gold-announces-non-brokered-5m-private-placement-led-by-strategic-investo-982914",
      "date": "2025-02-11T11:30:00.000Z",
      "hidden": false
    },
    {
      "id": 86234,
      "company_id": 2123,
      "title": "Relevant Gold Reflects on Milestone Year in 2024 and looks to 2025",
      "link": "https://www.accessnewswire.com/newsroom/en/metals-and-mining/relevant-gold-reflects-on-milestone-year-in-2024-and-looks-to-2025-974649",
      "date": "2025-01-30T21:30:00.000Z",
      "hidden": false
    },
    {
      "id": 82307,
      "company_id": 2123,
      "title": "Relevant Gold Intersects Gold Mineralization in All Six Holes at Burr",
      "link": "https://www.accesswire.com/956579/relevant-gold-intersects-gold-mineralization-in-all-six-holes-at-burr",
      "date": "2024-12-18T11:30:00.000Z",
      "hidden": false
    },
    {
      "id": 72640,
      "company_id": 2123,
      "title": "Relevant Gold Defines Large-Scale Drilling Target at Bradley Peak, Sampling 46.8 g/t Au, 7.8% Cu and 2% Zn in Apex Zone",
      "link": "https://www.accesswire.com/viewarticle.aspx?id=923529&lang=en",
      "date": "2024-09-26T10:30:00.000Z",
      "hidden": false
    },
    {
      "id": 71216,
      "company_id": 2123,
      "title": "Relevant Gold Receives Exploration Permit and Commences Drilling at the Burr Target",
      "link": "https://www.accesswire.com/viewarticle.aspx?id=916753&lang=en",
      "date": "2024-09-12T13:25:00.000Z",
      "hidden": false
    },
    {
      "id": 69719,
      "company_id": 2123,
      "title": "Relevant Gold Doubles its Land Position at the Bradley Peak Gold Camp",
      "link": "https://www.accesswire.com/viewarticle.aspx?id=909421&lang=en",
      "date": "2024-08-29T10:30:00.000Z",
      "hidden": false
    }
  ]
}
