{
  "article": {
    "id": 82182,
    "link": "https://www.accesswire.com/956047/granite-creek-copper-incorporates-geologic-hydrogen-subsidiary-options-union-bay-project-and-appoints-allegra-hosford-scheirer-to-lead-advisory-board",
    "title": "Granite Creek Copper Incorporates Geologic Hydrogen Subsidiary, Options Union Bay Project and Appoints Allegra Hosford Scheirer to Lead Advisory Board",
    "description": "<p><strong id=\"dateline\">VANCOUVER, BC / ACCESSWIRE / December 17, 2024 / </strong><strong>Granite Creek Copper Ltd. (TSXV:GCX)(OTCQB:GCXXF) (&quot;Granite Creek&quot; or the &quot;Company&quot;)</strong> is pleased to announce that it has incorporated Element One Hydrogen Ltd as a wholly owned subsidiary to further advance the exploration for geologic hydrogen. The Company is currently completing research in several jurisdictions in North America for possible acquisitions of projects prospective for both stimulated hydrogen from ultramafic rocks and for discovery of accumulations of hydrogen in the subsurface from various sources.</p><figure class=\"image image_resized\" style=\"width:100%;text-align:center;margin:0.9em auto\" width=\"100%\"><img style=\"aspect-ratio:438/129;\" src=\"https://www.accesswire.com/imagelibrary/5aefdb55-7620-497d-84df-f47a175ef6dc/956047/picture1.png\" width=\"100%\" /></figure><div style=\"clear: both\"> </div><p>The Company further announces that it has entered into an agreement dated December 16, 2024 (the Option Agreement&quot;) granting 1508260 B.C. Ltd the option to acquire an 100% interest in the recently staked Union Bay hydrogen project (&quot;Union Bay&quot; or the &quot;Project&quot;) located in Southeast Alaska. Union Bay is a classic &quot;Ural-Alaska type&quot; underlain by a zoned ultramafic-mafic complex, which ranges from dunite through wehrlite and magnetite-bearing olivine clinopyroxenite to hornblendite and gabbro on the margins. Exploration work completed on the project by previous owners included geological mapping and sampling, geophysical surveys and drilling which identified several high-grade platinum target areas. Research has shown that the olivine component in various ultramafic lithologies such as dunite and wehrlite may be conducive to production of hydrogen by interaction of water at depth.</p><p><strong>About Allegra Hosford Scheirer</strong></p><figure class=\"image\" style=\"text-align:center;margin:0.9em auto;\" width=\"100%\"><img style=\"aspect-ratio:127/138;\" src=\"https://www.accesswire.com/imagelibrary/0b54be7d-d2e2-420e-b89e-b38edcf23ca7/956047/picture2.jpg\" width=\"100%\" /></figure><div style=\"clear: both\"> </div><p>Granite Creek is very pleased to announce that the Company's continued geologic hydrogen exploration activities will be led by Allegra Hosford Scheirer, whom has been appointed to the company's Advisory Board. Allegra is in interdisciplinary geoscientist specializing in rock-fluid networks such as geologic hydrogen, oil and gas, and geothermal systems. She deploys basin and petroleum system modeling, resource assessment, big data and machine learning, and acquisition and processing of field data. Her work experience spans government, academic, and industry sectors. Allegra is an independent, non-executive director of Pantheon Resources, an oil and gas company that explores on the North Slope of Alaska. Her degrees are from Brown University (B.S.) and MIT (PhD).</p><p>The Company anticipates additional additions to its geologic hydrogen team, under the auspices of Element One Hydrogen, in the coming weeks.</p><p>Tim Johnson CEO of Granite Creek stated, &quot;The search for hydrogen accumulations is the subsurface is a rapidly growing branch of resource development. The opportunities present in this burgeoning field are unparalleled in the resource extraction industry. We are pleased to be entering this field and hope to be announcing additional acquisitions in the near future&quot;.</p><p><strong>Terms of the Option Agreement</strong></p><p>Pursuant to the Option Agreement, 1508260 B.C. Ltd may acquire a 100% undivided interest in the Union Bay project, subject to a 2% Gross Overriding Royalty (GORR) by:</p><p>All values unless specifically stated are in Canadian dollars.</p><div><p>1. making aggregate cash payments of US$175,000 to Granite as follows:</p></div><div><ul style=\"list-style-type:disc;\"><li><p>US$50,000 on signing (the &quot;Effective Date&quot;);</p></li><li><p>US$50,000 on or before the first anniversary of the Effective Date; and</p></li><li><p>US$75,000 on or before the second anniversary of the Effective Date; and</p></li></ul></div><div><p>2. incurring aggregate of $1,200,000 in expenditures on the Property as follows:</p><ul style=\"list-style-type:disc;\"><li><p>$200,000 on or before the first anniversary of the Effective Date; and</p></li><li><p>an additional $400,000 on or before the second anniversary of the Effective Date; and</p></li><li><p>an additional $600,000 on or before the third anniversary of the of the Effective Date; and</p></li></ul><p>3. issuing to Granite an aggregate of 2,750,000 shares as follows:</p></div><ul style=\"list-style-type:disc;\"><li><p>200,000 shares on the Effective Date and;</p></li><li><p>300,000 shares on or before the date which the Optionee is acquired by, or merges with an Optionee Acquireco <sup>1</sup>, but no later than four months following the Effective Date and;</p></li><li><p>1,000,000 shares on or before the first anniversary of the Effective Date and;</p></li><li><p>1,250,000 on or before the second anniversary of the Effective Date</p></li></ul><p>Upon completion of all payments, work and share issuance the Option will be deemed to be exercised, and the Property will automatically vest to 1508260 B.C. Ltd subject to a 2% GOR to be granted by 1508260 B.C. Ltd in favor of Granite Creek of which one half (being 1%) may be purchased by 1508260 B.C. Ltd for $1,500,000 within 30 days of commercial production.</p><p><sup>1</sup>1508260 B.C. Ltd has informed the Company of its intent to complete a go public transaction by way of a reverse take over, merger or other method in the coming months.</p><p><strong>About Granite Creek Copper</strong></p><p>Granite Creek Copper is a focused on the exploration and development of critical minerals projects in North America and more recently on geologic hydrogen. The Company's projects consist of its flagship 177 square kilometer Carmacks project in the Minto copper district of Canada's Yukon Territory on trend with the formerly operating, high-grade Minto copper-gold mine and the advanced stage LS molybdenum project and the Star copper-nickel-PGM plus geological hydrogen project, both located in central British Columbia. Recent acquisitions include the Union Bay geologic hydrogen project as well as entering into a letter of intent to acquire the Duke Island ultramafic project for it's geologic hydrogen potential, both projects located in the state of Alaska. Granite Creek's goal is to be among the companies with first mover advantage in geologic hydrogen exploration by leveraging the considerable geological knowledge available to the company through its existing employee and consultant base plus the addition of key consultants with extensive knowledge in the field. More information about Granite Creek Copper can be viewed on the Company's website at <a rel=\"nofollow\" href=\"https://pr.report/54t1\">www.gcxcopper.com</a>.</p><p><strong>FOR FURTHER INFORMATION PLEASE CONTACT:</strong></p><p>Timothy Johnson, President &amp; CEO<br />Telephone: 1 (604) 235-1982<br />Toll Free: 1 (888) 361-3494<br />E-mail: <a rel=\"nofollow\" href=\"mailto:info@gcxcopper.com\">info@gcxcopper.com</a><br />Website: <a rel=\"nofollow\" href=\"https://pr.report/54t2\">www.gcxcopper.com</a></p><p><strong>Qualified Person</strong></p><p>Debbie James P.Geo, has reviewed and approved the technical information contained in this news release. Ms. James is a Qualified Person as defined in NI 43-101. She is not independent of the Company because she has received employment income from the Company and holds stock in the Company.</p><p><strong>Forward-Looking Statements</strong></p><p>Forward Looking Statements: This news release includes certain statements that may be deemed &quot;forward-looking statements&quot; or &quot;forward-looking information&quot;. All statements in this release, other than statements of historical facts including, without limitation, statements regarding expected use of proceeds from the private placement and future plans and objectives of the company are forward-looking statements that involve various risks and uncertainties. Although Granite Creek Copper believes the expectations expressed in such forward-looking statements are based on reasonable assumptions, such statements are not guarantees of future performance and actual results or developments may differ materially from those in the forward-looking statements. Forward-looking statements are based on a number of material factors and assumptions. Factors that could cause actual results to differ materially from those in forward-looking statements include failure to obtain necessary approvals, unsuccessful exploration results, changes in project parameters as plans continue to be refined, results of future resource estimates, future metal prices, availability of capital and financing on acceptable terms, general economic, market or business conditions, risks associated with regulatory changes, defects in title, availability of personnel, materials and equipment on a timely basis, accidents or equipment breakdowns, uninsured risks, delays in receiving government approvals, unanticipated environmental impacts on operations and costs to remedy same, and other exploration or other risks detailed herein and from time to time in the filings made by the companies with securities regulators. Readers are cautioned that mineral resources that are not mineral reserves do not have demonstrated economic viability. Mineral exploration and development of mines is an inherently risky business. Accordingly, the actual events may differ materially from those projected in the forward-looking statements. For more information on Granite Creek Copper and the risks and challenges of their businesses, investors should review their annual filings that are available at <a rel=\"nofollow\" href=\"https://pr.report/54t3\">www.sedarplus.ca</a>.</p><p style=\"text-align:center;\"><i>Neither the TSX Venture Exchange nor its Regulation Services Provider (as that term is defined in the policies of the TSX Venture Exchange) accepts responsibility for the adequacy or accuracy of this release.</i></p><p><strong>SOURCE: </strong>Granite Creek Copper Ltd.</p><br /><br />View the original <a href='https://www.accesswire.com/956047/granite-creek-copper-incorporates-geologic-hydrogen-subsidiary-options-union-bay-project-and-appoints-allegra-hosford-scheirer-to-lead-advisory-board'>press release</a> on accesswire.com<br /><br />",
    "search_terms": "Union Bay,Granite Creek Copper,GCX",
    "master_gid": 9334,
    "date": "2024-12-17T12:00:00.000Z",
    "tags": "|||Copper|Company Update,Management Changes,Project Acquisition",
    "image_id": null,
    "hidden": false,
    "company_id": 247,
    "provider": "accesswire",
    "excerpt": "VANCOUVER, BC / ACCESSWIRE / December 17, 2024 /Granite Creek Copper Ltd. (TSXV:GCX)(OTCQB:GCXXF) (&quot;Granite Creek&quot; or the &quot;Company&quot;)is pleased to announce that it has incorporated Element One Hydrogen Ltd as a wholly owned subsidiary to further advance the exploration for geologic hydrogen. The Company is currently completing research in several",
    "is_regulatory": false,
    "refined_tags": null,
    "ftp_filename": null,
    "company_name": "Granite Creek Copper",
    "exchange": "TSXV",
    "root_ticker": "GCX",
    "project_name": "Union Bay",
    "gid": 9334,
    "location": "Alaska, United States",
    "plan_id": "companytier2",
    "description_text": "VANCOUVER, BC / ACCESSWIRE / December 17, 2024 / Granite Creek Copper Ltd. (TSXV:GCX)(OTCQB:GCXXF) (\"Granite Creek\" or the \"Company\") is pleased to announce that it has incorporated Element One Hydrogen Ltd as a wholly owned subsidiary to further advance the exploration for geologic hydrogen. The Company is currently completing research in several jurisdictions in North America for possible acquisitions of projects prospective for both stimulated hydrogen from ultramafic rocks and for discovery of accumulations of hydrogen in the subsurface from various sources. The Company further announces that it has entered into an agreement dated December 16, 2024 (the Option Agreement\") granting 1508260 B.C. Ltd the option to acquire an 100% interest in the recently staked Union Bay hydrogen project (\"Union Bay\" or the \"Project\") located in Southeast Alaska. Union Bay is a classic \"Ural-Alaska type\" underlain by a zoned ultramafic-mafic complex, which ranges from dunite through wehrlite and magnetite-bearing olivine clinopyroxenite to hornblendite and gabbro on the margins. Exploration work completed on the project by previous owners included geological mapping and sampling, geophysical surveys and drilling which identified several high-grade platinum target areas. Research has shown that the olivine component in various ultramafic lithologies such as dunite and wehrlite may be conducive to production of hydrogen by interaction of water at depth. About Allegra Hosford Scheirer Granite Creek is very pleased to announce that the Company's continued geologic hydrogen exploration activities will be led by Allegra Hosford Scheirer, whom has been appointed to the company's Advisory Board. Allegra is in interdisciplinary geoscientist specializing in rock-fluid networks such as geologic hydrogen, oil and gas, and geothermal systems. She deploys basin and petroleum system modeling, resource assessment, big data and machine learning, and acquisition and processing of field data. Her work experience spans government, academic, and industry sectors. Allegra is an independent, non-executive director of Pantheon Resources, an oil and gas company that explores on the North Slope of Alaska. Her degrees are from Brown University (B.S.) and MIT (PhD). The Company anticipates additional additions to its geologic hydrogen team, under the auspices of Element One Hydrogen, in the coming weeks. Tim Johnson CEO of Granite Creek stated, \"The search for hydrogen accumulations is the subsurface is a rapidly growing branch of resource development. The opportunities present in this burgeoning field are unparalleled in the resource extraction industry. We are pleased to be entering this field and hope to be announcing additional acquisitions in the near future\". Terms of the Option Agreement Pursuant to the Option Agreement, 1508260 B.C. Ltd may acquire a 100% undivided interest in the Union Bay project, subject to a 2% Gross Overriding Royalty (GORR) by: All values unless specifically stated are in Canadian dollars. 1. making aggregate cash payments of US$175,000 to Granite as follows: US$50,000 on signing (the \"Effective Date\"); US$50,000 on or before the first anniversary of the Effective Date; and US$75,000 on or before the second anniversary of the Effective Date; and 2. incurring aggregate of $1,200,000 in expenditures on the Property as follows: $200,000 on or before the first anniversary of the Effective Date; and an additional $400,000 on or before the second anniversary of the Effective Date; and an additional $600,000 on or before the third anniversary of the of the Effective Date; and 3. issuing to Granite an aggregate of 2,750,000 shares as follows: 200,000 shares on the Effective Date and; 300,000 shares on or before the date which the Optionee is acquired by, or merges with an Optionee Acquireco 1 , but no later than four months following the Effective Date and; 1,000,000 shares on or before the first anniversary of the Effective Date and; 1,250,000 on or before the second anniversary of the Effective Date Upon completion of all payments, work and share issuance the Option will be deemed to be exercised, and the Property will automatically vest to 1508260 B.C. Ltd subject to a 2% GOR to be granted by 1508260 B.C. Ltd in favor of Granite Creek of which one half (being 1%) may be purchased by 1508260 B.C. Ltd for $1,500,000 within 30 days of commercial production. 1 1508260 B.C. Ltd has informed the Company of its intent to complete a go public transaction by way of a reverse take over, merger or other method in the coming months. About Granite Creek Copper Granite Creek Copper is a focused on the exploration and development of critical minerals projects in North America and more recently on geologic hydrogen. The Company's projects consist of its flagship 177 square kilometer Carmacks project in the Minto copper district of Canada's Yukon Territory on trend with the formerly operating, high-grade Minto copper-gold mine and the advanced stage LS molybdenum project and the Star copper-nickel-PGM plus geological hydrogen project, both located in central British Columbia. Recent acquisitions include the Union Bay geologic hydrogen project as well as entering into a letter of intent to acquire the Duke Island ultramafic project for it's geologic hydrogen potential, both projects located in the state of Alaska. Granite Creek's goal is to be among the companies with first mover advantage in geologic hydrogen exploration by leveraging the considerable geological knowledge available to the company through its existing employee and consultant base plus the addition of key consultants with extensive knowledge in the field. More information about Granite Creek Copper can be viewed on the Company's website at www.gcxcopper.com . FOR FURTHER INFORMATION PLEASE CONTACT: Timothy Johnson, President & CEO Telephone: 1 (604) 235-1982 Toll Free: 1 (888) 361-3494 E-mail: info@gcxcopper.com Website: www.gcxcopper.com Qualified Person Debbie James P.Geo, has reviewed and approved the technical information contained in this news release. Ms. James is a Qualified Person as defined in NI 43-101. She is not independent of the Company because she has received employment income from the Company and holds stock in the Company. Forward-Looking Statements Forward Looking Statements: This news release includes certain statements that may be deemed \"forward-looking statements\" or \"forward-looking information\". All statements in this release, other than statements of historical facts including, without limitation, statements regarding expected use of proceeds from the private placement and future plans and objectives of the company are forward-looking statements that involve various risks and uncertainties. Although Granite Creek Copper believes the expectations expressed in such forward-looking statements are based on reasonable assumptions, such statements are not guarantees of future performance and actual results or developments may differ materially from those in the forward-looking statements. Forward-looking statements are based on a number of material factors and assumptions. Factors that could cause actual results to differ materially from those in forward-looking statements include failure to obtain necessary approvals, unsuccessful exploration results, changes in project parameters as plans continue to be refined, results of future resource estimates, future metal prices, availability of capital and financing on acceptable terms, general economic, market or business conditions, risks associated with regulatory changes, defects in title, availability of personnel, materials and equipment on a timely basis, accidents or equipment breakdowns, uninsured risks, delays in receiving government approvals, unanticipated environmental impacts on operations and costs to remedy same, and other exploration or other risks detailed herein and from time to time in the filings made by the companies with securities regulators. Readers are cautioned that mineral resources that are not mineral reserves do not have demonstrated economic viability. Mineral exploration and development of mines is an inherently risky business. Accordingly, the actual events may differ materially from those projected in the forward-looking statements. For more information on Granite Creek Copper and the risks and challenges of their businesses, investors should review their annual filings that are available at www.sedarplus.ca . Neither the TSX Venture Exchange nor its Regulation Services Provider (as that term is defined in the policies of the TSX Venture Exchange) accepts responsibility for the adequacy or accuracy of this release. SOURCE: Granite Creek Copper Ltd. View the original press release on accesswire.com",
    "primary_commodity": "Hydrogen"
  },
  "articleProject": {
    "gid": 9334,
    "project_name": "Union Bay",
    "location": "Alaska, United States"
  },
  "articleExchange": "TSXV",
  "articleCompanyId": 247,
  "articleTicker": "GCX",
  "articleCompanyName": "Granite Creek Copper",
  "allOtherCompanyProjects": [
    {
      "company_id": 247,
      "gid": 9334,
      "project_name": "Union Bay",
      "location": "Alaska, United States"
    },
    {
      "company_id": 247,
      "gid": 800,
      "project_name": "Carmacks",
      "location": "Yukon, Canada"
    },
    {
      "company_id": 247,
      "gid": 3399,
      "project_name": "Star",
      "location": "British Columbia, Canada"
    },
    {
      "company_id": 247,
      "gid": 4290,
      "project_name": "Lucky Ship",
      "location": "British Columbia, Canada"
    }
  ],
  "allOtherCompanyNews": [
    {
      "id": 108278,
      "company_id": 247,
      "title": "Granite Creek Provides Corporate Update",
      "link": null,
      "date": "2025-06-17T11:00:00.000Z",
      "hidden": false
    },
    {
      "id": 107304,
      "company_id": 247,
      "title": "Cascadia Minerals and Granite Creek Copper Announce Merger to Create a Leading Yukon Copper-Gold Exploration and Development Company",
      "link": null,
      "date": "2025-06-09T11:15:00.000Z",
      "hidden": false
    },
    {
      "id": 102149,
      "company_id": 247,
      "title": "Granite Creek Sells Hydrogen Projects",
      "link": null,
      "date": "2025-04-29T11:30:00.000Z",
      "hidden": false
    },
    {
      "id": 88952,
      "company_id": 247,
      "title": "Granite Creek Copper Announces Funding from Natural Resources Canada - Supporting Ultramafic Technology Development Project Targeting the Star Property  ",
      "link": "https://www.accessnewswire.com/newsroom/en/metals-and-mining/granite-creek-copper-announces-funding-from-natural-resources-canada--supporting-u-989915",
      "date": "2025-02-24T12:30:00.000Z",
      "hidden": false
    },
    {
      "id": 86889,
      "company_id": 247,
      "title": "Granite Creek Copper Announces Participation in Ultramafic Technology Development Project Targeting the Star Property  ",
      "link": "https://www.accessnewswire.com/newsroom/en/metals-and-mining/granite-creek-copper-announces-participation-in-ultramafic-technology-development--979801",
      "date": "2025-02-05T12:00:00.000Z",
      "hidden": false
    },
    {
      "id": 82182,
      "company_id": 247,
      "title": "Granite Creek Copper Incorporates Geologic Hydrogen Subsidiary, Options Union Bay Project and Appoints Allegra Hosford Scheirer to Lead Advisory Board",
      "link": "https://www.accesswire.com/956047/granite-creek-copper-incorporates-geologic-hydrogen-subsidiary-options-union-bay-project-and-appoints-allegra-hosford-scheirer-to-lead-advisory-board",
      "date": "2024-12-17T12:00:00.000Z",
      "hidden": false
    },
    {
      "id": 81460,
      "company_id": 247,
      "title": "Granite Creek Copper Confirms New Mineralized Zone in 2024 Drilling at Carmacks Copper-Gold-Silver Project in Yukon, Canada",
      "link": "https://www.accesswire.com/952425/granite-creek-copper-confirms-new-mineralized-zone-in-2024-drilling-at-carmacks-copper-gold-silver-project-in-yukon-canada",
      "date": "2024-12-10T12:30:00.000Z",
      "hidden": false
    },
    {
      "id": 76288,
      "company_id": 247,
      "title": "Granite Creek Expands Portfolio with Alaska Ultramafic Acquisitions and Partners with Cornell University to Study Geologic Hydrogen Potential under Department of Energy Grant",
      "link": "https://www.accesswire.com/935797/granite-creek-expands-portfolio-with-alaska-ultramafic-acquisitions-and-partners-with-cornell-university-to-study-geologic-hydrogen-potential-under-department-of-energy-grant",
      "date": "2024-10-28T11:45:00.000Z",
      "hidden": false
    },
    {
      "id": 74919,
      "company_id": 247,
      "title": "Granite Creek Collaborates with New England Research on Geologic Hydrogen",
      "link": "https://www.accesswire.com/viewarticle.aspx?id=932126&lang=en",
      "date": "2024-10-16T11:45:00.000Z",
      "hidden": false
    },
    {
      "id": 73677,
      "company_id": 247,
      "title": "Granite Creek Copper Discovers New Zone in 2024 Drilling at Carmacks Copper-Gold-Silver Project in Yukon, Canada   ",
      "link": "https://www.accesswire.com/viewarticle.aspx?id=927066&lang=en",
      "date": "2024-10-03T11:45:00.000Z",
      "hidden": false
    }
  ]
}
