{
  "article": {
    "id": 82640,
    "link": "https://www.newsfilecorp.com/release/234608/Pluto-Ventures-Announces-Letter-of-Intent-to-Acquire-Rights-to-Alaska-Mining-Assets",
    "title": "Pluto Ventures Announces Letter of Intent to Acquire Rights to Alaska Mining Assets",
    "description": "<img src=\"https://api.newsfilecorp.com/newsinfo/234608/367\" id=\"367\" width=\"2\" height=\"2\" style=\"width: 1px;  height: 1px;border: 0px solid;\" /><p>Vancouver, British Columbia--(Newsfile Corp. - December 19, 2024) - Pluto Ventures Inc. (CSE: PLTO) (\"PLTO\" or the \"Company\") is pleased to announce that the Company has entered into a Letter of Intent (the \"LOI\") dated effective December 19, 2024 to purchase all of the issued and outstanding shares of 1508260 B.C. Ltd. (\"BC1508260\"), which holds the rights to acquire a series of mineral claims located in Alaska known as the Union Bay property (the \"Union Bay Property\"), and resulting in the indirect acquisition of the right to acquire a 100% interest in the Union Bay Property (the \"Proposed Transaction\"), located in Alaska.</p><p><b>Principal Terms of the Proposed Transaction</b></p><p>In consideration for the acquisition of all outstanding shares of BC1508260, the Company shall issue 7,500,000 common shares of PLTO (the \"Consideration Shares\") and 4,500,000 common share purchase warrants (the \"Consideration Warrants\") entitling the holders to acquire an equivalent number of common shares of PLTO at a price of $0.35 for a period of thirty-six months. The Consideration Shares and the Consideration Warrants will be issued to the existing shareholders of BC1508260, pro rata based upon their existing interest in BC1508260.</p><p>The Company is at arm's length from BC1508260 and the Union Bay Property vendors. Completion of the Proposed Transaction remains subject to a number of conditions, including: the satisfactory completion of due diligence on the Union Bay Project; the receipt of any required regulatory approvals, including the Canadian Securities Exchange; and the negotiation of definitive documentation. The Proposed Transaction cannot be completed until these conditions have been satisfied. There can be no guarantees that the Proposed Transaction will be completed as contemplated or at all.</p><p>The Proposed Transaction is not expected to constitute a Fundamental Change for the Company (as defined in the policies of the Canadian Securities Exchange), nor is it expected to result in a change of control of the Company, within the meaning of applicable securities laws and the policies of the Canadian Securities Exchange.</p><p>All securities issued pursuant to the Proposed Transaction will be issued under prospectus exemptions pursuant to National Instrument 45-106&#160;&#8211; <i>Prospectus Exemptions</i> of the Canadian Securities Administrators and may be subject to resale restrictions if imposed by applicable securities laws.</p><p><b>About the Company</b></p><p>Pluto Ventures Inc., headquartered in Vancouver, BC, Canada, is a mineral exploration company engaged in acquisition, exploration, and development of mineral properties. The Company's current principal project is the Dardanelle Project, which covers an area of 1,434 hectares located 23 kilometers east of Terrace, British Columbia.</p><p>ON BEHALF OF THE BOARD OF DIRECTORS</p><p>\"Lawrence Tsang\"</p><p>Lawrence Tsang, President and Chief Executive Officer</p><div id=\"contactInfo\"><p>For further information, please contact the Company at (604) 688-9588</p></div><p>Cautionary Statement Regarding \"Forward-Looking\" Information</p><p>This news release includes certain statements that may be deemed \"forward-looking statements\". All statements in this new release, other than statements of historical facts, that address events or developments that the Company expects to occur, are forward-looking statements. Forward-looking statements are statements that are not historical facts and are generally, but not always, identified by the words \"expects\", \"plans\", \"anticipates\", \"believes\", \"intends\", \"estimates\", \"projects\", \"potential\" and similar expressions, or that events or conditions \"will\", \"would\", \"may\", \"could\" or \"should\" occur. Forward-looking statements in this news release include statements related to the Proposed Transaction, satisfaction of the conditions precedent to the Proposed Transaction, and the acquisition of the Union Bay Property and related matters. Although the Company believes the expectations expressed in such forward-looking statements are based on reasonable assumptions, such statements are not guarantees of future performance and actual results may differ materially from those in the forward- looking statements. Factors that could cause the actual results to differ materially from those in forward-looking statements include market prices, continued availability of capital and financing, and general economic, market or business conditions. Investors are cautioned that any such statements are not guarantees of future performance and actual results or developments may differ materially from those projected in the forward-looking statements. Forward-looking statements are based on the beliefs, estimates and opinions of the Company's management on the date the statements are made. Except as required by applicable securities laws, the Company undertakes no obligation to update these forward-looking statements in the event that management's beliefs, estimates or opinions, or other factors, should change.</p><p id=\"corporateLinkBack\">To view the source version of this press release, please visit <a href=\"https://api.newsfilecorp.com/redirect/ZApXmFxOPX\">https://www.newsfilecorp.com/release/234608</a></p>",
    "search_terms": "Union Bay,Pluto Ventures Inc.,PLTO",
    "master_gid": 9334,
    "date": "2024-12-19T23:02:00.000Z",
    "tags": "USA|Alaska|||Project Acquisition",
    "image_id": null,
    "hidden": false,
    "company_id": 4839,
    "provider": "newsfilecorp",
    "excerpt": "Vancouver, British Columbia--(Newsfile Corp. - December 19, 2024) - Pluto Ventures Inc. (CSE: PLTO) (\"PLTO\" or the \"Company\") is pleased to announce that the Company has entered into a Letter of Intent (the \"LOI\") dated effective December 19, 2024 to purchase all of the issued and outstanding shares of 1508260",
    "is_regulatory": false,
    "refined_tags": null,
    "ftp_filename": null,
    "company_name": "Granite Creek Copper",
    "exchange": "CSE",
    "root_ticker": "PLTO",
    "project_name": "Union Bay",
    "gid": 9334,
    "location": "Alaska, United States",
    "plan_id": null,
    "description_text": "Vancouver, British Columbia--(Newsfile Corp. - December 19, 2024) - Pluto Ventures Inc. (CSE: PLTO) (\"PLTO\" or the \"Company\") is pleased to announce that the Company has entered into a Letter of Intent (the \"LOI\") dated effective December 19, 2024 to purchase all of the issued and outstanding shares of 1508260 B.C. Ltd. (\"BC1508260\"), which holds the rights to acquire a series of mineral claims located in Alaska known as the Union Bay property (the \"Union Bay Property\"), and resulting in the indirect acquisition of the right to acquire a 100% interest in the Union Bay Property (the \"Proposed Transaction\"), located in Alaska. Principal Terms of the Proposed Transaction In consideration for the acquisition of all outstanding shares of BC1508260, the Company shall issue 7,500,000 common shares of PLTO (the \"Consideration Shares\") and 4,500,000 common share purchase warrants (the \"Consideration Warrants\") entitling the holders to acquire an equivalent number of common shares of PLTO at a price of $0.35 for a period of thirty-six months. The Consideration Shares and the Consideration Warrants will be issued to the existing shareholders of BC1508260, pro rata based upon their existing interest in BC1508260. The Company is at arm's length from BC1508260 and the Union Bay Property vendors. Completion of the Proposed Transaction remains subject to a number of conditions, including: the satisfactory completion of due diligence on the Union Bay Project; the receipt of any required regulatory approvals, including the Canadian Securities Exchange; and the negotiation of definitive documentation. The Proposed Transaction cannot be completed until these conditions have been satisfied. There can be no guarantees that the Proposed Transaction will be completed as contemplated or at all. The Proposed Transaction is not expected to constitute a Fundamental Change for the Company (as defined in the policies of the Canadian Securities Exchange), nor is it expected to result in a change of control of the Company, within the meaning of applicable securities laws and the policies of the Canadian Securities Exchange. All securities issued pursuant to the Proposed Transaction will be issued under prospectus exemptions pursuant to National Instrument 45-106 – Prospectus Exemptions of the Canadian Securities Administrators and may be subject to resale restrictions if imposed by applicable securities laws. About the Company Pluto Ventures Inc., headquartered in Vancouver, BC, Canada, is a mineral exploration company engaged in acquisition, exploration, and development of mineral properties. The Company's current principal project is the Dardanelle Project, which covers an area of 1,434 hectares located 23 kilometers east of Terrace, British Columbia. ON BEHALF OF THE BOARD OF DIRECTORS \"Lawrence Tsang\" Lawrence Tsang, President and Chief Executive Officer For further information, please contact the Company at (604) 688-9588 Cautionary Statement Regarding \"Forward-Looking\" Information This news release includes certain statements that may be deemed \"forward-looking statements\". All statements in this new release, other than statements of historical facts, that address events or developments that the Company expects to occur, are forward-looking statements. Forward-looking statements are statements that are not historical facts and are generally, but not always, identified by the words \"expects\", \"plans\", \"anticipates\", \"believes\", \"intends\", \"estimates\", \"projects\", \"potential\" and similar expressions, or that events or conditions \"will\", \"would\", \"may\", \"could\" or \"should\" occur. Forward-looking statements in this news release include statements related to the Proposed Transaction, satisfaction of the conditions precedent to the Proposed Transaction, and the acquisition of the Union Bay Property and related matters. Although the Company believes the expectations expressed in such forward-looking statements are based on reasonable assumptions, such statements are not guarantees of future performance and actual results may differ materially from those in the forward- looking statements. Factors that could cause the actual results to differ materially from those in forward-looking statements include market prices, continued availability of capital and financing, and general economic, market or business conditions. Investors are cautioned that any such statements are not guarantees of future performance and actual results or developments may differ materially from those projected in the forward-looking statements. Forward-looking statements are based on the beliefs, estimates and opinions of the Company's management on the date the statements are made. Except as required by applicable securities laws, the Company undertakes no obligation to update these forward-looking statements in the event that management's beliefs, estimates or opinions, or other factors, should change. To view the source version of this press release, please visit https://www.newsfilecorp.com/release/234608",
    "primary_commodity": "Hydrogen"
  },
  "articleProject": {
    "gid": 9334,
    "project_name": "Union Bay",
    "location": "Alaska, United States"
  },
  "articleExchange": "CSE",
  "articleCompanyId": 4839,
  "articleTicker": "PLTO",
  "articleCompanyName": "Pluto Ventures Inc.",
  "allOtherCompanyProjects": [],
  "allOtherCompanyNews": [
    {
      "id": -204065,
      "company_id": 4839,
      "title": "Pluto Ventures Announces Appointment of Tyler Tian as Director",
      "link": null,
      "date": "2025-06-10T21:00:00.000Z",
      "hidden": false
    },
    {
      "id": -199869,
      "company_id": 4839,
      "title": "Pluto Ventures Inc. Signs Option Agreement to Acquire Monarch Uranium Project in Nunavut",
      "link": null,
      "date": "2025-05-08T12:00:00.000Z",
      "hidden": false
    },
    {
      "id": -170170,
      "company_id": 4839,
      "title": "Pluto Ventures Inc. Announces Termination of Letter of Intent to Acquire Mineral Option",
      "link": "https://www.newsfilecorp.com/release/241562/Pluto-Ventures-Inc.-Announces-Termination-of-Letter-of-Intent-to-Acquire-Mineral-Option",
      "date": "2025-02-19T22:29:00.000Z",
      "hidden": false
    },
    {
      "id": 83612,
      "company_id": 4839,
      "title": "Pluto Ventures Announces Appointment of Mathew Lee as CFO",
      "link": "https://www.newsfilecorp.com/release/236536/Pluto-Ventures-Announces-Appointment-of-Mathew-Lee-as-CFO",
      "date": "2025-01-09T00:30:00.000Z",
      "hidden": false
    },
    {
      "id": 82640,
      "company_id": 4839,
      "title": "Pluto Ventures Announces Letter of Intent to Acquire Rights to Alaska Mining Assets",
      "link": "https://www.newsfilecorp.com/release/234608/Pluto-Ventures-Announces-Letter-of-Intent-to-Acquire-Rights-to-Alaska-Mining-Assets",
      "date": "2024-12-19T23:02:00.000Z",
      "hidden": false
    },
    {
      "id": -155586,
      "company_id": 4839,
      "title": "Pluto Ventures Inc. Engages Fairfax Partners Inc.",
      "link": "https://www.newsfilecorp.com/release/230982/Pluto-Ventures-Inc.-Engages-Fairfax-Partners-Inc.",
      "date": "2024-11-21T23:44:00.000Z",
      "hidden": false
    },
    {
      "id": -153213,
      "company_id": 4839,
      "title": "Pluto Ventures Inc. Announces Forward Stock Split",
      "link": "https://www.newsfilecorp.com/release/229243/Pluto-Ventures-Inc.-Announces-Forward-Stock-Split",
      "date": "2024-11-08T14:00:00.000Z",
      "hidden": false
    }
  ]
}