{
  "article": {
    "id": 31016,
    "link": "https://www.newsfilecorp.com/release/154212/Ridgeline-Minerals-Acquires-DistrictScale-Porphyry-CopperGoldSilver-Project-in-Elko-County-Nevada",
    "title": "Ridgeline Minerals Acquires District-Scale Porphyry Copper-Gold-Silver Project in Elko County, Nevada",
    "description": "<img id=\"367\" width=\"2\" height=\"2\" style=\"width: 1px;  height: 1px;border: 0px solid;\" src=\"https://api.newsfilecorp.com/newsinfo/154212/367\" /><p>Vancouver, British Columbia--(Newsfile Corp. - February 9, 2023) - Ridgeline Minerals Corp. (TSXV: RDG) (OTCQB: RDGMF) (FSE: 0GC0) (\"<b>Ridgeline</b>\" or the \"<b>Company</b>\") is pleased to announce the staking of the Big Blue Project, (\"<b>Big Blue</b>\" or the \"<b>Project</b>\") a high-grade porphyry copper (\"Cu\") - gold (\"Au\") - silver (\"Ag\") exploration prospect in Elko County, Nevada (<a href=\"https://www.newsfilecorp.com/redirect/NN7vrUgkEX\"><b>Figure 1</b></a>). The Company acquired Big Blue via low-cost staking of 361 lode claims totaling 7,255 acres (29 square kilometers). The Project is 100% owned by the Company and retains no underlying lease payments, work commitments or royalty obligations.</p><p>The Big Blue Project includes the past producing Delker Mine, which produced 94,434 pounds of copper at an average grade of 6.2% Cu between 1916-1917<sup> </sup><sup>1</sup> and shares its southern boundary with Reyna Silver's Medicine Springs Ag-Pb-Zn Carbonate Replacement (\"CRD\") project (<a href=\"https://www.newsfilecorp.com/redirect/D3pWKijrqR\"><b>Figure 2</b></a>). A total of nineteen (19) confirmation rock chip samples were collected by Ridgeline in late 2022 between the Delker Mine workings and Skarn Hill adit, returning an average grade of 1.8% oxide Cu including a highlight sample of<b> 6.4% Cu, 0.2 grams per tonne (\"g/t\") Au, and 53.8 g/t Ag</b> at Skarn Hill (<a href=\"https://www.newsfilecorp.com/redirect/rYZLrIDA0O\"><b>Picture 1</b></a> &#38; <a href=\"https://www.newsfilecorp.com/redirect/VmZLQT1g8G\"><b>Figure 2</b></a>).  The Project has seen limited exploration over the past 100+ years and represents an opportunity to expand the known high-grade Cu-Au-Ag Skarn mineralization as well as discover new deposit types including Cu-Au Porphyry and Ag-Au-Pb-Zn CRD style mineralization at depth and along strike towards the Medicine Springs project. </p><p><i>Chad Peters, Ridgeline's President &#38; CEO, commented, \"This is the first project staked and generated by our team in the Company's history and consolidates a core land position within a historic but significantly underexplored porphyry district in Nevada. Our team's exploration thesis for Big Blue is analogous to the Butte Valley porphyry Cu-Au system located roughly 60 km to the south, which is inferred to be the source of CRD mineralization at our Selena project. Big Blue exhibits similar potential to host new, high-grade porphyry-skarn copper discoveries as well as CRD mineralization on-strike of the Delker Mine towards the Medicine Springs project, a known CRD discovery being explored by Reyna Silver. The Project is royalty free with no underlying work commitments and will be advanced alongside our growing CRD discovery at Selena.\"</i></p><p><b>Rock Chip Highlights:</b></p><ul style=\"list-style-type: disc;\"><li><p>Skarn Hill:<b> 6.44% Cu, 0.16 g/t Au, 53.75 g/t Ag </b>(<a href=\"https://www.newsfilecorp.com/redirect/zW40QUBb37\"><b>Picture 1</b> </a>&#38; <a href=\"https://www.newsfilecorp.com/redirect/4W4GkUrZpr\"><b>Figure 2</b></a>)</p></li><li><p>Delker Mine:<b> 4.88% Cu, 0.10 g/t Au, below detection limit (\"BDL\") Ag </b>(<a href=\"https://www.newsfilecorp.com/redirect/jVZvxuQjG3\"><b>Picture 1</b></a>)</p></li><li><p>Delker test pit: <b>6.31% Cu, 0.09 g/t Au, 4.21 g/t Ag</b></p></li><li><p>A total of 19 rock chip samples were collected during initial reconnaissance work ranging from 0.01-6.4% Cu, 0.009-0.2 g/t Au and BDL-53.8 g/t Ag (avg. 1.83% Cu, 0.05 g/t Au, 3.16 g/t Ag)</p></li></ul><p style=\"text-align: center;\">For a full table of rock chip values click <a href=\"https://www.newsfilecorp.com/redirect/vRDwjtNgL5\"><b>HERE</b></a></p><p><b>2023 Exploration Plans</b><br />Q1 2023 will focus on acquiring any available historical data for the Project to support an initial 3D geologic model. The team will follow up with mapping and prospecting in the spring as well as select Ridgeline operated backpack drill holes in the vicinity of the Delker Mine to chase shallow high-grade Cu skarn mineralization. The Company will also begin permitting a Bureau of Land Management administered Notice of Intent (\"NOI\") exploration permit to allow for up to five (5) acres of surface disturbance, which will be allocated to road and pad building to support a maiden drill program in the second half of the year.</p><p style=\"text-align: center;\"><a rel=\"nofollow\" href=\"https://images.newsfilecorp.com/files/7298/154212_8f1f1f3d64d11bf3_002full.jpg\"><img src=\"https://images.newsfilecorp.com/files/7298/154212_8f1f1f3d64d11bf3_002.jpg\" style=\"border-width: 0px;\" alt=\"Cannot view this image? Visit: https://images.newsfilecorp.com/files/7298/154212_8f1f1f3d64d11bf3_002.jpg\" /></a><br /><a href=\"https://www.newsfilecorp.com/redirect/JZnVyuaJXB\"><b><br /></b></a><b></b><a href=\"https://www.newsfilecorp.com/redirect/q3Z5DiDej4\"><b>Figure 1</b></a>: Plan view map showing the location of the Big Blue project as well as Ridgeline's five other exploration projects in Nevada and Idaho</p><p style=\"text-align: center;\">To view an enhanced version of this graphic, please visit:<br /><a rel=\"nofollow\" href=\"https://images.newsfilecorp.com/files/7298/154212_8f1f1f3d64d11bf3_002full.jpg\">https://images.newsfilecorp.com/files/7298/154212_8f1f1f3d64d11bf3_002full.jpg</a></p><p style=\"text-align: center;\"><a rel=\"nofollow\" href=\"https://images.newsfilecorp.com/files/7298/154212_8f1f1f3d64d11bf3_003full.jpg\"><img src=\"https://images.newsfilecorp.com/files/7298/154212_8f1f1f3d64d11bf3_003.jpg\" style=\"border-width: 0px;\" alt=\"Cannot view this image? Visit: https://images.newsfilecorp.com/files/7298/154212_8f1f1f3d64d11bf3_003.jpg\" /></a></p><p style=\"text-align: center;\"><a href=\"https://www.newsfilecorp.com/redirect/GORX7fx4qa\"><b>Picture 1</b></a>: Rock chip photos of high-grade Cu-Au-Ag oxide skarn from the Delker Mine and Skarn Hill Adit</p><p style=\"text-align: center;\">To view an enhanced version of this graphic, please visit:<br /><a rel=\"nofollow\" href=\"https://images.newsfilecorp.com/files/7298/154212_8f1f1f3d64d11bf3_003full.jpg\">https://images.newsfilecorp.com/files/7298/154212_8f1f1f3d64d11bf3_003full.jpg</a></p><p style=\"text-align: center;\"><a rel=\"nofollow\" href=\"https://images.newsfilecorp.com/files/7298/154212_8f1f1f3d64d11bf3_004full.jpg\"><img src=\"https://images.newsfilecorp.com/files/7298/154212_8f1f1f3d64d11bf3_004.jpg\" style=\"border-width: 0px;\" alt=\"Cannot view this image? Visit: https://images.newsfilecorp.com/files/7298/154212_8f1f1f3d64d11bf3_004.jpg\" /></a></p><p style=\"text-align: center;\"><a href=\"https://www.newsfilecorp.com/redirect/QrZQ4uzL0Y\"><b>Figure 2</b></a>: Plan view map showing high-grade Cu-Au-Ag rock chips taken from the Delker Mine workings, Skarn Hill Adit and nearby test pits.  Note the Medicine Springs<a href=\"https://www.newsfilecorp.com/redirect/moaQ8sp5om\"><sup>2</sup></a> CRD property boundary to the south. </p><p style=\"text-align: center;\">To view an enhanced version of this graphic, please visit:<br /><a rel=\"nofollow\" href=\"https://images.newsfilecorp.com/files/7298/154212_8f1f1f3d64d11bf3_004full.jpg\">https://images.newsfilecorp.com/files/7298/154212_8f1f1f3d64d11bf3_004full.jpg</a></p><p><b>Big Blue Project</b><br />Big Blue is located in Elko County, Nevada, approximately 75 kilometers (\"km\") southeast of the city of Elko, NV. The project shares a property boundary with the Medicine Springs Project, a Carbonate Replacement type exploration project operated by Reyna Silver. Outcropping garnet skarn with high-grade Cu &#177; Au-Ag rock chip samples collected by Ridgeline occurs on the Project on two outcropping buttes surrounded by post-mineral gravels covering a roughly five (5) km target area zoning towards Medicine Springs. The primary target at Big Blue is porphyry-skarn Cu &#177; Au-Ag mineralization, which may be the source of CRD mineralization at Medicine Springs - analogous to the Butte Valley porphyry Cu-Au system inferred to be a source of CRD mineralization at the Company's Selena project. The 100% owned Project is comprised of a total of 29 square kilometers of highly prospective exploration ground that has seen limited exploration since the early 1900's and will benefit from the Ridgeline teams systematic approach to discovery (view the Ridgeline Corporate Deck <a href=\"https://www.newsfilecorp.com/redirect/kzZJ7fLK3q\">HERE</a>)<u>.</u></p><p><b>QAQC Procedures</b><br />Samples are submitted to American Assay Laboratories (AAL) of Sparks, Nevada, which is a certified and accredited laboratory, independent of the Company. Samples are prepared using industry-standard prep methods and analysed using FA-PB30-ICP (Au; 30 g fire assay) and ICP-5AM48 (48 element Suite; 0.5 g 5-acid digestion/ICP-MS) methods. AAL also undertakes its own internal coarse and pulp duplicate analysis to ensure proper sample preparation and equipment calibration. Ridgeline's QA/QC program includes regular insertion of CRM standards, duplicates, and blanks into the sample stream with a stringent review of all results completed by the Company's Qualified Person, Michael T. Harp, Vice President, Exploration.</p><p>Technical information contained in this news release has been reviewed and approved by Michael T. Harp, CPG. the Company's Vice President, Exploration, who is Ridgeline's Qualified Person under National Instrument 43-101 and responsible for technical matters of this release. </p><p><b>About Ridgeline Minerals Corp.</b><br />Ridgeline is a discovery focused gold-silver explorer with a proven management team and a 192 km&#178; exploration portfolio across six projects in Nevada and Idaho, USA. More information about Ridgeline can be found at <a href=\"https://www.newsfilecorp.com/redirect/BNw0qUZXRP\">www.RidgelineMinerals.com</a></p><p><b>On behalf of the Board</b><br /><i>\"Chad Peters\"</i><br />President &#38; CEO</p><p><b>Further Information:</b><br />Chad Peters, P.Geo.<br />President &#38; CEO<br />Ridgeline Minerals Corp. <br />1-866-RDG-NVAU (734-6828) - toll free | <a href=\"mailto:info@ridgelineminerals.com\">info@ridgelineminerals.com</a> </p><p><b>Neither the TSX Venture Exchange nor its Regulation Service Provider (as that term is defined in the policies of the TSX Venture Exchange) accepts responsibility for the adequacy or accuracy of this press release.</b></p><p><b>Cautionary Note regarding Forward Looking Statements</b><br /><i>Statements contained in this press release that are not historical facts are \"forward-looking information\" or \"forward-looking statements\" (collectively, \"Forward-Looking Information\") within the meaning of applicable Canadian securities legislation and the United States Private Securities Litigation Reform Act of 1995. Forward-Looking Information includes, but is not limited to, the anticipated benefits of the Earn-In Agreement and the transaction contemplated thereby. The words \"potential\", \"anticipate\", \"meaningful\", \"discovery\", \"forecast\", \"believe\", \"estimate\", \"expect\", \"may\", \"will\", \"project\", \"plan\", \"historical\", \"historic\" and similar expressions are intended to be among the statements that identify Forward-Looking Information. Forward-Looking Information involves known and unknown risks, uncertainties and other factors which may cause the actual results to be materially different from any future results expressed or implied by the Forward-Looking Information. In preparing the Forward-Looking Information in this news release, Ridgeline has applied several material assumptions, including, but not limited to, assumptions that TSX Venture Exchange approval will be granted in a timely manner subject only to standard conditions; the current objectives concerning the Project can be achieved and that its other corporate activities will proceed as expected; that general business and economic conditions will not change in a materially adverse manner; and that all requisite information will be available in a timely manner. Forward-Looking Information involves known and unknown risks, uncertainties and other factors which may cause the actual results, performance, or achievements of Ridgeline to be materially different from any future results, performance or achievements expressed or implied by the Forward-Looking Information. Such risks and other factors include, among others, risks related to dependence on key personnel; risks related to unforeseen delays; risks related to historical data that has not been verified by the Company; as well as those factors discussed in Ridgeline's public disclosure record. Although Ridgeline has attempted to identify important factors that could affect Ridgeline and may cause actual actions, events, or results to differ materially from those described in Forward-Looking Information, there may be other factors that cause actions, events or results not to be as anticipated, estimated or intended. There can be no assurance that Forward-Looking Information will prove to be accurate, as actual results and future events could differ materially from those anticipated in such statements. Accordingly, readers should not place undue reliance on Forward-Looking Information. Except as required by law, Ridgeline does not assume any obligation to release publicly any revisions to Forward-Looking Information contained in this news release to reflect events or circumstances after the date hereof or to reflect the occurrence of unanticipated events.</i></p><p><u><i>Sources</i></u></p><p><font style=\"font-size: 11px;\"><sup><i>1</i></sup><i>Delker Mine Historic Production (Page 57): Smith, R.M., 1976, Mineral resources of Elko County, Nevada: U.S. Geological Survey Open-File Report 76-56, 201 p.</i><br /><sup><i>2</i></sup><i>Medicine Springs Results: https://reynasilver.com/system/uploads/RS-PressRelease-20230117.pdf</i></font></p><p id=\"corporateNewsLogoContainer\"><img src=\"https://images.newsfilecorp.com/files/7298/154212_8f1f1f3d64d11bf3_logo.jpg\" id=\"corporateNewsLogo\" alt=\"Corporate Logo\" /></p><p id=\"corporateLinkBack\">To view the source version of this press release, please visit <a href=\"https://www.newsfilecorp.com/redirect/5pjQBTBwY5\">https://www.newsfilecorp.com/release/154212</a></p>",
    "search_terms": "Big Blue,Ridgeline Minerals Corp.,RDG",
    "master_gid": 4027,
    "date": "2023-02-09T12:45:00.000Z",
    "tags": "USA|Nevada||Copper,Gold,Silver|Project Acquisition",
    "image_id": null,
    "hidden": false,
    "company_id": 383,
    "provider": null,
    "excerpt": "Vancouver, British Columbia--(Newsfile Corp. - February 9, 2023) - Ridgeline Minerals Corp. (TSXV: RDG) (OTCQB: RDGMF) (FSE: 0GC0) (\"Ridgeline\" or the \"Company\") is pleased to announce the staking of the Big Blue Project, (\"Big Blue\" or the \"Project\") a high-grade porphyry copper (\"Cu\") - gold (\"Au\") - silver (\"Ag\") exploration",
    "is_regulatory": false,
    "refined_tags": [
      "Project Acquisition"
    ],
    "ftp_filename": null,
    "company_name": "Ridgeline Minerals Corp.",
    "exchange": "TSXV",
    "root_ticker": "RDG",
    "project_name": "Big Blue",
    "gid": 4027,
    "location": "Nevada, United States",
    "plan_id": null,
    "description_text": "Vancouver, British Columbia--(Newsfile Corp. - February 9, 2023) - Ridgeline Minerals Corp. (TSXV: RDG) (OTCQB: RDGMF) (FSE: 0GC0) (\" Ridgeline \" or the \" Company \") is pleased to announce the staking of the Big Blue Project, (\" Big Blue \" or the \" Project \") a high-grade porphyry copper (\"Cu\") - gold (\"Au\") - silver (\"Ag\") exploration prospect in Elko County, Nevada ( Figure 1 ). The Company acquired Big Blue via low-cost staking of 361 lode claims totaling 7,255 acres (29 square kilometers). The Project is 100% owned by the Company and retains no underlying lease payments, work commitments or royalty obligations. The Big Blue Project includes the past producing Delker Mine, which produced 94,434 pounds of copper at an average grade of 6.2% Cu between 1916-1917 1 and shares its southern boundary with Reyna Silver's Medicine Springs Ag-Pb-Zn Carbonate Replacement (\"CRD\") project ( Figure 2 ). A total of nineteen (19) confirmation rock chip samples were collected by Ridgeline in late 2022 between the Delker Mine workings and Skarn Hill adit, returning an average grade of 1.8% oxide Cu including a highlight sample of 6.4% Cu, 0.2 grams per tonne (\"g/t\") Au, and 53.8 g/t Ag at Skarn Hill ( Picture 1 & Figure 2 ).  The Project has seen limited exploration over the past 100+ years and represents an opportunity to expand the known high-grade Cu-Au-Ag Skarn mineralization as well as discover new deposit types including Cu-Au Porphyry and Ag-Au-Pb-Zn CRD style mineralization at depth and along strike towards the Medicine Springs project. Chad Peters, Ridgeline's President & CEO, commented, \"This is the first project staked and generated by our team in the Company's history and consolidates a core land position within a historic but significantly underexplored porphyry district in Nevada. Our team's exploration thesis for Big Blue is analogous to the Butte Valley porphyry Cu-Au system located roughly 60 km to the south, which is inferred to be the source of CRD mineralization at our Selena project. Big Blue exhibits similar potential to host new, high-grade porphyry-skarn copper discoveries as well as CRD mineralization on-strike of the Delker Mine towards the Medicine Springs project, a known CRD discovery being explored by Reyna Silver. The Project is royalty free with no underlying work commitments and will be advanced alongside our growing CRD discovery at Selena.\" Rock Chip Highlights: Skarn Hill: 6.44% Cu, 0.16 g/t Au, 53.75 g/t Ag ( Picture 1 & Figure 2 ) Delker Mine: 4.88% Cu, 0.10 g/t Au, below detection limit (\"BDL\") Ag ( Picture 1 ) Delker test pit: 6.31% Cu, 0.09 g/t Au, 4.21 g/t Ag A total of 19 rock chip samples were collected during initial reconnaissance work ranging from 0.01-6.4% Cu, 0.009-0.2 g/t Au and BDL-53.8 g/t Ag (avg. 1.83% Cu, 0.05 g/t Au, 3.16 g/t Ag) For a full table of rock chip values click HERE 2023 Exploration Plans Q1 2023 will focus on acquiring any available historical data for the Project to support an initial 3D geologic model. The team will follow up with mapping and prospecting in the spring as well as select Ridgeline operated backpack drill holes in the vicinity of the Delker Mine to chase shallow high-grade Cu skarn mineralization. The Company will also begin permitting a Bureau of Land Management administered Notice of Intent (\"NOI\") exploration permit to allow for up to five (5) acres of surface disturbance, which will be allocated to road and pad building to support a maiden drill program in the second half of the year. Figure 1 : Plan view map showing the location of the Big Blue project as well as Ridgeline's five other exploration projects in Nevada and Idaho To view an enhanced version of this graphic, please visit: https://images.newsfilecorp.com/files/7298/154212_8f1f1f3d64d11bf3_002full.jpg Picture 1 : Rock chip photos of high-grade Cu-Au-Ag oxide skarn from the Delker Mine and Skarn Hill Adit To view an enhanced version of this graphic, please visit: https://images.newsfilecorp.com/files/7298/154212_8f1f1f3d64d11bf3_003full.jpg Figure 2 : Plan view map showing high-grade Cu-Au-Ag rock chips taken from the Delker Mine workings, Skarn Hill Adit and nearby test pits.  Note the Medicine Springs 2 CRD property boundary to the south. To view an enhanced version of this graphic, please visit: https://images.newsfilecorp.com/files/7298/154212_8f1f1f3d64d11bf3_004full.jpg Big Blue Project Big Blue is located in Elko County, Nevada, approximately 75 kilometers (\"km\") southeast of the city of Elko, NV. The project shares a property boundary with the Medicine Springs Project, a Carbonate Replacement type exploration project operated by Reyna Silver. Outcropping garnet skarn with high-grade Cu ± Au-Ag rock chip samples collected by Ridgeline occurs on the Project on two outcropping buttes surrounded by post-mineral gravels covering a roughly five (5) km target area zoning towards Medicine Springs. The primary target at Big Blue is porphyry-skarn Cu ± Au-Ag mineralization, which may be the source of CRD mineralization at Medicine Springs - analogous to the Butte Valley porphyry Cu-Au system inferred to be a source of CRD mineralization at the Company's Selena project. The 100% owned Project is comprised of a total of 29 square kilometers of highly prospective exploration ground that has seen limited exploration since the early 1900's and will benefit from the Ridgeline teams systematic approach to discovery (view the Ridgeline Corporate Deck HERE ) . QAQC Procedures Samples are submitted to American Assay Laboratories (AAL) of Sparks, Nevada, which is a certified and accredited laboratory, independent of the Company. Samples are prepared using industry-standard prep methods and analysed using FA-PB30-ICP (Au; 30 g fire assay) and ICP-5AM48 (48 element Suite; 0.5 g 5-acid digestion/ICP-MS) methods. AAL also undertakes its own internal coarse and pulp duplicate analysis to ensure proper sample preparation and equipment calibration. Ridgeline's QA/QC program includes regular insertion of CRM standards, duplicates, and blanks into the sample stream with a stringent review of all results completed by the Company's Qualified Person, Michael T. Harp, Vice President, Exploration. Technical information contained in this news release has been reviewed and approved by Michael T. Harp, CPG. the Company's Vice President, Exploration, who is Ridgeline's Qualified Person under National Instrument 43-101 and responsible for technical matters of this release. About Ridgeline Minerals Corp. Ridgeline is a discovery focused gold-silver explorer with a proven management team and a 192 km² exploration portfolio across six projects in Nevada and Idaho, USA. More information about Ridgeline can be found at www.RidgelineMinerals.com On behalf of the Board \"Chad Peters\" President & CEO Further Information: Chad Peters, P.Geo. President & CEO Ridgeline Minerals Corp. 1-866-RDG-NVAU (734-6828) - toll free | info@ridgelineminerals.com Neither the TSX Venture Exchange nor its Regulation Service Provider (as that term is defined in the policies of the TSX Venture Exchange) accepts responsibility for the adequacy or accuracy of this press release. Cautionary Note regarding Forward Looking Statements Statements contained in this press release that are not historical facts are \"forward-looking information\" or \"forward-looking statements\" (collectively, \"Forward-Looking Information\") within the meaning of applicable Canadian securities legislation and the United States Private Securities Litigation Reform Act of 1995. Forward-Looking Information includes, but is not limited to, the anticipated benefits of the Earn-In Agreement and the transaction contemplated thereby. The words \"potential\", \"anticipate\", \"meaningful\", \"discovery\", \"forecast\", \"believe\", \"estimate\", \"expect\", \"may\", \"will\", \"project\", \"plan\", \"historical\", \"historic\" and similar expressions are intended to be among the statements that identify Forward-Looking Information. Forward-Looking Information involves known and unknown risks, uncertainties and other factors which may cause the actual results to be materially different from any future results expressed or implied by the Forward-Looking Information. In preparing the Forward-Looking Information in this news release, Ridgeline has applied several material assumptions, including, but not limited to, assumptions that TSX Venture Exchange approval will be granted in a timely manner subject only to standard conditions; the current objectives concerning the Project can be achieved and that its other corporate activities will proceed as expected; that general business and economic conditions will not change in a materially adverse manner; and that all requisite information will be available in a timely manner. Forward-Looking Information involves known and unknown risks, uncertainties and other factors which may cause the actual results, performance, or achievements of Ridgeline to be materially different from any future results, performance or achievements expressed or implied by the Forward-Looking Information. Such risks and other factors include, among others, risks related to dependence on key personnel; risks related to unforeseen delays; risks related to historical data that has not been verified by the Company; as well as those factors discussed in Ridgeline's public disclosure record. Although Ridgeline has attempted to identify important factors that could affect Ridgeline and may cause actual actions, events, or results to differ materially from those described in Forward-Looking Information, there may be other factors that cause actions, events or results not to be as anticipated, estimated or intended. There can be no assurance that Forward-Looking Information will prove to be accurate, as actual results and future events could differ materially from those anticipated in such statements. Accordingly, readers should not place undue reliance on Forward-Looking Information. Except as required by law, Ridgeline does not assume any obligation to release publicly any revisions to Forward-Looking Information contained in this news release to reflect events or circumstances after the date hereof or to reflect the occurrence of unanticipated events. Sources 1 Delker Mine Historic Production (Page 57): Smith, R.M., 1976, Mineral resources of Elko County, Nevada: U.S. Geological Survey Open-File Report 76-56, 201 p. 2 Medicine Springs Results: https://reynasilver.com/system/uploads/RS-PressRelease-20230117.pdf To view the source version of this press release, please visit https://www.newsfilecorp.com/release/154212",
    "primary_commodity": "Cu"
  },
  "articleProject": {
    "gid": 4027,
    "project_name": "Big Blue",
    "location": "Nevada, United States"
  },
  "articleExchange": "TSXV",
  "articleCompanyId": 383,
  "articleTicker": "RDG",
  "articleCompanyName": "Ridgeline Minerals Corp.",
  "allOtherCompanyProjects": [
    {
      "company_id": 383,
      "gid": 1022,
      "project_name": "Swift",
      "location": "Nevada, USA"
    },
    {
      "company_id": 383,
      "gid": 4027,
      "project_name": "Big Blue",
      "location": "Nevada, United States"
    },
    {
      "company_id": 383,
      "gid": 10663,
      "project_name": "Eagle",
      "location": "Nevada, United States"
    },
    {
      "company_id": 383,
      "gid": 736,
      "project_name": "Selena",
      "location": "Nevada, USA"
    },
    {
      "company_id": 383,
      "gid": 5133,
      "project_name": "Black Ridge (Carlin East)",
      "location": "Nevada, United States"
    },
    {
      "company_id": 383,
      "gid": 9529,
      "project_name": "Atlas",
      "location": "Nevada, United States"
    },
    {
      "company_id": 383,
      "gid": 5206,
      "project_name": "Bell Creek",
      "location": "Nevada, United States"
    }
  ],
  "allOtherCompanyNews": [
    {
      "id": 106772,
      "company_id": 383,
      "title": "Ridgeline Minerals Sells Tungsten and Critical Metals Project to Midasco Capital Corp.",
      "link": null,
      "date": "2025-06-03T11:30:00.000Z",
      "hidden": false
    },
    {
      "id": 106239,
      "company_id": 383,
      "title": "Ridgeline Minerals Acquires High-Grade Oxide Gold Project, Further Consolidating Land Position at the Atlas Project, Nevada",
      "link": null,
      "date": "2025-05-29T12:00:00.000Z",
      "hidden": false
    },
    {
      "id": 104795,
      "company_id": 383,
      "title": "Ridgeline Minerals Provides Drill Program Updates for the Big Blue and Atlas Projects",
      "link": null,
      "date": "2025-05-15T12:00:00.000Z",
      "hidden": false
    },
    {
      "id": 99151,
      "company_id": 383,
      "title": "Ridgeline Minerals Provides 2025 Budget Guidance for the Selena CRD Project, Nevada",
      "link": null,
      "date": "2025-04-09T12:00:00.000Z",
      "hidden": false
    },
    {
      "id": 92101,
      "company_id": 383,
      "title": "Ridgeline Minerals Closes $500k Private Placement",
      "link": null,
      "date": "2025-03-21T19:37:00.000Z",
      "hidden": false
    },
    {
      "id": 91703,
      "company_id": 383,
      "title": "Ridgeline Minerals Announces Non-Brokered Private Placement",
      "link": null,
      "date": "2025-03-18T19:05:00.000Z",
      "hidden": false
    },
    {
      "id": 90987,
      "company_id": 383,
      "title": "Ridgeline Minerals Announces Remaining 2024 Drill Results and Provides 2025 Budget Guidance for the Swift Project, Nevada",
      "link": null,
      "date": "2025-03-13T12:00:00.000Z",
      "hidden": false
    },
    {
      "id": 90599,
      "company_id": 383,
      "title": "Ridgeline Minerals Commences Drill Program at the Big Blue Porphyry Cu-Au Project, Nevada",
      "link": "https://www.newsfilecorp.com/release/244074/Ridgeline-Minerals-Commences-Drill-Program-at-the-Big-Blue-Porphyry-CuAu-Project-Nevada",
      "date": "2025-03-11T12:00:00.000Z",
      "hidden": false
    },
    {
      "id": 89131,
      "company_id": 383,
      "title": "Ridgeline Minerals MT Survey Confirms High-Priority 2025 Drill Targets at the Selena CRD Project, Nevada",
      "link": "https://www.newsfilecorp.com/release/242238/Ridgeline-Minerals-MT-Survey-Confirms-HighPriority-2025-Drill-Targets-at-the-Selena-CRD-Project-Nevada",
      "date": "2025-02-25T13:00:00.000Z",
      "hidden": false
    },
    {
      "id": 87885,
      "company_id": 383,
      "title": "Ridgeline Minerals Closes $4.1 Million Private Placement",
      "link": "https://www.newsfilecorp.com/release/240899/Ridgeline-Minerals-Closes-4.1-Million-Private-Placement",
      "date": "2025-02-14T00:00:00.000Z",
      "hidden": false
    }
  ]
}
