{
  "article": {
    "id": 40380,
    "link": "https://www.newsfilecorp.com/release/179674/Ridgeline-Minerals-Expands-Big-Blue-Property-Position-by-33",
    "title": "Ridgeline Minerals Expands Big Blue Property Position by 33%",
    "description": "<img src=\"https://api.newsfilecorp.com/newsinfo/179674/367\" id=\"367\" width=\"2\" height=\"2\" style=\"width: 1px;  height: 1px;border: 0px solid;\" /><p>Vancouver, British Columbia--(Newsfile Corp. - September 6, 2023) - Ridgeline Minerals Corp. (TSXV: RDG) (OTCQB: RDGMF) (FSE: 0GC0) (\"<b>Ridgeline</b>\" or the \"<b>Company</b>\") is pleased to announce the staking of an additional one hundred and forty-one (\"141\") Bureau of Land Management (\"<b>BLM</b>\") lode claims (2,913 acres) at the Big Blue project (\"Big Blue\" or \"Project\") in Elko County, Nevada. Big Blue now comprises 502 contiguous lode claims totaling 10,168 acres or 41 square kilometers (\"km\") (<a href=\"https://api.newsfilecorp.com/redirect/QO7Z3ubkYD\">Figure 1</a>), and is 100% owned by the Company with no underlying work commitments or royalty obligations. The property includes the past producing Delker Mine and Skarn Hill Adit, which collectively produced a reported 94,434 pounds of copper (\"Cu\") at an average grade of 6.2% Cu between 1916-1917<a href=\"https://api.newsfilecorp.com/redirect/m3GaPcbjXr\"><sup>1</sup></a> (<a href=\"https://api.newsfilecorp.com/redirect/kOaZouyND0\">Figure 1</a>). The Project has not seen a sustained exploration effort in decades and exhibits excellent potential to make new porphyry copper and Carbonate Replacement (\"CRD\") style polymetallic discoveries.</p><p>The property expansion followed the Company's recently announced acquisition of an extensive historical database for Big Bluesee (August 24, 2023 press release&#160;<a href=\"https://api.newsfilecorp.com/redirect/BpWwySL5YY\"><u>HERE</u></a><u></u>), which has highlighted additional geophysical targets located to the northwest of the original claim block. This kilometer-scale target exhibits overlapping gravity and magnetic geophysics anomalies and is interpreted as a potential porphyry signature that may be the deeper source to the known Cu-skarn mineralization outcropping at the historical Delker Mine (<a href=\"https://api.newsfilecorp.com/redirect/551jyfvkye\">Figure 2</a>). As a result, Ridgeline staked all open and locatable claims surrounding the porphyry target and will continue advancing Big Blue towards a maiden drill program in 2024.</p><p>Chad Peters, President &#38; CEO, commented, <i>\"Big Blue continues to be a rapidly evolving project in our exploration pipeline. Our team is very encouraged by the scale of the geophysical anomaly's located on our new claim block, which suggests potential for a blind porphyry copper target at depth and distal CRD targets along strike. Until now, the Delker area has never been explored as a consolidated porphyry district and with this expansion we now control a target-rich land position with a robust geologic dataset to support our exploration model. We will continue to advance low-cost targeting and permitting initiatives through the remainder of this year while we prepare for a maiden drill campaign in 2024.\"</i></p><p><b>Big Blue Project</b></p><p>Big Blue is located in Elko County, Nevada, approximately seventy-five kilometers (\"km\") southeast of the city of Elko, NV. The Project includes the past producing Delker Mine, which produced a reported 94,434 pounds of copper at an average grade of 6.2% Cu between 1916-1917<a href=\"https://api.newsfilecorp.com/redirect/LG8EZTK1xn\"><sup>1</sup></a> and shares its southern boundary with Reyna Silver's Medicine Springs Ag-Pb-Zn Carbonate Replacement (\"CRD\") project. Mineralization occurs as outcropping, high-grade Cu occurrences located proximal to northeast trending felsic dikes that are interpreted as the zoned manifestations off a potential porphyry source, located in the northwest corner of the Big Blue property. Importantly, this target has never been drill-tested. The primary target at Big Blue is porphyry-skarn Cu &#177; Au-Ag mineralization, with potential to discover polymetallic, carbonate replacement deposit (CRD) style mineralization as the system zones outward over 6 kilometers of strike towards the Medicine Springs project. This target model is analogous to the Butte Valley porphyry Cu-Au system, which is inferred to be the source of CRD mineralization at the Company's nearby&#160;<a href=\"https://api.newsfilecorp.com/redirect/oL1ZgtWm7B\">Selena project</a>. Big Blue is 100% owned by the Company and is comprised of a total of 41 square kilometers of highly prospective exploration ground that has seen limited exploration since the early 1900's and will benefit from Ridgeline's systematic approach to discovery (view Ridgeline's Corporate Deck <a href=\"https://api.newsfilecorp.com/redirect/O3MeycKqG3\">HERE</a>).</p><p style=\"text-align: center;\"><a rel=\"nofollow\" href=\"https://images.newsfilecorp.com/files/7298/179674_1f511761d4096991_002full.jpg\"><img src=\"https://images.newsfilecorp.com/files/7298/179674_1f511761d4096991_002.jpg\" style=\"border-width: 0px;\" alt=\"Cannot view this image? Visit: https://images.newsfilecorp.com/files/7298/179674_1f511761d4096991_002.jpg\" /></a></p><p style=\"text-align: center;\"><a href=\"https://api.newsfilecorp.com/redirect/PLB82tNRQb\"><b>Figure 1</b>:</a>&#160;Plan view map showing the location of the 141 new claims (shaded blue) staked by Ridgeline to increase claims by ~33% to 502 contiguous lode claims.</p><p style=\"text-align: center;\">To view an enhanced version of this graphic, please visit:<br /><a rel=\"nofollow\" href=\"https://images.newsfilecorp.com/files/7298/179674_1f511761d4096991_002full.jpg\">https://images.newsfilecorp.com/files/7298/179674_1f511761d4096991_002full.jpg</a></p><p style=\"text-align: center;\"><a rel=\"nofollow\" href=\"https://images.newsfilecorp.com/files/7298/179674_1f511761d4096991_003full.jpg\"><img src=\"https://images.newsfilecorp.com/files/7298/179674_1f511761d4096991_003.jpg\" style=\"border-width: 0px;\" alt=\"Cannot view this image? Visit: https://images.newsfilecorp.com/files/7298/179674_1f511761d4096991_003.jpg\" /></a></p><p style=\"text-align: center;\"><a href=\"https://api.newsfilecorp.com/redirect/wWwrjsXneV\"><b>Figure 2</b></a>: Plan view map on the left showing reduced to pole (\"RTP\") airborne magnetics highlighting kilometer scale magnetic \"highs\" at both the&#160;<i><b>Delker Mine</b></i><b>&#160;</b>and to the northwest on Ridgeline's new claims. The map on the right shows Residual Gravity with a coincident high over proposed porphyry centers. Gravity also highlights a lower amplitude anomaly interpreted as a northeast trending structural corridor that trends southwest to the historical Golden Pipe mine (Ag-Pb-Zn) owned by Reyna Silver.</p><p style=\"text-align: center;\">To view an enhanced version of this graphic, please visit:<br /><a rel=\"nofollow\" href=\"https://images.newsfilecorp.com/files/7298/179674_1f511761d4096991_003full.jpg\">https://images.newsfilecorp.com/files/7298/179674_1f511761d4096991_003full.jpg</a></p><p>To view X-Section A-A' showing magnetics anomaly beneath the Delker Mine, click <a href=\"https://api.newsfilecorp.com/redirect/gOvbkuva3D\">HERE</a>.</p><p>To view plan view maps showing Total Horizontal Gradient Magnetics and Residual gravity, click <a href=\"https://api.newsfilecorp.com/redirect/pE1ZNiZyOv\">HERE</a>.</p><p><b>QAQC Procedures</b></p><p>Samples are submitted to American Assay Laboratories (AAL) of Sparks, Nevada, which is a certified and accredited laboratory, independent of the Company. Samples are prepared using industry-standard prep methods and analysed using FA-PB30-ICP (Au; 30 g fire assay) and ICP-5AM48 (48 element Suite; 0.5 g 5-acid digestion/ICP-MS) methods. AAL also undertakes its own internal coarse and pulp duplicate analysis to ensure proper sample preparation and equipment calibration. Ridgeline's QA/QC program includes regular insertion of CRM standards, duplicates, and blanks into the sample stream with a stringent review of all results completed by the Company's Qualified Person, Michael T. Harp, Vice President, Exploration.</p><p>Technical information contained in this news release has been reviewed and approved by Michael T. Harp, CPG. the Company's Vice President, Exploration, who is Ridgeline's Qualified Person under National Instrument 43-101 and responsible for technical matters of this release. </p><p><b>About Ridgeline Minerals Corp.</b></p><p>Ridgeline is a discovery focused gold-silver explorer with a proven management team and a 204km&#178; exploration portfolio across six projects in Nevada and Idaho, USA. More information about Ridgeline can be found at <a href=\"https://api.newsfilecorp.com/redirect/YYAZeTn8kV\">www.RidgelineMinerals.com</a>.</p><p><b>On behalf of the Board<br /></b><i>\"Chad Peters\"<br /></i>President &#38; CEO</p><p><b>Further Information:<br /></b>Chad Peters, P.Geo.<br />President &#38; CEO<br />Ridgeline Minerals Corp.<br />(775) 304-9773 | <a href=\"mailto:info@ridgelineminerals.com\">info@ridgelineminerals.com</a></p><p><b>Neither the TSX Venture Exchange nor its Regulation Service Provider (as that term is defined in the policies of the TSX Venture Exchange) accepts responsibility for the adequacy or accuracy of this press release.</b></p><p><b>Cautionary Note regarding Forward-Looking Statements</b></p><p><i>Statements contained in this press release that are not historical facts are \"forward-looking information\" or \"forward-looking statements\" (collectively, \"Forward-Looking Information\") within the meaning of applicable Canadian securities legislation and the United States Private Securities Litigation Reform Act of 1995. Forward-Looking Information includes, but is not limited to, the anticipated benefits of the Earn-In Agreement and the transaction contemplated thereby. The words \"potential\", \"anticipate\", \"meaningful\", \"discovery\", \"forecast\", \"believe\", \"estimate\", \"expect\", \"may\", \"will\", \"project\", \"plan\", \"historical\", \"historic\" and similar expressions are intended to be among the statements that identify Forward-Looking Information. Forward-Looking Information involves known and unknown risks, uncertainties and other factors which may cause the actual results to be materially different from any future results expressed or implied by the Forward-Looking Information. In preparing the Forward-Looking Information in this news release, Ridgeline has applied several material assumptions, including, but not limited to, assumptions that TSX Venture Exchange approval will be granted in a timely manner subject only to standard conditions; the current objectives concerning the Project can be achieved and that its other corporate activities will proceed as expected; that general business and economic conditions will not change in a materially adverse manner; and that all requisite information will be available in a timely manner. Forward-Looking Information involves known and unknown risks, uncertainties and other factors which may cause the actual results, performance, or achievements of Ridgeline to be materially different from any future results, performance or achievements expressed or implied by the Forward-Looking Information. Such risks and other factors include, among others, risks related to dependence on key personnel; risks related to unforeseen delays; risks related to historical data that has not been verified by the Company; as well as those factors discussed in Ridgeline's public disclosure record. Although Ridgeline has attempted to identify important factors that could affect Ridgeline and may cause actual actions, events, or results to differ materially from those described in Forward-Looking Information, there may be other factors that cause actions, events or results not to be as anticipated, estimated or intended. There can be no assurance that Forward-Looking Information will prove to be accurate, as actual results and future events could differ materially from those anticipated in such statements. Accordingly, readers should not place undue reliance on Forward-Looking Information. Except as required by law, Ridgeline does not assume any obligation to release publicly any revisions to Forward-Looking Information contained in this news release to reflect events or circumstances after the date hereof or to reflect the occurrence of unanticipated events.</i></p><p><u><i><font style=\"font-size: 11px;\">Sources</font></i></u></p><p><font style=\"font-size: 11px;\"><sup><i>1</i></sup><i>Delker Mine Historic Production (Page 57): Smith, R.M., 1976, Mineral resources of Elko County, Nevada: U.S. Geological Survey Open-File Report 76-56, 201 p.</i></font></p><p><sup><i><font style=\"font-size: 11px;\">2</font></i></sup><i><font style=\"font-size: 11px;\">Medicine Springs Results: <a href=\"https://api.newsfilecorp.com/redirect/R7xZeTaZq7\">https://reynasilver.com/system/uploads/RS-PressRelease-20230117.pdf</a></font></i></p><p id=\"corporateNewsLogoContainer\"><img src=\"https://images.newsfilecorp.com/files/7298/179674_1f511761d4096991_logo.jpg\" id=\"corporateNewsLogo\" alt=\"Corporate Logo\" /></p><p id=\"corporateLinkBack\">To view the source version of this press release, please visit <a href=\"https://api.newsfilecorp.com/redirect/0VBDyUy2bz\">https://www.newsfilecorp.com/release/179674</a></p>",
    "search_terms": "Big Blue,Ridgeline Minerals Corp.,RDG",
    "master_gid": 4027,
    "date": "2023-09-06T11:45:00.000Z",
    "tags": "USA|Nevada|||Project Acquisition",
    "image_id": null,
    "hidden": false,
    "company_id": 383,
    "provider": null,
    "excerpt": "Vancouver, British Columbia--(Newsfile Corp. - September 6, 2023) - Ridgeline Minerals Corp. (TSXV: RDG) (OTCQB: RDGMF) (FSE: 0GC0) (\"Ridgeline\" or the \"Company\") is pleased to announce the staking of an additional one hundred and forty-one (\"141\") Bureau of Land Management (\"BLM\") lode claims (2,913 acres) at the Big Blue project",
    "is_regulatory": false,
    "refined_tags": [
      "Project Acquisition"
    ],
    "ftp_filename": null,
    "company_name": "Ridgeline Minerals Corp.",
    "exchange": "TSXV",
    "root_ticker": "RDG",
    "project_name": "Big Blue",
    "gid": 4027,
    "location": "Nevada, United States",
    "plan_id": null,
    "description_text": "Vancouver, British Columbia--(Newsfile Corp. - September 6, 2023) - Ridgeline Minerals Corp. (TSXV: RDG) (OTCQB: RDGMF) (FSE: 0GC0) (\" Ridgeline \" or the \" Company \") is pleased to announce the staking of an additional one hundred and forty-one (\"141\") Bureau of Land Management (\" BLM \") lode claims (2,913 acres) at the Big Blue project (\"Big Blue\" or \"Project\") in Elko County, Nevada. Big Blue now comprises 502 contiguous lode claims totaling 10,168 acres or 41 square kilometers (\"km\") ( Figure 1 ), and is 100% owned by the Company with no underlying work commitments or royalty obligations. The property includes the past producing Delker Mine and Skarn Hill Adit, which collectively produced a reported 94,434 pounds of copper (\"Cu\") at an average grade of 6.2% Cu between 1916-1917 1 ( Figure 1 ). The Project has not seen a sustained exploration effort in decades and exhibits excellent potential to make new porphyry copper and Carbonate Replacement (\"CRD\") style polymetallic discoveries. The property expansion followed the Company's recently announced acquisition of an extensive historical database for Big Bluesee (August 24, 2023 press release HERE ), which has highlighted additional geophysical targets located to the northwest of the original claim block. This kilometer-scale target exhibits overlapping gravity and magnetic geophysics anomalies and is interpreted as a potential porphyry signature that may be the deeper source to the known Cu-skarn mineralization outcropping at the historical Delker Mine ( Figure 2 ). As a result, Ridgeline staked all open and locatable claims surrounding the porphyry target and will continue advancing Big Blue towards a maiden drill program in 2024. Chad Peters, President & CEO, commented, \"Big Blue continues to be a rapidly evolving project in our exploration pipeline. Our team is very encouraged by the scale of the geophysical anomaly's located on our new claim block, which suggests potential for a blind porphyry copper target at depth and distal CRD targets along strike. Until now, the Delker area has never been explored as a consolidated porphyry district and with this expansion we now control a target-rich land position with a robust geologic dataset to support our exploration model. We will continue to advance low-cost targeting and permitting initiatives through the remainder of this year while we prepare for a maiden drill campaign in 2024.\" Big Blue Project Big Blue is located in Elko County, Nevada, approximately seventy-five kilometers (\"km\") southeast of the city of Elko, NV. The Project includes the past producing Delker Mine, which produced a reported 94,434 pounds of copper at an average grade of 6.2% Cu between 1916-1917 1 and shares its southern boundary with Reyna Silver's Medicine Springs Ag-Pb-Zn Carbonate Replacement (\"CRD\") project. Mineralization occurs as outcropping, high-grade Cu occurrences located proximal to northeast trending felsic dikes that are interpreted as the zoned manifestations off a potential porphyry source, located in the northwest corner of the Big Blue property. Importantly, this target has never been drill-tested. The primary target at Big Blue is porphyry-skarn Cu ± Au-Ag mineralization, with potential to discover polymetallic, carbonate replacement deposit (CRD) style mineralization as the system zones outward over 6 kilometers of strike towards the Medicine Springs project. This target model is analogous to the Butte Valley porphyry Cu-Au system, which is inferred to be the source of CRD mineralization at the Company's nearby Selena project . Big Blue is 100% owned by the Company and is comprised of a total of 41 square kilometers of highly prospective exploration ground that has seen limited exploration since the early 1900's and will benefit from Ridgeline's systematic approach to discovery (view Ridgeline's Corporate Deck HERE ). Figure 1 : Plan view map showing the location of the 141 new claims (shaded blue) staked by Ridgeline to increase claims by ~33% to 502 contiguous lode claims. To view an enhanced version of this graphic, please visit: https://images.newsfilecorp.com/files/7298/179674_1f511761d4096991_002full.jpg Figure 2 : Plan view map on the left showing reduced to pole (\"RTP\") airborne magnetics highlighting kilometer scale magnetic \"highs\" at both the Delker Mine and to the northwest on Ridgeline's new claims. The map on the right shows Residual Gravity with a coincident high over proposed porphyry centers. Gravity also highlights a lower amplitude anomaly interpreted as a northeast trending structural corridor that trends southwest to the historical Golden Pipe mine (Ag-Pb-Zn) owned by Reyna Silver. To view an enhanced version of this graphic, please visit: https://images.newsfilecorp.com/files/7298/179674_1f511761d4096991_003full.jpg To view X-Section A-A' showing magnetics anomaly beneath the Delker Mine, click HERE . To view plan view maps showing Total Horizontal Gradient Magnetics and Residual gravity, click HERE . QAQC Procedures Samples are submitted to American Assay Laboratories (AAL) of Sparks, Nevada, which is a certified and accredited laboratory, independent of the Company. Samples are prepared using industry-standard prep methods and analysed using FA-PB30-ICP (Au; 30 g fire assay) and ICP-5AM48 (48 element Suite; 0.5 g 5-acid digestion/ICP-MS) methods. AAL also undertakes its own internal coarse and pulp duplicate analysis to ensure proper sample preparation and equipment calibration. Ridgeline's QA/QC program includes regular insertion of CRM standards, duplicates, and blanks into the sample stream with a stringent review of all results completed by the Company's Qualified Person, Michael T. Harp, Vice President, Exploration. Technical information contained in this news release has been reviewed and approved by Michael T. Harp, CPG. the Company's Vice President, Exploration, who is Ridgeline's Qualified Person under National Instrument 43-101 and responsible for technical matters of this release. About Ridgeline Minerals Corp. Ridgeline is a discovery focused gold-silver explorer with a proven management team and a 204km² exploration portfolio across six projects in Nevada and Idaho, USA. More information about Ridgeline can be found at www.RidgelineMinerals.com . On behalf of the Board \"Chad Peters\" President & CEO Further Information: Chad Peters, P.Geo. President & CEO Ridgeline Minerals Corp. (775) 304-9773 | info@ridgelineminerals.com Neither the TSX Venture Exchange nor its Regulation Service Provider (as that term is defined in the policies of the TSX Venture Exchange) accepts responsibility for the adequacy or accuracy of this press release. Cautionary Note regarding Forward-Looking Statements Statements contained in this press release that are not historical facts are \"forward-looking information\" or \"forward-looking statements\" (collectively, \"Forward-Looking Information\") within the meaning of applicable Canadian securities legislation and the United States Private Securities Litigation Reform Act of 1995. Forward-Looking Information includes, but is not limited to, the anticipated benefits of the Earn-In Agreement and the transaction contemplated thereby. The words \"potential\", \"anticipate\", \"meaningful\", \"discovery\", \"forecast\", \"believe\", \"estimate\", \"expect\", \"may\", \"will\", \"project\", \"plan\", \"historical\", \"historic\" and similar expressions are intended to be among the statements that identify Forward-Looking Information. Forward-Looking Information involves known and unknown risks, uncertainties and other factors which may cause the actual results to be materially different from any future results expressed or implied by the Forward-Looking Information. In preparing the Forward-Looking Information in this news release, Ridgeline has applied several material assumptions, including, but not limited to, assumptions that TSX Venture Exchange approval will be granted in a timely manner subject only to standard conditions; the current objectives concerning the Project can be achieved and that its other corporate activities will proceed as expected; that general business and economic conditions will not change in a materially adverse manner; and that all requisite information will be available in a timely manner. Forward-Looking Information involves known and unknown risks, uncertainties and other factors which may cause the actual results, performance, or achievements of Ridgeline to be materially different from any future results, performance or achievements expressed or implied by the Forward-Looking Information. Such risks and other factors include, among others, risks related to dependence on key personnel; risks related to unforeseen delays; risks related to historical data that has not been verified by the Company; as well as those factors discussed in Ridgeline's public disclosure record. Although Ridgeline has attempted to identify important factors that could affect Ridgeline and may cause actual actions, events, or results to differ materially from those described in Forward-Looking Information, there may be other factors that cause actions, events or results not to be as anticipated, estimated or intended. There can be no assurance that Forward-Looking Information will prove to be accurate, as actual results and future events could differ materially from those anticipated in such statements. Accordingly, readers should not place undue reliance on Forward-Looking Information. Except as required by law, Ridgeline does not assume any obligation to release publicly any revisions to Forward-Looking Information contained in this news release to reflect events or circumstances after the date hereof or to reflect the occurrence of unanticipated events. Sources 1 Delker Mine Historic Production (Page 57): Smith, R.M., 1976, Mineral resources of Elko County, Nevada: U.S. Geological Survey Open-File Report 76-56, 201 p. 2 Medicine Springs Results: https://reynasilver.com/system/uploads/RS-PressRelease-20230117.pdf To view the source version of this press release, please visit https://www.newsfilecorp.com/release/179674",
    "primary_commodity": "Cu"
  },
  "articleProject": {
    "gid": 4027,
    "project_name": "Big Blue",
    "location": "Nevada, United States"
  },
  "articleExchange": "TSXV",
  "articleCompanyId": 383,
  "articleTicker": "RDG",
  "articleCompanyName": "Ridgeline Minerals Corp.",
  "allOtherCompanyProjects": [
    {
      "company_id": 383,
      "gid": 1022,
      "project_name": "Swift",
      "location": "Nevada, USA"
    },
    {
      "company_id": 383,
      "gid": 4027,
      "project_name": "Big Blue",
      "location": "Nevada, United States"
    },
    {
      "company_id": 383,
      "gid": 10663,
      "project_name": "Eagle",
      "location": "Nevada, United States"
    },
    {
      "company_id": 383,
      "gid": 736,
      "project_name": "Selena",
      "location": "Nevada, USA"
    },
    {
      "company_id": 383,
      "gid": 5133,
      "project_name": "Black Ridge (Carlin East)",
      "location": "Nevada, United States"
    },
    {
      "company_id": 383,
      "gid": 9529,
      "project_name": "Atlas",
      "location": "Nevada, United States"
    },
    {
      "company_id": 383,
      "gid": 5206,
      "project_name": "Bell Creek",
      "location": "Nevada, United States"
    }
  ],
  "allOtherCompanyNews": [
    {
      "id": 106772,
      "company_id": 383,
      "title": "Ridgeline Minerals Sells Tungsten and Critical Metals Project to Midasco Capital Corp.",
      "link": null,
      "date": "2025-06-03T11:30:00.000Z",
      "hidden": false
    },
    {
      "id": 106239,
      "company_id": 383,
      "title": "Ridgeline Minerals Acquires High-Grade Oxide Gold Project, Further Consolidating Land Position at the Atlas Project, Nevada",
      "link": null,
      "date": "2025-05-29T12:00:00.000Z",
      "hidden": false
    },
    {
      "id": 104795,
      "company_id": 383,
      "title": "Ridgeline Minerals Provides Drill Program Updates for the Big Blue and Atlas Projects",
      "link": null,
      "date": "2025-05-15T12:00:00.000Z",
      "hidden": false
    },
    {
      "id": 99151,
      "company_id": 383,
      "title": "Ridgeline Minerals Provides 2025 Budget Guidance for the Selena CRD Project, Nevada",
      "link": null,
      "date": "2025-04-09T12:00:00.000Z",
      "hidden": false
    },
    {
      "id": 92101,
      "company_id": 383,
      "title": "Ridgeline Minerals Closes $500k Private Placement",
      "link": null,
      "date": "2025-03-21T19:37:00.000Z",
      "hidden": false
    },
    {
      "id": 91703,
      "company_id": 383,
      "title": "Ridgeline Minerals Announces Non-Brokered Private Placement",
      "link": null,
      "date": "2025-03-18T19:05:00.000Z",
      "hidden": false
    },
    {
      "id": 90987,
      "company_id": 383,
      "title": "Ridgeline Minerals Announces Remaining 2024 Drill Results and Provides 2025 Budget Guidance for the Swift Project, Nevada",
      "link": null,
      "date": "2025-03-13T12:00:00.000Z",
      "hidden": false
    },
    {
      "id": 90599,
      "company_id": 383,
      "title": "Ridgeline Minerals Commences Drill Program at the Big Blue Porphyry Cu-Au Project, Nevada",
      "link": "https://www.newsfilecorp.com/release/244074/Ridgeline-Minerals-Commences-Drill-Program-at-the-Big-Blue-Porphyry-CuAu-Project-Nevada",
      "date": "2025-03-11T12:00:00.000Z",
      "hidden": false
    },
    {
      "id": 89131,
      "company_id": 383,
      "title": "Ridgeline Minerals MT Survey Confirms High-Priority 2025 Drill Targets at the Selena CRD Project, Nevada",
      "link": "https://www.newsfilecorp.com/release/242238/Ridgeline-Minerals-MT-Survey-Confirms-HighPriority-2025-Drill-Targets-at-the-Selena-CRD-Project-Nevada",
      "date": "2025-02-25T13:00:00.000Z",
      "hidden": false
    },
    {
      "id": 87885,
      "company_id": 383,
      "title": "Ridgeline Minerals Closes $4.1 Million Private Placement",
      "link": "https://www.newsfilecorp.com/release/240899/Ridgeline-Minerals-Closes-4.1-Million-Private-Placement",
      "date": "2025-02-14T00:00:00.000Z",
      "hidden": false
    }
  ]
}
