{
  "article": {
    "id": 74097,
    "link": "https://www.newsfilecorp.com/release/225938/Scorpio-Gold-More-Than-Doubles-Land-Position-Further-Consolidates-Manhattan-District",
    "title": "Scorpio Gold More Than Doubles Land Position, Further Consolidates Manhattan District",
    "description": "<img src=\"https://api.newsfilecorp.com/newsinfo/225938/367\" id=\"367\" width=\"2\" height=\"2\" style=\"width: 1px;  height: 1px;border: 0px solid;\" /><p class=\"nfSubHeading\">Increases land position driven by review of historic exploration data</p><p>Vancouver, British Columbia--(Newsfile Corp. - October 8, 2024) - <b>Scorpio Gold Corporation (TSXV: SGN) (OTCQB: SRCRF) (FSE: RY9) (\"Scorpio Gold\" or the \"Company\") </b>is pleased to announce that it has significantly expanded its land position at its Manhattan project (the \"<b>Manhattan District</b>\"). The land package has increased from an existing position of <b>1,876 hectares of unpatented claims</b>, and <b>187 hectares of patented claims</b>, with the staking of <b>over 2,716 hectares </b>of new unpatented claims (the \"<b>New Claims</b>\"), bringing Scorpio Gold's new total land position to approximately <b>4,779 hectares</b> across the entire district.</p><p>The staking of the New Claims was driven by an extensive database review of historic exploration data spanning back 30 years, that was compiled by Kinross Gold Corporation (\"<b>Kinross</b>\") and Scorpio Gold. The historic database includes a full multi-element soil sampling program completed in 2014 by Kinross (see Figure 1), alongside over <b>100,000 metres</b> of historic drilling and multiple geophysical surveys (including gravity, magnetics, and resistivity surveys). Scorpio Gold has also identified historic drill results within the New Claims, with assays warranting their acquisition, and the Company is currently in the process of compiling the data and conducting Quality Assurance and Quality Control (QA/QC).</p><p>The Manhattan District has historically produced greater than <b>600,000 ounces</b> of gold from underground lode mining, open pit mining, and placer operations. Gold and silver resources in the district occur within a northwest-trending, northwest-plunging, faulted antiform.  Low sulfidation epithermal gold and silver mineralization occurs as structurally hosted stockwork veining and disseminations in the folded and thrust-faulted siliciclastic and carbonate rocks of the Cambrian Gold Hill and Ordovician Zanzibar Formations. Gold and silver mineralization is characterized by quartz-adularia-sericite-calcite alteration proximal to high-angle structures and low-angle thrust faulting. Carlin-type mineralization occurs in the eastern part of the Manhattan District where gold occurs in arsenian rims of pyrite and is associated with realgar and orpiment. Gold and silver mineralization is also observed as quartz-calcite veins in Tertiary volcanic rocks adjacent to the 24 Ma Manhattan Caldera.</p><p>\"The anomalous metals in soils from the expanded claim package are highlighted by elevated gold, arsenic, and antimony proximal to a low angle thrust contact between the Cambrian Gold Hill formation and overlying Zanzibar carbonate sequence. We believe the low angle faulting in the Manhattan District is correlated to the Late Devonian Roberts Mountains Thrust.  Regionally, the Roberts Mountains Thrust is associated with multiple bulk mineable gold deposits in northern and central Nevada\", stated Harrison Pokrandt, VP Exploration of Scorpio Gold.</p><p style=\"text-align: center;\"><a rel=\"nofollow\" href=\"https://images.newsfilecorp.com/files/9779/225938_c774db0b94275b68_002full.jpg\"><img src=\"https://images.newsfilecorp.com/files/9779/225938_c774db0b94275b68_002.jpg\" style=\"border-width: 0px;\" alt=\"Cannot view this image? Visit: https://images.newsfilecorp.com/files/9779/225938_c774db0b94275b68_002.jpg\" /></a><br /><br />Figure 1: Manhattan District Expanded Claims 2024<br /><br />To view an enhanced version of this graphic, please visit:<br /><a rel=\"nofollow\" href=\"https://images.newsfilecorp.com/files/9779/225938_c774db0b94275b68_002full.jpg\">https://images.newsfilecorp.com/files/9779/225938_c774db0b94275b68_002full.jpg</a></p><p><b>Qualified Person</b><br />The technical information in this news release has been reviewed and approved by Thomas Poitras, P.Geo., a \"Qualified Person\", as defined under National Instrument 43-101 <i>Standards of Disclosure for Mineral Projects</i>.</p><p><b>About Scorpio Gold Corp.</b><br />Scorpio Gold holds a 100% interest in two past producing mines, the Manhattan Mine and the Mineral Ridge Mine, both located in the Walker Lane Trend of Nevada, USA. Scorpio's Manhattan District comprises the advanced exploration-stage Goldwedge Project, with a 400 ton per day gravity mill. Adjacent to Goldwedge is the ~4,780-hectare Manhattan Project, centered on two past-producing pits, acquired from Kinross in 2021. The consolidated Manhattan District presents an exciting late-stage exploration opportunity, with over 100,000+ metres of historical drilling, with significant resource potential, alongside valuable permitting. Scorpio Gold also holds a 100% interest in the Mineral Ridge gold project located in Esmeralda County, Nevada. Scorpio produced over 222,440 oz of gold at Mineral Ridge between 2010 and 2020. With a proven and probable resource, valuable permits, water rights, infrastructure, and the recently acquired adjacent North Star exploration target, Mineral Ridge has significant near-term development potential.</p><p><b>ON BEHALF OF THE BOARD OF SCORPIO GOLD CORPORATION</b></p><div id=\"contactInfo\"><p><b>Zayn Kalyan, Chief Executive Officer and Director</b><br />Tel: (604) 252-2672<br />Email: <a href=\"mailto:zayn@altuscapital.ca\">zayn@scorpiogold.com</a>  </p><p><b>Investor Relations Contact:</b><br />Kin Communications Inc.<br />Tel: (604) 684-6730<br />Email: <a href=\"mailto:SGN@kincommunications.com\">SGN@kincommunications.com</a></p></div><p><b>Connect with Scorpio Gold:</b><br /><a href=\"mailto:zayn@scorpiogold.com\">Email</a> | <a href=\"https://api.newsfilecorp.com/redirect/0V4wRT4ODb\">Website</a> | <a href=\"https://api.newsfilecorp.com/redirect/R7m0oixEB1\">Facebook</a> | <a href=\"https://api.newsfilecorp.com/redirect/W0oKpTAgPb\">LinkedIn</a> | <a href=\"https://api.newsfilecorp.com/redirect/q85R4UWj3K\">X</a> | <a href=\"https://api.newsfilecorp.com/redirect/nVmprT3Vgj\">YouTube</a><br />To register for investor updates please visit: <a href=\"https://api.newsfilecorp.com/redirect/K8zoGUrkjw\">scorpiogold.com</a><br /><b>(TSXV: SGN)&#160;(OTCQB: SRCRF)&#160;(FSE: RY9)</b></p><p><i><b>Forward-Looking Statements </b></i></p><p><i>The Company relies on litigation protection for forward-looking statements. This news release contains forward-looking statements that are based on the Company's current expectations and estimates. Forward-looking statements are frequently characterized by words such as \"plan\", \"expect\", \"project\", \"intend\", \"believe\", \"anticipate\", \"estimate\", \"suggest\", \"indicate\" and other similar words or statements that certain events or conditions \"may\" or \"will\" occur, and include, without limitation, statements regarding: whether the low angle faulting in the Manhattan District is correlated to the Late Devonian Roberts Mountains Thrust; the resource potential of the Manhattan District, including the New Claims; and the near-term development potential of Mineral Ridge. There is significant risk that the forward-looking statements will not prove to be accurate, that the management's assumptions may not be correct and that actual results may differ materially from such forward-looking statements. Such forward-looking statements involve known and unknown risks, uncertainties and other factors that could cause actual events or results to differ materially from estimated or anticipated events or results implied or expressed in such forward-looking statements, including those risk factors outlined in the Company's Management Discussion and Analysis as filed on SEDAR+. Any forward-looking statement speaks only as of the date on which it is made and, except as may be required by applicable securities laws, the Company disclaims any intent or obligation to update any forward-looking statement, whether as a result of new information, future events or results or otherwise. Forward-looking statements are not guarantees of future performance and accordingly undue reliance should not be put on such statements due to the inherent uncertainty thereof. </i></p><p style=\"text-align: center;\"><i>Neither the TSX Venture Exchange nor its Regulation Services Provider (as that term is defined in the policies of the Exchange) accepts responsibility for the adequacy or accuracy of this release.</i></p><p id=\"corporateLinkBack\">To view the source version of this press release, please visit <a href=\"https://api.newsfilecorp.com/redirect/EyqQVH7zXp\">https://www.newsfilecorp.com/release/225938</a></p>",
    "search_terms": "Manhattan-Goldwedge,Scorpio Gold Corporation,SGN",
    "master_gid": 1004,
    "date": "2024-10-08T12:30:00.000Z",
    "tags": "Canada|||Gold|Project Acquisition",
    "image_id": null,
    "hidden": false,
    "company_id": 1710,
    "provider": "newsfilecorp",
    "excerpt": "Increases land position driven by review of historic exploration dataVancouver, British Columbia--(Newsfile Corp. - October 8, 2024) -Scorpio Gold Corporation (TSXV: SGN) (OTCQB: SRCRF) (FSE: RY9) (\"Scorpio Gold\" or the \"Company\")is pleased to announce that it has significantly expanded its land position at its Manhattan project (the \"Manhattan District\"). The",
    "is_regulatory": false,
    "refined_tags": null,
    "ftp_filename": null,
    "company_name": "Scorpio Gold Corporation",
    "exchange": "TSXV",
    "root_ticker": "SGN",
    "project_name": "Manhattan",
    "gid": 1004,
    "location": "Nevada, USA",
    "plan_id": null,
    "description_text": "Increases land position driven by review of historic exploration data Vancouver, British Columbia--(Newsfile Corp. - October 8, 2024) - Scorpio Gold Corporation (TSXV: SGN) (OTCQB: SRCRF) (FSE: RY9) (\"Scorpio Gold\" or the \"Company\") is pleased to announce that it has significantly expanded its land position at its Manhattan project (the \" Manhattan District \"). The land package has increased from an existing position of 1,876 hectares of unpatented claims , and 187 hectares of patented claims , with the staking of over 2,716 hectares of new unpatented claims (the \" New Claims \"), bringing Scorpio Gold's new total land position to approximately 4,779 hectares across the entire district. The staking of the New Claims was driven by an extensive database review of historic exploration data spanning back 30 years, that was compiled by Kinross Gold Corporation (\" Kinross \") and Scorpio Gold. The historic database includes a full multi-element soil sampling program completed in 2014 by Kinross (see Figure 1), alongside over 100,000 metres of historic drilling and multiple geophysical surveys (including gravity, magnetics, and resistivity surveys). Scorpio Gold has also identified historic drill results within the New Claims, with assays warranting their acquisition, and the Company is currently in the process of compiling the data and conducting Quality Assurance and Quality Control (QA/QC). The Manhattan District has historically produced greater than 600,000 ounces of gold from underground lode mining, open pit mining, and placer operations. Gold and silver resources in the district occur within a northwest-trending, northwest-plunging, faulted antiform.  Low sulfidation epithermal gold and silver mineralization occurs as structurally hosted stockwork veining and disseminations in the folded and thrust-faulted siliciclastic and carbonate rocks of the Cambrian Gold Hill and Ordovician Zanzibar Formations. Gold and silver mineralization is characterized by quartz-adularia-sericite-calcite alteration proximal to high-angle structures and low-angle thrust faulting. Carlin-type mineralization occurs in the eastern part of the Manhattan District where gold occurs in arsenian rims of pyrite and is associated with realgar and orpiment. Gold and silver mineralization is also observed as quartz-calcite veins in Tertiary volcanic rocks adjacent to the 24 Ma Manhattan Caldera. \"The anomalous metals in soils from the expanded claim package are highlighted by elevated gold, arsenic, and antimony proximal to a low angle thrust contact between the Cambrian Gold Hill formation and overlying Zanzibar carbonate sequence. We believe the low angle faulting in the Manhattan District is correlated to the Late Devonian Roberts Mountains Thrust.  Regionally, the Roberts Mountains Thrust is associated with multiple bulk mineable gold deposits in northern and central Nevada\", stated Harrison Pokrandt, VP Exploration of Scorpio Gold. Figure 1: Manhattan District Expanded Claims 2024 To view an enhanced version of this graphic, please visit: https://images.newsfilecorp.com/files/9779/225938_c774db0b94275b68_002full.jpg Qualified Person The technical information in this news release has been reviewed and approved by Thomas Poitras, P.Geo., a \"Qualified Person\", as defined under National Instrument 43-101 Standards of Disclosure for Mineral Projects . About Scorpio Gold Corp. Scorpio Gold holds a 100% interest in two past producing mines, the Manhattan Mine and the Mineral Ridge Mine, both located in the Walker Lane Trend of Nevada, USA. Scorpio's Manhattan District comprises the advanced exploration-stage Goldwedge Project, with a 400 ton per day gravity mill. Adjacent to Goldwedge is the ~4,780-hectare Manhattan Project, centered on two past-producing pits, acquired from Kinross in 2021. The consolidated Manhattan District presents an exciting late-stage exploration opportunity, with over 100,000+ metres of historical drilling, with significant resource potential, alongside valuable permitting. Scorpio Gold also holds a 100% interest in the Mineral Ridge gold project located in Esmeralda County, Nevada. Scorpio produced over 222,440 oz of gold at Mineral Ridge between 2010 and 2020. With a proven and probable resource, valuable permits, water rights, infrastructure, and the recently acquired adjacent North Star exploration target, Mineral Ridge has significant near-term development potential. ON BEHALF OF THE BOARD OF SCORPIO GOLD CORPORATION Zayn Kalyan, Chief Executive Officer and Director Tel: (604) 252-2672 Email: zayn@scorpiogold.com Investor Relations Contact: Kin Communications Inc. Tel: (604) 684-6730 Email: SGN@kincommunications.com Connect with Scorpio Gold: Email | Website | Facebook | LinkedIn | X | YouTube To register for investor updates please visit: scorpiogold.com (TSXV: SGN) (OTCQB: SRCRF) (FSE: RY9) Forward-Looking Statements The Company relies on litigation protection for forward-looking statements. This news release contains forward-looking statements that are based on the Company's current expectations and estimates. Forward-looking statements are frequently characterized by words such as \"plan\", \"expect\", \"project\", \"intend\", \"believe\", \"anticipate\", \"estimate\", \"suggest\", \"indicate\" and other similar words or statements that certain events or conditions \"may\" or \"will\" occur, and include, without limitation, statements regarding: whether the low angle faulting in the Manhattan District is correlated to the Late Devonian Roberts Mountains Thrust; the resource potential of the Manhattan District, including the New Claims; and the near-term development potential of Mineral Ridge. There is significant risk that the forward-looking statements will not prove to be accurate, that the management's assumptions may not be correct and that actual results may differ materially from such forward-looking statements. Such forward-looking statements involve known and unknown risks, uncertainties and other factors that could cause actual events or results to differ materially from estimated or anticipated events or results implied or expressed in such forward-looking statements, including those risk factors outlined in the Company's Management Discussion and Analysis as filed on SEDAR+. Any forward-looking statement speaks only as of the date on which it is made and, except as may be required by applicable securities laws, the Company disclaims any intent or obligation to update any forward-looking statement, whether as a result of new information, future events or results or otherwise. Forward-looking statements are not guarantees of future performance and accordingly undue reliance should not be put on such statements due to the inherent uncertainty thereof. Neither the TSX Venture Exchange nor its Regulation Services Provider (as that term is defined in the policies of the Exchange) accepts responsibility for the adequacy or accuracy of this release. To view the source version of this press release, please visit https://www.newsfilecorp.com/release/225938",
    "primary_commodity": "Au"
  },
  "articleProject": {
    "gid": 1004,
    "project_name": "Manhattan",
    "location": "Nevada, USA"
  },
  "articleExchange": "TSXV",
  "articleCompanyId": 1710,
  "articleTicker": "SGN",
  "articleCompanyName": "Scorpio Gold Corporation",
  "allOtherCompanyProjects": [
    {
      "company_id": 1710,
      "gid": 1004,
      "project_name": "Manhattan",
      "location": "Nevada, USA"
    }
  ],
  "allOtherCompanyNews": [
    {
      "id": 106018,
      "company_id": 1710,
      "title": "Scorpio Gold Appoints Leo Hathaway as Executive Technical Director",
      "link": null,
      "date": "2025-05-28T10:00:00.000Z",
      "hidden": false
    },
    {
      "id": 100463,
      "company_id": 1710,
      "title": "Scorpio Gold Closes Over-Subscribed Final Tranche of Private Placement, Bringing Gross Proceeds Raised to Over $7 million",
      "link": null,
      "date": "2025-04-22T20:28:00.000Z",
      "hidden": false
    },
    {
      "id": 99947,
      "company_id": 1710,
      "title": "Scorpio Gold Announces Completion of $5.4 million First Tranche of Financing and Upsize of Total Financing to Over $7 million",
      "link": null,
      "date": "2025-04-16T01:03:00.000Z",
      "hidden": false
    },
    {
      "id": 98251,
      "company_id": 1710,
      "title": "Scorpio Gold Announces Plan to Close Over-Subscribed First Tranche of Private Placement for Over $5.4 million",
      "link": null,
      "date": "2025-03-31T23:14:00.000Z",
      "hidden": false
    },
    {
      "id": 89619,
      "company_id": 1710,
      "title": "Scorpio Gold Announces $3.5 Million Private Placement",
      "link": "https://www.newsfilecorp.com/release/242756/Scorpio-Gold-Announces-3.5-Million-Private-Placement",
      "date": "2025-02-27T21:41:00.000Z",
      "hidden": false
    },
    {
      "id": 85163,
      "company_id": 1710,
      "title": "Scorpio Gold Provides 2024 Summary to Shareholders",
      "link": "https://www.newsfilecorp.com/release/238290/Scorpio-Gold-Provides-2024-Summary-to-Shareholders",
      "date": "2025-01-24T13:00:00.000Z",
      "hidden": false
    },
    {
      "id": 81586,
      "company_id": 1710,
      "title": "Scorpio Gold Drills 1.69 g/t Gold over 55.7 Metres at the Manhattan District, Nevada",
      "link": "https://www.newsfilecorp.com/release/233309/Scorpio-Gold-Drills-1.69-gt-Gold-over-55.7-Metres-at-the-Manhattan-District-Nevada",
      "date": "2024-12-11T11:00:00.000Z",
      "hidden": false
    },
    {
      "id": 78438,
      "company_id": 1710,
      "title": "Scorpio Gold Participates in 121 Mining Investment Dubai and Embarks on European Roadshows",
      "link": "https://www.newsfilecorp.com/release/229359/Scorpio-Gold-Participates-in-121-Mining-Investment-Dubai-and-Embarks-on-European-Roadshows",
      "date": "2024-11-12T10:30:00.000Z",
      "hidden": false
    },
    {
      "id": 77505,
      "company_id": 1710,
      "title": "Scorpio Announces Appointment of Jeff Lindstrom as VP Operations",
      "link": "https://www.newsfilecorp.com/release/228604/Scorpio-Announces-Appointment-of-Jeff-Lindstrom-as-VP-Operations",
      "date": "2024-11-01T21:00:00.000Z",
      "hidden": false
    },
    {
      "id": 77155,
      "company_id": 1710,
      "title": "Scorpio Appoints Leo Hathaway as Technical Advisor, Further Strengthens Team",
      "link": "https://www.newsfilecorp.com/release/228434/Scorpio-Appoints-Leo-Hathaway-as-Technical-Advisor-Further-Strengthens-Team",
      "date": "2024-10-31T09:30:00.000Z",
      "hidden": false
    }
  ]
}
