{
  "article": {
    "id": 50434,
    "link": "https://www.newsfilecorp.com/release/201476/Blackrock-Silver-Exercises-Option-to-Buy-Tonopah-West-Project",
    "title": "Blackrock Silver Exercises Option to Buy Tonopah West Project",
    "description": "<img src=\"https://api.newsfilecorp.com/newsinfo/201476/367\" id=\"367\" width=\"2\" height=\"2\" style=\"width: 1px;  height: 1px;border: 0px solid;\" /><p>Vancouver, British Columbia--(Newsfile Corp. - March 13, 2024) - Blackrock Silver Corp. (TSXV: BRC) (the \"<b>Company</b>\" or \"<b>Blackrock</b>\") is pleased to announce that the Company has exercised its option (the \"<b>Option</b>\") to acquire a 100% interest in the Tonopah West project (\"<b>Tonopah West</b>\") pursuant to an option agreement dated February 24, 2020 (the \"<b>Option Agreement</b>\") between the Company's wholly-owned Nevada subsidiary, Blackrock Gold Corp., and Nevada Select Royalty, Inc. (\"<b>Nevada Select Royalty</b>\"), a wholly-owned subsidiary of Gold Royalty Corp. Tonopah West consists of 101 patented and 19 unpatented lode mining claims covering mineral rights on approximately 1,380 acres (558.5 hectares) located within the historic Tonopah silver district in the Walker Lane trend of Western Nevada.</p><p>Andrew Pollard, President and Chief Executive Officer of the Company, commented: \"In the four years since we first optioned Tonopah West, it has quickly emerged as one of the best silver discoveries of the decade, cementing its status as the highest-grade undeveloped large silver project in the world<sup>1</sup>, and we're excited to now complete our acquisition granting us 100% ownership of the property. With title in-hand, we are now squarely in the driver's seat to continue on our mission to quickly de-risk and advance the project through further engineering, hydrologic and metallurgic studies, while pursuing the vast resource expansion potential.\"  </p><p>David Garofalo, Chairman and Chief Executive Officer of Gold Royalty Corp, commented, \"The Blackrock team has delivered significant value with their advancement of the Tonopah West project, which has quickly become one of the most exciting precious metals projects in Nevada. We are encouraged to have continued exposure to the project through our royalty interest, and for Blackrock to continue to deliver on their strategy of unlocking the value of the project.\"  </p><p>In connection with the exercise of the Option to acquire Tonopah West, the Company made payments to Nevada Select Royalty totalling US$3 million over a 4-year term, with a final cash payment in the amount of US$1,000,000. </p><p>Pursuant to the terms of the Option Agreement, Nevada Select Royalty retained a net smelter returns royalty (the \"<b>Royalty</b>\") on Tonopah West equal to 3.0% of the net value of all precious and base metals, products and materials of commercial value mined and removed from Tonopah West and sold by the Company. Under the terms of the royalty agreement (the \"<b>NSR Agreement</b>\"), the Company is required to pay Nevada Select Royalty an annual advance minimum royalty of US$50,000 (each, an \"<b>Advance Royalty Payment</b>\") until the earlier of the commencement of commercial production at Tonopah West or the twentieth (20th) anniversary of the effective date of the NSR Agreement. All Advance Royalty Payments made by the Company will be credited towards any future royalty payments to Nevada Select Royalty.</p><p>The Royalty also covers 64 unpatented claims staked by the Company in July 2021 which fall within the one (1) mile area of interest delineated by the Option Agreement. Such additional claims cover 1,280 acres (518 hectares) bringing Tonopah West to a total size of 2,660 acres (1076.5 hectares).</p><p><b>About Blackrock Silver Corp. </b></p><p>Backed by gold and silver ounces in the ground, Blackrock is a junior precious metal focused exploration company driven to add shareholder value via the drill bit. With 6.12 million tonnes grading 508.5 g/t silver equivalent<sup>2</sup>&#160;at its Tonopah West project, and a new bonanza-grade gold discovery at its Silver Cloud project, the Company has a proven track record of exploration success. In addition to its gold and silver project portfolio, the Company is credited with a lithium discovery, the Tonopah North project, which is under option to a lithium exploration group.  Anchored by a seasoned Board of Directors, the Company is focused on its 100% controlled Nevada portfolio of properties consisting of low-sulphidation, epithermal gold and silver mineralization located along the established Northern Nevada Rift in north-central Nevada and the Walker Lane trend in western Nevada.</p><p>For further information, please contact:</p><p>Andrew Pollard, President &#38; Chief Executive Officer<br />Blackrock Silver Corp.<br />Phone: 604 817-6044<br />Email: <a href=\"mailto:andrew@blackrocksilver.com\">andrew@blackrocksilver.com</a></p><p><i><b>Forward-Looking Statements</b></i></p><p><i>This news release contains \"forward-looking statements\" within the meaning of Canadian securities legislation. Such forward-looking statements concern, without limitation: the Company's intentions to de-risk and advance Tonopah West through further engineering, hydrologic and metallurgic studies for the purposes of realizing resource expansion potential</i>. <i>Such forward-looking statements or information are based on a number of assumptions, which may prove to be incorrect. Assumptions have been made regarding, among other things: conditions in general economic and financial markets; accuracy of assay results; geological interpretations from drilling results, timing and amount of capital expenditures; performance of available laboratory and other related services; future operating costs; and the historical basis for current estimates of potential quantities and grades of target zones. The actual results could differ materially from those anticipated in these forward-looking statements as a result of  risk factors, including: the timing and content of work programs; results of exploration activities and development of mineral properties; the interpretation and uncertainties of drilling results and other geological data; receipt, maintenance and security of permits and mineral property titles; environmental and other regulatory risks; project costs overruns or unanticipated costs and expenses; availability of funds; failure to delineate potential quantities and grades of the target zones based on historical data, and general market and industry conditions. Forward-looking statements are based on the expectations and opinions of the Company's management on the date the statements are made. The assumptions used in the preparation of such statements, although considered reasonable at the time of preparation, may prove to be imprecise and, as such, readers are cautioned not to place undue reliance on these forward-looking statements, which speak only as of the date the statements were made. The Company undertakes no obligation to update or revise any forward-looking statements included in this news release if these beliefs, estimates and opinions or other circumstances should change, except as otherwise required by applicable law.</i></p><p><i>Neither TSX Venture Exchange nor its Regulation Services Provider (as that term is defined in policies of the TSX Venture Exchange) accepts responsibility for the adequacy or accuracy of this release.</i></p><hr style=\"width: 33%; margin-left: 0px; border-top: 1px solid #000000;\" /><p><font style=\"font-size: 11px;\"><sup>1</sup>&#160;As of March 11<sup>th</sup>, 2024. Sourced from S&#38;P Capital IQ for deposits greater than 80M AgEq ounces (MI+I).</font></p><p><font style=\"font-size: 11px;\"><sup>2</sup>&#160;Technical information relating to the Tonopah West project is based on and derived from the National Instrument 43-101 technical report prepared for Blackrock entitled \"Technical Report for Updated Estimate of Mineral Resources, Tonopah West Silver-Gold Project, Nye and Esmeralda Counties, Nevada, USA\" effective October 6, 2023 and dated November 8, 2023 authored by Jeffrey Bickel, C.P.G. (the \"<b>Technical Report</b>\"). The Technical Report outlines 6.12 million tonnes at a block diluted grade of 242 grams per tonne (g/t) silver (Ag) and 2.9g/t gold (Au) for a total inferred mineral resource of 47,738,000 ounces Ag and 570,000 ounces Au, or 508.5 g/t silver equivalent (AgEq) for 100.04 million oz AgEq. AgEq equivalent grade is based on silver and gold prices of US$22/ounce and US$1,850/ounce, respectively, and recoveries for silver and gold of 87% and 95%, respectively.</font></p><p id=\"corporateLinkBack\">To view the source version of this press release, please visit <a href=\"https://api.newsfilecorp.com/redirect/7WonQc834Y\">https://www.newsfilecorp.com/release/201476</a></p>",
    "search_terms": "Tonopah West,Blackrock Silver Corp.,BRC",
    "master_gid": 992,
    "date": "2024-03-13T10:15:00.000Z",
    "tags": "USA|Nevada||Gold,Silver|Project Acquisition",
    "image_id": null,
    "hidden": false,
    "company_id": 474,
    "provider": null,
    "excerpt": "Vancouver, British Columbia--(Newsfile Corp. - March 13, 2024) - Blackrock Silver Corp. (TSXV: BRC) (the \"Company\" or \"Blackrock\") is pleased to announce that the Company has exercised its option (the \"Option\") to acquire a 100% interest in the Tonopah West project (\"Tonopah West\") pursuant to an option agreement dated February",
    "is_regulatory": false,
    "refined_tags": [
      "Project Acquisition"
    ],
    "ftp_filename": null,
    "company_name": "Blackrock Silver Corp.",
    "exchange": "TSXV",
    "root_ticker": "BRC",
    "project_name": "Tonopah West",
    "gid": 992,
    "location": "Nevada, USA",
    "plan_id": null,
    "description_text": "Vancouver, British Columbia--(Newsfile Corp. - March 13, 2024) - Blackrock Silver Corp. (TSXV: BRC) (the \" Company \" or \" Blackrock \") is pleased to announce that the Company has exercised its option (the \" Option \") to acquire a 100% interest in the Tonopah West project (\" Tonopah West \") pursuant to an option agreement dated February 24, 2020 (the \" Option Agreement \") between the Company's wholly-owned Nevada subsidiary, Blackrock Gold Corp., and Nevada Select Royalty, Inc. (\" Nevada Select Royalty \"), a wholly-owned subsidiary of Gold Royalty Corp. Tonopah West consists of 101 patented and 19 unpatented lode mining claims covering mineral rights on approximately 1,380 acres (558.5 hectares) located within the historic Tonopah silver district in the Walker Lane trend of Western Nevada. Andrew Pollard, President and Chief Executive Officer of the Company, commented: \"In the four years since we first optioned Tonopah West, it has quickly emerged as one of the best silver discoveries of the decade, cementing its status as the highest-grade undeveloped large silver project in the world 1 , and we're excited to now complete our acquisition granting us 100% ownership of the property. With title in-hand, we are now squarely in the driver's seat to continue on our mission to quickly de-risk and advance the project through further engineering, hydrologic and metallurgic studies, while pursuing the vast resource expansion potential.\" David Garofalo, Chairman and Chief Executive Officer of Gold Royalty Corp, commented, \"The Blackrock team has delivered significant value with their advancement of the Tonopah West project, which has quickly become one of the most exciting precious metals projects in Nevada. We are encouraged to have continued exposure to the project through our royalty interest, and for Blackrock to continue to deliver on their strategy of unlocking the value of the project.\" In connection with the exercise of the Option to acquire Tonopah West, the Company made payments to Nevada Select Royalty totalling US$3 million over a 4-year term, with a final cash payment in the amount of US$1,000,000. Pursuant to the terms of the Option Agreement, Nevada Select Royalty retained a net smelter returns royalty (the \" Royalty \") on Tonopah West equal to 3.0% of the net value of all precious and base metals, products and materials of commercial value mined and removed from Tonopah West and sold by the Company. Under the terms of the royalty agreement (the \" NSR Agreement \"), the Company is required to pay Nevada Select Royalty an annual advance minimum royalty of US$50,000 (each, an \" Advance Royalty Payment \") until the earlier of the commencement of commercial production at Tonopah West or the twentieth (20th) anniversary of the effective date of the NSR Agreement. All Advance Royalty Payments made by the Company will be credited towards any future royalty payments to Nevada Select Royalty. The Royalty also covers 64 unpatented claims staked by the Company in July 2021 which fall within the one (1) mile area of interest delineated by the Option Agreement. Such additional claims cover 1,280 acres (518 hectares) bringing Tonopah West to a total size of 2,660 acres (1076.5 hectares). About Blackrock Silver Corp. Backed by gold and silver ounces in the ground, Blackrock is a junior precious metal focused exploration company driven to add shareholder value via the drill bit. With 6.12 million tonnes grading 508.5 g/t silver equivalent 2 at its Tonopah West project, and a new bonanza-grade gold discovery at its Silver Cloud project, the Company has a proven track record of exploration success. In addition to its gold and silver project portfolio, the Company is credited with a lithium discovery, the Tonopah North project, which is under option to a lithium exploration group.  Anchored by a seasoned Board of Directors, the Company is focused on its 100% controlled Nevada portfolio of properties consisting of low-sulphidation, epithermal gold and silver mineralization located along the established Northern Nevada Rift in north-central Nevada and the Walker Lane trend in western Nevada. For further information, please contact: Andrew Pollard, President & Chief Executive Officer Blackrock Silver Corp. Phone: 604 817-6044 Email: andrew@blackrocksilver.com Forward-Looking Statements This news release contains \"forward-looking statements\" within the meaning of Canadian securities legislation. Such forward-looking statements concern, without limitation: the Company's intentions to de-risk and advance Tonopah West through further engineering, hydrologic and metallurgic studies for the purposes of realizing resource expansion potential . Such forward-looking statements or information are based on a number of assumptions, which may prove to be incorrect. Assumptions have been made regarding, among other things: conditions in general economic and financial markets; accuracy of assay results; geological interpretations from drilling results, timing and amount of capital expenditures; performance of available laboratory and other related services; future operating costs; and the historical basis for current estimates of potential quantities and grades of target zones. The actual results could differ materially from those anticipated in these forward-looking statements as a result of  risk factors, including: the timing and content of work programs; results of exploration activities and development of mineral properties; the interpretation and uncertainties of drilling results and other geological data; receipt, maintenance and security of permits and mineral property titles; environmental and other regulatory risks; project costs overruns or unanticipated costs and expenses; availability of funds; failure to delineate potential quantities and grades of the target zones based on historical data, and general market and industry conditions. Forward-looking statements are based on the expectations and opinions of the Company's management on the date the statements are made. The assumptions used in the preparation of such statements, although considered reasonable at the time of preparation, may prove to be imprecise and, as such, readers are cautioned not to place undue reliance on these forward-looking statements, which speak only as of the date the statements were made. The Company undertakes no obligation to update or revise any forward-looking statements included in this news release if these beliefs, estimates and opinions or other circumstances should change, except as otherwise required by applicable law. Neither TSX Venture Exchange nor its Regulation Services Provider (as that term is defined in policies of the TSX Venture Exchange) accepts responsibility for the adequacy or accuracy of this release. 1 As of March 11 th , 2024. Sourced from S&P Capital IQ for deposits greater than 80M AgEq ounces (MI+I). 2 Technical information relating to the Tonopah West project is based on and derived from the National Instrument 43-101 technical report prepared for Blackrock entitled \"Technical Report for Updated Estimate of Mineral Resources, Tonopah West Silver-Gold Project, Nye and Esmeralda Counties, Nevada, USA\" effective October 6, 2023 and dated November 8, 2023 authored by Jeffrey Bickel, C.P.G. (the \" Technical Report \"). The Technical Report outlines 6.12 million tonnes at a block diluted grade of 242 grams per tonne (g/t) silver (Ag) and 2.9g/t gold (Au) for a total inferred mineral resource of 47,738,000 ounces Ag and 570,000 ounces Au, or 508.5 g/t silver equivalent (AgEq) for 100.04 million oz AgEq. AgEq equivalent grade is based on silver and gold prices of US$22/ounce and US$1,850/ounce, respectively, and recoveries for silver and gold of 87% and 95%, respectively. To view the source version of this press release, please visit https://www.newsfilecorp.com/release/201476",
    "primary_commodity": "Ag"
  },
  "articleProject": {
    "gid": 992,
    "project_name": "Tonopah West",
    "location": "Nevada, USA"
  },
  "articleExchange": "TSXV",
  "articleCompanyId": 474,
  "articleTicker": "BRC",
  "articleCompanyName": "Blackrock Silver Corp.",
  "allOtherCompanyProjects": [
    {
      "company_id": 474,
      "gid": 680,
      "project_name": "Silver Cloud",
      "location": "Nevada, USA"
    },
    {
      "company_id": 474,
      "gid": 3884,
      "project_name": "Tonopah North",
      "location": "Nevada, United States"
    },
    {
      "company_id": 474,
      "gid": 992,
      "project_name": "Tonopah West",
      "location": "Nevada, USA"
    }
  ],
  "allOtherCompanyNews": [
    {
      "id": 108257,
      "company_id": 474,
      "title": "Blackrock Silver Drills Multiple +1 kg/t AgEq Intercepts and Establishes Grade Continuity over 350 Metres in Final M&I Conversion Assays at Tonopah West",
      "link": null,
      "date": "2025-06-17T08:00:00.000Z",
      "hidden": false
    },
    {
      "id": 104733,
      "company_id": 474,
      "title": "Blackrock Silver Begins Placement of Hydrologic Monitoring Wells at Tonopah West",
      "link": null,
      "date": "2025-05-15T09:30:00.000Z",
      "hidden": false
    },
    {
      "id": 103975,
      "company_id": 474,
      "title": "Blackrock Drills 4.2m of 700 g/t AgEq (Including 0.3m of 3,182 g/t AgEq) and Reports Multiple +1 kg/t AgEq Intercepts at Tonopah West",
      "link": null,
      "date": "2025-05-08T08:00:00.000Z",
      "hidden": false
    },
    {
      "id": 103323,
      "company_id": 474,
      "title": "Blackrock Silver Announces Filing of Amended Tonopah West Technical Report",
      "link": null,
      "date": "2025-05-02T22:00:00.000Z",
      "hidden": false
    },
    {
      "id": 93021,
      "company_id": 474,
      "title": "Blackrock Silver Steps Out 1.2km Across New High-Grade Zone at Tonopah West",
      "link": null,
      "date": "2025-03-31T08:01:00.000Z",
      "hidden": false
    },
    {
      "id": 90324,
      "company_id": 474,
      "title": "Blackrock Silver Engages ICP Securities for Automated Market Making Services",
      "link": "https://www.newsfilecorp.com/release/243628/Blackrock-Silver-Engages-ICP-Securities-for-Automated-Market-Making-Services",
      "date": "2025-03-07T13:30:00.000Z",
      "hidden": false
    },
    {
      "id": 88908,
      "company_id": 474,
      "title": "Blackrock Silver Steps Out and Hits Multiple +1 kg/t AgEq Intercepts in First Assays from Resource Expansion Program at Tonopah West",
      "link": "https://www.newsfilecorp.com/release/241966/Blackrock-Silver-Steps-Out-and-Hits-Multiple-1-kgt-AgEq-Intercepts-in-First-Assays-from-Resource-Expansion-Program-at-Tonopah-West",
      "date": "2025-02-24T10:00:00.000Z",
      "hidden": false
    },
    {
      "id": 88571,
      "company_id": 474,
      "title": "Blackrock Silver Drills 5.21m of 563 g/t AgEq (Including 0.73m of 3,462 g/t AgEq and Reports Multiple +1 kg/t AgEq Intercepts at Tonopah West",
      "link": "https://www.newsfilecorp.com/release/241600/Blackrock-Silver-Drills-5.21m-of-563-gt-AgEq-Including-0.73m-of-3462-gt-AgEq-and-Reports-Multiple-1-kgt-AgEq-Intercepts-at-Tonopah-West",
      "date": "2025-02-20T11:00:00.000Z",
      "hidden": false
    },
    {
      "id": 88111,
      "company_id": 474,
      "title": "Blackrock Silver Engages Westland Engineering and Environmental Services to Drive Permits Required for Underground Decline and Test Mining at Tonopah West",
      "link": "https://www.newsfilecorp.com/release/241237/Blackrock-Silver-Engages-Westland-Engineering-and-Environmental-Services-to-Drive-Permits-Required-for-Underground-Decline-and-Test-Mining-at-Tonopah-West",
      "date": "2025-02-18T11:00:00.000Z",
      "hidden": false
    },
    {
      "id": 85966,
      "company_id": 474,
      "title": "Blackrock Silver Announces Closing of $13.8 Million Bought Deal Public Offering; Overallotment Option Exercised in Full",
      "link": "https://www.newsfilecorp.com/release/238958/Blackrock-Silver-Announces-Closing-of-13.8-Million-Bought-Deal-Public-Offering-Overallotment-Option-Exercised-in-Full",
      "date": "2025-01-30T14:10:00.000Z",
      "hidden": false
    }
  ]
}
