{
  "article": {
    "id": 84296,
    "link": "https://www.newsfilecorp.com/release/237390/Rise-Gold-Announces-Receipt-of-702000-with-Regards-to-Property-Sale",
    "title": "Rise Gold Announces Receipt of $702,000 with Regards to Property Sale",
    "description": "<img src=\"https://api.newsfilecorp.com/newsinfo/237390/367\" id=\"367\" width=\"2\" height=\"2\" style=\"width: 1px;  height: 1px;border: 0px solid;\" /><p>Grass Valley, California--(Newsfile Corp. - January 16, 2025) - Rise Gold Corp. (CSE: RISE) (OTCQX: RYES) (the \"<b>Company</b>\") announces it has received a $702,000 payment with regards to the sale of property.</p><p>On November 27, 2024, Rise announced the sale of 66 acres of industrial land located adjacent to the Company's Idaho-Maryland Mine Property (the \"I-M Mine Property\") for $4.3 million to an arm's length third party in two transactions. The first of these transactions covered 16 acres of land for total consideration of $1.8 million, including $900,000 at closing, minus certain transaction fees, and an additional $900,000 due on November 27, 2026. Rise negotiated a discounted, accelerated payment with the purchaser whereby the Company received $702,000 on January 15, 2025 in lieu of the payment due in 2026. While the first tranche of $900,000 received in November 2024 was allocated to reduce the Company's secured debt, the $702,000 received on January 15, 2025 is available to fund ongoing operations.</p><p>The second sale agreement covers 50 acres of land for total sale price of $2.5 million and is expected to close on May 26, 2025, at which point half of the sale price will be due, with the other half due on May 26, 2027. The buyer has placed $200,000 in escrow and is paying $12,500 per month in rent until closing, with the rent payments to be applied against the purchase price. Commencing on the closing date, the buyer will pay monthly interest at an annual rate of 5% per year on the balance of the purchase price until it is paid in full.</p><p>Rise and the purchaser have also executed an option agreement whereby the Company may repurchase the 66 acres of land being sold for the sale price plus the cost of any capital improvements plus an increase of five percent per year on the condition that Rise acquires final government approvals to perform mining operations at the I-M Mine Property.</p><p>The Company retains ownership of the I-M Mine Property, which is comprised of 53 acres of land surrounding the New Brunswick shaft, as well as its nearby 56-acre Centennial property, and it retains all of its 2,585 acres of mineral rights.</p><p>The Company will use the sale proceeds to repay debt and to fund its legal claims against Nevada County (the \"County\"). As previously disclosed in its press release dated May 13, 2024, the Company has submitted a Writ of Mandamus (the \"Writ\") to the Superior Court of California for the County of Nevada (the \"Court\") asking the Court to compel the Board of Supervisors of Nevada County to follow applicable law and grant Rise recognition of its constitutionally-protected, grandfathered vested right to operate the Mine.</p><p>Rise's litigation attorneys at Cooper &#38; Kirk have advised the Company that should the Writ be unsuccessful, Rise's mineral estate will lose all value, which will allow Rise to bring a takings action in federal court against the County under the Fifth Amendment of the U.S. Constitution. The remedy for an unconstitutional taking is the payment of just compensation, which is the fair market value of the property taken. Based on comparable mines and historic yields at the I-M Mine, management believes the fair market value of Rise's mineral estate is at least $400 million.</p><p><u><b>About Rise Gold Corp.</b></u></p><p>Rise Gold is an exploration-stage mining company incorporated in Nevada, USA. The Company's principal asset is the historic past-producing Idaho-Maryland Gold Mine located in Nevada County, California, USA. </p><p>On behalf of the Board of Directors:</p><p>Joseph Mullin<br />President and CEO<br />Rise Gold Corp.</p><div id=\"contactInfo\"><p>For further information, please contact:</p><p><b>RISE GOLD CORP.</b><br />Suite 215, 333 Crown Point Circle<br />Grass Valley, CA 95945<br />T: 530.433.0188<br /><a href=\"mailto:info@risegoldcorp.com\">info@risegoldcorp.com</a> <br /><a href=\"https://api.newsfilecorp.com/redirect/4Q5r2fbW18\">www.risegoldcorp.com</a></p></div><p>The CSE has not reviewed, approved or disapproved the contents of this news release.</p><p><b>Forward-Looking Statements</b></p><p>This press release contains certain forward-looking statements within the meaning of applicable securities laws. Forward-looking statements are frequently characterized by words such as \"plan\", \"expect\", \"project\", \"intend\", \"believe\", \"anticipate\", \"estimate\" and other similar words or statements that certain events or conditions \"may\" or \"will\" occur.  </p><p>Although the Company believes that the expectations reflected in the forward-looking statements are reasonable, there can be no assurance that such expectations will prove to be correct. Such forward-looking statements are subject to risks, uncertainties and assumptions related to certain factors including, without limitation, obtaining all necessary approvals, meeting expenditure and financing requirements, compliance with environmental regulations, title matters, operating hazards, metal prices, political and economic factors, competitive factors, general economic conditions, relationships with vendors and strategic partners, governmental regulation and supervision, seasonality, technological change, industry practices, and one-time events that may cause actual results, performance or developments to differ materially from those contained in the forward-looking statements.  Accordingly, readers should not place undue reliance on forward-looking statements and information contained in this release. Rise undertakes no obligation to update forward-looking statements or information except as required by law.</p><p id=\"corporateNewsLogoContainer\"><img src=\"https://images.newsfilecorp.com/files/2255/237390_e0a85b57c489da9a_logo.jpg\" id=\"corporateNewsLogo\" alt=\"Corporate Logo\" /></p><p id=\"corporateLinkBack\">To view the source version of this press release, please visit <a href=\"https://api.newsfilecorp.com/redirect/jpXr7Uor7x\">https://www.newsfilecorp.com/release/237390</a></p>",
    "search_terms": "Idaho-Maryland Mine,Rise Gold Corp.,RISE",
    "master_gid": 4131,
    "date": "2025-01-16T12:00:00.000Z",
    "tags": "USA|Idaho,Maryland||Gold|Financing,Project Acquisition",
    "image_id": null,
    "hidden": false,
    "company_id": 1679,
    "provider": "newsfilecorp",
    "excerpt": "Grass Valley, California--(Newsfile Corp. - January 16, 2025) - Rise Gold Corp. (CSE: RISE) (OTCQX: RYES) (the \"Company\") announces it has received a $702,000 payment with regards to the sale of property.On November 27, 2024, Rise announced the sale of 66 acres of industrial land located adjacent to the Company's",
    "is_regulatory": false,
    "refined_tags": [],
    "ftp_filename": null,
    "company_name": "Rise Gold Corp.",
    "exchange": "CSE",
    "root_ticker": "RISE",
    "project_name": "Idaho-Maryland Mine",
    "gid": 4131,
    "location": "California, United States",
    "plan_id": null,
    "description_text": "Grass Valley, California--(Newsfile Corp. - January 16, 2025) - Rise Gold Corp. (CSE: RISE) (OTCQX: RYES) (the \" Company \") announces it has received a $702,000 payment with regards to the sale of property. On November 27, 2024, Rise announced the sale of 66 acres of industrial land located adjacent to the Company's Idaho-Maryland Mine Property (the \"I-M Mine Property\") for $4.3 million to an arm's length third party in two transactions. The first of these transactions covered 16 acres of land for total consideration of $1.8 million, including $900,000 at closing, minus certain transaction fees, and an additional $900,000 due on November 27, 2026. Rise negotiated a discounted, accelerated payment with the purchaser whereby the Company received $702,000 on January 15, 2025 in lieu of the payment due in 2026. While the first tranche of $900,000 received in November 2024 was allocated to reduce the Company's secured debt, the $702,000 received on January 15, 2025 is available to fund ongoing operations. The second sale agreement covers 50 acres of land for total sale price of $2.5 million and is expected to close on May 26, 2025, at which point half of the sale price will be due, with the other half due on May 26, 2027. The buyer has placed $200,000 in escrow and is paying $12,500 per month in rent until closing, with the rent payments to be applied against the purchase price. Commencing on the closing date, the buyer will pay monthly interest at an annual rate of 5% per year on the balance of the purchase price until it is paid in full. Rise and the purchaser have also executed an option agreement whereby the Company may repurchase the 66 acres of land being sold for the sale price plus the cost of any capital improvements plus an increase of five percent per year on the condition that Rise acquires final government approvals to perform mining operations at the I-M Mine Property. The Company retains ownership of the I-M Mine Property, which is comprised of 53 acres of land surrounding the New Brunswick shaft, as well as its nearby 56-acre Centennial property, and it retains all of its 2,585 acres of mineral rights. The Company will use the sale proceeds to repay debt and to fund its legal claims against Nevada County (the \"County\"). As previously disclosed in its press release dated May 13, 2024, the Company has submitted a Writ of Mandamus (the \"Writ\") to the Superior Court of California for the County of Nevada (the \"Court\") asking the Court to compel the Board of Supervisors of Nevada County to follow applicable law and grant Rise recognition of its constitutionally-protected, grandfathered vested right to operate the Mine. Rise's litigation attorneys at Cooper & Kirk have advised the Company that should the Writ be unsuccessful, Rise's mineral estate will lose all value, which will allow Rise to bring a takings action in federal court against the County under the Fifth Amendment of the U.S. Constitution. The remedy for an unconstitutional taking is the payment of just compensation, which is the fair market value of the property taken. Based on comparable mines and historic yields at the I-M Mine, management believes the fair market value of Rise's mineral estate is at least $400 million. About Rise Gold Corp. Rise Gold is an exploration-stage mining company incorporated in Nevada, USA. The Company's principal asset is the historic past-producing Idaho-Maryland Gold Mine located in Nevada County, California, USA. On behalf of the Board of Directors: Joseph Mullin President and CEO Rise Gold Corp. For further information, please contact: RISE GOLD CORP. Suite 215, 333 Crown Point Circle Grass Valley, CA 95945 T: 530.433.0188 info@risegoldcorp.com www.risegoldcorp.com The CSE has not reviewed, approved or disapproved the contents of this news release. Forward-Looking Statements This press release contains certain forward-looking statements within the meaning of applicable securities laws. Forward-looking statements are frequently characterized by words such as \"plan\", \"expect\", \"project\", \"intend\", \"believe\", \"anticipate\", \"estimate\" and other similar words or statements that certain events or conditions \"may\" or \"will\" occur. Although the Company believes that the expectations reflected in the forward-looking statements are reasonable, there can be no assurance that such expectations will prove to be correct. Such forward-looking statements are subject to risks, uncertainties and assumptions related to certain factors including, without limitation, obtaining all necessary approvals, meeting expenditure and financing requirements, compliance with environmental regulations, title matters, operating hazards, metal prices, political and economic factors, competitive factors, general economic conditions, relationships with vendors and strategic partners, governmental regulation and supervision, seasonality, technological change, industry practices, and one-time events that may cause actual results, performance or developments to differ materially from those contained in the forward-looking statements.  Accordingly, readers should not place undue reliance on forward-looking statements and information contained in this release. Rise undertakes no obligation to update forward-looking statements or information except as required by law. To view the source version of this press release, please visit https://www.newsfilecorp.com/release/237390",
    "primary_commodity": "Au"
  },
  "articleProject": {
    "gid": 4131,
    "project_name": "Idaho-Maryland Mine",
    "location": "California, United States"
  },
  "articleExchange": "CSE",
  "articleCompanyId": 1679,
  "articleTicker": "RISE",
  "articleCompanyName": "Rise Gold Corp.",
  "allOtherCompanyProjects": [
    {
      "company_id": 1679,
      "gid": 4131,
      "project_name": "Idaho-Maryland Mine",
      "location": "California, United States"
    }
  ],
  "allOtherCompanyNews": [
    {
      "id": 106291,
      "company_id": 1679,
      "title": "Rise Gold Announces Closing of Second Sale of Industrial Land and Paying Off the Secured Debt",
      "link": null,
      "date": "2025-05-29T20:57:00.000Z",
      "hidden": false
    },
    {
      "id": 105602,
      "company_id": 1679,
      "title": "Rise Gold Grants Stock Options",
      "link": null,
      "date": "2025-05-23T03:00:00.000Z",
      "hidden": false
    },
    {
      "id": 104151,
      "company_id": 1679,
      "title": "Rise Gold Closes $3,000,000 Financing including Strategic Investor Equinox Partners",
      "link": null,
      "date": "2025-05-09T12:00:00.000Z",
      "hidden": false
    },
    {
      "id": 100807,
      "company_id": 1679,
      "title": "Rise Gold Announces US$3,000,000 Financing",
      "link": null,
      "date": "2025-04-23T20:41:00.000Z",
      "hidden": false
    },
    {
      "id": 92680,
      "company_id": 1679,
      "title": "Rise Gold Grants Stock Options",
      "link": null,
      "date": "2025-03-26T23:36:00.000Z",
      "hidden": false
    },
    {
      "id": 84296,
      "company_id": 1679,
      "title": "Rise Gold Announces Receipt of $702,000 with Regards to Property Sale",
      "link": "https://www.newsfilecorp.com/release/237390/Rise-Gold-Announces-Receipt-of-702000-with-Regards-to-Property-Sale",
      "date": "2025-01-16T12:00:00.000Z",
      "hidden": false
    },
    {
      "id": 80228,
      "company_id": 1679,
      "title": "Rise Gold Announces $4.3 Million Sale of Property",
      "link": "https://www.newsfilecorp.com/release/231712/Rise-Gold-Announces-4.3-Million-Sale-of-Property",
      "date": "2024-11-27T22:38:00.000Z",
      "hidden": false
    },
    {
      "id": 79699,
      "company_id": 1679,
      "title": "Rise Gold Announces Change of Officers",
      "link": "https://www.newsfilecorp.com/release/231145/Rise-Gold-Announces-Change-of-Officers",
      "date": "2024-11-22T22:34:00.000Z",
      "hidden": false
    },
    {
      "id": -155306,
      "company_id": 1679,
      "title": "Rise Gold Announces Results from Annual General Meeting",
      "link": "https://www.newsfilecorp.com/release/230814/Rise-Gold-Announces-Results-from-Annual-General-Meeting",
      "date": "2024-11-20T23:09:00.000Z",
      "hidden": false
    },
    {
      "id": 77187,
      "company_id": 1679,
      "title": "Rise Gold Provides Corporate Update",
      "link": "https://www.newsfilecorp.com/release/228394/Rise-Gold-Provides-Corporate-Update",
      "date": "2024-10-30T20:31:00.000Z",
      "hidden": false
    }
  ]
}
