{
  "article": {
    "id": 88455,
    "link": "https://golddiscovery.com/legacy/user/news_details/739143-wcuca-world-copper-enters-into-letter-agreement-to-sell-zonia-project",
    "title": "World Copper Enters into Letter Agreement to Sell Zonia Project",
    "description": "<div class=\"qmnews_story\" id=\"story\"><p>Vancouver, British Columbia--(Newsfile Corp. - February 19, 2025) - World Copper Ltd. (TSXV: WCU) (OTCQB: WCUFF) (FSE: 7LY0)&nbsp;  (\"<b>World Copper</b>\" or the \"<b>Company</b>\") announces that the Company has entered into a binding letter agreement made as of February 12, 2025 (the \"<b>Letter Agreement</b>\") to sell its interest in the Zonia copper project located in the Walnut Grove Mining District, Yavapai County, Arizona (\"<b>Zonia</b>\" or the \"<b>Project</b>\") to an arm's length third party (the \"<b>Purchaser</b>\") in consideration for CAD $26.0 million cash (the \"<b>Purchase Price</b>\"), payable in tranches (the \"<b>Proposed Transaction</b>\").</p><p>The Letter Agreement provides for a 90-day due diligence period and sets forth the proposed commercial terms for the Proposed Transaction.  It is currently expected that the Proposed Transaction will be effected by way of a share purchase and sale transaction pursuant to which the Purchaser would acquire all of the issued and outstanding shares of the Company's Arizona subsidiary, Cardero Copper (USA) Ltd. (\"<b>Subco</b>\").  Following completion of due diligence to the satisfaction of the Purchaser, the parties will have 15 days to enter into a definitive agreement.  The payment of the Purchase Price shall be payable as to CAD $8.0 million to World Copper at closing of the Proposed Transaction (the \"<b>Closing</b>\"), an additional instalment of CAD $8.0 million on or before the 15-month anniversary of Closing, and a final instalment of CAD $10.0 million on or before the 30-month anniversary of Closing, subject to the Purchaser's right to accelerate the additional instalments.  Until the payment in full of the Purchase Price, it is proposed that the shares of Subco will be held in escrow, and the Purchaser will grant World Copper a security interest over such shares and the Project.  If the Purchaser fails to make any instalment payment for the Purchase Price, the shares of Subco will be returned to World Copper and the Purchaser would retain no interest in the Subco shares or the Project.</p><p>The Purchaser is a European based metals and mining investment manager with two decades of leadership in investing in and developing mining projects worldwide.  Completion of the Proposed Transaction is subject to, among other things, satisfactory completion of due diligence by the Purchaser, the Purchaser obtaining financing to complete the Proposed Transaction, the parties entering into a definitive agreement which will contain customary terms and conditions for a transaction of this nature, and receipt of all necessary shareholder, board and regulatory (including TSX Venture Exchange) consents and approvals.  A USD $75,000 break fee is payable by World Copper if it terminates the Letter Agreement.  Finder's fees in the amount of up to 4% will be payable in connection with the Proposed Transaction, subject to TSX Venture Exchange approval.  World Copper plans to issue a comprehensive news release detailing the Proposed Transaction once further updates become available.</p><p><b>ABOUT WORLD COPPER LTD.</b></p><p>World Copper Ltd., headquartered in Vancouver, BC, is a Canadian resource company focused on the exploration and development of its copper porphyry projects:  Zonia in Arizona and Escalones in Chile.  Both projects have estimated resources with significant soluble copper mineralization, and they boast exciting potential to expand the resource base.  The Company is dedicated to sustainable practices and leveraging technology to develop safe and productive mining operations in stable, mining-friendly jurisdictions.</p><p>Detailed information is available at World Copper's website at <a href=\"https://api.newsfilecorp.com/redirect/W0mbOiQV7E\">https://worldcopperltd.com</a>, and for general Company updates you may follow us on our social media pages via <a href=\"https://api.newsfilecorp.com/redirect/q8DLyhnAEY\">Facebook</a>, <a href=\"https://api.newsfilecorp.com/redirect/nVyk5hA15K\">Twitter</a> &amp; <a href=\"https://api.newsfilecorp.com/redirect/K8Nbyh4LPm\">LinkedIn</a>.</p><p>On Behalf of the Board of Directors of</p><p><b>WORLD COPPER LTD.</b></p><p><i>\"Gordon Neal\"</i></p><p>Gordon Neal<br>President &amp; Chief Executive Officer</p><div id=\"contactInfo\"><p>For further information, or to schedule a Zoom meeting with Management, please contact:<br>Gordon Neal or Michael Pound<br>Phone: 604-638-3287<br>Email: <a href=\"mailto:info@worldcopperltd.com\">info@worldcopperltd.com</a> </p><p>For all Investor Relations inquiries, please contact: <br>John Liviakis<br>Liviakis Financial Communications Inc.<br>Phone: 415-389-4670</p><p>For all Public Relations inquiries, please contact: <br>Nancy Thompson<br>Vorticom, Inc.<br>Office: 212-532-2208 | Mobile: 917-371-4053</p></div><p><b>Follow us:</b></p><p>Twitter: <a href=\"https://api.newsfilecorp.com/redirect/EyEbOu813y\" target=\"_blank\">https://twitter.com/WorldCopperLtd</a> <br>Facebook: <a href=\"https://api.newsfilecorp.com/redirect/x3JY1Hm7AO\" target=\"_blank\">https://www.facebook.com/WorldCopperLtd</a> <br>LinkedIn: <a href=\"https://api.newsfilecorp.com/redirect/7WLpbSAbgK\" target=\"_blank\">https://www.linkedin.com/company/worldcopperltd</a> </p><p><i>Neither TSXV nor its Regulation Services Provider (as that term is defined in the policies of the TSXV) accepts responsibility for the adequacy or accuracy of this news release.</i></p><p><b>Cautionary Note Regarding Forward-Looking Statements</b></p><p><i>This news release contains forward-looking statements and forward-looking information (collectively, \"forward looking statements\") within the meaning of applicable Canadian and U.S. securities legislation.  All statements, other than statements of historical fact, included herein including, without limitation, statements regarding the entry into of a definitive purchase and sale agreement with the Purchaser, the completion of all conditions precedent to the Proposed Transaction, and the completion of the Proposed Transaction, are forward-looking statements.  Although the Company believes that such statements are reasonable, it can give no assurance that such expectations will prove to be correct.  Forward-looking statements are typically identified by words such as: \"believes\", \"expects\", \"anticipates\", \"intends\", \"estimates\", \"plans\", \"may\", \"should\", \"would\", \"will\", \"potential\", \"scheduled\" or variations of such words and phrases and similar expressions, which, by their nature, refer to future events or results that may, could, would, might or will occur or be taken or achieved.  In making the forward-looking statements in this news release, World Copper has applied several material assumptions, including without limitation, market fundamentals will result in sustained copper demand and prices, the receipt of any necessary permits, licences and regulatory approvals in connection with the Proposed Transaction in a timely manner, the availability of financing on suitable terms for the continued operation of World Copper's business and its ability to comply with environmental, health and safety laws.</i></p><p><i>Forward-looking statements involve known and unknown risks, uncertainties and other factors which may cause the actual results, performance or achievements of the Company to differ materially from any future results, performance or achievements expressed or implied by the forward-looking information.  Such risks and other factors include, among others, requirements for additional capital, actual results of exploration activities, including on the Company's projects, the estimation or realization of mineral reserves and mineral resources, future prices of copper, changes in general economic conditions, changes in the financial markets and in the demand and market price for commodities, lack of investor interest in future financings, accidents, labour disputes and other risks of the mining industry, delays in obtaining governmental approvals (including TSX Venture Exchange acceptance of the Proposed Transaction), permits or financing or in the completion of other planned activities, risks relating to epidemics or pandemics, including impacts on the Company's business, financial condition and results of operations, changes in laws, regulations and policies affecting mining operations, title disputes, the timing and possible outcome of any pending litigation, environmental issues and liabilities, as well as the risk factors described in the Company's annual and quarterly management's discussion and analysis and in other filings made by the Company with Canadian securities regulatory authorities under the Company's profile at <a href=\"https://api.newsfilecorp.com/redirect/eLWVoCGqb0\">www.sedarplus.ca</a>.</i></p><p><i>Readers are cautioned not to place undue reliance on forward-looking statements.  The Company does not undertake any obligation to update any of the forward-looking statements in this news release or incorporated by reference herein, except as otherwise required by law.</i></p><p id=\"corporateNewsLogoContainer\"><img alt=\"Corporate Logo\" id=\"corporateNewsLogo\" src=\"https://images.newsfilecorp.com/files/3653/241479_c1ecd31fc4b73808_logo.jpg\" class=\"mCS_img_loaded\"></p><p id=\"corporateLinkBack\">To view the source version of this press release, please visit <a href=\"https://api.newsfilecorp.com/redirect/85oYpi3qpR\">https://www.newsfilecorp.com/release/241479</a></p><p><img alt=\"\" src=\"https://api.newsfilecorp.com/newsinfo/241479/475\" class=\"mCS_img_loaded\"></p><p><img src=\"https://info.quotemedianews.com/info?story_id=6565579957136706&amp;vendor_id=38c226a\" style=\"display:none;\" class=\"mCS_img_loaded\"></p></div>",
    "search_terms": "Zonia,World Copper Ltd.,WCU",
    "master_gid": 2913,
    "date": "2025-02-19T16:14:00.000Z",
    "tags": "||||Project Acquisition",
    "image_id": null,
    "hidden": false,
    "company_id": 1862,
    "provider": "custom addition",
    "excerpt": "Vancouver, British Columbia--(Newsfile Corp. - February 19, 2025) - World Copper Ltd. (TSXV: WCU) (OTCQB: WCUFF) (FSE: 7LY0)&nbsp; (\"World Copper\" or the \"Company\") announces that the Company has entered into a binding letter agreement made as of February 12, 2025 (the \"Letter Agreement\") to sell its interest in the",
    "is_regulatory": false,
    "refined_tags": null,
    "ftp_filename": null,
    "company_name": "World Copper Ltd.",
    "exchange": "TSXV",
    "root_ticker": "WCU",
    "project_name": "Zonia",
    "gid": 2913,
    "location": "Arizona, United States",
    "plan_id": null,
    "description_text": "Vancouver, British Columbia--(Newsfile Corp. - February 19, 2025) - World Copper Ltd. (TSXV: WCU) (OTCQB: WCUFF) (FSE: 7LY0)   (\" World Copper \" or the \" Company \") announces that the Company has entered into a binding letter agreement made as of February 12, 2025 (the \" Letter Agreement \") to sell its interest in the Zonia copper project located in the Walnut Grove Mining District, Yavapai County, Arizona (\" Zonia \" or the \" Project \") to an arm's length third party (the \" Purchaser \") in consideration for CAD $26.0 million cash (the \" Purchase Price \"), payable in tranches (the \" Proposed Transaction \"). The Letter Agreement provides for a 90-day due diligence period and sets forth the proposed commercial terms for the Proposed Transaction.  It is currently expected that the Proposed Transaction will be effected by way of a share purchase and sale transaction pursuant to which the Purchaser would acquire all of the issued and outstanding shares of the Company's Arizona subsidiary, Cardero Copper (USA) Ltd. (\" Subco \").  Following completion of due diligence to the satisfaction of the Purchaser, the parties will have 15 days to enter into a definitive agreement.  The payment of the Purchase Price shall be payable as to CAD $8.0 million to World Copper at closing of the Proposed Transaction (the \" Closing \"), an additional instalment of CAD $8.0 million on or before the 15-month anniversary of Closing, and a final instalment of CAD $10.0 million on or before the 30-month anniversary of Closing, subject to the Purchaser's right to accelerate the additional instalments.  Until the payment in full of the Purchase Price, it is proposed that the shares of Subco will be held in escrow, and the Purchaser will grant World Copper a security interest over such shares and the Project.  If the Purchaser fails to make any instalment payment for the Purchase Price, the shares of Subco will be returned to World Copper and the Purchaser would retain no interest in the Subco shares or the Project. The Purchaser is a European based metals and mining investment manager with two decades of leadership in investing in and developing mining projects worldwide.  Completion of the Proposed Transaction is subject to, among other things, satisfactory completion of due diligence by the Purchaser, the Purchaser obtaining financing to complete the Proposed Transaction, the parties entering into a definitive agreement which will contain customary terms and conditions for a transaction of this nature, and receipt of all necessary shareholder, board and regulatory (including TSX Venture Exchange) consents and approvals.  A USD $75,000 break fee is payable by World Copper if it terminates the Letter Agreement.  Finder's fees in the amount of up to 4% will be payable in connection with the Proposed Transaction, subject to TSX Venture Exchange approval.  World Copper plans to issue a comprehensive news release detailing the Proposed Transaction once further updates become available. ABOUT WORLD COPPER LTD. World Copper Ltd., headquartered in Vancouver, BC, is a Canadian resource company focused on the exploration and development of its copper porphyry projects:  Zonia in Arizona and Escalones in Chile.  Both projects have estimated resources with significant soluble copper mineralization, and they boast exciting potential to expand the resource base.  The Company is dedicated to sustainable practices and leveraging technology to develop safe and productive mining operations in stable, mining-friendly jurisdictions. Detailed information is available at World Copper's website at https://worldcopperltd.com , and for general Company updates you may follow us on our social media pages via Facebook , Twitter & LinkedIn . On Behalf of the Board of Directors of WORLD COPPER LTD. \"Gordon Neal\" Gordon Neal President & Chief Executive Officer For further information, or to schedule a Zoom meeting with Management, please contact: Gordon Neal or Michael Pound Phone: 604-638-3287 Email: info@worldcopperltd.com For all Investor Relations inquiries, please contact: John Liviakis Liviakis Financial Communications Inc. Phone: 415-389-4670 For all Public Relations inquiries, please contact: Nancy Thompson Vorticom, Inc. Office: 212-532-2208 | Mobile: 917-371-4053 Follow us: Twitter: https://twitter.com/WorldCopperLtd Facebook: https://www.facebook.com/WorldCopperLtd LinkedIn: https://www.linkedin.com/company/worldcopperltd Neither TSXV nor its Regulation Services Provider (as that term is defined in the policies of the TSXV) accepts responsibility for the adequacy or accuracy of this news release. Cautionary Note Regarding Forward-Looking Statements This news release contains forward-looking statements and forward-looking information (collectively, \"forward looking statements\") within the meaning of applicable Canadian and U.S. securities legislation.  All statements, other than statements of historical fact, included herein including, without limitation, statements regarding the entry into of a definitive purchase and sale agreement with the Purchaser, the completion of all conditions precedent to the Proposed Transaction, and the completion of the Proposed Transaction, are forward-looking statements.  Although the Company believes that such statements are reasonable, it can give no assurance that such expectations will prove to be correct.  Forward-looking statements are typically identified by words such as: \"believes\", \"expects\", \"anticipates\", \"intends\", \"estimates\", \"plans\", \"may\", \"should\", \"would\", \"will\", \"potential\", \"scheduled\" or variations of such words and phrases and similar expressions, which, by their nature, refer to future events or results that may, could, would, might or will occur or be taken or achieved.  In making the forward-looking statements in this news release, World Copper has applied several material assumptions, including without limitation, market fundamentals will result in sustained copper demand and prices, the receipt of any necessary permits, licences and regulatory approvals in connection with the Proposed Transaction in a timely manner, the availability of financing on suitable terms for the continued operation of World Copper's business and its ability to comply with environmental, health and safety laws. Forward-looking statements involve known and unknown risks, uncertainties and other factors which may cause the actual results, performance or achievements of the Company to differ materially from any future results, performance or achievements expressed or implied by the forward-looking information.  Such risks and other factors include, among others, requirements for additional capital, actual results of exploration activities, including on the Company's projects, the estimation or realization of mineral reserves and mineral resources, future prices of copper, changes in general economic conditions, changes in the financial markets and in the demand and market price for commodities, lack of investor interest in future financings, accidents, labour disputes and other risks of the mining industry, delays in obtaining governmental approvals (including TSX Venture Exchange acceptance of the Proposed Transaction), permits or financing or in the completion of other planned activities, risks relating to epidemics or pandemics, including impacts on the Company's business, financial condition and results of operations, changes in laws, regulations and policies affecting mining operations, title disputes, the timing and possible outcome of any pending litigation, environmental issues and liabilities, as well as the risk factors described in the Company's annual and quarterly management's discussion and analysis and in other filings made by the Company with Canadian securities regulatory authorities under the Company's profile at www.sedarplus.ca . Readers are cautioned not to place undue reliance on forward-looking statements.  The Company does not undertake any obligation to update any of the forward-looking statements in this news release or incorporated by reference herein, except as otherwise required by law. To view the source version of this press release, please visit https://www.newsfilecorp.com/release/241479",
    "primary_commodity": "Cu"
  },
  "articleProject": {
    "gid": 2913,
    "project_name": "Zonia",
    "location": "Arizona, United States"
  },
  "articleExchange": "TSXV",
  "articleCompanyId": 1862,
  "articleTicker": "WCU",
  "articleCompanyName": "World Copper Ltd.",
  "allOtherCompanyProjects": [
    {
      "company_id": 1862,
      "gid": 3230,
      "project_name": "Escalones",
      "location": "Santiago Metropolitan Region, Chile"
    },
    {
      "company_id": 1862,
      "gid": 2913,
      "project_name": "Zonia",
      "location": "Arizona, United States"
    }
  ],
  "allOtherCompanyNews": [
    {
      "id": 103709,
      "company_id": 1862,
      "title": "World Copper Terminates Letter Agreement",
      "link": null,
      "date": "2025-05-06T20:15:00.000Z",
      "hidden": false
    },
    {
      "id": 102724,
      "company_id": 1862,
      "title": "World Copper Provides Update",
      "link": "https://app.quotemedia.com/data/downloadFiling?webmasterId=104408&ref=67f848da4442665800014661&type=PDFC&formType=002-002-001089-003001&formDescription=News+release&dateFiled=2025-04-10",
      "date": "2025-04-10T15:40:26.000Z",
      "hidden": false
    },
    {
      "id": -170067,
      "company_id": 1862,
      "title": "Canadian Investment Regulatory Organization Trade Resumption - WCU",
      "link": "https://contentapi.cision.com/api/v1.0/releases/20250219C2140",
      "date": "2025-02-19T17:13:00.000Z",
      "hidden": false
    },
    {
      "id": 88455,
      "company_id": 1862,
      "title": "World Copper Enters into Letter Agreement to Sell Zonia Project",
      "link": "https://golddiscovery.com/legacy/user/news_details/739143-wcuca-world-copper-enters-into-letter-agreement-to-sell-zonia-project",
      "date": "2025-02-19T16:14:00.000Z",
      "hidden": false
    },
    {
      "id": -185211,
      "company_id": 1862,
      "title": "World Copper Closes Financing",
      "link": "https://app.quotemedia.com/data/downloadFiling?webmasterId=104408&ref=67afd990cddccb40851d8bcb&type=PDFC&formType=002-002-001089-003001&formDescription=News+release&dateFiled=2025-02-14",
      "date": "2025-02-15T00:02:24.000Z",
      "hidden": false
    },
    {
      "id": 80163,
      "company_id": 1862,
      "title": "World Copper Arranges $1.5 Million Financing",
      "link": "https://www.newsfilecorp.com/release/231529/World-Copper-Arranges-1.5-Million-Financing",
      "date": "2024-11-27T13:00:00.000Z",
      "hidden": false
    },
    {
      "id": 79433,
      "company_id": 1862,
      "title": "World Copper Initiates Strategic Review Process and Engages Advisor",
      "link": "https://www.newsfilecorp.com/release/230640/World-Copper-Initiates-Strategic-Review-Process-and-Engages-Advisor",
      "date": "2024-11-20T13:00:00.000Z",
      "hidden": false
    },
    {
      "id": 78575,
      "company_id": 1862,
      "title": "World Copper Files Amended Resource Estimate and Technical Report for Updated Resource Estimate for the Zonia Project",
      "link": "https://www.newsfilecorp.com/release/229725/World-Copper-Files-Amended-Resource-Estimate-and-Technical-Report-for-Updated-Resource-Estimate-for-the-Zonia-Project",
      "date": "2024-11-12T23:13:00.000Z",
      "hidden": false
    },
    {
      "id": 76067,
      "company_id": 1862,
      "title": "World Copper Files Technical Report for Updated Resource Estimate for the Zonia Project",
      "link": "https://www.newsfilecorp.com/release/227776/World-Copper-Files-Technical-Report-for-Updated-Resource-Estimate-for-the-Zonia-Project",
      "date": "2024-10-25T12:00:00.000Z",
      "hidden": false
    },
    {
      "id": 70693,
      "company_id": 1862,
      "title": "World Copper Provides Project Updates and Announces an Updated Resource Estimate for the Zonia Project",
      "link": "https://www.newsfilecorp.com/release/222617/World-Copper-Provides-Project-Updates-and-Announces-an-Updated-Resource-Estimate-for-the-Zonia-Project",
      "date": "2024-09-09T12:00:00.000Z",
      "hidden": false
    }
  ]
}
