{
  "article": {
    "id": 90305,
    "link": "https://www.newsfilecorp.com/release/243652/Argyle-Resources-Corp.-Announces-Filing-of-22-Mineral-Lode-Claims-Near-Bovill-Idaho",
    "title": "Argyle Resources Corp. Announces Filing of 22 Mineral Lode Claims Near Bovill, Idaho",
    "description": "<img src=\"https://api.newsfilecorp.com/newsinfo/243652/367\" id=\"367\" width=\"2\" height=\"2\" style=\"width: 1px;  height: 1px;border: 0px solid;\" /><p>Calgary, Alberta--(Newsfile Corp. - March 7, 2025) - Argyle Resources Corp. (CSE: ARGL) (OTCQB: ARLYF) (FSE: ME0) (\"Argyle\" or the \"Company\") is pleased to announce that its exploration partner, Rangefront Mining Services (\"Rangefront\"), has filed 22 mineral lode claims on the Company's behalf with the U.S. Bureau of Land Management (BLM) near Bovill, Idaho.  The Company is naming these consolidated claim blocks, the Bovill Silica Project.</p><p style=\"text-align: center;\"><a href=\"https://images.newsfilecorp.com/files/10451/243652_087644a154ba5b08_001full.jpg\"><img style=\"border-width: 0px;\" src=\"https://images.newsfilecorp.com/files/10451/243652_243652figure1_550.jpg\" alt=\"Cannot view this image? Visit: https://images.newsfilecorp.com/files/10451/243652_243652figure1_550.jpg\" /></a><br /><br />Figure 1: Claim Map of the Bovill Silica Project</p><p style=\"text-align: center;\">To view an enhanced version of this graphic, please visit:<br /><a href=\"https://images.newsfilecorp.com/files/10451/243652_087644a154ba5b08_001full.jpg\">https://images.newsfilecorp.com/files/10451/243652_087644a154ba5b08_001full.jpg</a></p><p>The newly staked claims are strategically located in a region known for its rich deposits of silica and feldspar. Notably, a portion of the newly staked claims includes a historical feldspar quarry, further supporting the prospectivity of the site.</p><p style=\"text-align: center;\"><a href=\"https://images.newsfilecorp.com/files/10451/243652_087644a154ba5b08_002full.jpg\"><img style=\"border-width: 0px;\" src=\"https://images.newsfilecorp.com/files/10451/243652_243652figure2_550.jpg\" alt=\"Cannot view this image? Visit: https://images.newsfilecorp.com/files/10451/243652_243652figure2_550.jpg\" /></a><br /><br />Figure 2: Historical Mines and Prospects in the Bovill Region<br /><br />To view an enhanced version of this graphic, please visit:<br /><a href=\"https://images.newsfilecorp.com/files/10451/243652_087644a154ba5b08_002full.jpg\">https://images.newsfilecorp.com/files/10451/243652_087644a154ba5b08_002full.jpg</a></p><p>The 22 lode claims have been submitted to the BLM for application processing, with finalization expected within approximately six weeks. Argyle and Rangefront will continue to evaluate the potential of the claims and explore opportunities to advance the project in alignment with the Company's strategic growth initiatives.</p><p>\"We are excited about the acquisition of these new claims, which add to our expanding portfolio of mineral assets,\" said Jeff Stevens, CEO of Argyle Resources Corp. \"The historical mining activity in the region, coupled with our technical team's expertise, presents a strong opportunity to unlock value from these properties.\"</p><p>The Company will provide further updates as the permitting process advances and as exploration activities commence on the claims.</p><p>The Company is pleased to announce that it has closed its previously-announced non-brokered private placement (please see news release dated December 12, 2024, for aggregate gross proceeds of $300,000 through the issuance of 555,555 units (each, a \"<b>Unit</b>\") at a price of $0.54 per Unit (the \"<b>Offering</b>\").  Each Unit is comprised of one (1) common share of the Company (a \"<b>Common Share</b>\") and one common share purchase warrant (\"<b>Warrant</b>\"), with each Warrant entitling the holder to purchase one Common Share at a price of $0.65 for a period of 24 months from the date of the closing. </p><p>The Company intends to use the net proceeds of the Offering for expenditures on its mineral exploration properties, and for general working capital purposes.</p><p>All securities issued under the Offering are subject to a four-month and one-day hold period. </p><p><i>The securities issued pursuant to the Offering have not been, nor will they be, registered under the United States Securities Act of 1933, as amended, and may not be offered or sold within the United States or to, or for the account or benefit of, U.S. persons in the absence of U.S. registration or an applicable exemption from the U.S. registration requirements. This news release shall not constitute an offer to sell or the solicitation of an offer to buy nor shall there be any sale of the securities in the United States or in any other jurisdiction in which such offer, solicitation or sale would be unlawful.</i></p><p>The Company also announces it has granted 600,000 stock options (\"<b>Options</b>\") to a consultant of the Company, pursuant to its equity incentive Plan, and has granted 1,250,000 restricted share units (\"<b>RSUs</b>\") to certain directors, officers and consultants of the Company.</p><p>George M. Yordanov, OGQ., P.GEO., a consultant to the Company, is the Qualified Person (as such term is defined in National Instrument 43-101), who has reviewed and approved the scientific and technical disclosure contained in this news release.</p><p><b>About Rangefront Mining Services</b><br />Rangefront Mining Services is a leading provider of geological and exploration services, specializing in claim staking, permitting, and mineral assessment to support mining companies in advancing their projects.</p><p><b>About Argyle Resources Corp.</b></p><p>Argyle Resources Corp. is a junior mineral exploration company engaged in the business of acquiring, exploring, staking and evaluating natural resource properties in North America. In addition to the Saint Gabriel project, the Company currently holds an option to acquire up to 100% of the Frenchvale Graphite Property located in Nova Scotia, Canada and owns 100% interest in the Pilgrim Islands, Matapedia and Lac Comport&#233; quartzite silica projects in Quebec, Canada. Argyle is engaged in a research partnership with the National Institute of Scientific Research (INRS), a high-level research and training institute funded by the Qu&#233;bec government to conduct exploration programs on the Company's silica projects. The Company was incorporated in 2023 and its head office is located in Calgary, Alberta, Canada.</p><p><b>ON BEHALF OF THE BOARD OF DIRECTORS</b></p><p>'Jeffrey Stevens'</p><p>President &#38; CEO</p><div id=\"contactInfo\"><p><b>For all other inquiries:</b></p><p>Email: <a href=\"mailto:info@argylresourcescorp.com\">info@argylresourcescorp.com</a></p><p>Phone: (825) 724-0033</p><p>Website: <a href=\"https://api.newsfilecorp.com/redirect/2EwwDCQyeE\">www.argyleresourcescorp.com</a></p></div><p><b>Forward-Looking Statements </b></p><p>All statements included in this press release that address activities, events or developments that Argyle expects, believes or anticipates will or may occur in the future are forward-looking statements. Such statements may involve, but are not limited to, statements with respect to the exploration and development of the Company's mineral properties and the use of proceeds from the Offering. These forward-looking statements involve numerous assumptions made by Argyle based on its experience, perception of historical trends, current conditions, expected future developments and other factors it believes are appropriate in the circumstances. In addition, these statements involve substantial known and unknown risks and uncertainties that contribute to the possibility that the predictions, forecasts, projections and other forward-looking statements will prove inaccurate, certain of which are beyond Argyle's control. Readers should not place undue reliance on forward-looking statements. Except as required by law, Argyle does not intend to revise or update these forward-looking statements after the date hereof or revise them to reflect the occurrence of future unanticipated events.</p><p>Neither the Canadian Securities Exchange nor its Regulation Service Provider accepts responsibility for the adequacy or accuracy of this news release.</p><p id=\"corporateNewsLogoContainer\"><img src=\"https://images.newsfilecorp.com/files/10451/243652_087644a154ba5b08_logo.jpg\" id=\"corporateNewsLogo\" alt=\"Corporate Logo\" /></p><p id=\"corporateLinkBack\">To view the source version of this press release, please visit <a href=\"https://api.newsfilecorp.com/redirect/MAGGzfG54o\">https://www.newsfilecorp.com/release/243652</a></p>",
    "search_terms": "Bovill Silica,Argyle Resources Corp.,ARGL",
    "master_gid": 9963,
    "date": "2025-03-07T11:00:00.000Z",
    "tags": "USA|Idaho|||Project Acquisition",
    "image_id": null,
    "hidden": false,
    "company_id": 4565,
    "provider": "newsfilecorp",
    "excerpt": "Calgary, Alberta--(Newsfile Corp. - March 7, 2025) - Argyle Resources Corp. (CSE: ARGL) (OTCQB: ARLYF) (FSE: ME0) (\"Argyle\" or the \"Company\") is pleased to announce that its exploration partner, Rangefront Mining Services (\"Rangefront\"), has filed 22 mineral lode claims on the Company's behalf with the U.S. Bureau of Land Management",
    "is_regulatory": false,
    "refined_tags": null,
    "ftp_filename": null,
    "company_name": "Argyle Resources Corp.",
    "exchange": "CSE",
    "root_ticker": "ARGL",
    "project_name": "Bovill Silica",
    "gid": 9963,
    "location": "Idaho, United States",
    "plan_id": null,
    "description_text": "Calgary, Alberta--(Newsfile Corp. - March 7, 2025) - Argyle Resources Corp. (CSE: ARGL) (OTCQB: ARLYF) (FSE: ME0) (\"Argyle\" or the \"Company\") is pleased to announce that its exploration partner, Rangefront Mining Services (\"Rangefront\"), has filed 22 mineral lode claims on the Company's behalf with the U.S. Bureau of Land Management (BLM) near Bovill, Idaho.  The Company is naming these consolidated claim blocks, the Bovill Silica Project. Figure 1: Claim Map of the Bovill Silica Project To view an enhanced version of this graphic, please visit: https://images.newsfilecorp.com/files/10451/243652_087644a154ba5b08_001full.jpg The newly staked claims are strategically located in a region known for its rich deposits of silica and feldspar. Notably, a portion of the newly staked claims includes a historical feldspar quarry, further supporting the prospectivity of the site. Figure 2: Historical Mines and Prospects in the Bovill Region To view an enhanced version of this graphic, please visit: https://images.newsfilecorp.com/files/10451/243652_087644a154ba5b08_002full.jpg The 22 lode claims have been submitted to the BLM for application processing, with finalization expected within approximately six weeks. Argyle and Rangefront will continue to evaluate the potential of the claims and explore opportunities to advance the project in alignment with the Company's strategic growth initiatives. \"We are excited about the acquisition of these new claims, which add to our expanding portfolio of mineral assets,\" said Jeff Stevens, CEO of Argyle Resources Corp. \"The historical mining activity in the region, coupled with our technical team's expertise, presents a strong opportunity to unlock value from these properties.\" The Company will provide further updates as the permitting process advances and as exploration activities commence on the claims. The Company is pleased to announce that it has closed its previously-announced non-brokered private placement (please see news release dated December 12, 2024, for aggregate gross proceeds of $300,000 through the issuance of 555,555 units (each, a \" Unit \") at a price of $0.54 per Unit (the \" Offering \").  Each Unit is comprised of one (1) common share of the Company (a \" Common Share \") and one common share purchase warrant (\" Warrant \"), with each Warrant entitling the holder to purchase one Common Share at a price of $0.65 for a period of 24 months from the date of the closing. The Company intends to use the net proceeds of the Offering for expenditures on its mineral exploration properties, and for general working capital purposes. All securities issued under the Offering are subject to a four-month and one-day hold period. The securities issued pursuant to the Offering have not been, nor will they be, registered under the United States Securities Act of 1933, as amended, and may not be offered or sold within the United States or to, or for the account or benefit of, U.S. persons in the absence of U.S. registration or an applicable exemption from the U.S. registration requirements. This news release shall not constitute an offer to sell or the solicitation of an offer to buy nor shall there be any sale of the securities in the United States or in any other jurisdiction in which such offer, solicitation or sale would be unlawful. The Company also announces it has granted 600,000 stock options (\" Options \") to a consultant of the Company, pursuant to its equity incentive Plan, and has granted 1,250,000 restricted share units (\" RSUs \") to certain directors, officers and consultants of the Company. George M. Yordanov, OGQ., P.GEO., a consultant to the Company, is the Qualified Person (as such term is defined in National Instrument 43-101), who has reviewed and approved the scientific and technical disclosure contained in this news release. About Rangefront Mining Services Rangefront Mining Services is a leading provider of geological and exploration services, specializing in claim staking, permitting, and mineral assessment to support mining companies in advancing their projects. About Argyle Resources Corp. Argyle Resources Corp. is a junior mineral exploration company engaged in the business of acquiring, exploring, staking and evaluating natural resource properties in North America. In addition to the Saint Gabriel project, the Company currently holds an option to acquire up to 100% of the Frenchvale Graphite Property located in Nova Scotia, Canada and owns 100% interest in the Pilgrim Islands, Matapedia and Lac Comporté quartzite silica projects in Quebec, Canada. Argyle is engaged in a research partnership with the National Institute of Scientific Research (INRS), a high-level research and training institute funded by the Québec government to conduct exploration programs on the Company's silica projects. The Company was incorporated in 2023 and its head office is located in Calgary, Alberta, Canada. ON BEHALF OF THE BOARD OF DIRECTORS 'Jeffrey Stevens' President & CEO For all other inquiries: Email: info@argylresourcescorp.com Phone: (825) 724-0033 Website: www.argyleresourcescorp.com Forward-Looking Statements All statements included in this press release that address activities, events or developments that Argyle expects, believes or anticipates will or may occur in the future are forward-looking statements. Such statements may involve, but are not limited to, statements with respect to the exploration and development of the Company's mineral properties and the use of proceeds from the Offering. These forward-looking statements involve numerous assumptions made by Argyle based on its experience, perception of historical trends, current conditions, expected future developments and other factors it believes are appropriate in the circumstances. In addition, these statements involve substantial known and unknown risks and uncertainties that contribute to the possibility that the predictions, forecasts, projections and other forward-looking statements will prove inaccurate, certain of which are beyond Argyle's control. Readers should not place undue reliance on forward-looking statements. Except as required by law, Argyle does not intend to revise or update these forward-looking statements after the date hereof or revise them to reflect the occurrence of future unanticipated events. Neither the Canadian Securities Exchange nor its Regulation Service Provider accepts responsibility for the adequacy or accuracy of this news release. To view the source version of this press release, please visit https://www.newsfilecorp.com/release/243652",
    "primary_commodity": "Si"
  },
  "articleProject": {
    "gid": 9963,
    "project_name": "Bovill Silica",
    "location": "Idaho, United States"
  },
  "articleExchange": "CSE",
  "articleCompanyId": 4565,
  "articleTicker": "ARGL",
  "articleCompanyName": "Argyle Resources Corp.",
  "allOtherCompanyProjects": [
    {
      "company_id": 4565,
      "gid": 9849,
      "project_name": "Lac Comporte",
      "location": "Quebec, Canada"
    },
    {
      "company_id": 4565,
      "gid": 9850,
      "project_name": "Pilgrim Island",
      "location": "Quebec, Canada"
    },
    {
      "company_id": 4565,
      "gid": 9963,
      "project_name": "Bovill Silica",
      "location": "Idaho, United States"
    },
    {
      "company_id": 4565,
      "gid": 9753,
      "project_name": "Saint Gabriel",
      "location": "Quebec, Canada"
    },
    {
      "company_id": 4565,
      "gid": 7698,
      "project_name": "Matapedia",
      "location": null
    },
    {
      "company_id": 4565,
      "gid": 8424,
      "project_name": "Frenchvale",
      "location": null
    },
    {
      "company_id": 4565,
      "gid": 10344,
      "project_name": "Clay Howell",
      "location": "Canada"
    }
  ],
  "allOtherCompanyNews": [
    {
      "id": 107992,
      "company_id": 4565,
      "title": "Argyle Announces Renewal with Euro Digital Media",
      "link": null,
      "date": "2025-06-13T23:00:00.000Z",
      "hidden": false
    },
    {
      "id": 107785,
      "company_id": 4565,
      "title": "Argyle Announces Filing of 43-101 Technical Report on Saint Gabriel Silica Project",
      "link": null,
      "date": "2025-06-12T10:00:00.000Z",
      "hidden": false
    },
    {
      "id": 107354,
      "company_id": 4565,
      "title": "Argyle Closes C$1 Million LIFE Offering",
      "link": null,
      "date": "2025-06-09T20:00:00.000Z",
      "hidden": false
    },
    {
      "id": 107210,
      "company_id": 4565,
      "title": "Argyle Resources Initiates Drill Permit Application for Clay Howells Rare Earth Element Project in Ontario",
      "link": null,
      "date": "2025-06-06T10:00:00.000Z",
      "hidden": false
    },
    {
      "id": 106888,
      "company_id": 4565,
      "title": "Argyle Commends the Ontario Governments Critical Minerals Exploration and Developments Initiatives",
      "link": null,
      "date": "2025-06-04T10:00:00.000Z",
      "hidden": false
    },
    {
      "id": 106436,
      "company_id": 4565,
      "title": "Argyle Announces Renewal with Euro Digital Media",
      "link": null,
      "date": "2025-05-30T23:30:00.000Z",
      "hidden": false
    },
    {
      "id": 106195,
      "company_id": 4565,
      "title": "Argyle Resources Corp. Announces Preliminary Remote Sensing Results for Matapedia Silica Project, Quebec",
      "link": null,
      "date": "2025-05-29T10:00:00.000Z",
      "hidden": false
    },
    {
      "id": 106009,
      "company_id": 4565,
      "title": "Argyle Announces Filing of Amended Offering Document",
      "link": null,
      "date": "2025-05-28T01:30:00.000Z",
      "hidden": false
    },
    {
      "id": 105805,
      "company_id": 4565,
      "title": "Argyle Announces up to C$1 Million LIFE Offering",
      "link": null,
      "date": "2025-05-26T23:00:00.000Z",
      "hidden": false
    },
    {
      "id": 105725,
      "company_id": 4565,
      "title": "Argyle Announces Completion of Satellite Analysis at Saint Gabriel Silica Project",
      "link": null,
      "date": "2025-05-26T10:00:00.000Z",
      "hidden": false
    }
  ]
}
