{
  "article": {
    "id": 90164,
    "link": "https://contentapi.cision.com/api/v1.0/releases/20250305C3345",
    "title": "Lundin Mining to Option Ni-Cu-PGM Exploration Properties from Talon Metals Corp.",
    "description": "\n\n<div class=\"PRN_ImbeddedAssetReference\" id=\"DivAssetPlaceHolder5519\"><p><a href=\"https://mma.prnewswire.com/media/2635016/Lundin_Mining_Corporation_Lundin_Mining_to_Option_Ni_Cu_PGM_Expl.html\" rel=\"nofollow\" target=\"_blank\"><img alt=\"Lundin Mining Corporation Logo (CNW Group/Lundin Mining Corporation)\" src=\"https://mma.prnewswire.com/media/2635016/Lundin_Mining_Corporation_Lundin_Mining_to_Option_Ni_Cu_PGM_Expl.jpg\" title=\"Lundin Mining Corporation Logo (CNW Group/Lundin Mining Corporation)\"></img></a></p>\n</div><p><span class=\"legendSpanClass\"><span class=\"xn-location\">VANCOUVER, BC</span></span>, <span class=\"legendSpanClass\"><span class=\"xn-chron\">March 5, 2025</span></span> /CNW/ - (TSX: LUN) (Nasdaq Stockholm: LUMI) <b>Lundin Mining Corporation </b>(\"Lundin Mining\" or the \"Company\") is pleased to announce today that it has entered into exclusivity to negotiate an earn-in agreement (the \"Option Agreement\") with Talon Metals Corp. (\"Talon\") for the right to acquire up to a 70% ownership interest in the Boulderdash exploration properties (\"Boulderdash\") which are adjacent to the Company's Eagle Mine.  Concurrently with the execution of the exclusivity agreement, Lunding Mining has advanced Talon <span class=\"xn-money\">US$5 million</span> to, among other things, commence drilling at Boulderdash. If the parties do not execute the Option Agreement, Talon will either repay such advance or issue shares to the Company with an aggregate subscription price equal to such advance based on the 5-day volume weighted average price of Talon shares on the TSX at the time of issuance. <a href=\"https://c212.net/c/link/?t=0&amp;l=en&amp;o=4377031-1&amp;h=1467218806&amp;u=https%3A%2F%2Fmma.prnewswire.com%2Fmedia%2F2635019%2FLundin.pdf&amp;a=View+PDF\" rel=\"nofollow\" target=\"_blank\">View PDF</a></p>\n<p>It is anticipated that pursuant to the terms of the Option Agreement, Lundin Mining will agree to fund up to 30,000 metres (m) of Talon's drilling campaign at Boulderdash in exchange for a 44.625% interest in Boulderdash. Such drill campaign will be completed in <span class=\"xn-money\">10,000 m</span> tranches at the election of Lundin Mining. Following the completion of <span class=\"xn-money\">30,000 m</span> of drilling, the Company may fund a feasibility study in respect of the Boulderdash property in exchange for an additional 25.375% interest in Boulderdash, for a total ownership of 70%, as well as the potential for a 90% interest in certain properties adjacent to Boulderdash.</p>\n<p><b>Boulderdash Properties</b></p>\n<p>The Boulderdash target is located approximately 12 kilometres northwest of Lundin Mining's Eagle Mine in <span class=\"xn-location\">Michigan</span>, the only operating nickel mine in the U.S. The maiden drill hole at Boulderdash announced last year on <span class=\"xn-chron\">October 24, 2024</span> (see Talon release <a href=\"https://c212.net/c/link/?t=0&amp;l=en&amp;o=4377031-1&amp;h=496518182&amp;u=https%3A%2F%2Ftalonmetals.com%2Ftalon-metals-makes-new-copper-nickel-discovery-in-michigan%2F&amp;a=%22Talon+Metals+Makes+New+Copper-Nickel+Discovery+in+Michigan%22\" rel=\"nofollow\" target=\"_blank\">\"Talon Metals Makes New Copper-Nickel Discovery in <span class=\"xn-location\">Michigan</span>\"</a>) intercepted <span class=\"xn-money\">99.92 m</span> grading 0.41% nickel and 0.35% copper starting at <span class=\"xn-money\">9.14 m</span> depth, more recent drilling has intercepted <span class=\"xn-money\">2.35 m</span> of nickel-copper massive sulphide mineralization assaying 2.33% nickel and 2.95% copper (press release dated <span class=\"xn-chron\">February 27, 2025</span> \"<a href=\"https://c212.net/c/link/?t=0&amp;l=en&amp;o=4377031-1&amp;h=3617571107&amp;u=https%3A%2F%2Ftalonmetals.com%2Ftalon-metals-reports-more-drilling-success-and-assays-from-its-michigan-boulderdash-discovery%2F&amp;a=Talon+Metals+Reports+More+Drilling+Success+and+Assays+From+its+Michigan+Boulderdash+Discovery\" rel=\"nofollow\" target=\"_blank\">Talon Metals Reports More Drilling Success and Assays From its Michigan Boulderdash Discovery</a>\"). As part of the option agreement Lundin Mining will fund an initial <span class=\"xn-money\">10,000 m</span> drill program to follow up on recent drill results.</p>\n<p><b>About Lundin Mining</b></p>\n<p>Lundin Mining is a diversified Canadian base metals mining company with operations or projects in <span class=\"xn-location\">Argentina</span>, <span class=\"xn-location\">Brazil</span>, <span class=\"xn-location\">Chile</span>, and <span class=\"xn-location\">the United States of America</span>, primarily producing copper, gold and nickel. In <span class=\"xn-chron\">December 2024</span> the Company announced the sale of its European assets to Boliden. The transaction is expected to close in mid-2025 subject to customary conditions and regulatory approvals.</p>\n<p>The information in this release is subject to the disclosure requirements of Lundin Mining under the Swedish Financial Instruments Trading Act. The information was submitted for publication, through the agency of the contact persons set out below on <span class=\"xn-chron\">March 5, 2025</span> at <span class=\"xn-chron\">14:30 Pacific Time</span>.</p>\n<p><b>Technical Information</b></p>\n<p>The scientific and technical information in this press release has been prepared in accordance with the disclosure standards of National Instrument 43-101 (\"NI 43-101\") and has been reviewed by <span class=\"xn-person\">Cole Moody</span>, PGeo., Director, Resource Geology, a \"Qualified Person\" under NI 43-101. Mr. Moody has verified the data disclosed in this release and no limitations were imposed on his verification process.</p>\n<p><b><i>Cautionary Statement on Forward-Looking Information </i></b></p>\n<p><i>Certain of the statements made and information contained herein are \"forward-looking information\" within the meaning of applicable Canadian securities laws. All statements other than statements of historical facts included in this document constitute forward-looking information, including but not limited to statements regarding: the Company's plans, prospects and business strategy; the earn-in arrangement in respect of the Boulderdash property, including the entering into of an Option Agreement in respect thereof and the terms of such Option Agreement; future actions taken by Talon and Lundin Mining in relation to the Boulderdash property and the outcomes and anticipated benefits thereof; and expectations for other economic, business, and/or competitive factors. Words such as \"believe\", \"expect\", \"anticipate\", \"contemplate\", \"target\", \"plan\", \"goal\", \"aim\", \"intend\", \"continue\", \"budget\", \"estimate\", \"may\", \"will\", \"can\", \"could\", \"should\", \"schedule\" and similar expressions are often, but not always, used identify forward-looking information.</i></p>\n<p><i>Forward-looking information is necessarily based upon various estimates and assumptions including, without limitation, the expectations and beliefs of management, including that the Company and Talon can successfully negotiate and enter into an Option Agreement, as well as the terms of such Option Agreement and the anticipated benefits of such arrangement; that the results of exploration activities at Boulderdash will be consistent with management expectations in relation thereto; the ability of Talon and Lundin to identify opportunities at Boulderdash and achieve related goals; assumed and future price of copper, zinc, nickel, gold and other metals; anticipated costs; that the political environment in which the Company operates will continue to support the development and operation of mining projects, including at Boulderdash; and assumptions related to the factors set forth below. While these factors and assumptions are considered reasonable by Lundin Mining as at the date of this document in light of management's experience and perception of current conditions and expected developments, these statements are inherently subject to significant business, economic and competitive uncertainties and contingencies. Known and unknown factors could cause actual results to differ materially from those projected in the forward-looking information and undue reliance should not be placed on such information. Such factors include, but are not limited to: the failure of the Company and Lundin to successfully negotiate the terms of an Option Agreement in a timely manner, or at all; the failure of the Company to realize the anticipated benefits of an Option Agreement; global financial conditions, market volatility and inflation, including pricing and availability of key supplies and services; risks inherent in mining including but not limited to risks to the environment, industrial accidents, catastrophic equipment failures, unusual or unexpected geological formations or unstable ground conditions, and natural phenomena such as earthquakes, flooding or unusually severe weather; uninsurable risks; volatility and fluctuations in metal and commodity demand and prices; reputation risks related to negative publicity with respect to the Company, Talon or the mining industry in general; delays or the inability to obtain, retain or comply with permits; risks relating to the development of the Boulderdash property and the Company's projects; health and safety laws and regulations; risks associated with climate change; risks relating to indebtedness; economic, political and social instability and mining regime changes, including but not limited to those related to permitting and approvals, nationalization or expropriation without fair compensation, environmental and tailings management, labour, trade relations, and transportation; an inability to attract and retain highly skilled employees; project financing risks; liquidity risks and limited financial resources; health and safety risks; compliance with environmental and other laws and regulations; unavailable or inaccessible infrastructure; infrastructure failures, and risks related to ageing infrastructure; changing taxation or tariff regimes; an inability of the Company to effectively compete in the industry; risks associated with any earn-in right in respect of the Boulderdash property, including with respect to ability to achieve anticipated benefits thereof and unanticipated difficulties or expenditures relating to the exploration and development of the Boulderdash property; risks related to mine closure activities, reclamation obligations, environmental liabilities and closed and historical sites; reliance on key personnel and reporting and oversight systems, as well as third parties and consultants; information technology and cybersecurity risks; risks associated with the estimation of Mineral Resources and Mineral Reserves and the geology, grade and continuity of mineral deposits including but not limited to models relating thereto; actual ore mined and/or metal recoveries varying from Mineral Resource and Mineral Reserve estimates, estimates of grade, tonnage, dilution, mine plans and metallurgical and other characteristics; ore processing efficiency; community and stakeholder opposition; regulatory investigations, enforcement, sanctions and/or related or other litigation; financial projections, including estimates of future expenditures and cash costs, and estimates of future production may not be reliable; risks associated with the use of derivatives; environmental and regulatory risks associated with the structural stability of waste rock dumps or tailings storage facilities; exchange rate fluctuations; compliance with laws; potential for the allegation of <span>fraud</span> and corruption involving the Company, its customers, suppliers or employees, or the allegation of improper or discriminatory employment practices, or human rights violations; risks relating to dilution; risks relating to payment of dividends; counterparty and customer concentration risks; activist shareholders and proxy solicitation matters; estimation of asset carrying values; existence of significant shareholders; challenges or defects in title; internal controls; risks relating to minor elements contained in concentrate products; the threat associated with outbreaks of viruses and infectious diseases; mining rates and rehabilitation projects; mill shut downs; and other risks and uncertainties, including but not limited to those described in the \"Risks and Uncertainties\" section of the Company's Annual Information Form for the year ended <span class=\"xn-chron\">December 31, 2024</span>, which is available on SEDAR+ at <a href=\"http://www.sedarplus.com\" rel=\"nofollow\">www.sedarplus.com</a> under the Company's profile. </i></p>\n<p><i>All of the forward-looking information in this document are qualified by these cautionary statements. Although the Company has attempted to identify important factors that could cause actual results to differ materially from those contained in forward-looking information, there may be other factors that cause results not to be as anticipated, estimated, forecasted or intended and readers are cautioned that the foregoing list is not exhaustive of all factors and assumptions which may have been used. Should one or more of these risks and uncertainties materialize, or should underlying assumptions prove incorrect, actual results may vary materially from those described in forward-looking information. Accordingly, there can be no assurance that forward-looking information will prove to be accurate and forward-looking information is not a guarantee of future performance. Readers are advised not to place undue reliance on forward-looking information. The forward-looking information contained herein speaks only as of the date of this document. The Company disclaims any intention or obligation to update or revise forward</i><i>‐</i><i>looking information or to explain any material difference between such and subsequent actual events, except as required by applicable law.</i></p>\n<div class=\"PRN_ImbeddedAssetReference\" id=\"DivAssetPlaceHolder5232\"><p><a href=\"https://mma.prnewswire.com/media/2635019/Lundin_Mining_Corporation_Lundin_Mining_to_Option_Ni_Cu_PGM_Expl.pdf?p=original\" rel=\"nofollow\" target=\"_blank\"><img alt=\"Lundin Mining to Option Ni-Cu-PGM Exploration Properties from Talon Metals Corp. (CNW Group/Lundin Mining Corporation)\" src=\"https://mma.prnewswire.com/media/2635019/Lundin_Mining_Corporation_Lundin_Mining_to_Option_Ni_Cu_PGM_Expl.pdf?p=pdfthumbnail\" title=\"Lundin Mining to Option Ni-Cu-PGM Exploration Properties from Talon Metals Corp. (CNW Group/Lundin Mining Corporation)\"></img></a></p>\n</div>\n<div class=\"PRN_ImbeddedAssetReference\" id=\"DivAssetPlaceHolder0\">\n</div>\n<p>SOURCE  Lundin Mining Corporation</p>\n<img alt=\"\" src=\"https://rt.newswire.ca/rt.gif?NewsItemId=C3345&amp;Transmission_Id=202503051730CANADANWCANADAPR_C3345&amp;DateId=20250305\" style=\"border:0px; width:1px; height:1px;\"></img>\n\n",
    "search_terms": "Boulderdash,Lundin Mining Corporation,LUN",
    "master_gid": 9960,
    "date": "2025-03-05T22:30:00.000Z",
    "tags": "||||Project Acquisition",
    "image_id": null,
    "hidden": false,
    "company_id": 1490,
    "provider": "cision",
    "excerpt": "VANCOUVER, BC,March 5, 2025/CNW/ - (TSX: LUN) (Nasdaq Stockholm: LUMI)Lundin Mining Corporation(\"Lundin Mining\" or the \"Company\") is pleased to announce today that it has entered into exclusivity to negotiate an earn-in agreement (the \"Option Agreement\") with Talon Metals Corp. (\"Talon\") for the right to acquire up to a 70% ownership interest",
    "is_regulatory": false,
    "refined_tags": [
      "Mergers & Acquisitions"
    ],
    "ftp_filename": null,
    "company_name": "Talon Metals Corp.",
    "exchange": "TSX",
    "root_ticker": "LUN",
    "project_name": "Boulderdash",
    "gid": 9960,
    "location": "Michigan, United States",
    "plan_id": null,
    "description_text": "VANCOUVER, BC , March 5, 2025 /CNW/ - (TSX: LUN) (Nasdaq Stockholm: LUMI) Lundin Mining Corporation (\"Lundin Mining\" or the \"Company\") is pleased to announce today that it has entered into exclusivity to negotiate an earn-in agreement (the \"Option Agreement\") with Talon Metals Corp. (\"Talon\") for the right to acquire up to a 70% ownership interest in the Boulderdash exploration properties (\"Boulderdash\") which are adjacent to the Company's Eagle Mine.  Concurrently with the execution of the exclusivity agreement, Lunding Mining has advanced Talon US$5 million to, among other things, commence drilling at Boulderdash. If the parties do not execute the Option Agreement, Talon will either repay such advance or issue shares to the Company with an aggregate subscription price equal to such advance based on the 5-day volume weighted average price of Talon shares on the TSX at the time of issuance. View PDF It is anticipated that pursuant to the terms of the Option Agreement, Lundin Mining will agree to fund up to 30,000 metres (m) of Talon's drilling campaign at Boulderdash in exchange for a 44.625% interest in Boulderdash. Such drill campaign will be completed in 10,000 m tranches at the election of Lundin Mining. Following the completion of 30,000 m of drilling, the Company may fund a feasibility study in respect of the Boulderdash property in exchange for an additional 25.375% interest in Boulderdash, for a total ownership of 70%, as well as the potential for a 90% interest in certain properties adjacent to Boulderdash. Boulderdash Properties The Boulderdash target is located approximately 12 kilometres northwest of Lundin Mining's Eagle Mine in Michigan , the only operating nickel mine in the U.S. The maiden drill hole at Boulderdash announced last year on October 24, 2024 (see Talon release \"Talon Metals Makes New Copper-Nickel Discovery in Michigan \" ) intercepted 99.92 m grading 0.41% nickel and 0.35% copper starting at 9.14 m depth, more recent drilling has intercepted 2.35 m of nickel-copper massive sulphide mineralization assaying 2.33% nickel and 2.95% copper (press release dated February 27, 2025 \" Talon Metals Reports More Drilling Success and Assays From its Michigan Boulderdash Discovery \"). As part of the option agreement Lundin Mining will fund an initial 10,000 m drill program to follow up on recent drill results. About Lundin Mining Lundin Mining is a diversified Canadian base metals mining company with operations or projects in Argentina , Brazil , Chile , and the United States of America , primarily producing copper, gold and nickel. In December 2024 the Company announced the sale of its European assets to Boliden. The transaction is expected to close in mid-2025 subject to customary conditions and regulatory approvals. The information in this release is subject to the disclosure requirements of Lundin Mining under the Swedish Financial Instruments Trading Act. The information was submitted for publication, through the agency of the contact persons set out below on March 5, 2025 at 14:30 Pacific Time . Technical Information The scientific and technical information in this press release has been prepared in accordance with the disclosure standards of National Instrument 43-101 (\"NI 43-101\") and has been reviewed by Cole Moody , PGeo., Director, Resource Geology, a \"Qualified Person\" under NI 43-101. Mr. Moody has verified the data disclosed in this release and no limitations were imposed on his verification process. Cautionary Statement on Forward-Looking Information Certain of the statements made and information contained herein are \"forward-looking information\" within the meaning of applicable Canadian securities laws. All statements other than statements of historical facts included in this document constitute forward-looking information, including but not limited to statements regarding: the Company's plans, prospects and business strategy; the earn-in arrangement in respect of the Boulderdash property, including the entering into of an Option Agreement in respect thereof and the terms of such Option Agreement; future actions taken by Talon and Lundin Mining in relation to the Boulderdash property and the outcomes and anticipated benefits thereof; and expectations for other economic, business, and/or competitive factors. Words such as \"believe\", \"expect\", \"anticipate\", \"contemplate\", \"target\", \"plan\", \"goal\", \"aim\", \"intend\", \"continue\", \"budget\", \"estimate\", \"may\", \"will\", \"can\", \"could\", \"should\", \"schedule\" and similar expressions are often, but not always, used identify forward-looking information. Forward-looking information is necessarily based upon various estimates and assumptions including, without limitation, the expectations and beliefs of management, including that the Company and Talon can successfully negotiate and enter into an Option Agreement, as well as the terms of such Option Agreement and the anticipated benefits of such arrangement; that the results of exploration activities at Boulderdash will be consistent with management expectations in relation thereto; the ability of Talon and Lundin to identify opportunities at Boulderdash and achieve related goals; assumed and future price of copper, zinc, nickel, gold and other metals; anticipated costs; that the political environment in which the Company operates will continue to support the development and operation of mining projects, including at Boulderdash; and assumptions related to the factors set forth below. While these factors and assumptions are considered reasonable by Lundin Mining as at the date of this document in light of management's experience and perception of current conditions and expected developments, these statements are inherently subject to significant business, economic and competitive uncertainties and contingencies. Known and unknown factors could cause actual results to differ materially from those projected in the forward-looking information and undue reliance should not be placed on such information. Such factors include, but are not limited to: the failure of the Company and Lundin to successfully negotiate the terms of an Option Agreement in a timely manner, or at all; the failure of the Company to realize the anticipated benefits of an Option Agreement; global financial conditions, market volatility and inflation, including pricing and availability of key supplies and services; risks inherent in mining including but not limited to risks to the environment, industrial accidents, catastrophic equipment failures, unusual or unexpected geological formations or unstable ground conditions, and natural phenomena such as earthquakes, flooding or unusually severe weather; uninsurable risks; volatility and fluctuations in metal and commodity demand and prices; reputation risks related to negative publicity with respect to the Company, Talon or the mining industry in general; delays or the inability to obtain, retain or comply with permits; risks relating to the development of the Boulderdash property and the Company's projects; health and safety laws and regulations; risks associated with climate change; risks relating to indebtedness; economic, political and social instability and mining regime changes, including but not limited to those related to permitting and approvals, nationalization or expropriation without fair compensation, environmental and tailings management, labour, trade relations, and transportation; an inability to attract and retain highly skilled employees; project financing risks; liquidity risks and limited financial resources; health and safety risks; compliance with environmental and other laws and regulations; unavailable or inaccessible infrastructure; infrastructure failures, and risks related to ageing infrastructure; changing taxation or tariff regimes; an inability of the Company to effectively compete in the industry; risks associated with any earn-in right in respect of the Boulderdash property, including with respect to ability to achieve anticipated benefits thereof and unanticipated difficulties or expenditures relating to the exploration and development of the Boulderdash property; risks related to mine closure activities, reclamation obligations, environmental liabilities and closed and historical sites; reliance on key personnel and reporting and oversight systems, as well as third parties and consultants; information technology and cybersecurity risks; risks associated with the estimation of Mineral Resources and Mineral Reserves and the geology, grade and continuity of mineral deposits including but not limited to models relating thereto; actual ore mined and/or metal recoveries varying from Mineral Resource and Mineral Reserve estimates, estimates of grade, tonnage, dilution, mine plans and metallurgical and other characteristics; ore processing efficiency; community and stakeholder opposition; regulatory investigations, enforcement, sanctions and/or related or other litigation; financial projections, including estimates of future expenditures and cash costs, and estimates of future production may not be reliable; risks associated with the use of derivatives; environmental and regulatory risks associated with the structural stability of waste rock dumps or tailings storage facilities; exchange rate fluctuations; compliance with laws; potential for the allegation of fraud and corruption involving the Company, its customers, suppliers or employees, or the allegation of improper or discriminatory employment practices, or human rights violations; risks relating to dilution; risks relating to payment of dividends; counterparty and customer concentration risks; activist shareholders and proxy solicitation matters; estimation of asset carrying values; existence of significant shareholders; challenges or defects in title; internal controls; risks relating to minor elements contained in concentrate products; the threat associated with outbreaks of viruses and infectious diseases; mining rates and rehabilitation projects; mill shut downs; and other risks and uncertainties, including but not limited to those described in the \"Risks and Uncertainties\" section of the Company's Annual Information Form for the year ended December 31, 2024 , which is available on SEDAR+ at www.sedarplus.com under the Company's profile. All of the forward-looking information in this document are qualified by these cautionary statements. Although the Company has attempted to identify important factors that could cause actual results to differ materially from those contained in forward-looking information, there may be other factors that cause results not to be as anticipated, estimated, forecasted or intended and readers are cautioned that the foregoing list is not exhaustive of all factors and assumptions which may have been used. Should one or more of these risks and uncertainties materialize, or should underlying assumptions prove incorrect, actual results may vary materially from those described in forward-looking information. Accordingly, there can be no assurance that forward-looking information will prove to be accurate and forward-looking information is not a guarantee of future performance. Readers are advised not to place undue reliance on forward-looking information. The forward-looking information contained herein speaks only as of the date of this document. The Company disclaims any intention or obligation to update or revise forward ‐ looking information or to explain any material difference between such and subsequent actual events, except as required by applicable law. SOURCE  Lundin Mining Corporation",
    "primary_commodity": "Ni"
  },
  "articleProject": {
    "gid": 9960,
    "project_name": "Boulderdash",
    "location": "Michigan, United States"
  },
  "articleExchange": "TSX",
  "articleCompanyId": 1490,
  "articleTicker": "LUN",
  "articleCompanyName": "Lundin Mining Corporation",
  "allOtherCompanyProjects": [
    {
      "company_id": 1490,
      "gid": 8792,
      "project_name": "Eagle Mine",
      "location": null
    },
    {
      "company_id": 1490,
      "gid": 4149,
      "project_name": "Candelaria mine",
      "location": "Atacama Region, Chile"
    },
    {
      "company_id": 1490,
      "gid": 6773,
      "project_name": "Chapada",
      "location": "Goias, Brazil"
    },
    {
      "company_id": 1490,
      "gid": 6368,
      "project_name": "Neves-Corvo",
      "location": "Portugal"
    },
    {
      "company_id": 1490,
      "gid": 2680,
      "project_name": "Josemaria",
      "location": "Argentina"
    },
    {
      "company_id": 1490,
      "gid": 9227,
      "project_name": "Zinkgruvan",
      "location": "Sweden"
    },
    {
      "company_id": 1490,
      "gid": 4302,
      "project_name": "Caserones Mine",
      "location": "Atacama Region, Chile"
    }
  ],
  "allOtherCompanyNews": [
    {
      "id": 108193,
      "company_id": 1490,
      "title": "Lundin Mining Files Vicuña Mineral Resource Technical Report",
      "link": "https://app.quotemedia.com/data/downloadFiling?webmasterId=104408&ref=6850987ea9bd4a63d30e9982&type=PDFC&formType=002-002-001089-003001&formDescription=News+release&dateFiled=2025-06-16",
      "date": "2025-06-16T22:19:42.000Z",
      "hidden": false
    },
    {
      "id": 108191,
      "company_id": 1490,
      "title": "Lundin Mining Files Vicuña Mineral Resource Technical Report",
      "link": "https://contentapi.cision.com/api/v1.0/releases/20250616C8675",
      "date": "2025-06-16T22:15:00.000Z",
      "hidden": false
    },
    {
      "id": 107846,
      "company_id": 1490,
      "title": "Lundin Mining Announces 2025 Capital Markets Day",
      "link": "https://contentapi.cision.com/api/v1.0/releases/20250611C3201",
      "date": "2025-06-12T02:30:00.000Z",
      "hidden": false
    },
    {
      "id": 106460,
      "company_id": 1490,
      "title": "Lundin Mining Announces Updated Share Capital and Provides Update on Share Buybacks",
      "link": "https://app.quotemedia.com/data/downloadFiling?webmasterId=104408&ref=683a5d79019914272a4b3f21&type=PDFC&formType=002-002-001089-003001&formDescription=News+release&dateFiled=2025-05-30",
      "date": "2025-05-31T01:38:01.000Z",
      "hidden": false
    },
    {
      "id": 105909,
      "company_id": 1490,
      "title": "Lundin Mining Announces 2024 Sustainability Report",
      "link": "https://contentapi.cision.com/api/v1.0/releases/20250526C1291",
      "date": "2025-05-26T22:30:00.000Z",
      "hidden": false
    },
    {
      "id": 104015,
      "company_id": 1490,
      "title": "Lundin Mining First Quarter 2025 Results",
      "link": "https://contentapi.cision.com/api/v1.0/releases/20250507C3429",
      "date": "2025-05-07T22:35:00.000Z",
      "hidden": false
    },
    {
      "id": -199764,
      "company_id": 1490,
      "title": "Lundin Mining Announces Declaration of Regular Dividend",
      "link": "https://contentapi.cision.com/api/v1.0/releases/20250507C6785",
      "date": "2025-05-07T22:30:00.000Z",
      "hidden": false
    },
    {
      "id": 103344,
      "company_id": 1490,
      "title": "Lundin Mining Announces Initial Mineral Resource at Filo Del Sol Demonstrating One of the World's Largest Copper, Gold, and Silver Resources",
      "link": "https://contentapi.cision.com/api/v1.0/releases/20250504C7225",
      "date": "2025-05-04T21:00:00.000Z",
      "hidden": false
    },
    {
      "id": 103041,
      "company_id": 1490,
      "title": "Lundin Mining Announces Updated Share Capital and Provides Update on Share Buybacks",
      "link": "https://app.quotemedia.com/data/downloadFiling?webmasterId=104408&ref=6812c7756977946687691115&type=PDFC&formType=002-002-001089-003001&formDescription=News+release&dateFiled=2025-04-30",
      "date": "2025-05-01T00:59:33.000Z",
      "hidden": false
    },
    {
      "id": 100245,
      "company_id": 1490,
      "title": "Lundin Mining Pre-Announces Items Impacting the First Quarter 2025 Results",
      "link": "https://contentapi.cision.com/api/v1.0/releases/20250417C2927",
      "date": "2025-04-17T22:00:00.000Z",
      "hidden": false
    }
  ]
}