{
  "article": {
    "id": 29679,
    "link": "https://www.newsfilecorp.com/release/150934/Kraken-Energy-Stakes-PastProducing-Huber-Hills-Uranium-Project-in-Nevada",
    "title": "Kraken Energy Stakes Past-Producing Huber Hills Uranium Project in Nevada",
    "description": "<img id=\"367\" width=\"2\" height=\"2\" style=\"width: 1px;  height: 1px;border: 0px solid;\" src=\"https://api.newsfilecorp.com/newsinfo/150934/367\" /><p>Vancouver, British Columbia--(Newsfile Corp. - January 11, 2023) - <b>Kraken Energy Corp. (CSE: UUSA) (OTCQB: UUSAF)</b> (the \"<b>Company</b>\" or \"<b>Kraken</b>\") is pleased to announce that it has staked mining claims encompassing the Huber Hills Uranium Project (\"<b>Huber Hills</b>\" or \"<b>the Project</b>\") in Elko County, Nevada.</p><p><b>Huber Hills Uranium Project Highlights:</b></p><ul><li>129 unpatented lode claims covering 1,044 hectares (2,580 acres)<br /><br /></li><li>Claims encompass the historic Race Track open pit mine, once Elko County's largest uranium producer, which produced ~10,000 pounds of U<sub>3</sub>O<sub>8</sub> grading 0.24% U<sub>3</sub>O<sub>8<br /><br /></sub></li><li>Channel samples from Race Track returned results of 0.149% and 0.102% U<sub>3</sub>O<sub>8</sub> (2007)<br /><br /></li><li>Located near Mountain City, north of California Creek in an area with numerous well-known uranium occurrences discovered and worked during the uranium boom of the 1950s and 1960s<br /><br /></li><li>Claims also cover multiple historic uranium showings and molybdenum prospects, including the Autunite and October uranium showings<br /><br /></li><li>Believed to cover the western portion of the Mountain West Property, which has a historical resource of 1.1 million pounds U<sub>3</sub>O<sub>8</sub> with an average grade of 0.153% U<sub>3</sub>O<sub>8</sub>.</li></ul><p><i>This above mineral resource estimate is considered to be an \"historical estimate\" under National Instrument 43-101 - Standards of Disclosure for Mineral Projects (\"NI 43-101\"). A Qualified Person has not done sufficient work to classify the historical estimate as a current mineral resource, and the Company is not treating these historical estimates as current Mineral Resources. Confirmatory drilling of historical drill holes would be required in order to verify the Mountain West Deposit historical estimate as a current mineral resource.</i></p><p>\"Huber Hills is a highly prospective land package that fits well with our strategy to acquire and explore high-grade, past-producing US-based uranium projects with the potential to feed a central milling facility as part of a hub and spoke model,\" stated CEO Matthew Schwab. \"We plan to approach this project with rapid and cost-efficient exploration activities, such as drone magnetics and radiometrics, geological mapping, and prospecting to confirm existing targets and outline new anomalies, followed by a drilling program targeted for H2 2023.\"</p><p>The Huber Hill property comprises 129 unpatented lode mineral claims covering approximately 1,044 hectares (2,580 acres) and is located near Mountain City, north of California Creek in Elko County, Nevada. The mineral claims encompass the historic Race Track uranium mine, and the Autunite and October uranium showings, plus numerous molybdenum prospects. The Race Track Mine was the largest producer of uranium during the 1950s and 1960s in Elko County, producing nearly 10,000 pounds of U<sub>3</sub>O<sub>8</sub> from ore grading 0.24%<sup>1</sup>. A recent sampling program completed within the historic Race Track Mine open pit by the project's previous operator, Samba Gold Inc. in 2007, consisted of two adjacent 4.5 metre (14.9 feet) channel samples from an exposed bentonitic tuff found in the best developed part of the historic pit, returned results of 0.149% and 0.102% U<sub>3</sub>O<sub>8</sub>.</p><p><font style=\"font-size: 11px;\"><i><sup>1</sup></i><i> Garside &#38; David, 2006</i></font></p><p><b>Accessibility:</b></p><p>The Huber Hills Project is located roughly 2.0 kilometres (1.2 miles) east of Mountain City, Nevada and is accessible year-round from Elko, Nevada via all-weather highway 225.</p><p style=\"text-align: center;\"><a href=\"https://images.newsfilecorp.com/files/8684/150934_krakenfigure1.jpg\"><img style=\"border-width: 0px;\" src=\"https://images.newsfilecorp.com/files/8684/150934_krakenfigure1_550.jpg\" alt=\"Cannot view this image? Visit: https://images.newsfilecorp.com/files/8684/150934_krakenfigure1_550.jpg\" /></a><br /><br /><b>Figure 1: Huber Hills Property Map</b></p><p style=\"text-align: center;\">To view an enhanced version of Figure 1, please visit:<br /><a href=\"https://images.newsfilecorp.com/files/8684/150934_krakenfigure1.jpg\">https://images.newsfilecorp.com/files/8684/150934_krakenfigure1.jpg</a></p><p>The Project is believed to cover the western portion of the Mountain West Property, formerly owned by Bayswater Uranium (Kilgore Minerals Co.), which is located 8 kilometres (5 miles) east of the small village of Mountain City. This property was explored between 1967 and 1983 by Pathfinder Mines (owned by Cogema) and its predecessor Utah Construction and Mining Co. and, according to Baywater press releases, 359 holes were drilled to depths of up to 82 metres (270 feet) and an historic resource of approximately 1.1 million pounds U<sub>3</sub>O<sub>8</sub> with an average grade of 0.153% U<sub>3</sub>O<sub>8</sub> was defined.</p><p><b>Geological Information:</b></p><p>There are two general types of uranium deposits on the claim groups: one type occurs along vertical fractures and/or shear zones in quartz monzontie (Autunite and October Prospects), while the other type of deposit is related to the contact zone between the underlying Cretaceous quartz monzonite and the overlying Tertiary volcanic sediments. At the Race Track Mine, an apparent basal tuffaceous layer has also been described as a shear zone separating the quartz monzonite from the granite. The Autunite and October prospects are developed in a near vertical shear zone in the quartz monzonite.</p><p><b>Technical Information</b></p><p>All scientific and technical information in this news release has been prepared by or reviewed and approved by Matthew Schwab, P.Geo., President and CEO of the Company, and Garrett Ainsworth, P.Geo., Chairman of the Company. Each of Mr. Schwab and Mr. Ainsworth is a Qualified Person for the purposes of National Instrument 43-101 - Standards of Disclosure for Mineral Projects.</p><p><b>About Kraken Energy Corp.</b></p><p>Kraken Energy Corp. is a new energy company advancing its 100%-owned Apex Uranium Property, located 280 km (174 miles) east from Reno, Nevada. The Apex Property is recognized as Nevada's largest past-producing uranium mine. The Company has additionally entered into an option agreement to earn 100% of the Garfield Hills Uranium Property, located 19 km (12 miles) east of Hawthorne in Mineral County, Nevada. Additional staking has been done on the Garfield Hills Uranium Property, bringing the total area of the Property to 1,238 hectares (3,060 acres). For more information about the Company, please visit <a href=\"https://www.newsfilecorp.com/redirect/oJGVKUeP2B\">www.krakenenergycorp.com</a>.</p><p><b>On Behalf of the Board of Kraken Energy Corp.</b></p><p>Matthew Schwab<br />President &#38; Chief Executive Officer</p><p>Corporate Office:<br />Suite 907 - 1030 West Georgia Street<br />Vancouver, British Columbia<br />V6E 2Y3<br />T: (604) 377-1212</p><p>For investor relations inquiries, contact:<br />Kristina Pillon, High Tide Consulting Corp.<br />E: <a href=\"mailto:info@krakenenergycorp.com\">info@krakenenergycorp.com</a></p><p><i>The CSE has neither approved nor disapproved the contents of this news release. Neither the CSE nor its Regulation Services Provider (as that term is defined in the policies of the CSE) accepts responsibility for the adequacy or accuracy of this release.</i></p><p><i>This press release includes \"forward-looking information\" that is subject to a number of assumptions, risks and uncertainties, many of which are beyond the control of the Company. Such statements are subject to all of the risks and uncertainties normally incident to such events. Investors are cautioned that any such statements are not guarantees of future events and that actual events or developments may differ materially from those projected in the forward-looking statements. Such forward-looking statements represent management's best judgment based on information currently available.</i></p><p id=\"corporateNewsLogoContainer\"><img src=\"https://images.newsfilecorp.com/files/8684/150934_a0feeb0a746caa67_logo.jpg\" id=\"corporateNewsLogo\" alt=\"Corporate Logo\" /></p><p id=\"corporateLinkBack\">To view the source version of this press release, please visit <a href=\"https://www.newsfilecorp.com/redirect/OLQB5fLZX3\">https://www.newsfilecorp.com/release/150934</a></p>",
    "search_terms": "Huber Hills,Kraken Energy Corp.,UUSA",
    "master_gid": 3885,
    "date": "2023-01-11T12:30:00.000Z",
    "tags": "USA|Nevada||Uranium|Project Acquisition",
    "image_id": null,
    "hidden": false,
    "company_id": 1429,
    "provider": null,
    "excerpt": "Vancouver, British Columbia--(Newsfile Corp. - January 11, 2023) -Kraken Energy Corp. (CSE: UUSA) (OTCQB: UUSAF)(the \"Company\" or \"Kraken\") is pleased to announce that it has staked mining claims encompassing the Huber Hills Uranium Project (\"Huber Hills\" or \"the Project\") in Elko County, Nevada.Huber Hills Uranium Project Highlights:129 unpatented lode claims",
    "is_regulatory": false,
    "refined_tags": [
      "Project Acquisition"
    ],
    "ftp_filename": null,
    "company_name": "Kraken Energy Corp.",
    "exchange": "CSE",
    "root_ticker": "UUSA",
    "project_name": "Huber Hills",
    "gid": 3885,
    "location": "Nevada, United States",
    "plan_id": null,
    "description_text": "Vancouver, British Columbia--(Newsfile Corp. - January 11, 2023) - Kraken Energy Corp. (CSE: UUSA) (OTCQB: UUSAF) (the \" Company \" or \" Kraken \") is pleased to announce that it has staked mining claims encompassing the Huber Hills Uranium Project (\" Huber Hills \" or \" the Project \") in Elko County, Nevada. Huber Hills Uranium Project Highlights: 129 unpatented lode claims covering 1,044 hectares (2,580 acres) Claims encompass the historic Race Track open pit mine, once Elko County's largest uranium producer, which produced ~10,000 pounds of U 3 O 8 grading 0.24% U 3 O 8 Channel samples from Race Track returned results of 0.149% and 0.102% U 3 O 8 (2007) Located near Mountain City, north of California Creek in an area with numerous well-known uranium occurrences discovered and worked during the uranium boom of the 1950s and 1960s Claims also cover multiple historic uranium showings and molybdenum prospects, including the Autunite and October uranium showings Believed to cover the western portion of the Mountain West Property, which has a historical resource of 1.1 million pounds U 3 O 8 with an average grade of 0.153% U 3 O 8 . This above mineral resource estimate is considered to be an \"historical estimate\" under National Instrument 43-101 - Standards of Disclosure for Mineral Projects (\"NI 43-101\"). A Qualified Person has not done sufficient work to classify the historical estimate as a current mineral resource, and the Company is not treating these historical estimates as current Mineral Resources. Confirmatory drilling of historical drill holes would be required in order to verify the Mountain West Deposit historical estimate as a current mineral resource. \"Huber Hills is a highly prospective land package that fits well with our strategy to acquire and explore high-grade, past-producing US-based uranium projects with the potential to feed a central milling facility as part of a hub and spoke model,\" stated CEO Matthew Schwab. \"We plan to approach this project with rapid and cost-efficient exploration activities, such as drone magnetics and radiometrics, geological mapping, and prospecting to confirm existing targets and outline new anomalies, followed by a drilling program targeted for H2 2023.\" The Huber Hill property comprises 129 unpatented lode mineral claims covering approximately 1,044 hectares (2,580 acres) and is located near Mountain City, north of California Creek in Elko County, Nevada. The mineral claims encompass the historic Race Track uranium mine, and the Autunite and October uranium showings, plus numerous molybdenum prospects. The Race Track Mine was the largest producer of uranium during the 1950s and 1960s in Elko County, producing nearly 10,000 pounds of U 3 O 8 from ore grading 0.24% 1 . A recent sampling program completed within the historic Race Track Mine open pit by the project's previous operator, Samba Gold Inc. in 2007, consisted of two adjacent 4.5 metre (14.9 feet) channel samples from an exposed bentonitic tuff found in the best developed part of the historic pit, returned results of 0.149% and 0.102% U 3 O 8 . 1 Garside & David, 2006 Accessibility: The Huber Hills Project is located roughly 2.0 kilometres (1.2 miles) east of Mountain City, Nevada and is accessible year-round from Elko, Nevada via all-weather highway 225. Figure 1: Huber Hills Property Map To view an enhanced version of Figure 1, please visit: https://images.newsfilecorp.com/files/8684/150934_krakenfigure1.jpg The Project is believed to cover the western portion of the Mountain West Property, formerly owned by Bayswater Uranium (Kilgore Minerals Co.), which is located 8 kilometres (5 miles) east of the small village of Mountain City. This property was explored between 1967 and 1983 by Pathfinder Mines (owned by Cogema) and its predecessor Utah Construction and Mining Co. and, according to Baywater press releases, 359 holes were drilled to depths of up to 82 metres (270 feet) and an historic resource of approximately 1.1 million pounds U 3 O 8 with an average grade of 0.153% U 3 O 8 was defined. Geological Information: There are two general types of uranium deposits on the claim groups: one type occurs along vertical fractures and/or shear zones in quartz monzontie (Autunite and October Prospects), while the other type of deposit is related to the contact zone between the underlying Cretaceous quartz monzonite and the overlying Tertiary volcanic sediments. At the Race Track Mine, an apparent basal tuffaceous layer has also been described as a shear zone separating the quartz monzonite from the granite. The Autunite and October prospects are developed in a near vertical shear zone in the quartz monzonite. Technical Information All scientific and technical information in this news release has been prepared by or reviewed and approved by Matthew Schwab, P.Geo., President and CEO of the Company, and Garrett Ainsworth, P.Geo., Chairman of the Company. Each of Mr. Schwab and Mr. Ainsworth is a Qualified Person for the purposes of National Instrument 43-101 - Standards of Disclosure for Mineral Projects. About Kraken Energy Corp. Kraken Energy Corp. is a new energy company advancing its 100%-owned Apex Uranium Property, located 280 km (174 miles) east from Reno, Nevada. The Apex Property is recognized as Nevada's largest past-producing uranium mine. The Company has additionally entered into an option agreement to earn 100% of the Garfield Hills Uranium Property, located 19 km (12 miles) east of Hawthorne in Mineral County, Nevada. Additional staking has been done on the Garfield Hills Uranium Property, bringing the total area of the Property to 1,238 hectares (3,060 acres). For more information about the Company, please visit www.krakenenergycorp.com . On Behalf of the Board of Kraken Energy Corp. Matthew Schwab President & Chief Executive Officer Corporate Office: Suite 907 - 1030 West Georgia Street Vancouver, British Columbia V6E 2Y3 T: (604) 377-1212 For investor relations inquiries, contact: Kristina Pillon, High Tide Consulting Corp. E: info@krakenenergycorp.com The CSE has neither approved nor disapproved the contents of this news release. Neither the CSE nor its Regulation Services Provider (as that term is defined in the policies of the CSE) accepts responsibility for the adequacy or accuracy of this release. This press release includes \"forward-looking information\" that is subject to a number of assumptions, risks and uncertainties, many of which are beyond the control of the Company. Such statements are subject to all of the risks and uncertainties normally incident to such events. Investors are cautioned that any such statements are not guarantees of future events and that actual events or developments may differ materially from those projected in the forward-looking statements. Such forward-looking statements represent management's best judgment based on information currently available. To view the source version of this press release, please visit https://www.newsfilecorp.com/release/150934",
    "primary_commodity": "U"
  },
  "articleProject": {
    "gid": 3885,
    "project_name": "Huber Hills",
    "location": "Nevada, United States"
  },
  "articleExchange": "CSE",
  "articleCompanyId": 1429,
  "articleTicker": "UUSA",
  "articleCompanyName": "Kraken Energy Corp.",
  "allOtherCompanyProjects": [
    {
      "company_id": 1429,
      "gid": 3885,
      "project_name": "Huber Hills",
      "location": "Nevada, United States"
    },
    {
      "company_id": 1429,
      "gid": 3475,
      "project_name": "Garfield Hills",
      "location": "Nevada, United States"
    },
    {
      "company_id": 1429,
      "gid": 2673,
      "project_name": "Apex",
      "location": "Nevada"
    }
  ],
  "allOtherCompanyNews": [
    {
      "id": 104907,
      "company_id": 1429,
      "title": "Kraken Mails Meeting Materials to Approve Acquisition by Aero Energy",
      "link": null,
      "date": "2025-05-16T11:00:00.000Z",
      "hidden": false
    },
    {
      "id": -193787,
      "company_id": 1429,
      "title": "Aero Energy and Kraken Energy Combine to Create a Premier North American Uranium Developer",
      "link": "https://app.quotemedia.com/data/downloadFiling?webmasterId=104408&ref=67ed1d69bac2286d58225bf1&type=PDFC&formType=002-002-001089-003001&formDescription=News+release&dateFiled=2025-04-02",
      "date": "2025-04-02T04:20:09.000Z",
      "hidden": false
    },
    {
      "id": 81166,
      "company_id": 1429,
      "title": "Kraken Energy Provides an Update on the Drilling Permit for the Apex Property in Nevada",
      "link": "https://www.newsfilecorp.com/release/232726/Kraken-Energy-Provides-an-Update-on-the-Drilling-Permit-for-the-Apex-Property-in-Nevada",
      "date": "2024-12-06T13:00:00.000Z",
      "hidden": false
    },
    {
      "id": 70459,
      "company_id": 1429,
      "title": "Kraken Energy Appoints Brian Goss as Interim Chief Executive Officer",
      "link": "https://www.newsfilecorp.com/release/222200/Kraken-Energy-Appoints-Brian-Goss-as-Interim-Chief-Executive-Officer",
      "date": "2024-09-05T12:30:00.000Z",
      "hidden": false
    },
    {
      "id": 68462,
      "company_id": 1429,
      "title": "Kraken Energy Provides Corporate Update",
      "link": "https://www.newsfilecorp.com/release/220007/Kraken-Energy-Provides-Corporate-Update",
      "date": "2024-08-15T12:00:00.000Z",
      "hidden": false
    },
    {
      "id": 63870,
      "company_id": 1429,
      "title": "Kraken Energy Completes First Tranche of Private Placement",
      "link": "https://www.newsfilecorp.com/release/214946/Kraken-Energy-Completes-First-Tranche-of-Private-Placement",
      "date": "2024-06-28T20:40:00.000Z",
      "hidden": false
    },
    {
      "id": 54504,
      "company_id": 1429,
      "title": "Kraken Energy Announces Financing",
      "link": "https://www.newsfilecorp.com/release/210665/Kraken-Energy-Announces-Financing",
      "date": "2024-05-27T12:00:00.000Z",
      "hidden": false
    },
    {
      "id": 53812,
      "company_id": 1429,
      "title": "Kraken Energy Reports on Positive Radon Results and Drill Permitting Update at Apex Uranium Property, Nevada",
      "link": "https://www.newsfilecorp.com/release/209080/Kraken-Energy-Reports-on-Positive-Radon-Results-and-Drill-Permitting-Update-at-Apex-Uranium-Property-Nevada",
      "date": "2024-05-14T12:00:00.000Z",
      "hidden": false
    },
    {
      "id": 51033,
      "company_id": 1429,
      "title": "Kraken Energy Confirms Elevated Radioactivity in Both Initial Drill Holes at Harts Point Property, Utah",
      "link": "https://www.newsfilecorp.com/release/203107/Kraken-Energy-Confirms-Elevated-Radioactivity-in-Both-Initial-Drill-Holes-at-Harts-Point-Property-Utah",
      "date": "2024-03-26T12:00:00.000Z",
      "hidden": false
    },
    {
      "id": 50738,
      "company_id": 1429,
      "title": "Kraken Energy to Present at the 2024 Kinvestor Critical Minerals & Mining Virtual Conference",
      "link": "https://www.newsfilecorp.com/release/202173/Kraken-Energy-to-Present-at-the-2024-Kinvestor-Critical-Minerals-Mining-Virtual-Conference",
      "date": "2024-03-19T12:00:00.000Z",
      "hidden": false
    }
  ]
}
