{
  "article": {
    "id": 49216,
    "link": "https://www.globenewswire.com/news-release/2024/02/21/2832657/0/en/Revival-Gold-Expands-Land-Position-and-Advances-Exploration-South-of-Joss.html",
    "title": "Revival Gold Expands Land Position and Advances Exploration South of Joss",
    "description": "<p align=\"justify\">TORONTO, Feb.  21, 2024  (GLOBE NEWSWIRE) -- <strong>Reviva</strong><strong>l</strong> <strong>Gold</strong> <strong>Inc.</strong> <strong>(TSXV:</strong> <strong>RVG,</strong> <strong>OTCQX:</strong> <strong>RVLGF)</strong> (“Revival Gold” or the “Company”) is pleased to announce the expansion of its land position, the results of recent geophysical and geological work, and the advance of exploration on a newly defined target area known as Sharkey on the Company’s Beartrack-Arnett Gold Project (“Beartrack-Arnett”) located in Idaho, USA.<br /></p>  <p align=\"justify\"><strong>Highlights</strong></p>  <ul type=\"disc\"><li style=\"margin-bottom:6pt; text-align:justify;\">Fifty-seven lode claims encompassing 476 hectares have been staked to increase Revival Gold’s land position on prospective exploration ground at the south end of Beartrack-Arnett (see Figure 1 for details);</li><li style=\"margin-bottom:6pt; text-align:justify;\">18-line kilometers of IP geophysics along with 16-line kilometers of CSAMT geophysics collected over multiple campaigns at Beartrack between 1990 and 1996 were reprocessed with present-day algorithms to produce a consistent set of 2-D inversion products;</li><li style=\"margin-bottom:6pt; text-align:justify;\">The reprocessed geophysical data together with results from last season’s soil geochemistry survey and recent Leapfrog software-based geological and structural modeling has further clarified Revival Gold’s understanding of the geology and structure in the Panther Creek-Coiner Fault System;</li><li style=\"margin-bottom:6pt; text-align:justify;\">The Panther Creek-Coiner Fault System extends approximately five kilometers south of the Joss Zone at Beartrack-Arnett and is now thought to be an anastomosing (or braided) fault system that is typical of the structures that host many orogenic gold deposits;</li><li style=\"margin-bottom:6pt; text-align:justify;\">Potential targets in braided shear zones include bends, or changes in strike, and structural intersections of the various structures within the broader structural system, and multiple strands of the shear zone may be mineralized; and,</li><li style=\"margin-bottom:6pt; text-align:justify;\">Chief among the newly defined targets is Sharkey located within the Panther Creek Structural Corridor approximately two kilometers south of the existing underground mineralization in the Joss target area.</li></ul>  <p align=\"justify\">“Revival Gold’s recent work analysing and modeling geophysical and geological data from the south end of Beartrack-Arnett has sharpened our exploration team’s focus on the Panther Creek-Coiner Fault braided fault system,” said Hugh Agro, President &amp; CEO. “The Sharkey target has emerged as a high-value under-cover target with tonnage and grade potential equivalent to, and perhaps greater than, what we have at Joss. Sharkey lies within Revival Gold’s approved Plan of Operations permit for drilling at Beartrack-Arnett and represents a high-priority target for follow-up exploration this season,” added Agro.</p>  <p align=\"justify\"><strong>Further Details</strong></p>  <p align=\"justify\">The Beartrack-Arnett Project consists of two orogenic gold systems with a Measured &amp; Indicated Mineral Resource of 86.2 million tonnes at 0.87 g/T gold containing 2.42 million ounces of gold, and an Inferred Mineral Resource of 50.7 million tonnes at 1.34 g/T gold containing 2.19 million ounces of gold (see “Preliminary Feasibility Study NI 43-101 Technical Report on the Beartrack-Arnett Heap Leach Project, Lemhi County, Idaho, USA”, prepared by Kappes, Cassidy &amp; Associates, Independent Mining Consultants, Inc., KC Harvey Environmental LLC, and WSP USA Environment &amp; Infrastructure Inc. dated August 2<sup>nd</sup>, 2023).</p>  <p align=\"justify\">Most of the Beartrack-Arnett Mineral Resource is contained within five deposits at Beartrack distributed over more than five kilometers of strike of the Panther Creek Shear Zone (“PCSZ”). Gold has been encountered in all Revival Gold drill holes intersecting the PCSZ, and the structure has been drill-tested over a vertical distance of 750 meters. The high-grade, potentially underground mineable resource at Joss (6.7 million tonnes of Inferred Mineral Resource at 4.0 g/T gold containing 877,000 ounces of gold), has been drilled for over 400 meters vertically and mineralization is open in all directions.  </p>  <p align=\"justify\">The most favorable host rocks at Beartrack are Mesoproterozoic siltites and silty quartzites. These units are mineralized in the South Pit ore body and at Joss, where grades are generally highest. These units extend to the south and are exposed along the margins of the Leesburg Basin.</p>  <p align=\"justify\">Revival Gold’s IP and reprocessed CSAMT geophysical lines effectively map contrasting resistivities between the post-mineralization (Tertiary and Quaternary) Leesburg Basin fill sequence and the Mesoproterozoic host rocks. In the Joss area, mineralization occurs immediately east of a post-mineral Basin bounding fault (Coiner Fault). The structure is effectively mapped by the CSAMT and can be projected for approximately five kilometers south of Joss (see Figure 2 for details).</p>  <p align=\"justify\">The Coiner Fault, and associated mineralization, is not exposed south of the South Pit due to extensive post-mineralization Tertiary sedimentary and volcanic cover in the Leesburg Basin. The post-mineralization cover obscures geology and presents an intriguing exploration opportunity as any mineralization in this area is not exposed.</p>  <p align=\"justify\">The intersection of the Coiner Fault and the Arnett structure is also an exploration target. This is the deepest portion of the Leesburg Basin but represents a large area of favorable structural preparation.</p>  <p align=\"justify\">In addition to the recently reprocessed geophysics, Revival Gold conducted a soil survey during the 2023 field season to characterize the soil geochemistry over the Coiner Fault. 119 soil samples were taken over the approximate trace of the fault. Overall, the soil survey showed a general trend of increasing gold, arsenic, and mercury from south to north. A spatially coherent anomaly over the structure was, however, not detected.</p>  <p align=\"justify\">In 2020 Revival Gold drilled three core holes approximately 1.2 to 2.2 kilometers south of the southern Joss drill fence to explore the intersection of the Arnett Creek structure with the Coiner Fault. Difficult drilling conditions prevented the holes from testing a significant thickness of the target stratigraphy. The holes are thought to have encountered the trough of the Leesburg Basin but were drilled west of the Coiner Fault based on Revival Gold’s current CSAMT interpretation.</p>  <p align=\"justify\">In 2021 Revival Gold continued exploring both Joss and the southern extension of the Coiner Fault south of Joss. One core hole was drilled approximately 500 meters south of the southern Joss drill fence. Based on Revival Gold’s current understanding of the Joss deposit architecture, this hole is believed to have passed over the top of the mineralized horizon intercepting 73 meters of the target Mesoproterozoic stratigraphy before passing back into the post-mineral basin fill. Anomalous gold (high of 0.048 ppm) and arsenic (high of 185 ppm) were intercepted within the target stratigraphy associated with sericitic alteration and quartz veining.</p>  <p align=\"justify\">Revival Gold’s 2020 and 2021 drilling leaves the southern extension of the Coiner Fault System untested and worthy of further exploration. An additional program of field mapping, infill geophysics, and scout drilling, is being prepared to further evaluate the structural corridor south of Joss.</p>  <p align=\"center\"><strong>Figure 1:</strong>  <strong> Panther Creek-Coiner Fault System </strong><br /><strong>Showing Claim Additions and the Sharkey Target</strong></p>  <p align=\"center\"><img alt=\"Panther Creek-Coiner Fault System Showing Claim Additions and the Sharkey Target\" height=\"600\" name=\"GNW_RichHtml_External_IMG\" src=\"https://ml.globenewswire.com/Resource/Download/0d0eb93b-cf83-45ba-aeb7-fbe94c5ce6b1/Figure 1.jpg\" width=\"538\" /><br /></p>  <p align=\"center\"><strong>Figure 2:</strong>  <strong> Perspective View of Reprocessed CSAMT Resistivity </strong><br /><strong>Showing Key Structures 2023 Mineral Resource Blocks &gt; 2 g/t Au</strong></p>  <p align=\"justify\"><img alt=\"Perspective View of Reprocessed CSAMT Resistivity Showing Key Structures 2023 Mineral Resource Blocks\" data-mce-style=\"display: block; margin-left: auto; margin-right: auto;\" src=\"https://ml.globenewswire.com/Resource/Download/45e6ec98-a1af-450b-bb87-aaf3c3c44bd6/Figure 2.jpg\" style=\"display:block; margin-left:auto; margin-right:auto;\" /> <br /></p>  <p align=\"justify\"><strong>Qualified Persons</strong></p>  <p align=\"justify\">Steven T. Priesmeyer, C.P.G., Vice President Exploration, and Dan Pace, Regis. Mem. SME, Chief Geologist, Revival Gold Inc., are the Company’s designated Qualified Person for this news release within the meaning of National Instrument 43-101 Standards of Disclosure for Mineral Projects and have reviewed and approved its scientific and technical content.</p>  <p align=\"justify\"><strong>About Revival Gold Inc.</strong></p>  <p align=\"justify\">Revival Gold is a growth-focused gold exploration and development company. The Company is advancing the Beartrack-Arnett Gold Project located in Idaho, USA.</p>  <p align=\"justify\">Beartrack-Arnett is the largest past-producing gold mine in Idaho. The Project benefits from extensive existing infrastructure and is the subject of a recent Preliminary Feasibility Study for the potential restart of open pit heap leach gold production operations.</p>  <p align=\"justify\">Since reassembling the Beartrack-Arnett land position in 2017, Revival Gold has made one of the largest new discoveries of gold in the United States in the past decade. The mineralized trend at Beartrack extends for over five kilometers and is open on strike and at depth. Mineralization at Arnett is open in all directions.</p>  <p align=\"justify\">Additional disclosure including the Company’s financial statements, technical reports, news releases and other information can be obtained at <a href=\"https://www.globenewswire.com/Tracker?data=6qmmS1jRxlRVXbbS0USY6ZnywPXEqJqkpgPHsrUN0oQD1t33dFT9RbRJMKbmm8xWoesgKLLCHS4Kw584NGMnmF5kLiiM6hd7TcRqycf0MHc=\" rel=\"nofollow\" target=\"_blank\" title=\"www.revival-gold.com\">www.revival-gold.com</a> or on SEDAR+ at <a href=\"https://www.globenewswire.com/Tracker?data=9ejEr5TK1wgbyV312qW2yIp5ROucbbhGxKzA_cSmBGfTaBNphypFZ0f-lh_xGy3JvCdJOL78IgcdGaNP_1kOhzCR447iGKyqChHUIF4q7aQ=\" rel=\"nofollow\" target=\"_blank\" title=\"www.sedarplus.ca\">www.sedarplus.ca</a>.</p>  <p>For further information, please contact: Hugh Agro, President &amp; CEO or Lisa Ross, CFO, telephone: (416) 366-4100 or email: <a href=\"https://www.globenewswire.com/Tracker?data=zn_QTZ5qongzrSYsvgOK13rsx17VGHzKmVVx-D0xQ0HcVMd4xtK4s31-wLdCvT-Jw9Sl9A9SjBI98cwy47H27xQfw7roo0Shpey3x6yz5QM=\" rel=\"nofollow\" target=\"_blank\" title=\"info@revival-gold.com\">info@revival-gold.com</a>.</p>  <p><strong>Cautionary Statement</strong></p>  <p align=\"justify\">Neither the TSX Venture Exchange nor its Regulation Services Provider (as that term is defined in the policies of the TSX Venture Exchange) accepts responsibility for the adequacy or accuracy of this news release.</p>  <p align=\"justify\">This press release includes certain \"forward-looking information\" within the meaning of Canadian securities legislation and “forward-looking statements” within the meaning of U.S. securities legislation (collectively “forward-looking statements”). Forward-looking statements are not comprised of historical facts. Forward-looking statements include estimates and statements that describe the Company’s future plans, objectives or goals, including words to the effect that the Company or management expects a stated condition or result to occur. Forward-looking statements may be identified by such terms as “believes”, “anticipates”, “expects”, “estimates”, “may”, “could”, “would”, “will”, or “plan”. Since forward-looking statements are based on assumptions and address future events and conditions, by their very nature they involve inherent risks and uncertainties. Although these statements are based on information currently available to the Company, the Company provides no assurance that actual results will meet management’s expectations. Risks, uncertainties, and other factors involved with forward-looking statements could cause actual events, results, performance, prospects, and opportunities to differ materially from those expressed or implied by such forward-looking statements. Forward-looking statements in this document include, but are not limited to, the Company’s objectives, goals and future plans, and statements of intent, the implications of exploration results, mineral resource/reserve estimates and the economic analysis thereof, exploration and mine development plans, timing of the commencement of operations, estimates of market conditions, and statements regarding the results of the pre-feasibility study, including the anticipated capital and operating costs, sustaining costs, net present value, internal rate of return, payback period, process capacity, average annual metal production, average process recoveries, concession renewal, permitting of the project, anticipated mining and processing methods, proposed pre-feasibility study production schedule and metal production profile, anticipated construction period, anticipated mine life, expected recoveries and grades, anticipated production rates, infrastructure, social and environmental impact studies, availability of labour, tax rates and commodity prices that would support development of the Project. Factors that could cause actual results to differ materially from such forward-looking statements include, but are not limited to failure to identify mineral resources, failure to convert estimated mineral resources to reserves, the inability to maintain the modelling and assumptions upon which the interpretation of results are based after further testing, the inability to complete a feasibility study which recommends a production decision, the preliminary nature of metallurgical test results, delays in obtaining or failures to obtain required governmental, environmental or other project approvals, changes in regulatory requirements, political and social risks, uncertainties relating to the availability and costs of financing needed in the future, uncertainties or challenges related to mineral title in the Company’s projects, changes in equity markets, inflation, changes in exchange rates, fluctuations in commodity and in particular gold prices, delays in the development of projects, capital, operating and reclamation costs varying significantly from estimates, the continued availability of capital, accidents and labour disputes, and the other risks involved in the mineral exploration and development industry, an inability to raise additional funding, the manner the Company uses its cash or the proceeds of an offering of the Company’s securities, an inability to predict and counteract the effects of COVID-19 on the business of the Company, including but not limited to the effects of COVID-19 on the price of commodities, capital market conditions, restriction on labour and international travel and supply chains, future climatic conditions, the discovery of new, large, low-cost mineral deposits, the general level of global economic activity, disasters or environmental or climatic events which affect the infrastructure on which the project is dependent, and those risks set out in the Company’s public documents filed on SEDAR+. Although the Company believes that the assumptions and factors used in preparing the forward-looking statements in this news release are reasonable, undue reliance should not be placed on such information, which only applies as of the date of this news release, and no assurance can be given that such events will occur in the disclosed time frames or at all. Specific reference is made to the most recent Annual Information Form filed on SEDAR+ for a more detailed discussion of some of the factors underlying forward-looking statements and the risks that may affect the Company’s ability to achieve the expectations set forth in the forward-looking statements contained in this presentation. The Company disclaims any intention or obligation to update or revise any forward-looking statements, whether as a result of new information, future events or otherwise, other than as required by law.</p>  <p>Photos accompanying this announcement are available at</p>  <p><img src=\"https://ml.globenewswire.com/Resource/Download/0d0eb93b-cf83-45ba-aeb7-fbe94c5ce6b1?size=original\" alt=\"\"/></p>  <p><img src=\"https://ml.globenewswire.com/Resource/Download/45e6ec98-a1af-450b-bb87-aaf3c3c44bd6?size=original\" alt=\"\"/></p>  <br /><img src='https://ml.globenewswire.com/media/YWRmMDQ5MjgtNTgxNC00YjEzLTg3YzMtZGNlMDI1ODRlMjc2LTExMDE3MzM=/tiny/Revival-Gold-Inc-.png' referrerpolicy='no-referrer-when-downgrade' />",
    "search_terms": "Beartrack-Arnett,Revival Gold Inc.,RVG",
    "master_gid": 1093,
    "date": "2024-02-21T12:30:00.000Z",
    "tags": "USA|Idaho||Gold|Exploration update,Geophysical Survey,Project Acquisition",
    "image_id": null,
    "hidden": false,
    "company_id": 49,
    "provider": null,
    "excerpt": "TORONTO, Feb. 21, 2024 (GLOBE NEWSWIRE) --RevivalGoldInc.(TSXV:RVG,OTCQX:RVLGF)(“Revival Gold” or the “Company”) is pleased to announce the expansion of its land position, the results of recent geophysical and geological work, and the advance of exploration on a newly defined target area known as Sharkey on the Company’s Beartrack-Arnett Gold Project (“Beartrack-Arnett”)",
    "is_regulatory": false,
    "refined_tags": [
      "Project Acquisition",
      "Exploration Update",
      "Geophysical Survey"
    ],
    "ftp_filename": null,
    "company_name": "Revival Gold Inc.",
    "exchange": "TSXV",
    "root_ticker": "RVG",
    "project_name": "Beartrack-Arnett",
    "gid": 1093,
    "location": "Idaho, USA",
    "plan_id": null,
    "description_text": "TORONTO, Feb.  21, 2024  (GLOBE NEWSWIRE) -- Reviva l Gold Inc. (TSXV: RVG, OTCQX: RVLGF) (“Revival Gold” or the “Company”) is pleased to announce the expansion of its land position, the results of recent geophysical and geological work, and the advance of exploration on a newly defined target area known as Sharkey on the Company’s Beartrack-Arnett Gold Project (“Beartrack-Arnett”) located in Idaho, USA. Highlights Fifty-seven lode claims encompassing 476 hectares have been staked to increase Revival Gold’s land position on prospective exploration ground at the south end of Beartrack-Arnett (see Figure 1 for details); 18-line kilometers of IP geophysics along with 16-line kilometers of CSAMT geophysics collected over multiple campaigns at Beartrack between 1990 and 1996 were reprocessed with present-day algorithms to produce a consistent set of 2-D inversion products; The reprocessed geophysical data together with results from last season’s soil geochemistry survey and recent Leapfrog software-based geological and structural modeling has further clarified Revival Gold’s understanding of the geology and structure in the Panther Creek-Coiner Fault System; The Panther Creek-Coiner Fault System extends approximately five kilometers south of the Joss Zone at Beartrack-Arnett and is now thought to be an anastomosing (or braided) fault system that is typical of the structures that host many orogenic gold deposits; Potential targets in braided shear zones include bends, or changes in strike, and structural intersections of the various structures within the broader structural system, and multiple strands of the shear zone may be mineralized; and, Chief among the newly defined targets is Sharkey located within the Panther Creek Structural Corridor approximately two kilometers south of the existing underground mineralization in the Joss target area. “Revival Gold’s recent work analysing and modeling geophysical and geological data from the south end of Beartrack-Arnett has sharpened our exploration team’s focus on the Panther Creek-Coiner Fault braided fault system,” said Hugh Agro, President & CEO. “The Sharkey target has emerged as a high-value under-cover target with tonnage and grade potential equivalent to, and perhaps greater than, what we have at Joss. Sharkey lies within Revival Gold’s approved Plan of Operations permit for drilling at Beartrack-Arnett and represents a high-priority target for follow-up exploration this season,” added Agro. Further Details The Beartrack-Arnett Project consists of two orogenic gold systems with a Measured & Indicated Mineral Resource of 86.2 million tonnes at 0.87 g/T gold containing 2.42 million ounces of gold, and an Inferred Mineral Resource of 50.7 million tonnes at 1.34 g/T gold containing 2.19 million ounces of gold (see “Preliminary Feasibility Study NI 43-101 Technical Report on the Beartrack-Arnett Heap Leach Project, Lemhi County, Idaho, USA”, prepared by Kappes, Cassidy & Associates, Independent Mining Consultants, Inc., KC Harvey Environmental LLC, and WSP USA Environment & Infrastructure Inc. dated August 2 nd , 2023). Most of the Beartrack-Arnett Mineral Resource is contained within five deposits at Beartrack distributed over more than five kilometers of strike of the Panther Creek Shear Zone (“PCSZ”). Gold has been encountered in all Revival Gold drill holes intersecting the PCSZ, and the structure has been drill-tested over a vertical distance of 750 meters. The high-grade, potentially underground mineable resource at Joss (6.7 million tonnes of Inferred Mineral Resource at 4.0 g/T gold containing 877,000 ounces of gold), has been drilled for over 400 meters vertically and mineralization is open in all directions. The most favorable host rocks at Beartrack are Mesoproterozoic siltites and silty quartzites. These units are mineralized in the South Pit ore body and at Joss, where grades are generally highest. These units extend to the south and are exposed along the margins of the Leesburg Basin. Revival Gold’s IP and reprocessed CSAMT geophysical lines effectively map contrasting resistivities between the post-mineralization (Tertiary and Quaternary) Leesburg Basin fill sequence and the Mesoproterozoic host rocks. In the Joss area, mineralization occurs immediately east of a post-mineral Basin bounding fault (Coiner Fault). The structure is effectively mapped by the CSAMT and can be projected for approximately five kilometers south of Joss (see Figure 2 for details). The Coiner Fault, and associated mineralization, is not exposed south of the South Pit due to extensive post-mineralization Tertiary sedimentary and volcanic cover in the Leesburg Basin. The post-mineralization cover obscures geology and presents an intriguing exploration opportunity as any mineralization in this area is not exposed. The intersection of the Coiner Fault and the Arnett structure is also an exploration target. This is the deepest portion of the Leesburg Basin but represents a large area of favorable structural preparation. In addition to the recently reprocessed geophysics, Revival Gold conducted a soil survey during the 2023 field season to characterize the soil geochemistry over the Coiner Fault. 119 soil samples were taken over the approximate trace of the fault. Overall, the soil survey showed a general trend of increasing gold, arsenic, and mercury from south to north. A spatially coherent anomaly over the structure was, however, not detected. In 2020 Revival Gold drilled three core holes approximately 1.2 to 2.2 kilometers south of the southern Joss drill fence to explore the intersection of the Arnett Creek structure with the Coiner Fault. Difficult drilling conditions prevented the holes from testing a significant thickness of the target stratigraphy. The holes are thought to have encountered the trough of the Leesburg Basin but were drilled west of the Coiner Fault based on Revival Gold’s current CSAMT interpretation. In 2021 Revival Gold continued exploring both Joss and the southern extension of the Coiner Fault south of Joss. One core hole was drilled approximately 500 meters south of the southern Joss drill fence. Based on Revival Gold’s current understanding of the Joss deposit architecture, this hole is believed to have passed over the top of the mineralized horizon intercepting 73 meters of the target Mesoproterozoic stratigraphy before passing back into the post-mineral basin fill. Anomalous gold (high of 0.048 ppm) and arsenic (high of 185 ppm) were intercepted within the target stratigraphy associated with sericitic alteration and quartz veining. Revival Gold’s 2020 and 2021 drilling leaves the southern extension of the Coiner Fault System untested and worthy of further exploration. An additional program of field mapping, infill geophysics, and scout drilling, is being prepared to further evaluate the structural corridor south of Joss. Figure 1: Panther Creek-Coiner Fault System Showing Claim Additions and the Sharkey Target Figure 2: Perspective View of Reprocessed CSAMT Resistivity Showing Key Structures 2023 Mineral Resource Blocks > 2 g/t Au Qualified Persons Steven T. Priesmeyer, C.P.G., Vice President Exploration, and Dan Pace, Regis. Mem. SME, Chief Geologist, Revival Gold Inc., are the Company’s designated Qualified Person for this news release within the meaning of National Instrument 43-101 Standards of Disclosure for Mineral Projects and have reviewed and approved its scientific and technical content. About Revival Gold Inc. Revival Gold is a growth-focused gold exploration and development company. The Company is advancing the Beartrack-Arnett Gold Project located in Idaho, USA. Beartrack-Arnett is the largest past-producing gold mine in Idaho. The Project benefits from extensive existing infrastructure and is the subject of a recent Preliminary Feasibility Study for the potential restart of open pit heap leach gold production operations. Since reassembling the Beartrack-Arnett land position in 2017, Revival Gold has made one of the largest new discoveries of gold in the United States in the past decade. The mineralized trend at Beartrack extends for over five kilometers and is open on strike and at depth. Mineralization at Arnett is open in all directions. Additional disclosure including the Company’s financial statements, technical reports, news releases and other information can be obtained at www.revival-gold.com or on SEDAR+ at www.sedarplus.ca . For further information, please contact: Hugh Agro, President & CEO or Lisa Ross, CFO, telephone: (416) 366-4100 or email: info@revival-gold.com . Cautionary Statement Neither the TSX Venture Exchange nor its Regulation Services Provider (as that term is defined in the policies of the TSX Venture Exchange) accepts responsibility for the adequacy or accuracy of this news release. This press release includes certain \"forward-looking information\" within the meaning of Canadian securities legislation and “forward-looking statements” within the meaning of U.S. securities legislation (collectively “forward-looking statements”). Forward-looking statements are not comprised of historical facts. Forward-looking statements include estimates and statements that describe the Company’s future plans, objectives or goals, including words to the effect that the Company or management expects a stated condition or result to occur. Forward-looking statements may be identified by such terms as “believes”, “anticipates”, “expects”, “estimates”, “may”, “could”, “would”, “will”, or “plan”. Since forward-looking statements are based on assumptions and address future events and conditions, by their very nature they involve inherent risks and uncertainties. Although these statements are based on information currently available to the Company, the Company provides no assurance that actual results will meet management’s expectations. Risks, uncertainties, and other factors involved with forward-looking statements could cause actual events, results, performance, prospects, and opportunities to differ materially from those expressed or implied by such forward-looking statements. Forward-looking statements in this document include, but are not limited to, the Company’s objectives, goals and future plans, and statements of intent, the implications of exploration results, mineral resource/reserve estimates and the economic analysis thereof, exploration and mine development plans, timing of the commencement of operations, estimates of market conditions, and statements regarding the results of the pre-feasibility study, including the anticipated capital and operating costs, sustaining costs, net present value, internal rate of return, payback period, process capacity, average annual metal production, average process recoveries, concession renewal, permitting of the project, anticipated mining and processing methods, proposed pre-feasibility study production schedule and metal production profile, anticipated construction period, anticipated mine life, expected recoveries and grades, anticipated production rates, infrastructure, social and environmental impact studies, availability of labour, tax rates and commodity prices that would support development of the Project. Factors that could cause actual results to differ materially from such forward-looking statements include, but are not limited to failure to identify mineral resources, failure to convert estimated mineral resources to reserves, the inability to maintain the modelling and assumptions upon which the interpretation of results are based after further testing, the inability to complete a feasibility study which recommends a production decision, the preliminary nature of metallurgical test results, delays in obtaining or failures to obtain required governmental, environmental or other project approvals, changes in regulatory requirements, political and social risks, uncertainties relating to the availability and costs of financing needed in the future, uncertainties or challenges related to mineral title in the Company’s projects, changes in equity markets, inflation, changes in exchange rates, fluctuations in commodity and in particular gold prices, delays in the development of projects, capital, operating and reclamation costs varying significantly from estimates, the continued availability of capital, accidents and labour disputes, and the other risks involved in the mineral exploration and development industry, an inability to raise additional funding, the manner the Company uses its cash or the proceeds of an offering of the Company’s securities, an inability to predict and counteract the effects of COVID-19 on the business of the Company, including but not limited to the effects of COVID-19 on the price of commodities, capital market conditions, restriction on labour and international travel and supply chains, future climatic conditions, the discovery of new, large, low-cost mineral deposits, the general level of global economic activity, disasters or environmental or climatic events which affect the infrastructure on which the project is dependent, and those risks set out in the Company’s public documents filed on SEDAR+. Although the Company believes that the assumptions and factors used in preparing the forward-looking statements in this news release are reasonable, undue reliance should not be placed on such information, which only applies as of the date of this news release, and no assurance can be given that such events will occur in the disclosed time frames or at all. Specific reference is made to the most recent Annual Information Form filed on SEDAR+ for a more detailed discussion of some of the factors underlying forward-looking statements and the risks that may affect the Company’s ability to achieve the expectations set forth in the forward-looking statements contained in this presentation. The Company disclaims any intention or obligation to update or revise any forward-looking statements, whether as a result of new information, future events or otherwise, other than as required by law. Photos accompanying this announcement are available at",
    "primary_commodity": "Au"
  },
  "articleProject": {
    "gid": 1093,
    "project_name": "Beartrack-Arnett",
    "location": "Idaho, USA"
  },
  "articleExchange": "TSXV",
  "articleCompanyId": 49,
  "articleTicker": "RVG",
  "articleCompanyName": "Revival Gold Inc.",
  "allOtherCompanyProjects": [
    {
      "company_id": 49,
      "gid": 1093,
      "project_name": "Beartrack-Arnett",
      "location": "Idaho, USA"
    },
    {
      "company_id": 49,
      "gid": 6318,
      "project_name": "Diamond Mountain",
      "location": "Utah, United States"
    },
    {
      "company_id": 49,
      "gid": 6849,
      "project_name": "Mercur",
      "location": "Utah, United States"
    }
  ],
  "allOtherCompanyNews": [
    {
      "id": 105180,
      "company_id": 49,
      "title": "Revival Gold Commences 2025 Field Work and Provides Operational Update",
      "link": null,
      "date": "2025-05-20T11:30:00.000Z",
      "hidden": false
    },
    {
      "id": 103454,
      "company_id": 49,
      "title": "Revival Gold Files NI 43-101 Preliminary Economic Assessment for the Mercur Gold Project",
      "link": null,
      "date": "2025-05-05T11:30:00.000Z",
      "hidden": false
    },
    {
      "id": 93057,
      "company_id": 49,
      "title": "Revival Gold Delivers Compelling PEA Results and Attractive Potential Re-development Timeline for the Mercur Gold Project",
      "link": null,
      "date": "2025-03-31T11:30:00.000Z",
      "hidden": false
    },
    {
      "id": 91941,
      "company_id": 49,
      "title": "Revival Gold Enters Marketing Services Agreement",
      "link": null,
      "date": "2025-03-20T11:30:00.000Z",
      "hidden": false
    },
    {
      "id": 89851,
      "company_id": 49,
      "title": "Revival Gold Closes Strategic Placement with Dundee Corporation",
      "link": "https://www.globenewswire.com/news-release/2025/03/03/3035514/0/en/Revival-Gold-Closes-Strategic-Placement-with-Dundee-Corporation.html",
      "date": "2025-03-03T12:30:00.000Z",
      "hidden": false
    },
    {
      "id": 88367,
      "company_id": 49,
      "title": "Revival Gold Announces Strategic Placement with Dundee Corporation",
      "link": "https://www.globenewswire.com/news-release/2025/02/19/3028668/0/en/Revival-Gold-Announces-Strategic-Placement-with-Dundee-Corporation.html",
      "date": "2025-02-19T12:30:00.000Z",
      "hidden": false
    },
    {
      "id": 87424,
      "company_id": 49,
      "title": "Revival Gold Advances Mercur for Potential Re-Development",
      "link": "https://www.globenewswire.com/news-release/2025/02/11/3024061/0/en/Revival-Gold-Advances-Mercur-for-Potential-Re-Development.html",
      "date": "2025-02-11T12:30:00.000Z",
      "hidden": false
    },
    {
      "id": 83029,
      "company_id": 49,
      "title": "Revival Gold 2024 Year in Review",
      "link": "https://www.globenewswire.com/news-release/2024/12/30/3002612/0/en/Revival-Gold-2024-Year-in-Review.html",
      "date": "2024-12-30T12:30:00.000Z",
      "hidden": false
    },
    {
      "id": -155540,
      "company_id": 49,
      "title": "Revival Gold Announces AGM Results  and Transition in Exploration Leadership",
      "link": "https://www.globenewswire.com/news-release/2024/11/21/2985669/0/en/Revival-Gold-Announces-AGM-Results-and-Transition-in-Exploration-Leadership.html",
      "date": "2024-11-21T22:00:00.000Z",
      "hidden": false
    },
    {
      "id": 74901,
      "company_id": 49,
      "title": "Revival Gold Marks Progress With Technical Programs",
      "link": "https://www.globenewswire.com/news-release/2024/10/16/2963935/0/en/Revival-Gold-Marks-Progress-With-Technical-Programs.html",
      "date": "2024-10-16T11:30:00.000Z",
      "hidden": false
    }
  ]
}
