{
  "article": {
    "id": 47177,
    "link": "https://www.newsfilecorp.com/release/194187/Oberon-Uranium-Corp.-Successfully-Earns-100-Interest-in-the-Lucky-Boy-Property",
    "title": "Oberon Uranium Corp. Successfully Earns 100% Interest in the Lucky Boy Property",
    "description": "<img src=\"https://api.newsfilecorp.com/newsinfo/194187/367\" id=\"367\" width=\"2\" height=\"2\" style=\"width: 1px;  height: 1px;border: 0px solid;\" /><p>Vancouver, British Columbia--(Newsfile Corp. - January 12, 2024) - <b>OBERON URANIUM CORP. </b>(CSE: OBRN) (\"<b>Oberon</b>\" or the \"<b>Company</b>\") is pleased to announce that it has successfully earned a 100% interest in the Company's past producing \"Lucky Boy Property\" located in Arizona, USA, pursuant to the option agreement respecting the property. To exercise the option, the Company issued an aggregate of 250,000 common shares of the Company to the optionor, each share issued at a deemed price of $0.05 per share for aggregate consideration of $12,500. The shares are subject to a four month hold period.</p><p><u><b>About the Company</b></u></p><p>Oberon Uranium Corp. is a mineral exploration company with a 100% interest in the past producing Lucky Boy Uranium Property located in Arizona, USA.  Oberon also owns a 100% interest in the Fusion Uranium Zone Project and the Element 92 Property both located in the Athabasca Region of Saskatchewan, Canada. For further information, please refer to the Company's disclosure record on SEDAR+ (<a href=\"https://api.newsfilecorp.com/redirect/eLxpYh2A12\">www.sedarplus.ca</a>) or contact the Company by email at <a href=\"mailto:info@oberonuranium.com\">info@oberonuranium.com</a>.</p><p><b>On Behalf of the Board of Directors<br /></b>\"<i>Lawrence Hay\"<br /></i>President and CEO<br />Tel: 778.317.8754<br />Email: <a href=\"mailto:info@oberonuranium.com\">info@oberonuranium.com</a> </p><p><b>Forward-Looking Information </b></p><p><i>Certain statements in this news release are forward-looking statements, including with respect to future plans, and other matters. Forward-looking statements consist of statements that are not purely historical, including any statements regarding beliefs, plans, expectations or intentions regarding the future. Such information can generally be identified by the use of forwarding-looking wording such as \"may\", \"expect\", \"estimate\", \"anticipate\", \"intend\", \"believe\" and \"continue\" or the negative thereof or similar variations. The reader is cautioned that assumptions used in the preparation of any forward-looking information may prove to be incorrect. Events or circumstances may cause actual results to differ materially from those predicted, as a result of numerous known and unknown risks, uncertainties, and other factors, many of which are beyond the control of the Company, including but not limited to, business, economic and capital market conditions, the ability to manage operating expenses, and dependence on key personnel. Such statements and information are based on numerous assumptions regarding present and future business strategies and the environment in which the Company will operate in the future, anticipated costs, and the ability to achieve goals. Factors that could cause the actual results to differ materially from those in forward-looking statements include, the continued availability of capital and financing, litigation, failure of counterparties to perform their contractual obligations, loss of key employees and consultants, and general economic, market or business conditions. Forward-looking statements contained in this news release are expressly qualified by this cautionary statement. The reader is cautioned not to place undue reliance on any forward-looking information. </i></p><p><i>The forward-looking statements contained in this news release are made as of the date of this news release. Except as required by law, the Company disclaims any intention and assumes no obligation to update or revise any forward-looking statements, whether as a result of new information, future events or otherwise.</i></p><p><i>The CSE has not reviewed, approved or disapproved the contents of this news release.</i></p><p id=\"corporateNewsLogoContainer\"><img src=\"https://images.newsfilecorp.com/files/8756/194187_61782d98c47858fc_001full_200.jpg\" alt=\"Corporate Logo\" id=\"corporateNewsLogo\" /></p><p id=\"corporateLinkBack\">To view the source version of this press release, please visit <a href=\"https://api.newsfilecorp.com/redirect/854zwUeK04\">https://www.newsfilecorp.com/release/194187</a></p>",
    "search_terms": "Lucky Boy,Oberon Uranium Corp.,OBRN",
    "master_gid": 4348,
    "date": "2024-01-13T00:30:00.000Z",
    "tags": "USA|Arizona||Uranium|Project Acquisition",
    "image_id": null,
    "hidden": false,
    "company_id": 2245,
    "provider": null,
    "excerpt": "Vancouver, British Columbia--(Newsfile Corp. - January 12, 2024) -OBERON URANIUM CORP.(CSE: OBRN) (\"Oberon\" or the \"Company\") is pleased to announce that it has successfully earned a 100% interest in the Company's past producing \"Lucky Boy Property\" located in Arizona, USA, pursuant to the option agreement respecting the property. To exercise",
    "is_regulatory": false,
    "refined_tags": [
      "Project Acquisition"
    ],
    "ftp_filename": null,
    "company_name": "Oberon Uranium Corp.",
    "exchange": "CSE",
    "root_ticker": "OBRN",
    "project_name": "Lucky Boy",
    "gid": 4348,
    "location": "Arizona, United States",
    "plan_id": null,
    "description_text": "Vancouver, British Columbia--(Newsfile Corp. - January 12, 2024) - OBERON URANIUM CORP. (CSE: OBRN) (\" Oberon \" or the \" Company \") is pleased to announce that it has successfully earned a 100% interest in the Company's past producing \"Lucky Boy Property\" located in Arizona, USA, pursuant to the option agreement respecting the property. To exercise the option, the Company issued an aggregate of 250,000 common shares of the Company to the optionor, each share issued at a deemed price of $0.05 per share for aggregate consideration of $12,500. The shares are subject to a four month hold period. About the Company Oberon Uranium Corp. is a mineral exploration company with a 100% interest in the past producing Lucky Boy Uranium Property located in Arizona, USA.  Oberon also owns a 100% interest in the Fusion Uranium Zone Project and the Element 92 Property both located in the Athabasca Region of Saskatchewan, Canada. For further information, please refer to the Company's disclosure record on SEDAR+ ( www.sedarplus.ca ) or contact the Company by email at info@oberonuranium.com . On Behalf of the Board of Directors \" Lawrence Hay\" President and CEO Tel: 778.317.8754 Email: info@oberonuranium.com Forward-Looking Information Certain statements in this news release are forward-looking statements, including with respect to future plans, and other matters. Forward-looking statements consist of statements that are not purely historical, including any statements regarding beliefs, plans, expectations or intentions regarding the future. Such information can generally be identified by the use of forwarding-looking wording such as \"may\", \"expect\", \"estimate\", \"anticipate\", \"intend\", \"believe\" and \"continue\" or the negative thereof or similar variations. The reader is cautioned that assumptions used in the preparation of any forward-looking information may prove to be incorrect. Events or circumstances may cause actual results to differ materially from those predicted, as a result of numerous known and unknown risks, uncertainties, and other factors, many of which are beyond the control of the Company, including but not limited to, business, economic and capital market conditions, the ability to manage operating expenses, and dependence on key personnel. Such statements and information are based on numerous assumptions regarding present and future business strategies and the environment in which the Company will operate in the future, anticipated costs, and the ability to achieve goals. Factors that could cause the actual results to differ materially from those in forward-looking statements include, the continued availability of capital and financing, litigation, failure of counterparties to perform their contractual obligations, loss of key employees and consultants, and general economic, market or business conditions. Forward-looking statements contained in this news release are expressly qualified by this cautionary statement. The reader is cautioned not to place undue reliance on any forward-looking information. The forward-looking statements contained in this news release are made as of the date of this news release. Except as required by law, the Company disclaims any intention and assumes no obligation to update or revise any forward-looking statements, whether as a result of new information, future events or otherwise. The CSE has not reviewed, approved or disapproved the contents of this news release. To view the source version of this press release, please visit https://www.newsfilecorp.com/release/194187",
    "primary_commodity": "U"
  },
  "articleProject": {
    "gid": 4348,
    "project_name": "Lucky Boy",
    "location": "Arizona, United States"
  },
  "articleExchange": "CSE",
  "articleCompanyId": 2245,
  "articleTicker": "OBRN",
  "articleCompanyName": "Oberon Uranium Corp.",
  "allOtherCompanyProjects": [
    {
      "company_id": 2245,
      "gid": 10486,
      "project_name": "Fusion Uranium Zone",
      "location": "Saskatchewan, Canada"
    },
    {
      "company_id": 2245,
      "gid": 4348,
      "project_name": "Lucky Boy",
      "location": "Arizona, United States"
    }
  ],
  "allOtherCompanyNews": [
    {
      "id": 108246,
      "company_id": 2245,
      "title": "Oberon Uranium Announces Changes to Board of Directors",
      "link": null,
      "date": "2025-06-17T02:00:00.000Z",
      "hidden": false
    },
    {
      "id": 106441,
      "company_id": 2245,
      "title": "Oberon Uranium Corp. Completes Sale of Saskatchewan Mineral Claims",
      "link": null,
      "date": "2025-05-31T03:50:00.000Z",
      "hidden": false
    },
    {
      "id": 104897,
      "company_id": 2245,
      "title": "Oberon Uranium Corp. Executes Agreement to Sell Saskatchewan Mineral Claims",
      "link": null,
      "date": "2025-05-16T01:30:00.000Z",
      "hidden": false
    },
    {
      "id": -158913,
      "company_id": 2245,
      "title": "Oberon Uranium Corp. Provides AGM Update Regarding Canada Post Strike",
      "link": "https://www.newsfilecorp.com/release/232660/Oberon-Uranium-Corp.-Provides-AGM-Update-Regarding-Canada-Post-Strike",
      "date": "2024-12-05T18:03:00.000Z",
      "hidden": false
    },
    {
      "id": -118201,
      "company_id": 2245,
      "title": "Oberon Uranium Corp. Ceases To Be an Insider of Forty Pillars Mining Corp",
      "link": "https://www.newsfilecorp.com/release/218580/Oberon-Uranium-Corp.-Ceases-To-Be-an-Insider-of-Forty-Pillars-Mining-Corp",
      "date": "2024-08-01T22:00:00.000Z",
      "hidden": false
    },
    {
      "id": -70331,
      "company_id": 2245,
      "title": "Oberon Uranium Closes Acquisition of Mineral Claims in Saskatchewan",
      "link": "https://www.newsfilecorp.com/release/204584/Oberon-Uranium-Closes-Acquisition-of-Mineral-Claims-in-Saskatchewan",
      "date": "2024-04-05T23:00:00.000Z",
      "hidden": false
    },
    {
      "id": -70075,
      "company_id": 2245,
      "title": "Oberon Uranium Executes Agreement to Acquire Mineral Claims in Saskatchewan",
      "link": "https://www.newsfilecorp.com/release/203760/Oberon-Uranium-Executes-Agreement-to-Acquire-Mineral-Claims-in-Saskatchewan",
      "date": "2024-04-01T11:00:00.000Z",
      "hidden": false
    },
    {
      "id": 50410,
      "company_id": 2245,
      "title": "Oberon Uranium Corp. Announces Closing of Sale of Element 92 Uranium Property",
      "link": "https://www.newsfilecorp.com/release/201475/Oberon-Uranium-Corp.-Announces-Closing-of-Sale-of-Element-92-Uranium-Property",
      "date": "2024-03-12T22:00:00.000Z",
      "hidden": false
    },
    {
      "id": 49943,
      "company_id": 2245,
      "title": "Oberon Uranium Corp. Announces Proposed Sale of Element 92 Uranium Property",
      "link": "https://www.newsfilecorp.com/release/200177/Oberon-Uranium-Corp.-Announces-Proposed-Sale-of-Element-92-Uranium-Property",
      "date": "2024-03-02T01:00:00.000Z",
      "hidden": false
    },
    {
      "id": 47177,
      "company_id": 2245,
      "title": "Oberon Uranium Corp. Successfully Earns 100% Interest in the Lucky Boy Property",
      "link": "https://www.newsfilecorp.com/release/194187/Oberon-Uranium-Corp.-Successfully-Earns-100-Interest-in-the-Lucky-Boy-Property",
      "date": "2024-01-13T00:30:00.000Z",
      "hidden": false
    }
  ]
}
