{
  "article": {
    "id": 34544,
    "link": "https://www.accesswire.com/viewarticle.aspx?id=752343&lang=en",
    "title": "Aztec Expands Tombstone JV Patented Land Position in Arizona by Acquiring the Historic High-Grade Silver-Gold Westside Mine",
    "description": "<p><strong>VANCOUVER, BC / ACCESSWIRE / May 2, 2023 / Aztec Minerals Corp. (TSX-V:AZT)(OTCQB:AZZTF)</strong> and Dragoon Resources LLC (\"Tombstone JV Partner\") announce the acquisition of one patented claim (private property rights) amounting to 7.82 hectares (19.33 acres), increasing the overall Tombstone Joint Venture (75% Aztec) land package to 452.02 hectares (1,116.94 acres).</p><p>Aztec and Dragoon have acquired the Westside patented claim from a third-party for cash consideration of US$65,000. The claim immediately adjoins the Tombstone property core patented claims to the northwest, expanding opportunities to explore new targets in the historic Tombstone Silver District in Southeastern Arizona. The patented claim was purchased outright and has no underlying royalties or work commitments.</p><p>Aztec Mineral CEO Simon Dyakowski stated \"Aztec and our partners have again advanced the consolidation of the historic Tombstone district with the acquisition of a fifth patented claim since recommencing exploration activities at the project in 2020. We are excited to explore targets toward and including the historic Westside Mine which is notable in the district for hosting some of the highest silver and gold grades of the late 1800s mining era. The opportunity to add private land holdings in the mining friendly jurisdiction of Arizona highlights the attractiveness of our expanding land position at the Tombstone Project.\"</p><p>The Westside patented claim covers several historic mine shafts, and prospects. Its main shaft had adjacent exploitation by underground workings with a vertical extent over 240 meters in depth. The West Side claim has the majority of the northeast striking Westside fissure-vein system. The claim covers on strike the Westside fissure for 450 meters with its oxidized, mesothermal quartz-gossan silver-gold mineralization. The Westside claim also has oxidized CRD replacement style, silver-lead-gold-copper mineralization hosted in the Westside roll (anticline) which continues into the Tombstone project for a total of a 650 meter long, southeasterly trend. The Westside roll (B.S. Butler, et.al., 1933) is reported to host multiple horizons of oxidized to mixed-supergene mineralization hosted in Mesozoic Bisbee Group clastic sediments, Paleozoic limestones, and Tertiary quartz-feldspar porphyry dikes.</p><p>The Westside claim was staked in October 1881 by the Girard Gold and Silver Mining Company (incorporated in 1879), patented in 1901, mostly operated from the 1880's to the early 1900's and was recognized for having high grades of gold as well as silver. Historic production during the period from 1888 to 1894 as reported by Eng. W. F. Staunton was 5,157t of 67.42 opt Ag, 1.273 opt Au, and 9.79% Pb.</p><p><strong>View updated Tombstone Property claim map here:</strong></p><figure class=\"image image_resized\" style=\"width:560px;display:table;text-align:center;margin:0.9em auto;\"><img src=\"https://www.accesswire.com/users/newswire/images/752343/image.png\" alt=\"Aztec Minerals Corp., Tuesday, May 2, 2023, Press release picture\"></figure><div style=\"clear: both\"> </div><div style=\"clear:both;\"> </div><p style=\"text-align:center;\"><strong>Link to: </strong><a href=\"https://pr.report/feyPL062\"><strong>Updated Tombstone Property Claim Map</strong></a></p><p><strong>Tombstone Project Highlights</strong></p><ul><li><strong>Well located property</strong> on patented (33) and unpatented (42) claims (452.02 hectares/1,116.94 acres), covers much of the historic Tombstone silver mining district, great infrastructure, local town, road access, full services, water, power</li><li><strong>Historic silver district </strong>produced 32 million oz silver from 1878-1939, in high grade, oxidized, silver-gold-lead-zinc-copper vein and CRD deposits, and small open pit heap leach production in late 1980's</li><li><strong>Drilling by Aztec in 2020-21 </strong>has demonstrated that the Contention Pit target has significant Au-Ag mineralization which is open in all directions</li><li><strong>Multiple other prospective target</strong>s in Cretaceous and Paleozoic rocks related to major NW and NNE trending structures hosting porphyritic intrusions crosscutting a possible caldera ring structure</li><li><strong>A very important target </strong>is a potential bulk-tonnage carbonate replacement deposit in Paleozoic limestones similar to the Taylor discovery (100+ million tonnes of 10% Zinc Equivalent) located 60 km southwest of Tombstone (mineralization hosted on adjacent and/or nearby properties is not necessarily indicative of the mineralization hosted on the Company's property) whose presence is suggested by historic deep drilling intercepts for CRD mineralization returned multiple intersections grading up to 32 gpt silver, 0.61% copper, 6.5% lead and 2.6% zinc over 7.2m core length</li><li><strong>Distinct magnetic and AMT anomalies </strong>confirm multiple target areas, Contention pit hosts dikes along strongest district structure, excellent potential for CRD deposits with similar geology to the \"Taylor\" deposit</li><li><strong>Aztec high-grade surface rock samples </strong>from the Contention Pit, grade up to 3,178 gpt silver and 23.5 gpt gold, epithermal stockwork mineralization open along strike. Out of 94 samples collected from within the pit, silver ranges between &lt;0.1 and 3,178 gpt (114.5 gpt average) and gold ranges &lt;0.005 and 23.5 gpt (1.60 gpt average)</li><li><strong>Historic shallow mining </strong>at Contention pit for heap leachable Au-Ag mineralization, historic drilling by USMX around the pit returned multiple intersections including 1.61 gpt Au, 91.2 gpt Ag over 44.2m (see the Company's news release dated September 18, 2018 \"<strong>Aztec Minerals Acquires Late 1980's-Early 1990's Drilling and Trenching Data for the Tombstone Project, Arizona\" </strong>for further disclosure on USMX drilling)</li></ul><p>Allen David Heyl, B.Sc., CPG., VP Exploration, is the Qualified Person overseeing the Tombstone exploration program. Mr. Heyl reviewed and approved the technical disclosures in this news release</p><p><i>\"Simon Dyakowski\"</i><br><strong>Simon Dyakowski</strong>, Chief Executive Officer</p><p><strong>Aztec Minerals Corp.</strong></p><p><strong>About Aztec Minerals</strong> - Aztec is a mineral exploration company focused on two emerging discoveries in North America. The Cervantes project is an emerging porphyry gold-copper discovery in Sonora, Mexico. The Tombstone project is an emerging gold-silver discovery with high grade CRD silver-lead-zinc potential in southern Arizona. Aztec's shares trade on the TSX-V stock exchange (symbol AZT) and on the OTCQB (symbol AZZTF).</p><p><strong>Contact Information -</strong> For more information, please contact:</p><p>Simon Dyakowski, President &amp; CEO, Director<br>Tel: (604) 619-7469<br>Fax: (604) 685-9744<br>Email: <a href=\"mailto:simon@aztecminerals.com\">simon@aztecminerals.com</a><br>Website: <a href=\"https://pr.report/BYgK3nAJ\">www.aztecminerals.com</a></p><p>Neither the TSXV nor its Regulation Services Provider (as that term is defined in the policies of the TSXV) accepts responsibility for the adequacy or accuracy of this release. No stock exchange, securities commission or other regulatory authority has approved or disapproved the information contained herein.</p><p><i>Forward-Looking Statements:</i></p><p><i>Certain statements contained in this press release may constitute forward-looking statements under Canadian securities legislation. Generally, forward-looking information can be identified by the use of forward-looking terminology such as \"expects\" or \"it is expected\", or variations of such words and phrases or statements that certain actions, events or results \"will\" occur. These forward-looking statements are subject to a number of risks and uncertainties. Actual results may differ materially from results contemplated by the forward-looking statements. Factors that could cause actual results to differ materially from those in forward-looking statements. Accordingly, the actual events may differ materially from those projected in the forward-looking statements. When relying on forward-looking statements to make decisions, investors and others should carefully consider the foregoing factors and other uncertainties and should not place undue reliance on such forward-looking statements. The Company does not undertake to update any forward-looking statements, except as may be required by applicable securities laws.</i></p><p><strong>SOURCE</strong>: Aztec Minerals Corp.</p><br><br>View source version on accesswire.com: <br><a href='https://www.accesswire.com/752343/Aztec-Expands-Tombstone-JV-Patented-Land-Position-in-Arizona-by-Acquiring-the-Historic-High-Grade-Silver-Gold-Westside-Mine'>https://www.accesswire.com/752343/Aztec-Expands-Tombstone-JV-Patented-Land-Position-in-Arizona-by-Acquiring-the-Historic-High-Grade-Silver-Gold-Westside-Mine</a><br><br>",
    "search_terms": "Tombstone,Aztec Minerals Corp.,AZT",
    "master_gid": 3967,
    "date": "2023-05-02T11:00:00.000Z",
    "tags": "||||Project Acquisition",
    "image_id": null,
    "hidden": false,
    "company_id": 1134,
    "provider": "accesswire",
    "excerpt": "VANCOUVER, BC / ACCESSWIRE / May 2, 2023 / Aztec Minerals Corp. (TSX-V:AZT)(OTCQB:AZZTF)and Dragoon Resources LLC (\"Tombstone JV Partner\") announce the acquisition of one patented claim (private property rights) amounting to 7.82 hectares (19.33 acres), increasing the overall Tombstone Joint Venture (75% Aztec) land package to 452.02 hectares (1,116.94 acres).Aztec",
    "is_regulatory": false,
    "refined_tags": [
      "Project Acquisition"
    ],
    "ftp_filename": null,
    "company_name": "Aztec Minerals Corp.",
    "exchange": "TSXV",
    "root_ticker": "AZT",
    "project_name": "Tombstone",
    "gid": 3967,
    "location": "Arizona, United States",
    "plan_id": null,
    "description_text": "VANCOUVER, BC / ACCESSWIRE / May 2, 2023 / Aztec Minerals Corp. (TSX-V:AZT)(OTCQB:AZZTF) and Dragoon Resources LLC (\"Tombstone JV Partner\") announce the acquisition of one patented claim (private property rights) amounting to 7.82 hectares (19.33 acres), increasing the overall Tombstone Joint Venture (75% Aztec) land package to 452.02 hectares (1,116.94 acres). Aztec and Dragoon have acquired the Westside patented claim from a third-party for cash consideration of US$65,000. The claim immediately adjoins the Tombstone property core patented claims to the northwest, expanding opportunities to explore new targets in the historic Tombstone Silver District in Southeastern Arizona. The patented claim was purchased outright and has no underlying royalties or work commitments. Aztec Mineral CEO Simon Dyakowski stated \"Aztec and our partners have again advanced the consolidation of the historic Tombstone district with the acquisition of a fifth patented claim since recommencing exploration activities at the project in 2020. We are excited to explore targets toward and including the historic Westside Mine which is notable in the district for hosting some of the highest silver and gold grades of the late 1800s mining era. The opportunity to add private land holdings in the mining friendly jurisdiction of Arizona highlights the attractiveness of our expanding land position at the Tombstone Project.\" The Westside patented claim covers several historic mine shafts, and prospects. Its main shaft had adjacent exploitation by underground workings with a vertical extent over 240 meters in depth. The West Side claim has the majority of the northeast striking Westside fissure-vein system. The claim covers on strike the Westside fissure for 450 meters with its oxidized, mesothermal quartz-gossan silver-gold mineralization. The Westside claim also has oxidized CRD replacement style, silver-lead-gold-copper mineralization hosted in the Westside roll (anticline) which continues into the Tombstone project for a total of a 650 meter long, southeasterly trend. The Westside roll (B.S. Butler, et.al., 1933) is reported to host multiple horizons of oxidized to mixed-supergene mineralization hosted in Mesozoic Bisbee Group clastic sediments, Paleozoic limestones, and Tertiary quartz-feldspar porphyry dikes. The Westside claim was staked in October 1881 by the Girard Gold and Silver Mining Company (incorporated in 1879), patented in 1901, mostly operated from the 1880's to the early 1900's and was recognized for having high grades of gold as well as silver. Historic production during the period from 1888 to 1894 as reported by Eng. W. F. Staunton was 5,157t of 67.42 opt Ag, 1.273 opt Au, and 9.79% Pb. View updated Tombstone Property claim map here: Link to: Updated Tombstone Property Claim Map Tombstone Project Highlights Well located property on patented (33) and unpatented (42) claims (452.02 hectares/1,116.94 acres), covers much of the historic Tombstone silver mining district, great infrastructure, local town, road access, full services, water, power Historic silver district produced 32 million oz silver from 1878-1939, in high grade, oxidized, silver-gold-lead-zinc-copper vein and CRD deposits, and small open pit heap leach production in late 1980's Drilling by Aztec in 2020-21 has demonstrated that the Contention Pit target has significant Au-Ag mineralization which is open in all directions Multiple other prospective target s in Cretaceous and Paleozoic rocks related to major NW and NNE trending structures hosting porphyritic intrusions crosscutting a possible caldera ring structure A very important target is a potential bulk-tonnage carbonate replacement deposit in Paleozoic limestones similar to the Taylor discovery (100+ million tonnes of 10% Zinc Equivalent) located 60 km southwest of Tombstone (mineralization hosted on adjacent and/or nearby properties is not necessarily indicative of the mineralization hosted on the Company's property) whose presence is suggested by historic deep drilling intercepts for CRD mineralization returned multiple intersections grading up to 32 gpt silver, 0.61% copper, 6.5% lead and 2.6% zinc over 7.2m core length Distinct magnetic and AMT anomalies confirm multiple target areas, Contention pit hosts dikes along strongest district structure, excellent potential for CRD deposits with similar geology to the \"Taylor\" deposit Aztec high-grade surface rock samples from the Contention Pit, grade up to 3,178 gpt silver and 23.5 gpt gold, epithermal stockwork mineralization open along strike. Out of 94 samples collected from within the pit, silver ranges between <0.1 and 3,178 gpt (114.5 gpt average) and gold ranges <0.005 and 23.5 gpt (1.60 gpt average) Historic shallow mining at Contention pit for heap leachable Au-Ag mineralization, historic drilling by USMX around the pit returned multiple intersections including 1.61 gpt Au, 91.2 gpt Ag over 44.2m (see the Company's news release dated September 18, 2018 \" Aztec Minerals Acquires Late 1980's-Early 1990's Drilling and Trenching Data for the Tombstone Project, Arizona\" for further disclosure on USMX drilling) Allen David Heyl, B.Sc., CPG., VP Exploration, is the Qualified Person overseeing the Tombstone exploration program. Mr. Heyl reviewed and approved the technical disclosures in this news release \"Simon Dyakowski\" Simon Dyakowski , Chief Executive Officer Aztec Minerals Corp. About Aztec Minerals - Aztec is a mineral exploration company focused on two emerging discoveries in North America. The Cervantes project is an emerging porphyry gold-copper discovery in Sonora, Mexico. The Tombstone project is an emerging gold-silver discovery with high grade CRD silver-lead-zinc potential in southern Arizona. Aztec's shares trade on the TSX-V stock exchange (symbol AZT) and on the OTCQB (symbol AZZTF). Contact Information - For more information, please contact: Simon Dyakowski, President & CEO, Director Tel: (604) 619-7469 Fax: (604) 685-9744 Email: simon@aztecminerals.com Website: www.aztecminerals.com Neither the TSXV nor its Regulation Services Provider (as that term is defined in the policies of the TSXV) accepts responsibility for the adequacy or accuracy of this release. No stock exchange, securities commission or other regulatory authority has approved or disapproved the information contained herein. Forward-Looking Statements: Certain statements contained in this press release may constitute forward-looking statements under Canadian securities legislation. Generally, forward-looking information can be identified by the use of forward-looking terminology such as \"expects\" or \"it is expected\", or variations of such words and phrases or statements that certain actions, events or results \"will\" occur. These forward-looking statements are subject to a number of risks and uncertainties. Actual results may differ materially from results contemplated by the forward-looking statements. Factors that could cause actual results to differ materially from those in forward-looking statements. Accordingly, the actual events may differ materially from those projected in the forward-looking statements. When relying on forward-looking statements to make decisions, investors and others should carefully consider the foregoing factors and other uncertainties and should not place undue reliance on such forward-looking statements. The Company does not undertake to update any forward-looking statements, except as may be required by applicable securities laws. SOURCE : Aztec Minerals Corp. View source version on accesswire.com: https://www.accesswire.com/752343/Aztec-Expands-Tombstone-JV-Patented-Land-Position-in-Arizona-by-Acquiring-the-Historic-High-Grade-Silver-Gold-Westside-Mine",
    "primary_commodity": "Au"
  },
  "articleProject": {
    "gid": 3967,
    "project_name": "Tombstone",
    "location": "Arizona, United States"
  },
  "articleExchange": "TSXV",
  "articleCompanyId": 1134,
  "articleTicker": "AZT",
  "articleCompanyName": "Aztec Minerals Corp.",
  "allOtherCompanyProjects": [
    {
      "company_id": 1134,
      "gid": 3967,
      "project_name": "Tombstone",
      "location": "Arizona, United States"
    },
    {
      "company_id": 1134,
      "gid": 2269,
      "project_name": "Cervantes",
      "location": "Sonora, Mexico"
    }
  ],
  "allOtherCompanyNews": [
    {
      "id": 107639,
      "company_id": 1134,
      "title": "Aztec Commences 5000-meter RC and Core Drilling Program at Tombstone Project, Tombstone Gold-Silver Mining District, Arizona ",
      "link": "https://www.thenewswire.com/press-releases?id=1k49F6VaQ",
      "date": "2025-06-11T11:00:00.000Z",
      "hidden": false
    },
    {
      "id": 106029,
      "company_id": 1134,
      "title": "Aztec Announces 2025 Exploration Program at Cervantes Gold-Copper Project, Sonora, Mexico",
      "link": "https://www.thenewswire.com/press-releases?id=1k3wFOmZ3",
      "date": "2025-05-28T11:00:00.000Z",
      "hidden": false
    },
    {
      "id": 105740,
      "company_id": 1134,
      "title": "Aztec Grants Stock Options",
      "link": "https://www.thenewswire.com/press-releases?id=1Bb4FRnmD",
      "date": "2025-05-23T20:40:00.000Z",
      "hidden": false
    },
    {
      "id": 105166,
      "company_id": 1134,
      "title": "Aztec Expands Land Position at Tombstone Property, Arizona",
      "link": "https://www.thenewswire.com/press-releases?id=1LpMFqQdG",
      "date": "2025-05-20T11:00:00.000Z",
      "hidden": false
    },
    {
      "id": 104461,
      "company_id": 1134,
      "title": "Aztec Minerals Closes Oversubscribed $3.6 million Private Placement",
      "link": "https://www.thenewswire.com/press-releases?id=1AG9FEEqn",
      "date": "2025-05-13T11:00:00.000Z",
      "hidden": false
    },
    {
      "id": 100394,
      "company_id": 1134,
      "title": "Aztec Minerals Announces Private Placement",
      "link": "https://www.thenewswire.com/press-releases?id=1Av7FaPNY",
      "date": "2025-04-22T11:00:00.000Z",
      "hidden": false
    },
    {
      "id": 92370,
      "company_id": 1134,
      "title": "Aztec Geochemistry Data Compilation Strengthens Vectoring of High Priority Targets at Tombstone Project, Arizona",
      "link": "https://golddiscovery.com/legacy/user/news_details/746349-aztca-aztec-geochemistry-data-compilation-strengthens-vectoring-of-high-priority-targets-at-tombstone-project-arizona",
      "date": "2025-03-25T10:00:00.000Z",
      "hidden": false
    },
    {
      "id": 91915,
      "company_id": 1134,
      "title": "Aztec Identifies High Priority Carbonate Replacement Targets (CRD) at Tombstone Project, Arizona ",
      "link": "https://www.thenewswire.com/press-releases?id=1k49F6QY7",
      "date": "2025-03-20T10:00:00.000Z",
      "hidden": false
    },
    {
      "id": 89012,
      "company_id": 1134,
      "title": "Aztec Minerals Corp. Announces Participation in Red Cloud's 13th Annual Pre-PDAC Mining Showcase",
      "link": "https://www.newsfilecorp.com/release/242070/Aztec-Minerals-Corp.-Announces-Participation-in-Red-Clouds-13th-Annual-PrePDAC-Mining-Showcase",
      "date": "2025-02-24T15:30:00.000Z",
      "hidden": false
    },
    {
      "id": 102845,
      "company_id": 1134,
      "title": "Aztec Summarizes 2024 Exploration Drill Program at Tombstone Project, Arizona",
      "link": "https://app.quotemedia.com/data/downloadFiling?webmasterId=104408&ref=67b63866361a0624e81499bf&type=PDFC&formType=002-002-001089-003001&formDescription=News+release&dateFiled=2025-02-19",
      "date": "2025-02-19T12:00:38.000Z",
      "hidden": false
    }
  ]
}
