{
  "article": {
    "id": 93072,
    "link": null,
    "title": "Homeland Grows Coyote Basin & Red Wash Properties Through Staking Shares Listed on Frankfurt Stock Exchange",
    "description": "<p>Vancouver, British Columbia--(Newsfile Corp. - March 31, 2025) - Homeland Uranium Corp. (TSXV: HLU) (FSE: D3U) (\"<b>Homeland</b>\" or the \"<b>Company</b>\") is pleased to announce that it has filed Notice of Locations to the US Bureau of Land Management (\"<b>BLM</b>\") and Rio Blanco and Moffat Counties for 505 new mineral claims staked adjacent to the Coyote Basin and Red Wash Uranium Projects in northwestern Colorado.  All the new claims are located on lands where both surface rights and mineral rights are administered by the BLM (see Figure 1).</p><p>The new mineral claims overlie areas adjacent to both properties that are considered prospective strike extensions of potential uranium host stratigraphy.  At Coyote Basin, a total of 109 new mineral claims were staked covering a total of approximately 2,250 acres (910.9 ha).  The claims abut the southwest corner of the Coyote Basin Project where the four known host horizons are believed to be folded into an east-west strike direction that extends westward towards the Red Wash Project (see Figure 2).  The Coyote Basin Property now consists of 808 mineral claims and three state leases totaling 18,404.4 acres (7,448.4 ha).</p><p>A total of 396 new mineral claims were located adjacent to the Red Wash Project in two separate blocks. The first block abuts the southern end of the Red Wash Property and contains the Urangesellschaft Uranium Occurrence, where an outcrop sample containing 350 ppm U<sub>3</sub>O<sub>8</sub> within sandstone rocks was discovered by previous explorers in the late 1970s. The second block extends eastward from the east end of the Red Wash Project in the direction of the south end of the Coyote Basin Project (see Figure 3).  The two new claim blocks contain 396 new claims totaling 8,180.3 acres (3,310.5 ha). The Red Wash Project now consists of 699 mineral claims and two state leases totaling 15,313 acres (6196.9 ha).</p><p>Homeland now owns 1507 mineral claims and 5 state leases totaling 33,718.4 acres (13,645.4 ha) in Moffat and Rio Blanco counties in northern Colorado.  All 505 new mineral claims are included in the area which is subject to the terms of the Shift Rare Metals-Valleyview Amalgamation Agreement dated August 16, 2024 (the \"Amalgamation Agreement\").   Under the Amalgamation Agreement, former Shift Rare Metals (\"Shift\") shareholders and previous debt lenders to Shift are entitled to a milestone payment of US$111,111 in cash and 2,222,222 Homeland shares for every 5 million pounds of U<sub>3</sub>O<sub>8</sub> resources (up to a maximum of 45 million pounds of U<sub>3</sub>O<sub>8</sub>) defined on the claims within eighteen months of the signing of the Amalgamation Agreement.</p><p><b>Commencement of Trading on the Frankfurt Stock Exchange</b></p><p>The Company announces that it has commenced trading on the Frankfurt Stock Exchange under the ticker symbol D3U in an effort to broaden its shareholder base.   </p><p>The scientific and technical information in this news release has been reviewed and approved by Roger Lemaitre, P. Eng, P. Geo, the Company's President &#38; Chief Executive Officer and a Qualified Person (as defined in National Instrument 43-101- <i>Standards of Disclosure for Mineral Projects</i>).</p><p><b>About Homeland Uranium Corp.</b></p><p>Homeland is a mineral exploration company focused on becoming a premier US-focused and resource-bearing uranium explorer and developer. The Company is the 100% owner of the Coyote Basin and Red Wash uranium projects in northwestern Colorado. </p><div id=\"contactInfo\"><p>For further information, please contact:</p><p>Roger Lemaitre<br />President &#38; Chief Executive Officer<br />Homeland Uranium Corp.<br />Tel: 306-713-1401</p><p>Email: <a href=\"mailto:roger@homeland-uranium.com\">info@homeland-uranium.com</a></p></div><p><i>Neither the TSX Venture Exchange nor its Regulation Services Provider (as that term is defined in the policies of the TSX Venture Exchange) accepts responsibility for the adequacy or accuracy of this news release. No stock exchange, securities commission or other regulatory authority has approved or disapproved the information contained herein.</i></p><p><i><b>Cautionary Note Regarding Forward-Looking Statements</b></i></p><p><i>This news release contains \"forward-looking information\" and \"forward-looking statements\" within the meaning of applicable securities legislation. Forward-Looking information in this news release includes, but is not limited to, statements with respect to trading of the Company's common shares on the Frankfurt Stock Exchange, prospective strike extensions of potential uranium host stratigraphy of the new claims and the future exploration of the Redwash and Coyote Basin Properties.  In making the forward-looking statements, the Company has made certain assumptions, including the impact on trading of the Company's shares on the Frankfurt Stock Exchange and the potential prospectivity of the new mineral claims. Forward-Looking statements and information are subject to various known and unknown risks and uncertainties, many of which are beyond the ability of the Company to control or predict, that may cause the Company's actual results, performance or achievements to be materially different from those expressed or implied thereby, and are developed based on assumptions about such risks, uncertainties and other factors set out herein, including, but not limited to, the risk that trading does not develop on the Frankfurt Stock Exchange as well as the general risk factors related to exploration and development as are set out under the heading \"Risk Factors\" in the Company's documents filed under the Company's issuer profile on SEDAR+ at </i><a href=\"https://api.newsfilecorp.com/redirect/m3ZNBiXnm0\"><i>www.sedarplus.ca</i></a><i>. There can be no assurance that such statements will prove to be accurate, as actual results and future events could differ materially from those anticipated in such statements. Accordingly, readers should not place undue reliance on forward-looking statements and forward-looking information. The Company does not undertake to update any forward-looking statement, forward-looking information or financial outlook herein except as required by applicable securities laws.</i></p><p style=\"text-align: center;\"><a href=\"https://images.newsfilecorp.com/files/10583/246675_figure_1_-_location_of_the_recently_staked_claims_and_the_coyote_basin_and_red_wash_projects.jpg\"><img style=\"border-width: 0px;\" src=\"https://images.newsfilecorp.com/files/10583/246675_fig1.jpg\" alt=\"Cannot view this image? Visit: https://images.newsfilecorp.com/files/10583/246675_fig1.jpg\" /></a></p><p style=\"text-align: center;\">Figure 1 - Location of the recently staked claims and the Coyote Basin and Red Wash Projects</p><p style=\"text-align: center;\">To view an enhanced version of this graphic, please visit:<br /><a href=\"https://images.newsfilecorp.com/files/10583/246675_figure_1_-_location_of_the_recently_staked_claims_and_the_coyote_basin_and_red_wash_projects.jpg\">https://images.newsfilecorp.com/files/10583/246675_figure_1_-_location_of_the_recently_staked_claims_and_the_coyote_basin_and_red_wash_projects.jpg</a></p><p style=\"text-align: center;\"><a href=\"https://images.newsfilecorp.com/files/10583/246675_figure_2__location_of_the_coyote_basin_project_and_newly_staked_claims.jpg\"><img style=\"border-width: 0px;\" src=\"https://images.newsfilecorp.com/files/10583/246675_fig2.jpg\" alt=\"Cannot view this image? Visit: https://images.newsfilecorp.com/files/10583/246675_fig2.jpg\" /></a></p><p style=\"text-align: center;\">Figure 2 &#8211; Location of the Coyote Basin Project and newly staked claims</p><p style=\"text-align: center;\">To view an enhanced version of this graphic, please visit:<br /><a href=\"https://images.newsfilecorp.com/files/10583/246675_figure_2__location_of_the_coyote_basin_project_and_newly_staked_claims.jpg\">https://images.newsfilecorp.com/files/10583/246675_figure_2__location_of_the_coyote_basin_project_and_newly_staked_claims.jpg</a></p><p style=\"text-align: center;\"><a href=\"https://images.newsfilecorp.com/files/10583/246675_figure_3__location_of_the_red_wash_project_and_newly_staked_claims.jpg\"><img style=\"border-width: 0px;\" src=\"https://images.newsfilecorp.com/files/10583/246675_fig3.jpg\" alt=\"Cannot view this image? Visit: https://images.newsfilecorp.com/files/10583/246675_fig3.jpg\" /></a></p><p style=\"text-align: center;\">Figure 3 &#8211; Location of the Red Wash Project and newly staked claims</p><p style=\"text-align: center;\">To view an enhanced version of this graphic, please visit:<br /><a href=\"https://images.newsfilecorp.com/files/10583/246675_figure_3__location_of_the_red_wash_project_and_newly_staked_claims.jpg\">https://images.newsfilecorp.com/files/10583/246675_figure_3__location_of_the_red_wash_project_and_newly_staked_claims.jpg</a></p><p id=\"corporateNewsLogoContainer\"><img src=\"https://images.newsfilecorp.com/files/10583/246675_fc5d703a0490ba59_logo.jpg\" id=\"corporateNewsLogo\" alt=\"Corporate Logo\" /></p><p id=\"corporateLinkBack\">To view the source version of this press release, please visit <a href=\"https://api.newsfilecorp.com/redirect/kO1LkFD78Y\">https://www.newsfilecorp.com/release/246675</a></p><p><img src=\"https://api.newsfilecorp.com/newsinfo/246675/401\" alt=\"\" /></p>",
    "search_terms": "Coyote Basin,Homeland Uranium Corp.,HLU",
    "master_gid": 9675,
    "date": "2025-03-31T12:00:00.000Z",
    "tags": "USA|Colorado||Uranium|Company Update,Listing,Project Acquisition",
    "image_id": null,
    "hidden": false,
    "company_id": 2425,
    "provider": "newsfilecorp",
    "excerpt": "Vancouver, British Columbia--(Newsfile Corp. - March 31, 2025) - Homeland Uranium Corp. (TSXV: HLU) (FSE: D3U) (\"Homeland\" or the \"Company\") is pleased to announce that it has filed Notice of Locations to the US Bureau of Land Management (\"BLM\") and Rio Blanco and Moffat Counties for 505 new mineral claims staked adjacent to the Coyote Basin and Red Wash Uranium Projects in northwestern Colorado. All the new claims are located on lands where both surface rights and mineral rights are administered by the BLM (see Figure 1). The new mineral claims overlie areas adjacent to both properties that are considered",
    "is_regulatory": false,
    "refined_tags": [],
    "ftp_filename": "NEWSFILE-246675-401",
    "company_name": "Homeland Uranium Corp.",
    "exchange": "TSXV",
    "root_ticker": "HLU",
    "project_name": "Coyote Basin",
    "gid": 9675,
    "location": "Colorado, United States",
    "plan_id": null,
    "description_text": "Vancouver, British Columbia--(Newsfile Corp. - March 31, 2025) - Homeland Uranium Corp. (TSXV: HLU) (FSE: D3U) (\" Homeland \" or the \" Company \") is pleased to announce that it has filed Notice of Locations to the US Bureau of Land Management (\" BLM \") and Rio Blanco and Moffat Counties for 505 new mineral claims staked adjacent to the Coyote Basin and Red Wash Uranium Projects in northwestern Colorado.  All the new claims are located on lands where both surface rights and mineral rights are administered by the BLM (see Figure 1). The new mineral claims overlie areas adjacent to both properties that are considered prospective strike extensions of potential uranium host stratigraphy.  At Coyote Basin, a total of 109 new mineral claims were staked covering a total of approximately 2,250 acres (910.9 ha).  The claims abut the southwest corner of the Coyote Basin Project where the four known host horizons are believed to be folded into an east-west strike direction that extends westward towards the Red Wash Project (see Figure 2).  The Coyote Basin Property now consists of 808 mineral claims and three state leases totaling 18,404.4 acres (7,448.4 ha). A total of 396 new mineral claims were located adjacent to the Red Wash Project in two separate blocks. The first block abuts the southern end of the Red Wash Property and contains the Urangesellschaft Uranium Occurrence, where an outcrop sample containing 350 ppm U 3 O 8 within sandstone rocks was discovered by previous explorers in the late 1970s. The second block extends eastward from the east end of the Red Wash Project in the direction of the south end of the Coyote Basin Project (see Figure 3).  The two new claim blocks contain 396 new claims totaling 8,180.3 acres (3,310.5 ha). The Red Wash Project now consists of 699 mineral claims and two state leases totaling 15,313 acres (6196.9 ha). Homeland now owns 1507 mineral claims and 5 state leases totaling 33,718.4 acres (13,645.4 ha) in Moffat and Rio Blanco counties in northern Colorado.  All 505 new mineral claims are included in the area which is subject to the terms of the Shift Rare Metals-Valleyview Amalgamation Agreement dated August 16, 2024 (the \"Amalgamation Agreement\").   Under the Amalgamation Agreement, former Shift Rare Metals (\"Shift\") shareholders and previous debt lenders to Shift are entitled to a milestone payment of US$111,111 in cash and 2,222,222 Homeland shares for every 5 million pounds of U 3 O 8 resources (up to a maximum of 45 million pounds of U 3 O 8 ) defined on the claims within eighteen months of the signing of the Amalgamation Agreement. Commencement of Trading on the Frankfurt Stock Exchange The Company announces that it has commenced trading on the Frankfurt Stock Exchange under the ticker symbol D3U in an effort to broaden its shareholder base. The scientific and technical information in this news release has been reviewed and approved by Roger Lemaitre, P. Eng, P. Geo, the Company's President & Chief Executive Officer and a Qualified Person (as defined in National Instrument 43-101- Standards of Disclosure for Mineral Projects ). About Homeland Uranium Corp. Homeland is a mineral exploration company focused on becoming a premier US-focused and resource-bearing uranium explorer and developer. The Company is the 100% owner of the Coyote Basin and Red Wash uranium projects in northwestern Colorado. For further information, please contact: Roger Lemaitre President & Chief Executive Officer Homeland Uranium Corp. Tel: 306-713-1401 Email: info@homeland-uranium.com Neither the TSX Venture Exchange nor its Regulation Services Provider (as that term is defined in the policies of the TSX Venture Exchange) accepts responsibility for the adequacy or accuracy of this news release. No stock exchange, securities commission or other regulatory authority has approved or disapproved the information contained herein. Cautionary Note Regarding Forward-Looking Statements This news release contains \"forward-looking information\" and \"forward-looking statements\" within the meaning of applicable securities legislation. Forward-Looking information in this news release includes, but is not limited to, statements with respect to trading of the Company's common shares on the Frankfurt Stock Exchange, prospective strike extensions of potential uranium host stratigraphy of the new claims and the future exploration of the Redwash and Coyote Basin Properties.  In making the forward-looking statements, the Company has made certain assumptions, including the impact on trading of the Company's shares on the Frankfurt Stock Exchange and the potential prospectivity of the new mineral claims. Forward-Looking statements and information are subject to various known and unknown risks and uncertainties, many of which are beyond the ability of the Company to control or predict, that may cause the Company's actual results, performance or achievements to be materially different from those expressed or implied thereby, and are developed based on assumptions about such risks, uncertainties and other factors set out herein, including, but not limited to, the risk that trading does not develop on the Frankfurt Stock Exchange as well as the general risk factors related to exploration and development as are set out under the heading \"Risk Factors\" in the Company's documents filed under the Company's issuer profile on SEDAR+ at www.sedarplus.ca . There can be no assurance that such statements will prove to be accurate, as actual results and future events could differ materially from those anticipated in such statements. Accordingly, readers should not place undue reliance on forward-looking statements and forward-looking information. The Company does not undertake to update any forward-looking statement, forward-looking information or financial outlook herein except as required by applicable securities laws. Figure 1 - Location of the recently staked claims and the Coyote Basin and Red Wash Projects To view an enhanced version of this graphic, please visit: https://images.newsfilecorp.com/files/10583/246675_figure_1_-_location_of_the_recently_staked_claims_and_the_coyote_basin_and_red_wash_projects.jpg Figure 2 – Location of the Coyote Basin Project and newly staked claims To view an enhanced version of this graphic, please visit: https://images.newsfilecorp.com/files/10583/246675_figure_2__location_of_the_coyote_basin_project_and_newly_staked_claims.jpg Figure 3 – Location of the Red Wash Project and newly staked claims To view an enhanced version of this graphic, please visit: https://images.newsfilecorp.com/files/10583/246675_figure_3__location_of_the_red_wash_project_and_newly_staked_claims.jpg To view the source version of this press release, please visit https://www.newsfilecorp.com/release/246675",
    "primary_commodity": "U"
  },
  "articleProject": {
    "gid": 9675,
    "project_name": "Coyote Basin",
    "location": "Colorado, United States"
  },
  "articleExchange": "TSXV",
  "articleCompanyId": 2425,
  "articleTicker": "HLU",
  "articleCompanyName": "Homeland Uranium Corp.",
  "allOtherCompanyProjects": [
    {
      "company_id": 2425,
      "gid": 9995,
      "project_name": "Red Wash",
      "location": "Colorado, United States"
    }
  ],
  "allOtherCompanyNews": [
    {
      "id": 106375,
      "company_id": 2425,
      "title": "Homeland Commences Phase 1 Program at Coyote Basin and Red Wash Uranium Projects in Colorado: Executive Orders Issued to Grow American Nuclear Power Capacity",
      "link": null,
      "date": "2025-05-30T12:00:00.000Z",
      "hidden": false
    },
    {
      "id": 105196,
      "company_id": 2425,
      "title": "Homeland Issues Equity Compensation Awards to Officers, Directors and Consultants; Engages CDMG, Plutus and FeMax for Investor Relations Services",
      "link": null,
      "date": "2025-05-20T12:00:00.000Z",
      "hidden": false
    },
    {
      "id": 101883,
      "company_id": 2425,
      "title": "Homeland Appoints Nancy Normore as Vice President, Exploration",
      "link": null,
      "date": "2025-04-28T12:00:00.000Z",
      "hidden": false
    },
    {
      "id": 100601,
      "company_id": 2425,
      "title": "Homeland Uranium Corp. Provides Corporate Update and Announces Conference Call",
      "link": null,
      "date": "2025-04-23T12:00:00.000Z",
      "hidden": false
    },
    {
      "id": 93072,
      "company_id": 2425,
      "title": "Homeland Grows Coyote Basin & Red Wash Properties Through Staking Shares Listed on Frankfurt Stock Exchange",
      "link": null,
      "date": "2025-03-31T12:00:00.000Z",
      "hidden": false
    },
    {
      "id": 92237,
      "company_id": 2425,
      "title": "Homeland Engages Kin Communications for Investor Relations Services and Independent Trading Group as Market-Maker",
      "link": null,
      "date": "2025-03-24T12:00:00.000Z",
      "hidden": false
    },
    {
      "id": 90781,
      "company_id": 2425,
      "title": "Homeland Uranium Commences Trading on TSX Venture Exchange",
      "link": null,
      "date": "2025-03-12T12:00:00.000Z",
      "hidden": false
    },
    {
      "id": 90485,
      "company_id": 2425,
      "title": "Homeland Uranium Completes Reverse Takeover of Shift Rare Metals",
      "link": "https://www.newsfilecorp.com/release/243913/Homeland-Uranium-Completes-Reverse-Takeover-of-Shift-Rare-Metals",
      "date": "2025-03-10T12:00:00.000Z",
      "hidden": false
    },
    {
      "id": 89732,
      "company_id": 2425,
      "title": "Valleyview Releases New Website and Will Attend the PDAC",
      "link": "https://www.newsfilecorp.com/release/242984/Valleyview-Releases-New-Website-and-Will-Attend-the-PDAC",
      "date": "2025-03-02T13:00:00.000Z",
      "hidden": false
    },
    {
      "id": -171116,
      "company_id": 2425,
      "title": "Valleyview Issues Comprehensive News Release Regarding Reverse Takeover of Shift Including Completion of Share Split",
      "link": "https://www.newsfilecorp.com/release/242323/Valleyview-Issues-Comprehensive-News-Release-Regarding-Reverse-Takeover-of-Shift-Including-Completion-of-Share-Split",
      "date": "2025-02-25T18:39:00.000Z",
      "hidden": false
    }
  ]
}
