{
  "article": {
    "id": 83493,
    "link": "https://www.newsfilecorp.com/release/236325/EMX-Executes-Agreement-to-Sell-Four-Projects-in-Western-USA-to-Pacific-Ridge-Exploration",
    "title": "EMX Executes Agreement to Sell Four Projects in Western USA to Pacific Ridge Exploration",
    "description": "<img src=\"https://api.newsfilecorp.com/newsinfo/236325/367\" id=\"367\" width=\"2\" height=\"2\" style=\"width: 1px;  height: 1px;border: 0px solid;\" /><p>Vancouver, British Columbia--(Newsfile Corp. - January 8, 2025) - <b>EMX Royalty Corporation&#160;(NYSE American: EMX) (TSXV: EMX) (the \"Company\" or \"EMX\") </b>is pleased to announce that it has executed four separate option agreements (the \"Agreements\"), all dated January 7, 2025, with Pacific Ridge Exploration Ltd. (TSXV: PEX) (\"Pacific Ridge\" or \"PEX\") for the Ripsey West, Royston, Red Star, and Mineral Hill projects (the \"Projects\" or individually a \"Project\") located in Arizona, Nevada, Utah, and Wyoming, respectively. The Agreements provide EMX with cash payments, an equity stake in PEX, and required work commitments on the Projects during the earn-in period.  Additionally, upon earn-in for a given Project, a 3% net smelter return (\"NSR\") royalty, annual advance royalty (\"AAR\") payments, and milestone payments provide a strong foundation for future upside as the Projects advance.</p><p>The Ripsey West Project is a shallow copper porphyry target in central Arizona's Laramide copper province with exploration potential for both supergene and hypogene mineralization. The Royston Project in western Nevada targets a late Triassic-early Jurassic copper porphyry system. Of note, porphyries of this age have not traditionally been explored for in the region, even though this age of magmatic activity generally displays a stronger gold affinity than Laramide systems.  The Red Star Project is a copper porphyry target adjacent to the historical Star mining district in Utah, and has added potential for skarn, manto, and carbonate-replacement deposit (CRD) styles of mineralization. The Mineral Hill Project in eastern Wyoming is centered on an alkaline intrusive complex, which displays both epithermal and copper-gold porphyry exploration potential.</p><p>EMX acquired the Projects through the staking of open ground after recognizing overlooked opportunities in districts with historical exploration. EMX's track record of organically generating new targets in historical mining districts underscores the strength of the Company's project generation business model.</p><p><b>Commercial Terms Overview </b>(all dollar amounts in USD). Under the terms of the Agreements, subject to the approval of the TSX Venture Exchange, Pacific Ridge can earn 100% interest in each Project over a five-year option period by satisfying the following terms on a per-Project basis: a) upon receipt of regulatory approval, Pacific Ridge will pay $60,000 in cash and issue 200,000 Pacific Ridge shares (on a post 10:1 consolidation basis), and b) Pacific Ridge will also make option payments totaling $180,000, issue 1,175,000 additional shares, and complete $2,250,000 in exploration expenditures over the five-year term of the option agreement. </p><p>Upon option exercise by Pacific Ridge, EMX will retain a 3% NSR royalty on each applicable Project; 1% of the royalty may be bought back by first completing an initial 0.5% royalty buyback for a payment of $1,000,000 to the Company prior to the eighth anniversary of the Effective Date of the Agreement. If the first buyback is completed, then the remaining 0.5% of the royalty buyback can be purchased any time prior to production for $3,000,000. Pacific Ridge will also make AAR payments of $25,000 per Project, which will increase by $10,000 per year until reaching a cap of $75,000 per year. In addition, Pacific Ridge will make Project milestone payments consisting of: a) $500,000 upon completion of a Preliminary Economic Assessment, b) $1,000,000 upon completion of a Pre-Feasibility study, and c) $2,000,000 upon completion of a Feasibility Study.</p><p><b>Project Overviews</b></p><p><u>Ripsey West</u>: The Ripsey West Project spans over 2,161 hectares and consists of 36 unpatented mining claims and eight state exploration leases in central Arizona's prolific Laramide copper province. Historical exploration by Conoco, Bear Creek, Noranda, BHP, Freeport-McMoRan, and others concentrated on altered and mineralized outcrops adjacent to EMX's primary target area. These outcrops display distal chlorite-epidote and sericitic alteration over a broad footprint measuring approximately four by six kilometers, with a central zone of moderate sericitic alteration. Locally, structurally controlled zones exhibit strong sericitic alteration and variable copper mineralization. Through a detailed compilation of historical drilling and an iterative structural study, EMX determined that the district has undergone significant tilting of approximately 90 degrees. The historically explored area represents distal alteration and mineralization, along the paleo-eastern margin of the tilted and dismembered porphyry copper system, whereas EMX's Ripsey West Project targets the core of the system several kilometers to the west. Exploration by a previous partner included two drill holes totaling 649 meters which primarily tested the depth to bedrock. Beneath the post-mineral alluvium, the alteration in the drill holes matches well with the predictive interpretation of the system, but left the target and the core of the porphyry system untested at depth. </p><p><u>Red Star</u>: The Red Star Project covers 3,005 hectares and consists of unpatented mining claims adjacent to the historical Star mining district in Beaver County, Utah. Geologic observations indicate that the source of polymetallic fissure veins and replacements in the Star mining district may be a concealed porphyry copper system. Although historical workers explored for the source porphyry, they misunderstood the timing relationships between the exposed mineralization and intrusive rocks in the area as well as erroneously mapped normal faults as thrust faults. Structural reinterpretation and geochemical zonation patterns in outcropping stratigraphy indicate a westward vector towards a down-faulted block, or blocks, within the Red Star Project. The strongest copper and pathfinder geochemical anomalies occur at the western side of the exposed Paleozoic sedimentary package, coincident with the highest abundance of prospects in the Star district. Recent geophysical datasets, including drone magnetics, induced polarization (IP), and magnetotelluric (MT) surveys, are supportive of a target in the same area independently predicted by geological and geochemical vectors. The abundance of Paleozoic carbonate rocks in the host stratigraphy indicates potential for skarn, manto, and CRD-style mineralization at the Red Star Project, in addition to the target Cu-Mo porphyry. </p><p><u>Royston</u>: The Royston Project spans over 1,830 hectares and consists of 227 unpatented mining claims northwest of Tonopah, Nevada. The Royston Project represents a compelling porphyry prospect within a belt of Jurassic to late Triassic intrusive rocks in the western US, which are underexplored with respect to copper mineralization. Surface exposures and historical drilling reveal a significant zone of quartz-pyrite-sericite \"QSP\" style alteration in porphyry dikes and surrounding host rocks. Subsequent geological, geochemical, and geophysical work advanced EMX's understanding of the system and led to the identification of strong vectors based on system-scale zoning of alteration and mineralization. A reconnaissance reverse-circulation (\"RC\") drilling campaign was recently conducted which further validated the target concept and outlined a robust porphyry system which has undergone significant post-mineral tilting. Two of the RC drill holes were cased for re-entry with a core rig due to the shallow intersections of intense QSP (-clay) alteration with increasing base metal mineralization downhole. Follow-up core drilling will target the high temperature core of the porphyry system, which has not previously been intersected in drilling.</p><p><u>Mineral Hill</u>: The Mineral Hill Project in eastern Wyoming spans over 600 hectares across 77 unpatented and 19 patented mining claims. The Project is centered on a zoned Eocene-age alkaline intrusive complex with an outer ring, interior intrusive zones, and a central breccia. Historical mining in the late 19<sup>th</sup> and early 20<sup>th</sup> centuries produced gold from alluvial deposits, gold and silver from the Treadwell Mine, and gold and copper from the Interocean Mine. EMX and previous partners recognized that the gold and silver mineralization at the Treadwell Mine is associated with lower-temperature adularia-bearing potassic alteration and is consistent with epithermal-style mineralization. In contrast, the gold and copper mineralization at the Interocean Mine is associated with higher-temperature potassic alteration mineral assemblages (including potassium feldspar and biotite), consistent with a porphyry system. Reconnaissance drill programs with previous partners confirmed these two distinct mineralization styles, but never followed up on initial drill results. Mineral Hill's proximity to significant historical producers, such as the Homestake and Wharf mines, highlights the potential for additional discoveries in this productive belt.</p><p>EMX and Pacific Ridge look forward to commencing work on the Projects.</p><p>This transaction is another example of the execution of EMX's business model in providing turn-key and drill ready exploration projects to its partner companies in exchange for royalty interests.</p><p>More information on the Projects can be found at <a href=\"https://api.newsfilecorp.com/redirect/gOaJxI38O5\">www.EMXroyalty.com</a>.</p><p><b>Comments on Adjacent or nearby Districts, Mines, and Deposits. </b>The districts, mines and deposits discussed in this news release provide context for EMX's projects, which occur in similar geologic settings, but this is not necessarily indicative that the Company's projects host similar tonnages or grades of mineralization.</p><p>Michael P. Sheehan, CPG, a Qualified Person as defined by National Instrument 43-101 and employee of the Company, has reviewed, verified and approved the disclosure of the technical information contained in this news release.</p><p><b>About EMX. </b>EMX is a precious and base metals royalty company. EMX's investors are provided with discovery, development, and commodity price optionality, while limiting exposure to risks inherent to operating companies. The Company's common shares are listed on the NYSE American Exchange and TSX Venture Exchange under the symbol \"EMX\". Please see <a href=\"https://api.newsfilecorp.com/redirect/pEjp4uOXk3\">www.EMXroyalty.com</a> for more information. For further information contact:</p><p>David M. Cole<br />President and CEO<br />Phone: (303) 973-8585<br /><a href=\"mailto:Dave@EMXroyalty.com\">Dave@EMXroyalty.com</a></p><p>Isabel Belger<br />Investor Relations<br />Phone: +49 178 4909039<br /><a href=\"mailto:IBelger@EMXroyalty.com\">IBelger@EMXroyalty.com</a></p><p><i><b>Neither the TSX Venture Exchange nor its Regulation Services Provider (as that term is defined in policies of the TSX Venture Exchange) accepts responsibility for the adequacy or accuracy of this release</b></i></p><p><i><b>Forward-Looking Statements</b></i></p><p><i>This news release may contain \"forward-looking statements\" that reflect the Company's current expectations and projections about its future results. These forward-looking statements may include statements regarding perceived merit of properties, exploration results and budgets, mineral reserves and resource estimates, work programs, capital expenditures, timelines, strategic plans, market prices for precious and base metal, or other statements that are not statements of fact. When used in this news release, words such as \"estimate,\" \"intend,\" \"expect,\" \"anticipate,\" \"will\", \"believe\", \"potential\"  and similar expressions are intended to identify forward-looking statements, which, by their very nature, are not guarantees of the Company's future operational or financial performance, and are subject to risks and uncertainties and other factors that could cause the Company's actual results, performance, prospects or opportunities to differ materially from those expressed in, or implied by, these forward-looking statements. These risks, uncertainties and factors may include, but are not limited to unavailability of financing, failure to identify commercially viable mineral reserves, fluctuations in the market valuation for commodities, difficulties in obtaining required approvals for the development of a mineral project, increased regulatory compliance costs, expectations of project funding by joint venture partners and other factors.</i></p><p><i>Readers are cautioned not to place undue reliance on these forward-looking statements, which speak only as of the date of this news release or as of the date otherwise specifically indicated herein. Due to risks and uncertainties, including the risks and uncertainties identified in this news release, and other risk factors and forward-looking statements listed in the Company's MD&#38;A for the quarter ended September 30, 2024 (the \"MD&#38;A\"), and the most recently filed Annual Information Form (\"AIF\") for the year ended December 31, 2023, actual events may differ materially from current expectations. More information about the Company, including the MD&#38;A, the AIF and financial statements of the Company, is available on SEDAR at </i><a href=\"https://api.newsfilecorp.com/redirect/YYaEzTkbGW\"><i>www.sedarplus.ca</i></a><i>  and on the SEC's EDGAR website at </i><a href=\"https://api.newsfilecorp.com/redirect/0VQpKCbP7G\"><i>www.sec.gov</i></a>.</p><p id=\"corporateNewsLogoContainer\"><img src=\"https://images.newsfilecorp.com/files/1508/236325_f982069b341a3b58_logo.jpg\" id=\"corporateNewsLogo\" alt=\"Corporate Logo\" /></p><p id=\"corporateLinkBack\">To view the source version of this press release, please visit <a href=\"https://api.newsfilecorp.com/redirect/R7aYVHq1Rz\">https://www.newsfilecorp.com/release/236325</a></p>",
    "search_terms": "Ripsey West,EMX Royalty Corporation,EMX",
    "master_gid": 9557,
    "date": "2025-01-08T12:00:00.000Z",
    "tags": "USA|Arizona,Nevada,Utah|||Project Acquisition",
    "image_id": null,
    "hidden": false,
    "company_id": 151,
    "provider": "newsfilecorp",
    "excerpt": "Vancouver, British Columbia--(Newsfile Corp. - January 8, 2025) -EMX Royalty Corporation&#160;(NYSE American: EMX) (TSXV: EMX) (the \"Company\" or \"EMX\")is pleased to announce that it has executed four separate option agreements (the \"Agreements\"), all dated January 7, 2025, with Pacific Ridge Exploration Ltd. (TSXV: PEX) (\"Pacific Ridge\" or \"PEX\") for the",
    "is_regulatory": false,
    "refined_tags": null,
    "ftp_filename": null,
    "company_name": "EMX Royalty Corporation",
    "exchange": "NYSE",
    "root_ticker": "EMX",
    "project_name": "Ripsey West",
    "gid": 9557,
    "location": "Arizona, United States",
    "plan_id": null,
    "description_text": "Vancouver, British Columbia--(Newsfile Corp. - January 8, 2025) - EMX Royalty Corporation (NYSE American: EMX) (TSXV: EMX) (the \"Company\" or \"EMX\") is pleased to announce that it has executed four separate option agreements (the \"Agreements\"), all dated January 7, 2025, with Pacific Ridge Exploration Ltd. (TSXV: PEX) (\"Pacific Ridge\" or \"PEX\") for the Ripsey West, Royston, Red Star, and Mineral Hill projects (the \"Projects\" or individually a \"Project\") located in Arizona, Nevada, Utah, and Wyoming, respectively. The Agreements provide EMX with cash payments, an equity stake in PEX, and required work commitments on the Projects during the earn-in period.  Additionally, upon earn-in for a given Project, a 3% net smelter return (\"NSR\") royalty, annual advance royalty (\"AAR\") payments, and milestone payments provide a strong foundation for future upside as the Projects advance. The Ripsey West Project is a shallow copper porphyry target in central Arizona's Laramide copper province with exploration potential for both supergene and hypogene mineralization. The Royston Project in western Nevada targets a late Triassic-early Jurassic copper porphyry system. Of note, porphyries of this age have not traditionally been explored for in the region, even though this age of magmatic activity generally displays a stronger gold affinity than Laramide systems.  The Red Star Project is a copper porphyry target adjacent to the historical Star mining district in Utah, and has added potential for skarn, manto, and carbonate-replacement deposit (CRD) styles of mineralization. The Mineral Hill Project in eastern Wyoming is centered on an alkaline intrusive complex, which displays both epithermal and copper-gold porphyry exploration potential. EMX acquired the Projects through the staking of open ground after recognizing overlooked opportunities in districts with historical exploration. EMX's track record of organically generating new targets in historical mining districts underscores the strength of the Company's project generation business model. Commercial Terms Overview (all dollar amounts in USD). Under the terms of the Agreements, subject to the approval of the TSX Venture Exchange, Pacific Ridge can earn 100% interest in each Project over a five-year option period by satisfying the following terms on a per-Project basis: a) upon receipt of regulatory approval, Pacific Ridge will pay $60,000 in cash and issue 200,000 Pacific Ridge shares (on a post 10:1 consolidation basis), and b) Pacific Ridge will also make option payments totaling $180,000, issue 1,175,000 additional shares, and complete $2,250,000 in exploration expenditures over the five-year term of the option agreement. Upon option exercise by Pacific Ridge, EMX will retain a 3% NSR royalty on each applicable Project; 1% of the royalty may be bought back by first completing an initial 0.5% royalty buyback for a payment of $1,000,000 to the Company prior to the eighth anniversary of the Effective Date of the Agreement. If the first buyback is completed, then the remaining 0.5% of the royalty buyback can be purchased any time prior to production for $3,000,000. Pacific Ridge will also make AAR payments of $25,000 per Project, which will increase by $10,000 per year until reaching a cap of $75,000 per year. In addition, Pacific Ridge will make Project milestone payments consisting of: a) $500,000 upon completion of a Preliminary Economic Assessment, b) $1,000,000 upon completion of a Pre-Feasibility study, and c) $2,000,000 upon completion of a Feasibility Study. Project Overviews Ripsey West : The Ripsey West Project spans over 2,161 hectares and consists of 36 unpatented mining claims and eight state exploration leases in central Arizona's prolific Laramide copper province. Historical exploration by Conoco, Bear Creek, Noranda, BHP, Freeport-McMoRan, and others concentrated on altered and mineralized outcrops adjacent to EMX's primary target area. These outcrops display distal chlorite-epidote and sericitic alteration over a broad footprint measuring approximately four by six kilometers, with a central zone of moderate sericitic alteration. Locally, structurally controlled zones exhibit strong sericitic alteration and variable copper mineralization. Through a detailed compilation of historical drilling and an iterative structural study, EMX determined that the district has undergone significant tilting of approximately 90 degrees. The historically explored area represents distal alteration and mineralization, along the paleo-eastern margin of the tilted and dismembered porphyry copper system, whereas EMX's Ripsey West Project targets the core of the system several kilometers to the west. Exploration by a previous partner included two drill holes totaling 649 meters which primarily tested the depth to bedrock. Beneath the post-mineral alluvium, the alteration in the drill holes matches well with the predictive interpretation of the system, but left the target and the core of the porphyry system untested at depth. Red Star : The Red Star Project covers 3,005 hectares and consists of unpatented mining claims adjacent to the historical Star mining district in Beaver County, Utah. Geologic observations indicate that the source of polymetallic fissure veins and replacements in the Star mining district may be a concealed porphyry copper system. Although historical workers explored for the source porphyry, they misunderstood the timing relationships between the exposed mineralization and intrusive rocks in the area as well as erroneously mapped normal faults as thrust faults. Structural reinterpretation and geochemical zonation patterns in outcropping stratigraphy indicate a westward vector towards a down-faulted block, or blocks, within the Red Star Project. The strongest copper and pathfinder geochemical anomalies occur at the western side of the exposed Paleozoic sedimentary package, coincident with the highest abundance of prospects in the Star district. Recent geophysical datasets, including drone magnetics, induced polarization (IP), and magnetotelluric (MT) surveys, are supportive of a target in the same area independently predicted by geological and geochemical vectors. The abundance of Paleozoic carbonate rocks in the host stratigraphy indicates potential for skarn, manto, and CRD-style mineralization at the Red Star Project, in addition to the target Cu-Mo porphyry. Royston : The Royston Project spans over 1,830 hectares and consists of 227 unpatented mining claims northwest of Tonopah, Nevada. The Royston Project represents a compelling porphyry prospect within a belt of Jurassic to late Triassic intrusive rocks in the western US, which are underexplored with respect to copper mineralization. Surface exposures and historical drilling reveal a significant zone of quartz-pyrite-sericite \"QSP\" style alteration in porphyry dikes and surrounding host rocks. Subsequent geological, geochemical, and geophysical work advanced EMX's understanding of the system and led to the identification of strong vectors based on system-scale zoning of alteration and mineralization. A reconnaissance reverse-circulation (\"RC\") drilling campaign was recently conducted which further validated the target concept and outlined a robust porphyry system which has undergone significant post-mineral tilting. Two of the RC drill holes were cased for re-entry with a core rig due to the shallow intersections of intense QSP (-clay) alteration with increasing base metal mineralization downhole. Follow-up core drilling will target the high temperature core of the porphyry system, which has not previously been intersected in drilling. Mineral Hill : The Mineral Hill Project in eastern Wyoming spans over 600 hectares across 77 unpatented and 19 patented mining claims. The Project is centered on a zoned Eocene-age alkaline intrusive complex with an outer ring, interior intrusive zones, and a central breccia. Historical mining in the late 19 th and early 20 th centuries produced gold from alluvial deposits, gold and silver from the Treadwell Mine, and gold and copper from the Interocean Mine. EMX and previous partners recognized that the gold and silver mineralization at the Treadwell Mine is associated with lower-temperature adularia-bearing potassic alteration and is consistent with epithermal-style mineralization. In contrast, the gold and copper mineralization at the Interocean Mine is associated with higher-temperature potassic alteration mineral assemblages (including potassium feldspar and biotite), consistent with a porphyry system. Reconnaissance drill programs with previous partners confirmed these two distinct mineralization styles, but never followed up on initial drill results. Mineral Hill's proximity to significant historical producers, such as the Homestake and Wharf mines, highlights the potential for additional discoveries in this productive belt. EMX and Pacific Ridge look forward to commencing work on the Projects. This transaction is another example of the execution of EMX's business model in providing turn-key and drill ready exploration projects to its partner companies in exchange for royalty interests. More information on the Projects can be found at www.EMXroyalty.com . Comments on Adjacent or nearby Districts, Mines, and Deposits. The districts, mines and deposits discussed in this news release provide context for EMX's projects, which occur in similar geologic settings, but this is not necessarily indicative that the Company's projects host similar tonnages or grades of mineralization. Michael P. Sheehan, CPG, a Qualified Person as defined by National Instrument 43-101 and employee of the Company, has reviewed, verified and approved the disclosure of the technical information contained in this news release. About EMX. EMX is a precious and base metals royalty company. EMX's investors are provided with discovery, development, and commodity price optionality, while limiting exposure to risks inherent to operating companies. The Company's common shares are listed on the NYSE American Exchange and TSX Venture Exchange under the symbol \"EMX\". Please see www.EMXroyalty.com for more information. For further information contact: David M. Cole President and CEO Phone: (303) 973-8585 Dave@EMXroyalty.com Isabel Belger Investor Relations Phone: +49 178 4909039 IBelger@EMXroyalty.com Neither the TSX Venture Exchange nor its Regulation Services Provider (as that term is defined in policies of the TSX Venture Exchange) accepts responsibility for the adequacy or accuracy of this release Forward-Looking Statements This news release may contain \"forward-looking statements\" that reflect the Company's current expectations and projections about its future results. These forward-looking statements may include statements regarding perceived merit of properties, exploration results and budgets, mineral reserves and resource estimates, work programs, capital expenditures, timelines, strategic plans, market prices for precious and base metal, or other statements that are not statements of fact. When used in this news release, words such as \"estimate,\" \"intend,\" \"expect,\" \"anticipate,\" \"will\", \"believe\", \"potential\"  and similar expressions are intended to identify forward-looking statements, which, by their very nature, are not guarantees of the Company's future operational or financial performance, and are subject to risks and uncertainties and other factors that could cause the Company's actual results, performance, prospects or opportunities to differ materially from those expressed in, or implied by, these forward-looking statements. These risks, uncertainties and factors may include, but are not limited to unavailability of financing, failure to identify commercially viable mineral reserves, fluctuations in the market valuation for commodities, difficulties in obtaining required approvals for the development of a mineral project, increased regulatory compliance costs, expectations of project funding by joint venture partners and other factors. Readers are cautioned not to place undue reliance on these forward-looking statements, which speak only as of the date of this news release or as of the date otherwise specifically indicated herein. Due to risks and uncertainties, including the risks and uncertainties identified in this news release, and other risk factors and forward-looking statements listed in the Company's MD&A for the quarter ended September 30, 2024 (the \"MD&A\"), and the most recently filed Annual Information Form (\"AIF\") for the year ended December 31, 2023, actual events may differ materially from current expectations. More information about the Company, including the MD&A, the AIF and financial statements of the Company, is available on SEDAR at www.sedarplus.ca and on the SEC's EDGAR website at www.sec.gov . To view the source version of this press release, please visit https://www.newsfilecorp.com/release/236325",
    "primary_commodity": "Cu"
  },
  "articleProject": {
    "gid": 9557,
    "project_name": "Ripsey West",
    "location": "Arizona, United States"
  },
  "articleExchange": "NYSE",
  "articleCompanyId": 151,
  "articleTicker": "EMX",
  "articleCompanyName": "EMX Royalty Corporation",
  "allOtherCompanyProjects": [
    {
      "company_id": 151,
      "gid": 9302,
      "project_name": "Copper King",
      "location": "Arizona, United States"
    },
    {
      "company_id": 151,
      "gid": 9303,
      "project_name": "Copper Springs",
      "location": "Arizona, United States"
    },
    {
      "company_id": 151,
      "gid": 9304,
      "project_name": "Copper Warrior",
      "location": "Utah, United States"
    },
    {
      "company_id": 151,
      "gid": 9305,
      "project_name": "Cuddy Mountain",
      "location": "Idaho, United States"
    },
    {
      "company_id": 151,
      "gid": 9306,
      "project_name": "Dash Lake",
      "location": "Ontario, Canada"
    },
    {
      "company_id": 151,
      "gid": 9307,
      "project_name": "Gediktepe",
      "location": "Turkey"
    },
    {
      "company_id": 151,
      "gid": 9308,
      "project_name": "Independence",
      "location": "Idaho, United States"
    },
    {
      "company_id": 151,
      "gid": 9309,
      "project_name": "Jacknife",
      "location": "Idaho, United States"
    },
    {
      "company_id": 151,
      "gid": 9310,
      "project_name": " La Miel",
      "location": "Centre Department, Haiti"
    },
    {
      "company_id": 151,
      "gid": 9311,
      "project_name": "La Mine",
      "location": "Departement du Nord, Haiti"
    },
    {
      "company_id": 151,
      "gid": 9312,
      "project_name": "Grand Bois",
      "location": "Departement du Nord, Haiti"
    },
    {
      "company_id": 151,
      "gid": 9313,
      "project_name": "Northwest Haiti",
      "location": "Nord-Ouest Department, Haiti"
    },
    {
      "company_id": 151,
      "gid": 9314,
      "project_name": "Northeast Haiti",
      "location": "Nord-Est Department, Haiti"
    },
    {
      "company_id": 151,
      "gid": 9315,
      "project_name": "North Central Haiti ",
      "location": "Artibonite Department, Haiti"
    },
    {
      "company_id": 151,
      "gid": 9316,
      "project_name": "Las Animas",
      "location": "Atacama Region, Chile"
    },
    {
      "company_id": 151,
      "gid": 9318,
      "project_name": "Lehman Butte",
      "location": "Idaho, United States"
    },
    {
      "company_id": 151,
      "gid": 9319,
      "project_name": "Mjovattnet",
      "location": "Sweden"
    },
    {
      "company_id": 151,
      "gid": 9320,
      "project_name": "Njuggtraskliden",
      "location": "Sweden"
    },
    {
      "company_id": 151,
      "gid": 9321,
      "project_name": "Mofjell",
      "location": "Norway"
    },
    {
      "company_id": 151,
      "gid": 9322,
      "project_name": "Moose Ridge",
      "location": "Idaho, United States"
    },
    {
      "company_id": 151,
      "gid": 916,
      "project_name": "Kismet",
      "location": "Nevada, USA"
    },
    {
      "company_id": 151,
      "gid": 4078,
      "project_name": "Yarrol",
      "location": "Queensland, Australia"
    },
    {
      "company_id": 151,
      "gid": 9323,
      "project_name": "Robber Gulch",
      "location": "Idaho, United States"
    },
    {
      "company_id": 151,
      "gid": 9327,
      "project_name": "San Guillermo",
      "location": "Antofagasta Region, Chile"
    },
    {
      "company_id": 151,
      "gid": 9328,
      "project_name": "San Valentino",
      "location": "Valparaiso Region, Chile"
    },
    {
      "company_id": 151,
      "gid": 9331,
      "project_name": "Silverback",
      "location": "Idaho, United States"
    },
    {
      "company_id": 151,
      "gid": 9332,
      "project_name": "Sisorta",
      "location": "Turkey"
    },
    {
      "company_id": 151,
      "gid": 8811,
      "project_name": "Gumsberg",
      "location": null
    },
    {
      "company_id": 151,
      "gid": 5362,
      "project_name": "Timok",
      "location": "Central Serbia, Serbia"
    },
    {
      "company_id": 151,
      "gid": 6020,
      "project_name": "Sagvoll",
      "location": "Norway"
    },
    {
      "company_id": 151,
      "gid": 6319,
      "project_name": "South of Otter",
      "location": "Ontario, Canada"
    },
    {
      "company_id": 151,
      "gid": 8887,
      "project_name": "Viscaria",
      "location": null
    },
    {
      "company_id": 151,
      "gid": 10572,
      "project_name": "Trench",
      "location": "Nevada, United States"
    },
    {
      "company_id": 151,
      "gid": 838,
      "project_name": "Gutsy",
      "location": "Nevada, USA"
    },
    {
      "company_id": 151,
      "gid": 3345,
      "project_name": "Mesa Well",
      "location": "Arizona, United States"
    },
    {
      "company_id": 151,
      "gid": 5167,
      "project_name": "Bamble",
      "location": "Norway"
    },
    {
      "company_id": 151,
      "gid": 9324,
      "project_name": "Rana",
      "location": "Norway"
    },
    {
      "company_id": 151,
      "gid": 5732,
      "project_name": "Balya North",
      "location": "Turkey"
    },
    {
      "company_id": 151,
      "gid": 9557,
      "project_name": "Ripsey West",
      "location": "Arizona, United States"
    },
    {
      "company_id": 151,
      "gid": 5166,
      "project_name": "Flat ",
      "location": "Norway"
    },
    {
      "company_id": 151,
      "gid": 6021,
      "project_name": "Meraker",
      "location": "Norway"
    },
    {
      "company_id": 151,
      "gid": 10464,
      "project_name": "Ferber",
      "location": "Nevada, United States"
    },
    {
      "company_id": 151,
      "gid": 9558,
      "project_name": "Royston",
      "location": "Nevada, United States"
    },
    {
      "company_id": 151,
      "gid": 9294,
      "project_name": "Adak",
      "location": "Sweden"
    },
    {
      "company_id": 151,
      "gid": 9295,
      "project_name": "Akarca",
      "location": "Turkey"
    },
    {
      "company_id": 151,
      "gid": 9296,
      "project_name": "Blabarliden",
      "location": "Sweden"
    },
    {
      "company_id": 151,
      "gid": 9297,
      "project_name": "Brooks",
      "location": "Nevada, United States"
    },
    {
      "company_id": 151,
      "gid": 9298,
      "project_name": "Cathedral Well",
      "location": "Nevada, United States"
    },
    {
      "company_id": 151,
      "gid": 9299,
      "project_name": "Century",
      "location": "Idaho, United States"
    },
    {
      "company_id": 151,
      "gid": 9300,
      "project_name": "Challacollo",
      "location": "Tarapacа Region, Chile"
    },
    {
      "company_id": 151,
      "gid": 9301,
      "project_name": "Colla Kananchiari",
      "location": "Valparaiso Region, Chile"
    }
  ],
  "allOtherCompanyNews": [
    {
      "id": -203099,
      "company_id": 151,
      "title": "EMX Announces Voting Results from its 2025 Annual General Meeting",
      "link": null,
      "date": "2025-06-02T20:30:00.000Z",
      "hidden": false
    },
    {
      "id": -203038,
      "company_id": 151,
      "title": "EMX Sells Generative Enterprise in Nordics for Cash and Future Royalty Interests",
      "link": null,
      "date": "2025-06-02T11:30:00.000Z",
      "hidden": false
    },
    {
      "id": 106235,
      "company_id": 151,
      "title": "EMX Options the Trench Gold Project in Nevada, USA to Ridgeline Minerals for Pre-Production and Retained Royalty Interests",
      "link": null,
      "date": "2025-05-29T11:30:00.000Z",
      "hidden": false
    },
    {
      "id": 104569,
      "company_id": 151,
      "title": "EMX Royalty Executes an Agreement with Galileo Resources to Acquire a Royalty over the Ferber Polymetallic Project, Nevada, USA",
      "link": null,
      "date": "2025-05-13T20:30:00.000Z",
      "hidden": false
    },
    {
      "id": 104368,
      "company_id": 151,
      "title": "EMX Royalty Announces Q1 2025 Results; Significant Increases in Royalty Revenue, Adjusted Royalty Revenue and Adjusted EBITDA",
      "link": null,
      "date": "2025-05-12T21:00:00.000Z",
      "hidden": false
    },
    {
      "id": 99403,
      "company_id": 151,
      "title": "EMX Receives $6.85M Early Payment from AbraSilver and Repays $10M of Long-Term Debt",
      "link": null,
      "date": "2025-04-10T20:30:00.000Z",
      "hidden": false
    },
    {
      "id": -188179,
      "company_id": 151,
      "title": "EMX Royalty Announces Grant of Security-Based Compensation",
      "link": null,
      "date": "2025-03-31T20:30:00.000Z",
      "hidden": false
    },
    {
      "id": 92741,
      "company_id": 151,
      "title": "EMX Royalty Partner, Zijin Mining, Provides an Update on a New Copper and Gold Discovery in Serbia",
      "link": null,
      "date": "2025-03-27T18:30:00.000Z",
      "hidden": false
    },
    {
      "id": -176397,
      "company_id": 151,
      "title": "EMX Royalty Announces Commencement of New Normal Course Issuer Bid",
      "link": null,
      "date": "2025-03-26T11:00:00.000Z",
      "hidden": false
    },
    {
      "id": 90912,
      "company_id": 151,
      "title": "EMX Royalty Announces Year-End Financial Results; Record Adjusted Royalty Revenue; and Positive Outlook for 2025",
      "link": null,
      "date": "2025-03-12T21:26:00.000Z",
      "hidden": false
    }
  ]
}
