{
  "article": {
    "id": 26689,
    "link": "https://www.globenewswire.com/news-release/2022/10/13/2533873/0/en/United-Lithium-Corp-Completes-Staking-of-Large-Land-Position-in-Historical-Lithium-Pegmatite-Producing-Area-near-Ohio-City-Colorado.html",
    "title": "United Lithium Corp. Completes Staking of Large Land Position in Historical Lithium Pegmatite Producing Area near Ohio City, Colorado",
    "description": "<ul><li style=\"list-style-position:inside; text-align:center;\"><em>a rock chip sampling program has been conducted to identify new areas for detailed field work</em><br /></li></ul>          <p align=\"justify\">VANCOUVER, British Columbia, Oct.  13, 2022  (GLOBE NEWSWIRE) -- United Lithium Corp. (CSE: <a href=\"https://www.globenewswire.com/Tracker?data=1W574TkZqSD7QPG7KgrYVDZ49ibjdck2yq-qgoHC1yd2uBN8PZCcMwYOXaqonsdED0Y98DmpeDVR5wCZMdWZHDTK2UbiH_ZPCXBqxxTjbvfZ9LiE58rsChEvbdFo7rI7\" rel=\"nofollow\" target=\"_blank\" title=\"ULTH\">ULTH</a>; OTC: <a href=\"https://www.globenewswire.com/Tracker?data=5oJyQt3c1lMYRbSVbGwIPd0G5ANz77ZmcKii80jdHsvbLNyBQh-lvLyuwPor3NcQsbTFdTsN9GJYzpKgtEXfXbF8M9yQrHXwmao-gtBlE5A=\" rel=\"nofollow\" target=\"_blank\" title=\"ULTHF\">ULTHF</a>; FWB: <a href=\"https://www.globenewswire.com/Tracker?data=YGkgiymepfE2Qnt0690-osknQAaz57GjDASO1GdwYj1IVyhU83hlySmuNEAYoihpep9Z2wSbhAswrtJ5DCFWi3PzbL_5EUEQCBCRo3rjpGxnr42l4HfsNBhFEWxhnQ8W\" rel=\"nofollow\" target=\"_blank\" title=\"0ULA\">0ULA</a>) (“<strong>ULTH</strong>” or the “<strong>Company</strong>”) is pleased to announce that it has established a large land position in a historic lithium-beryllium producing area of Gunnison County of Colorado. The Company has completed staking of over 300 unpatented lode claims covering more than 9 square miles (nearly 25 square kilometers) near Ohio City, Colorado, surrounding the Black Wonder granite. The “Patriot Lithium Project” hosts numerous pegmatite bodies, several of which have been mined for Li-Be. United Lithium’s claim block covers or surround all past LCT (lithium, cesium, tantalum) pegmatite production in the Ohio City area.<br /></p>          <p align=\"justify\">A reconnaissance rock chip sampling program was carried out in conjunction with the staking program to identify new areas for detailed field work. Samples have been submitted to the laboratory and assays are awaited.</p>          <p align=\"justify\">Michael Dehn, CEO of United Lithium stated, “We are planning an integrated exploration program to evaluate the Ohio City area land holdings. The program will include local area detailed geologic mapping and additional rock chip sampling. With anomalies well-defined, targets with be drilled in the coming year when permits and contracts are in place.”</p>          <p align=\"justify\">A general outline of the United Lithium claims is presented below. The area staked covers the public lands administered by the U.S. Forest Service (USFS). There are private property holdings within the USFS lands and the claims are positioned and located to recognize the pre-existing, titled ownership rights.</p>          <p align=\"justify\"><img alt=\"Patriot Lithium Project Lode Claims (red), Gunnison County, Colorado, USA\" data-mce-src=\"/api/ImageRender/DownloadFile?resourceId=4addca48-88f0-423d-bae0-f80bc2b3d56d&amp;size=3\" data-mce-style=\"display: block; margin-left: auto; margin-right: auto;\" height=\"338\" name=\"GNW_RichHtml_External_IMG\" src=\"https://ml.globenewswire.com/Resource/Download/4addca48-88f0-423d-bae0-f80bc2b3d56d\" style=\"display:block; margin-left:auto; margin-right:auto;\" width=\"600\" /></p>          <p align=\"center\"><em>Map 1 Patriot Lithium Project Lode Claims (red), Gunnison County, Colorado, USA</em></p>          <p align=\"justify\"><strong>Historic Lithium – Beryllium Pegmatite Mining in the Ohio City Area</strong></p>          <p align=\"justify\">The Patriot Lithium project is part of the Quartz Creek pegmatite field. It is located 17 miles due east of City of Gunnison, in Gunnison County. The Patriot Lithium Project comprises three blocks of claims that are located between Parlin and Ohio City, Colorado and illustrated on Map 1. The two northern “Ohio City” claim blocks are separated by privately owned lands and a highway right-of-way. A sequence of younger, Paleozoic rocks separate the Ohio City claims from the southern “Parlin” claimblock. More than 1,800 individual pegmatite bodies were mapped around the Black Wonder granite by the US Geological Survey. The mapped pegmatites demonstrate zonation where the pegmatites closest to the Black Wonder granite are less evolved while the more distalpegmatites are geochemically evolved and commonly enriched in lithophile elements like Li, Be, Sn, Cs, Rb, etc. The more evolved pegmatites hosted lithium and beryllium former mines and occurrences, including the well-known Brown Derby pegmatite mine, as well as the Bazooka, White Spar and Opportunity pegmatites.</p>          <p align=\"justify\"><strong>Reconnaissance Rock Chip Geochemical Sampling</strong></p>          <p align=\"justify\">A geological crew worked in conjunction with the staking crew in the Ohio City – Parlin areas, highlighting areas for coverage, and more importantly, collecting 243 surface rock chip samples from many pegmatite outcrops for geochemical analysis. Lithium minerals were identified in a number of the outcrop samples, including abundant lepidolite, spodumene and tourmaline (elbaite), while beryl was the chief beryllium mineral. Other minerals reported in the pegmatites from this area, but not recognized in hand specimens, include monazite, columbite, tantalite, microlite, rynersonite, gahnite, zircon, allanite, amblygolite, pollucite and stibiotantalite.</p>          <p align=\"justify\">The pegmatites of the Ohio City- Parlin area contributed to the economic development of the region and contributed significantly to the war efforts of the 1940s and 1950s. The Brown Derby pegmatite mines were of particular note for their Li and Be production as well as a locale for several collectible mineral species.</p>          <p align=\"justify\"><img alt=\"Location of the major lithium-rich mines and occurrences in the Quartz Creek pegmatite district. : From Hanley et al 1950.\" data-mce-src=\"/api/ImageRender/DownloadFile?resourceId=23fc9b38-e8d4-4032-8077-b8103f986d41&amp;size=3\" data-mce-style=\"display: block; margin-left: auto; margin-right: auto;\" height=\"524\" name=\"GNW_RichHtml_External_IMG\" src=\"https://ml.globenewswire.com/Resource/Download/23fc9b38-e8d4-4032-8077-b8103f986d41\" style=\"display:block; margin-left:auto; margin-right:auto;\" width=\"454\" /></p>          <p align=\"center\"><em>Map 2 Location of the major lithium-rich mines and occurrences in the Quartz Creek pegmatite district. : From Hanley et al 1950.</em></p>          <p align=\"justify\"><img alt=\"The Brown Derby pegmatite, main gallery in July 1980. From 2015 Conference Paper - Quartz Creek pegmatite field, Gunnison County,  Colorado: geology and mineralogy by Mark Ivan Jacobson, Mines Museum of Earth Science, Colorado School of Mines\" data-mce-src=\"/api/ImageRender/DownloadFile?resourceId=69cad3c5-2622-4116-8dde-c08091b7cb66&amp;size=3\" data-mce-style=\"display: block; margin-left: auto; margin-right: auto;\" height=\"307\" name=\"GNW_RichHtml_External_IMG\" src=\"https://ml.globenewswire.com/Resource/Download/69cad3c5-2622-4116-8dde-c08091b7cb66\" style=\"display:block; margin-left:auto; margin-right:auto;\" width=\"468\" /></p>          <p align=\"center\"><em>Photo 1 The Brown Derby pegmatite, main gallery in July 1980. From 2015 Conference Paper - Quartz Creek pegmatite field, Gunnison County, Colorado: geology and mineralogy by Mark Ivan Jacobson, Mines Museum of Earth Science, Colorado School of Mines</em></p>          <p align=\"justify\"><img alt=\"The Bazooka Spodumene Prospect, Quartz Creek Pegmatite District: From Staatz et al, 1955\" data-mce-src=\"/api/ImageRender/DownloadFile?resourceId=3e178ee4-0f1c-4b2c-bc10-01cc323305c0&amp;size=3\" data-mce-style=\"display: block; margin-left: auto; margin-right: auto;\" height=\"517\" name=\"GNW_RichHtml_External_IMG\" src=\"https://ml.globenewswire.com/Resource/Download/3e178ee4-0f1c-4b2c-bc10-01cc323305c0\" style=\"display:block; margin-left:auto; margin-right:auto;\" width=\"468\" /></p>          <p align=\"center\"><em>Map 3 The Bazooka Spodumene Prospect, Quartz Creek Pegmatite District: From Staatz et al, 1955</em></p>          <p align=\"justify\"><img alt=\"Large Lepidolite Crystals in Pegmatite from near the Brown Derby Deposit\" data-mce-src=\"/api/ImageRender/DownloadFile?resourceId=379d6ced-2105-4b55-a7e8-48ec09cead6d&amp;size=3\" data-mce-style=\"display: block; margin-left: auto; margin-right: auto;\" height=\"600\" name=\"GNW_RichHtml_External_IMG\" src=\"https://ml.globenewswire.com/Resource/Download/379d6ced-2105-4b55-a7e8-48ec09cead6d\" style=\"display:block; margin-left:auto; margin-right:auto;\" width=\"600\" /></p>          <p align=\"center\"><em>Photo 2 Large Lepidolite Crystals in Pegmatite from near the Brown Derby Deposit</em></p>          <p align=\"justify\">All claims still require final approvals from the Bureau of Land Management.</p>          <p align=\"justify\">Mark Saxon (FAusMM), Technical Advisor to the Company, is a qualified person as defined by National Instrument 43-101 (Standards of Disclosure or Mineral Projects) and has prepared or reviewed the scientific and technical information in this press release.</p>          <p align=\"justify\">References<br />Jacobson, M. A. 2015. Quartz Creek pegmatite field, Gunnison County, Colorado: geology and mineralogy, Conference Paper<br />Staatz, M. H. and A. F. Trites, Jr. 1955, Geology of the Quartz Creek pegmatite district, Gunnison County, Colorado: U.S. Geological Survey Professional Paper 265, 111 pp.<br />Hanley, J. B., E. W. Heinrich and L. R. Page. 1950. Pegmatite investigations in Colorado, Wyoming, and Utah, 1942-1944: U.S. Geological Survey Professional Paper 227, 125 pp.</p>          <p><strong>On Behalf of The Board of Directors</strong><br />Michael Dehn<br />President, Chief Executive Officer and Director</p>          <p><strong>For further information, please contact the Company at:</strong><br /><a href=\"https://www.globenewswire.com/Tracker?data=r27aS6QYlFsH-5r4l2yRmTjv0HhgWtsRIdN9GMDtbqEdzsz6aRGqurxj5e_m1KpFc2vOjNnQzizg3wTTj_tRytIsBG2ctVVwIBliggD01OuxqNUwyT7qZMllMxJy7Ati\" rel=\"nofollow\" target=\"_blank\" title=\"michaeldehn@unitedlithium.com\">michaeldehn@unitedlithium.com</a> <br /><a href=\"https://www.globenewswire.com/Tracker?data=9nU4a-qzf1x6UgKwybFM_Wki-w2LPoo1qJIAVG8pZ3xmzW3s-rPzrkzELQg0Wu8BupZ1k_0MPjY00qsZMOUapmA1xrqhwM6Jxi_-3ErRrxo=\" rel=\"nofollow\" target=\"_blank\" title=\"www.unitedlithiumcorp.com\">www.unitedlithiumcorp.com</a></p>          <p align=\"justify\"><strong>About United Lithium Corp.</strong></p>          <p align=\"justify\">United Lithium Corp. (CSE: ULTH) is an exploration &amp; development company energized by the global demand for lithium. The Company is targeting lithium projects in politically safe jurisdictions with advanced infrastructure that allows for rapid and cost-effective exploration, development and production opportunities.</p>          <p align=\"justify\">The Company's consolidated financial statements and related management's discussion and analysis are available on the Company's website at https://unitedlithium.com/ or under its profile on SEDAR at www.sedar.com.</p>          <p><strong>Forward-Looking Statements </strong></p>          <p align=\"justify\"><em>This news release includes forward-looking statements that are subject to risks and uncertainties. All statements within, other than statements of historical fact, are to be considered forward-looking. The Company provides forward-looking statements for the purpose of conveying information about current expectations and plans relating to the future and readers are cautioned that such statements may not be appropriate for other purposes. By its nature, this information is subject to inherent risks and uncertainties that may be general or specific and which give rise to the possibility that expectations, forecasts, predictions, projections or conclusions will not prove to be accurate, that assumptions may not be correct and that objectives, strategic goals and priorities will not be achieved. These risks and uncertainties include but are not limited those identified and reported in the Company’s public filings under the Company’s SEDAR profile at www.sedar.com. Although the Company has attempted to identify important factors that could cause actual actions, events or results to differ materially from those described in forward-looking information, there may be other factors that cause actions, events or results not to be as anticipated, estimated or intended. There can be no assurance that such information will prove to be accurate as actual results and future events could differ materially from those anticipated in such statements. The Company disclaims any intention or obligation to update or revise any forward-looking information, whether as a result of new information, future events or otherwise unless required by law.</em></p>          <p align=\"center\"><strong><em>The CSE does not accept responsibility for the adequacy or accuracy of this release.</em></strong></p>          <p>Photos accompanying this announcement are available at:</p>          <p><a href=\"https://www.globenewswire.com/Tracker?data=p3MZWwiCWLqKR1WHTvGvKcjTz8_TOIVCT4s2XjrGDUaYQQCJNHo2cADABqs5r524BcOwLTJVsc1iNlmDc2ehKzqgUR-jrH4ZHEQDRNHDmWlNkUleGpQdbp3qT6yi0IW4Dm1GYsLMA1YU3vnuCx5ybub1R6ZCfzHSdvkIxX3yemyllh0XUNOCDrc9FPVSCloW2V26iNcNsdM2ay8ae-5XZ4Y-13ndqUnTegaanYGVLwM4pZE1lxQNLDQKLPNt6jU6vrgd-gPIpyqT35oysQwZSA==\" rel=\"nofollow\" target=\"_blank\" title=\"\">https://www.globenewswire.com/NewsRoom/AttachmentNg/4addca48-88f0-423d-bae0-f80bc2b3d56d</a></p>          <p><a href=\"https://www.globenewswire.com/Tracker?data=p3MZWwiCWLqKR1WHTvGvKcjTz8_TOIVCT4s2XjrGDUaYQQCJNHo2cADABqs5r524KiEWdbW67ZfqZdSa-RP8gRZyTlg1IFrUjczz2WSmSvCCGALcp_li0Peuq2q4x38ULjVWXpJXVxZm6YZQdnXC9eEAh16x63m_AJX4p9JcXDTiu2CaIGmijyGBabnglQn_i9hwCFscInZXWzRSKqBkxr_vCWQS0HzmDl72k0P5s-XPr2n0Vb9tmSmZ6qKhcBxTZPA1AaP5PE7afCvPmAKuIw==\" rel=\"nofollow\" target=\"_blank\" title=\"\">https://www.globenewswire.com/NewsRoom/AttachmentNg/23fc9b38-e8d4-4032-8077-b8103f986d41</a></p>          <p><a href=\"https://www.globenewswire.com/Tracker?data=p3MZWwiCWLqKR1WHTvGvKcjTz8_TOIVCT4s2XjrGDUaYQQCJNHo2cADABqs5r524PBo0RBqt8_ajJHFk4Q51YT4dMMkdRTxOI8NPDLpAt-LCTeqNP1YR_ob-KhoiAezIBCpihBMMjLlKgJX6KXYXDuxh2zDIjuCUcTS7kaQbFYE81_2GJR95qbE8vY1hKGszerPPCeBHrpJR4NdX9EFh7EGecNzAWMy0CKm1D5tulKVfFkawBhjquq0U7Z04CVaGSCJRJ86PkEBnxUdoUrjd4Q==\" rel=\"nofollow\" target=\"_blank\" title=\"\">https://www.globenewswire.com/NewsRoom/AttachmentNg/69cad3c5-2622-4116-8dde-c08091b7cb66</a></p>          <p><a href=\"https://www.globenewswire.com/Tracker?data=p3MZWwiCWLqKR1WHTvGvKcjTz8_TOIVCT4s2XjrGDUaYQQCJNHo2cADABqs5r5243PbzTkBFEPMKNGgm2gFGCFthNTaV1SzVy8BlxEalnbv9UoopjAbwUQ3VKCeF98DD9K77aTZK8vqJgYyJ5hJ7AmnBfguCojXmXKMS16HtVPTaajix-hYiCOat5oIe2s6WX1KNpZAGKgjNB2wfRgdTg-ph0ntFKIeiQep-xHp54ptzipIoNMCrogEwNpvfcXhghERIRNZ-D6thyiCZgQBV-g==\" rel=\"nofollow\" target=\"_blank\" title=\"\">https://www.globenewswire.com/NewsRoom/AttachmentNg/3e178ee4-0f1c-4b2c-bc10-01cc323305c0</a></p>          <p><a href=\"https://www.globenewswire.com/Tracker?data=p3MZWwiCWLqKR1WHTvGvKcjTz8_TOIVCT4s2XjrGDUaYQQCJNHo2cADABqs5r524ZYU01eVA-vsG5GMvIOCTaKW3KFNOfT7V_x3wdNGRQNT_A0mf0PKfBPQJ-dE7tQvPgDPgiOnjEczcTj0jcY7elDoFmRRQdakn9f41YKd5IBktG-Y4ezEJwCSUfNpcqpe4NHnAnVf5my6qlkpUsc_PI0jEvnVghvQwRMRFPiWGd6VxZDoky3yARwMrNV99UHXNSr66u4U07itQH-mr8lc85A==\" rel=\"nofollow\" target=\"_blank\" title=\"\">https://www.globenewswire.com/NewsRoom/AttachmentNg/379d6ced-2105-4b55-a7e8-48ec09cead6d</a></p>  <br /><img src='https://ml.globenewswire.com/media/MTNlOGM4MzctN2VjYS00MDU1LTkxN2EtZGNmYmMxZGFmYWQ1LTEyMzQ2OTM=/tiny/United-lithium.png' referrerpolicy='no-referrer-when-downgrade' />",
    "search_terms": "Patriot,United Lithium Corp.,ULTH",
    "master_gid": 3627,
    "date": "2022-10-13T12:30:00.000Z",
    "tags": "Canada,USA|Colorado,Ohio||Lithium|Project Acquisition",
    "image_id": null,
    "hidden": false,
    "company_id": 1822,
    "provider": null,
    "excerpt": "a rock chip sampling program has been conducted to identify new areas for detailed field workVANCOUVER, British Columbia, Oct.  13, 2022  (GLOBE NEWSWIRE) -- United Lithium Corp. (CSE:ULTH; OTC:ULTHF; FWB:0ULA) (“ULTH” or the “Company”) is pleased to announce that it has established a large land position in a",
    "is_regulatory": false,
    "refined_tags": [
      "Project Acquisition"
    ],
    "ftp_filename": null,
    "company_name": "United Lithium Corp.",
    "exchange": "CSE",
    "root_ticker": "ULTH",
    "project_name": "Patriot",
    "gid": 3627,
    "location": "Colorado, United States",
    "plan_id": null,
    "description_text": "a rock chip sampling program has been conducted to identify new areas for detailed field work VANCOUVER, British Columbia, Oct.  13, 2022  (GLOBE NEWSWIRE) -- United Lithium Corp. (CSE: ULTH ; OTC: ULTHF ; FWB: 0ULA ) (“ ULTH ” or the “ Company ”) is pleased to announce that it has established a large land position in a historic lithium-beryllium producing area of Gunnison County of Colorado. The Company has completed staking of over 300 unpatented lode claims covering more than 9 square miles (nearly 25 square kilometers) near Ohio City, Colorado, surrounding the Black Wonder granite. The “Patriot Lithium Project” hosts numerous pegmatite bodies, several of which have been mined for Li-Be. United Lithium’s claim block covers or surround all past LCT (lithium, cesium, tantalum) pegmatite production in the Ohio City area. A reconnaissance rock chip sampling program was carried out in conjunction with the staking program to identify new areas for detailed field work. Samples have been submitted to the laboratory and assays are awaited. Michael Dehn, CEO of United Lithium stated, “We are planning an integrated exploration program to evaluate the Ohio City area land holdings. The program will include local area detailed geologic mapping and additional rock chip sampling. With anomalies well-defined, targets with be drilled in the coming year when permits and contracts are in place.” A general outline of the United Lithium claims is presented below. The area staked covers the public lands administered by the U.S. Forest Service (USFS). There are private property holdings within the USFS lands and the claims are positioned and located to recognize the pre-existing, titled ownership rights. Map 1 Patriot Lithium Project Lode Claims (red), Gunnison County, Colorado, USA Historic Lithium – Beryllium Pegmatite Mining in the Ohio City Area The Patriot Lithium project is part of the Quartz Creek pegmatite field. It is located 17 miles due east of City of Gunnison, in Gunnison County. The Patriot Lithium Project comprises three blocks of claims that are located between Parlin and Ohio City, Colorado and illustrated on Map 1. The two northern “Ohio City” claim blocks are separated by privately owned lands and a highway right-of-way. A sequence of younger, Paleozoic rocks separate the Ohio City claims from the southern “Parlin” claimblock. More than 1,800 individual pegmatite bodies were mapped around the Black Wonder granite by the US Geological Survey. The mapped pegmatites demonstrate zonation where the pegmatites closest to the Black Wonder granite are less evolved while the more distalpegmatites are geochemically evolved and commonly enriched in lithophile elements like Li, Be, Sn, Cs, Rb, etc. The more evolved pegmatites hosted lithium and beryllium former mines and occurrences, including the well-known Brown Derby pegmatite mine, as well as the Bazooka, White Spar and Opportunity pegmatites. Reconnaissance Rock Chip Geochemical Sampling A geological crew worked in conjunction with the staking crew in the Ohio City – Parlin areas, highlighting areas for coverage, and more importantly, collecting 243 surface rock chip samples from many pegmatite outcrops for geochemical analysis. Lithium minerals were identified in a number of the outcrop samples, including abundant lepidolite, spodumene and tourmaline (elbaite), while beryl was the chief beryllium mineral. Other minerals reported in the pegmatites from this area, but not recognized in hand specimens, include monazite, columbite, tantalite, microlite, rynersonite, gahnite, zircon, allanite, amblygolite, pollucite and stibiotantalite. The pegmatites of the Ohio City- Parlin area contributed to the economic development of the region and contributed significantly to the war efforts of the 1940s and 1950s. The Brown Derby pegmatite mines were of particular note for their Li and Be production as well as a locale for several collectible mineral species. Map 2 Location of the major lithium-rich mines and occurrences in the Quartz Creek pegmatite district. : From Hanley et al 1950. Photo 1 The Brown Derby pegmatite, main gallery in July 1980. From 2015 Conference Paper - Quartz Creek pegmatite field, Gunnison County, Colorado: geology and mineralogy by Mark Ivan Jacobson, Mines Museum of Earth Science, Colorado School of Mines Map 3 The Bazooka Spodumene Prospect, Quartz Creek Pegmatite District: From Staatz et al, 1955 Photo 2 Large Lepidolite Crystals in Pegmatite from near the Brown Derby Deposit All claims still require final approvals from the Bureau of Land Management. Mark Saxon (FAusMM), Technical Advisor to the Company, is a qualified person as defined by National Instrument 43-101 (Standards of Disclosure or Mineral Projects) and has prepared or reviewed the scientific and technical information in this press release. References Jacobson, M. A. 2015. Quartz Creek pegmatite field, Gunnison County, Colorado: geology and mineralogy, Conference Paper Staatz, M. H. and A. F. Trites, Jr. 1955, Geology of the Quartz Creek pegmatite district, Gunnison County, Colorado: U.S. Geological Survey Professional Paper 265, 111 pp. Hanley, J. B., E. W. Heinrich and L. R. Page. 1950. Pegmatite investigations in Colorado, Wyoming, and Utah, 1942-1944: U.S. Geological Survey Professional Paper 227, 125 pp. On Behalf of The Board of Directors Michael Dehn President, Chief Executive Officer and Director For further information, please contact the Company at: michaeldehn@unitedlithium.com www.unitedlithiumcorp.com About United Lithium Corp. United Lithium Corp. (CSE: ULTH) is an exploration & development company energized by the global demand for lithium. The Company is targeting lithium projects in politically safe jurisdictions with advanced infrastructure that allows for rapid and cost-effective exploration, development and production opportunities. The Company's consolidated financial statements and related management's discussion and analysis are available on the Company's website at https://unitedlithium.com/ or under its profile on SEDAR at www.sedar.com. Forward-Looking Statements This news release includes forward-looking statements that are subject to risks and uncertainties. All statements within, other than statements of historical fact, are to be considered forward-looking. The Company provides forward-looking statements for the purpose of conveying information about current expectations and plans relating to the future and readers are cautioned that such statements may not be appropriate for other purposes. By its nature, this information is subject to inherent risks and uncertainties that may be general or specific and which give rise to the possibility that expectations, forecasts, predictions, projections or conclusions will not prove to be accurate, that assumptions may not be correct and that objectives, strategic goals and priorities will not be achieved. These risks and uncertainties include but are not limited those identified and reported in the Company’s public filings under the Company’s SEDAR profile at www.sedar.com. Although the Company has attempted to identify important factors that could cause actual actions, events or results to differ materially from those described in forward-looking information, there may be other factors that cause actions, events or results not to be as anticipated, estimated or intended. There can be no assurance that such information will prove to be accurate as actual results and future events could differ materially from those anticipated in such statements. The Company disclaims any intention or obligation to update or revise any forward-looking information, whether as a result of new information, future events or otherwise unless required by law. The CSE does not accept responsibility for the adequacy or accuracy of this release. Photos accompanying this announcement are available at: https://www.globenewswire.com/NewsRoom/AttachmentNg/4addca48-88f0-423d-bae0-f80bc2b3d56d https://www.globenewswire.com/NewsRoom/AttachmentNg/23fc9b38-e8d4-4032-8077-b8103f986d41 https://www.globenewswire.com/NewsRoom/AttachmentNg/69cad3c5-2622-4116-8dde-c08091b7cb66 https://www.globenewswire.com/NewsRoom/AttachmentNg/3e178ee4-0f1c-4b2c-bc10-01cc323305c0 https://www.globenewswire.com/NewsRoom/AttachmentNg/379d6ced-2105-4b55-a7e8-48ec09cead6d",
    "primary_commodity": "Li"
  },
  "articleProject": {
    "gid": 3627,
    "project_name": "Patriot",
    "location": "Colorado, United States"
  },
  "articleExchange": "CSE",
  "articleCompanyId": 1822,
  "articleTicker": "ULTH",
  "articleCompanyName": "United Lithium Corp.",
  "allOtherCompanyProjects": [
    {
      "company_id": 1822,
      "gid": 6939,
      "project_name": "Kannus",
      "location": "Finland"
    },
    {
      "company_id": 1822,
      "gid": 2781,
      "project_name": "Liberty",
      "location": "South Dakota, United States"
    },
    {
      "company_id": 1822,
      "gid": 4511,
      "project_name": "Bergby",
      "location": "Sweden"
    },
    {
      "company_id": 1822,
      "gid": 3627,
      "project_name": "Patriot",
      "location": "Colorado, United States"
    },
    {
      "company_id": 1822,
      "gid": 5550,
      "project_name": "Barbara Lake",
      "location": "Ontario, Canada"
    },
    {
      "company_id": 1822,
      "gid": 5536,
      "project_name": "Kietyonmaki",
      "location": "Finland"
    },
    {
      "company_id": 1822,
      "gid": 6800,
      "project_name": "Kova",
      "location": "Finland"
    },
    {
      "company_id": 1822,
      "gid": 6803,
      "project_name": "Axmarby",
      "location": "Sweden"
    }
  ],
  "allOtherCompanyNews": [
    {
      "id": 90967,
      "company_id": 1822,
      "title": "United Lithium Receives Positive Mineralogical Tests from its Bergby Project, Sweden",
      "link": null,
      "date": "2025-03-13T11:00:00.000Z",
      "hidden": false
    },
    {
      "id": -172038,
      "company_id": 1822,
      "title": "United Lithium Applies to Extend Warrant Expiry Date",
      "link": "https://www.globenewswire.com/news-release/2025/03/03/3035452/0/en/United-Lithium-Applies-to-Extend-Warrant-Expiry-Date.html",
      "date": "2025-03-03T12:00:00.000Z",
      "hidden": false
    },
    {
      "id": 101452,
      "company_id": 1822,
      "title": "United Lithium Announces Drill Results for Lithium Pegmatites D & E Confirming Strike Length of over 4,000m at Bergby Project, Sweden",
      "link": "https://app.quotemedia.com/data/downloadFiling?webmasterId=104408&ref=67901f58965f0b6e85142456&type=PDFC&formType=002-002-001089-003001&formDescription=News+release&dateFiled=2025-01-21",
      "date": "2025-01-21T14:27:36.000Z",
      "hidden": false
    },
    {
      "id": 82037,
      "company_id": 1822,
      "title": "United Lithium Receives Swedish National Interest Designation for Bergby Lithium Project",
      "link": "https://www.globenewswire.com/news-release/2024/12/16/2997380/0/en/United-Lithium-Receives-Swedish-National-Interest-Designation-for-Bergby-Lithium-Project.html",
      "date": "2024-12-16T12:00:00.000Z",
      "hidden": false
    },
    {
      "id": 65286,
      "company_id": 1822,
      "title": "United Lithium Commences Field Exploration Programs in Finland",
      "link": "https://www.globenewswire.com/news-release/2024/07/17/2914434/0/en/United-Lithium-Commences-Field-Exploration-Programs-in-Finland.html",
      "date": "2024-07-17T11:00:00.000Z",
      "hidden": false
    },
    {
      "id": 55543,
      "company_id": 1822,
      "title": "United Lithium Announces Drill Results for Lithium Pegmatites D & E Confirming Strike Length of over 4,000m at Bergby Project, Sweden",
      "link": "https://www.globenewswire.com/news-release/2024/06/12/2897425/0/en/United-Lithium-Announces-Drill-Results-for-Lithium-Pegmatites-D-E-Confirming-Strike-Length-of-over-4-000m-at-Bergby-Project-Sweden.html",
      "date": "2024-06-12T11:00:00.000Z",
      "hidden": false
    },
    {
      "id": 53998,
      "company_id": 1822,
      "title": "United Lithium adds Highly Prospective Kannus Reservation in Western Finland, and Commences Marketing Campaign",
      "link": "https://www.globenewswire.com/news-release/2024/05/16/2883270/0/en/United-Lithium-adds-Highly-Prospective-Kannus-Reservation-in-Western-Finland-and-Commences-Marketing-Campaign.html",
      "date": "2024-05-16T11:00:00.000Z",
      "hidden": false
    },
    {
      "id": 52798,
      "company_id": 1822,
      "title": "United Lithium Expands Holdings with Addition of Three Highly Prospective Properties in Finland and Sweden",
      "link": "https://www.globenewswire.com/news-release/2024/04/29/2871089/0/en/United-Lithium-Expands-Holdings-with-Addition-of-Three-Highly-Prospective-Properties-in-Finland-and-Sweden.html",
      "date": "2024-04-29T11:00:00.000Z",
      "hidden": false
    },
    {
      "id": 52156,
      "company_id": 1822,
      "title": "United Lithium Announces Closing of $2 Million Private Placement",
      "link": "https://www.globenewswire.com/news-release/2024/04/15/2863226/0/en/United-Lithium-Announces-Closing-of-2-Million-Private-Placement.html",
      "date": "2024-04-15T21:36:00.000Z",
      "hidden": false
    },
    {
      "id": 51746,
      "company_id": 1822,
      "title": "United Lithium Increases Ownership of Kietyönmäki Lithium Project in Finland to 100%",
      "link": "https://www.globenewswire.com/news-release/2024/04/09/2859851/0/en/United-Lithium-Increases-Ownership-of-Kiety%C3%B6nm%C3%A4ki-Lithium-Project-in-Finland-to-100.html",
      "date": "2024-04-09T11:00:00.000Z",
      "hidden": false
    }
  ]
}
