{
  "article": {
    "id": 88361,
    "link": "https://www.newsfilecorp.com/release/241443/Military-Metals-Completes-Acquisition-of-Last-Chance-AntimonyGold-Property-in-Nevada-Antimony-Price-Achieves-New-AllTime-High-over-US50000-per-Tonne1",
    "title": "Military Metals Completes Acquisition of Last Chance Antimony-Gold Property in Nevada, Antimony Price Achieves New All-Time High over US$50,000 per Tonne(1)",
    "description": "<img src=\"https://api.newsfilecorp.com/newsinfo/241443/367\" id=\"367\" width=\"2\" height=\"2\" style=\"width: 1px;  height: 1px;border: 0px solid;\" /><p>Vancouver, British Columbia--(Newsfile Corp. - February 19, 2025) - <b>Military Metals Corp. (CSE: MILI) (OTCQB: MILIF) (FSE: QN90) (the \"Company\" or \"Military\") </b>reports that as of February 14, 2025, it has completed the final cash payment owing to the vendor of the Last Chance Antimony-Gold Property, and as such has fulfilled all obligations required in order to acquire 100% interest in the subject property. The Vendor is currently in the process of transferring registration of the subject property to Military.  The Last Chance Antimony-Gold Property is located 70 kilometers North of the town of Tonopah, Nevada, and 18 kilometers due west of Kinross's Round Mountain gold mine, on the eastern side of the Toiyabe Range.</p><p>Further, the Company's senior management team completed an initial field visit to the Last Chance Antimony-Gold Property. Originally discovered in 1880, the Last Chance antimony-gold deposit saw limited production during a few intervals until the early 1960s to support US defense efforts. Historical infrastructure, including a shaft and concrete foundations, remain on the property. Aside from limited gold-focused exploration during the 1980s, the property has not received further exploration activity. The Company looks forward to advancing modern geological programs focused on antimony mineralization to unlock value.</p><p>Military's CEO, Scott Eldridge, comments: \"Last week we completed our initial site visit to the past producing Last Chance property and were very impressed by its past and future. Nevada is a top global mining jurisdiction that in addition to its notable precious metal mines hosts numerous historical antimony mines and prospects. The antimony spot price has yet again achieved a new all-time high, now trading at $51,500 USD per tonne<sup>(1)</sup>. Antimony investment opportunities are limited to mining equities with no ETF or futures contracts available to investors, furthermore the mining equities are limited to a few high caliber companies.\"</p><p>Hosted within a series of deformed, metamorphosed Paleozoic clastic and carbonate sedimentary units, antimony-gold mineralization is found within a series of structurally and stratigraphically-controlled quartz veins. Historical workers have documented that gold-dominant veins crosscut antimony-dominant veins, indicating more than one phase of mineralization. Several samples of mineralized quartz vein material were found within the historical dumps featuring fine-grained, subhedral metallic grey minerals varying from sub-millimeter stringers to semi-massive flooding within a quartz vein host. </p><p><font style=\"font-size: 11px;\">(1)     <a href=\"https://api.newsfilecorp.com/redirect/bVYM1CeVLw\">https://www.antimony-gz.com/update-price-of-antimony-20250217_n510</a></font></p><p>Green copper oxide staining on weathered specimens seen in the dumps and elsewhere indicate that tetrahedrite and/or other copper-bearing minerals may occur in the assemblage.</p><p>A polished section will be prepared so that minerals comprising this assemblage can be identified.  Likewise, a sample comprising selected grabs of mineralized material from the dumps has been sent for multi-element analysis. Management will digest the results of this field visit and incorporate them into its plans for a comprehensive field program planned for Q2-3 that will focus on the potential for additional clusters of mineralized veins, key to the property's potential.</p><p style=\"text-align: center;\"><a rel=\"nofollow\" href=\"https://images.newsfilecorp.com/files/10818/241443_311fbea1246b3a50_001full.jpg\"><img src=\"https://images.newsfilecorp.com/files/10818/241443_311fbea1246b3a50_001.jpg\" style=\"border-width: 0px;\" alt=\"Cannot view this image? Visit: https://images.newsfilecorp.com/files/10818/241443_311fbea1246b3a50_001.jpg\" /></a></p><p style=\"text-align: center;\"><b>Figure 1:</b> VP-Exploration, Avrom Howard and CEO, Scott Eldridge, viewing samples taken from Last Chance. </p><p style=\"text-align: center;\">To view an enhanced version of this graphic, please visit:<br /><a rel=\"nofollow\" href=\"https://images.newsfilecorp.com/files/10818/241443_311fbea1246b3a50_001full.jpg\">https://images.newsfilecorp.com/files/10818/241443_311fbea1246b3a50_001full.jpg</a></p><p style=\"text-align: center;\"><a rel=\"nofollow\" href=\"https://images.newsfilecorp.com/files/10818/241443_311fbea1246b3a50_002full.jpg\"><img src=\"https://images.newsfilecorp.com/files/10818/241443_311fbea1246b3a50_002.jpg\" style=\"border-width: 0px;\" alt=\"Cannot view this image? Visit: https://images.newsfilecorp.com/files/10818/241443_311fbea1246b3a50_002.jpg\" /></a></p><p style=\"text-align: center;\"><b>Figure 2:</b> Looking northeast at the shaft - foreground, and dumps and concrete foundations behind.</p><p style=\"text-align: center;\">To view an enhanced version of this graphic, please visit:<br /><a rel=\"nofollow\" href=\"https://images.newsfilecorp.com/files/10818/241443_311fbea1246b3a50_002full.jpg\">https://images.newsfilecorp.com/files/10818/241443_311fbea1246b3a50_002full.jpg</a></p><p>The Company also announces it has submitted its application to the USA Defense Industrial Base Consortium (\"DIBC\") which fosters collaboration between Government, Industry, and Academia to build a robust, resilient defense industrial base. All DIBC members are eligible for DPA (Defense Production Act) funding. </p><p>The technical contents of this release were reviewed and approved by Avrom E. Howard, MSc, PGeo, VP-Exploration for Military Metals and a qualified person as defined by National Instrument 43-101. </p><p><b>About Military Metals Corp. </b></p><p>The Company is a British Columbia-based mineral exploration company that is primarily engaged in the acquisition, exploration and development of mineral properties with a focus on antimony.  </p><div id=\"contactInfo\"><p><b>ON BEHALF OF THE BOARD of DIRECTORS</b></p><p>For more information, please contact:</p><p>Scott Eldridge<br />CEO and Director</p><p><a href=\"mailto:scott@militarymetalscorp.com\">scott@militarymetalscorp.com</a> or <a href=\"mailto:info@militarymetalscorp.com\">info@militarymetalscorp.com</a></p><p>For enquiries, please call 604-537-7556</p></div><p>This news release contains \"forward-looking information\". Often, but not always, forward-looking statements can be identified by the use of words such as \"plans\", \"expects\", \"is expected\", \"budget\", \"scheduled\", \"estimates\", \"forecasts\", \"intends\", \"anticipates\", or \"believes\" or variations (including negative variations) of such words and phrases, or state that certain actions, events or results \"may\", \"could\", \"would\", \"might\" or \"will\" be taken, occur or be achieved. Forward-Looking information in this news release includes statements related to the registration of the Last Chance property in the name of Military, as well as future plans for exploration activities at the Last Chance property, assumptions related to the continuation of the global demand for antimony, and any accessibility of DPA funding. A variety of factors, including known and unknown risks, many of which are beyond our control, could cause actual results to differ materially from the forward-looking information in this news release.  These include results from initial sampling and exploration activities at the Last Chance property, including consideration of results from the site visit noted, geopolitical developments related to the supply of antimony, the continued use of antimony and availability of alternatives,  availability of capital and labour in respect of the properties that are the subjects of this news release, the results of any future exploration activities, which cannot be guaranteed, and such other factors as may impact both the Last Chance property and any future activities in respect of the properties held by the Target. Additional risk factors can also be found in the Company's public filings under the Company's SEDAR+ profile at <a href=\"https://api.newsfilecorp.com/redirect/3jmqkiYKPn\">www.sedarplus.ca</a>. Forward-Looking statements contained herein are made as of the date of this news release and the Company disclaims any obligation to update any forward-looking statements, whether as a result of new information, future events or results or otherwise. There can be no assurance that forward-looking statements will prove to be accurate, as actual results and future events could differ materially from those anticipated in such statements. The Company undertakes no obligation to update forward looking statements if circumstances, management's estimates or opinions should change, except as required by securities legislation. Accordingly, the reader is cautioned not to place undue reliance on forward-looking statements. </p><p>The Canadian Securities Exchange has neither approved nor disapproved the information contained herein and does not accept responsibility for the adequacy or accuracy of this news release.</p><p id=\"corporateNewsLogoContainer\"><img src=\"https://images.newsfilecorp.com/files/10818/241443_311fbea1246b3a50_logo.jpg\" id=\"corporateNewsLogo\" alt=\"Corporate Logo\" /></p><p id=\"corporateLinkBack\">To view the source version of this press release, please visit <a href=\"https://api.newsfilecorp.com/redirect/NBrYKcQAEO\">https://www.newsfilecorp.com/release/241443</a></p>",
    "search_terms": "Last Chance,Military Metals Corp.,MILI",
    "master_gid": 9022,
    "date": "2025-02-19T12:30:00.000Z",
    "tags": "|||Gold|Project Acquisition",
    "image_id": null,
    "hidden": false,
    "company_id": 4677,
    "provider": "newsfilecorp",
    "excerpt": "Vancouver, British Columbia--(Newsfile Corp. - February 19, 2025) -Military Metals Corp. (CSE: MILI) (OTCQB: MILIF) (FSE: QN90) (the \"Company\" or \"Military\")reports that as of February 14, 2025, it has completed the final cash payment owing to the vendor of the Last Chance Antimony-Gold Property, and as such has fulfilled all",
    "is_regulatory": false,
    "refined_tags": [],
    "ftp_filename": null,
    "company_name": "Military Metals Corp.",
    "exchange": "CSE",
    "root_ticker": "MILI",
    "project_name": "Last Chance",
    "gid": 9022,
    "location": "Nevada, United States",
    "plan_id": null,
    "description_text": "Vancouver, British Columbia--(Newsfile Corp. - February 19, 2025) - Military Metals Corp. (CSE: MILI) (OTCQB: MILIF) (FSE: QN90) (the \"Company\" or \"Military\") reports that as of February 14, 2025, it has completed the final cash payment owing to the vendor of the Last Chance Antimony-Gold Property, and as such has fulfilled all obligations required in order to acquire 100% interest in the subject property. The Vendor is currently in the process of transferring registration of the subject property to Military.  The Last Chance Antimony-Gold Property is located 70 kilometers North of the town of Tonopah, Nevada, and 18 kilometers due west of Kinross's Round Mountain gold mine, on the eastern side of the Toiyabe Range. Further, the Company's senior management team completed an initial field visit to the Last Chance Antimony-Gold Property. Originally discovered in 1880, the Last Chance antimony-gold deposit saw limited production during a few intervals until the early 1960s to support US defense efforts. Historical infrastructure, including a shaft and concrete foundations, remain on the property. Aside from limited gold-focused exploration during the 1980s, the property has not received further exploration activity. The Company looks forward to advancing modern geological programs focused on antimony mineralization to unlock value. Military's CEO, Scott Eldridge, comments: \"Last week we completed our initial site visit to the past producing Last Chance property and were very impressed by its past and future. Nevada is a top global mining jurisdiction that in addition to its notable precious metal mines hosts numerous historical antimony mines and prospects. The antimony spot price has yet again achieved a new all-time high, now trading at $51,500 USD per tonne (1) . Antimony investment opportunities are limited to mining equities with no ETF or futures contracts available to investors, furthermore the mining equities are limited to a few high caliber companies.\" Hosted within a series of deformed, metamorphosed Paleozoic clastic and carbonate sedimentary units, antimony-gold mineralization is found within a series of structurally and stratigraphically-controlled quartz veins. Historical workers have documented that gold-dominant veins crosscut antimony-dominant veins, indicating more than one phase of mineralization. Several samples of mineralized quartz vein material were found within the historical dumps featuring fine-grained, subhedral metallic grey minerals varying from sub-millimeter stringers to semi-massive flooding within a quartz vein host. (1) https://www.antimony-gz.com/update-price-of-antimony-20250217_n510 Green copper oxide staining on weathered specimens seen in the dumps and elsewhere indicate that tetrahedrite and/or other copper-bearing minerals may occur in the assemblage. A polished section will be prepared so that minerals comprising this assemblage can be identified.  Likewise, a sample comprising selected grabs of mineralized material from the dumps has been sent for multi-element analysis. Management will digest the results of this field visit and incorporate them into its plans for a comprehensive field program planned for Q2-3 that will focus on the potential for additional clusters of mineralized veins, key to the property's potential. Figure 1: VP-Exploration, Avrom Howard and CEO, Scott Eldridge, viewing samples taken from Last Chance. To view an enhanced version of this graphic, please visit: https://images.newsfilecorp.com/files/10818/241443_311fbea1246b3a50_001full.jpg Figure 2: Looking northeast at the shaft - foreground, and dumps and concrete foundations behind. To view an enhanced version of this graphic, please visit: https://images.newsfilecorp.com/files/10818/241443_311fbea1246b3a50_002full.jpg The Company also announces it has submitted its application to the USA Defense Industrial Base Consortium (\"DIBC\") which fosters collaboration between Government, Industry, and Academia to build a robust, resilient defense industrial base. All DIBC members are eligible for DPA (Defense Production Act) funding. The technical contents of this release were reviewed and approved by Avrom E. Howard, MSc, PGeo, VP-Exploration for Military Metals and a qualified person as defined by National Instrument 43-101. About Military Metals Corp. The Company is a British Columbia-based mineral exploration company that is primarily engaged in the acquisition, exploration and development of mineral properties with a focus on antimony. ON BEHALF OF THE BOARD of DIRECTORS For more information, please contact: Scott Eldridge CEO and Director scott@militarymetalscorp.com or info@militarymetalscorp.com For enquiries, please call 604-537-7556 This news release contains \"forward-looking information\". Often, but not always, forward-looking statements can be identified by the use of words such as \"plans\", \"expects\", \"is expected\", \"budget\", \"scheduled\", \"estimates\", \"forecasts\", \"intends\", \"anticipates\", or \"believes\" or variations (including negative variations) of such words and phrases, or state that certain actions, events or results \"may\", \"could\", \"would\", \"might\" or \"will\" be taken, occur or be achieved. Forward-Looking information in this news release includes statements related to the registration of the Last Chance property in the name of Military, as well as future plans for exploration activities at the Last Chance property, assumptions related to the continuation of the global demand for antimony, and any accessibility of DPA funding. A variety of factors, including known and unknown risks, many of which are beyond our control, could cause actual results to differ materially from the forward-looking information in this news release.  These include results from initial sampling and exploration activities at the Last Chance property, including consideration of results from the site visit noted, geopolitical developments related to the supply of antimony, the continued use of antimony and availability of alternatives,  availability of capital and labour in respect of the properties that are the subjects of this news release, the results of any future exploration activities, which cannot be guaranteed, and such other factors as may impact both the Last Chance property and any future activities in respect of the properties held by the Target. Additional risk factors can also be found in the Company's public filings under the Company's SEDAR+ profile at www.sedarplus.ca . Forward-Looking statements contained herein are made as of the date of this news release and the Company disclaims any obligation to update any forward-looking statements, whether as a result of new information, future events or results or otherwise. There can be no assurance that forward-looking statements will prove to be accurate, as actual results and future events could differ materially from those anticipated in such statements. The Company undertakes no obligation to update forward looking statements if circumstances, management's estimates or opinions should change, except as required by securities legislation. Accordingly, the reader is cautioned not to place undue reliance on forward-looking statements. The Canadian Securities Exchange has neither approved nor disapproved the information contained herein and does not accept responsibility for the adequacy or accuracy of this news release. To view the source version of this press release, please visit https://www.newsfilecorp.com/release/241443",
    "primary_commodity": "Sb"
  },
  "articleProject": {
    "gid": 9022,
    "project_name": "Last Chance",
    "location": "Nevada, United States"
  },
  "articleExchange": "CSE",
  "articleCompanyId": 4677,
  "articleTicker": "MILI",
  "articleCompanyName": "Military Metals Corp.",
  "allOtherCompanyProjects": [
    {
      "company_id": 4677,
      "gid": 8876,
      "project_name": "Tienesgrund",
      "location": null
    },
    {
      "company_id": 4677,
      "gid": 8877,
      "project_name": "Medvedi Potok",
      "location": null
    },
    {
      "company_id": 4677,
      "gid": 9022,
      "project_name": "Last Chance",
      "location": "Nevada, United States"
    },
    {
      "company_id": 4677,
      "gid": 9099,
      "project_name": "Trojarova",
      "location": "Region of Bratislava, Slovakia"
    }
  ],
  "allOtherCompanyNews": [
    {
      "id": 106911,
      "company_id": 4677,
      "title": "Military Metals Announces Access Agreement at West Gore Past Producing Antimony Mine, Nova Scotia",
      "link": null,
      "date": "2025-06-04T11:30:00.000Z",
      "hidden": false
    },
    {
      "id": 104338,
      "company_id": 4677,
      "title": "Military Metals Announces Participation at the EIT Raw Materials Summit as EU Implements ReArm Europe Plan/Readiness 2030, Brussels May 13-15",
      "link": null,
      "date": "2025-05-12T11:30:00.000Z",
      "hidden": false
    },
    {
      "id": 103021,
      "company_id": 4677,
      "title": "Military Metals Summarizes U.S. Strategic Shift Toward European Critical Minerals Sourcing",
      "link": null,
      "date": "2025-05-01T11:30:00.000Z",
      "hidden": false
    },
    {
      "id": 99991,
      "company_id": 4677,
      "title": "Military Metals Announces Field Program at Its Tiennesgrund Antimony-Gold Property in Slovakia",
      "link": null,
      "date": "2025-04-16T11:30:00.000Z",
      "hidden": false
    },
    {
      "id": 99001,
      "company_id": 4677,
      "title": "Military Metals Corp. Summarizes U.S. Decision to Exempt Antimony from 'Liberation Day' Tariffs",
      "link": null,
      "date": "2025-04-08T11:30:00.000Z",
      "hidden": false
    },
    {
      "id": 98466,
      "company_id": 4677,
      "title": "Military Metals Commences Underground Lidar Survey at Its Flagship Trojárová Antimony-Gold Property in Slovakia, Antimony Achieves New All-Time High Price",
      "link": null,
      "date": "2025-04-02T11:30:00.000Z",
      "hidden": false
    },
    {
      "id": 91810,
      "company_id": 4677,
      "title": "Military Metals Reviews Its Slovakian Tin-Tungsten Asset in Slovakia",
      "link": null,
      "date": "2025-03-19T11:30:00.000Z",
      "hidden": false
    },
    {
      "id": 90448,
      "company_id": 4677,
      "title": "Military Metals European Progress Update: Slovakia Resource Estimation",
      "link": "https://www.newsfilecorp.com/release/243900/Military-Metals-European-Progress-Update-Slovakia-Resource-Estimation",
      "date": "2025-03-10T11:30:00.000Z",
      "hidden": false
    },
    {
      "id": -170584,
      "company_id": 4677,
      "title": "Military Metals Announce AGM Results",
      "link": "https://www.newsfilecorp.com/release/241907/Military-Metals-Announce-AGM-Results",
      "date": "2025-02-21T21:51:00.000Z",
      "hidden": false
    },
    {
      "id": 88361,
      "company_id": 4677,
      "title": "Military Metals Completes Acquisition of Last Chance Antimony-Gold Property in Nevada, Antimony Price Achieves New All-Time High over US$50,000 per Tonne(1)",
      "link": "https://www.newsfilecorp.com/release/241443/Military-Metals-Completes-Acquisition-of-Last-Chance-AntimonyGold-Property-in-Nevada-Antimony-Price-Achieves-New-AllTime-High-over-US50000-per-Tonne1",
      "date": "2025-02-19T12:30:00.000Z",
      "hidden": false
    }
  ]
}
