{
  "article": {
    "id": 40283,
    "link": "https://www.accesswire.com/viewarticle.aspx?id=780347&lang=en",
    "title": "Reyna Silver and Reyna Gold Announce Signing of Option Agreement for Gryphon Project in Nevada",
    "description": "<?xml version=\"1.0\" encoding=\"utf-8\"?><span><p><i><strong>NOT FOR DISSEMINATION IN THE UNITED STATES OR FOR DISTRIBUTION TO U.S. NEWSWIRE SERVICES.</strong></i></p><p><strong>VANCOUVER, BC and HONG KONG, CHINA / ACCESSWIRE / September 5, 2023 / Reyna Silver Corp. (TSXV:RSLV)(OTCQX:RSNVF)(FRA:4ZC) </strong>(&quot;<strong>Reyna Silver</strong>&quot;) and <strong>Reyna Gold Corp. (TSXV:REYG)(OTCQB:REYFG) </strong>(&quot;<strong>Reyna Gold</strong>&quot;)<strong> </strong>are pleased to announce that they have entered into a Property Option Agreement (the &quot;<strong>Agreement</strong>&quot;) with Golden Gryphon USA Inc. (&quot;<strong>Gryphon</strong>&quot;) on the Gryphon Summit Project (the &quot;<strong>Project</strong>&quot;) located in Eureka and Elko Counties, Nevada. The Project comprises 1286 unpatented and 8 patented lode mining claims located in the Diablo Range, which lies in an area of excellent infrastructure between the Carlin and Eureka-Battle Trends of north-central Nevada.</p><p>The 10,300-hectare Gryphon project covers 8 by 16 kilometres of ground laced by well-developed, variably mineralized structures. The structures show strong evidence of having sequentially controlled multiple mineralizing events, including Carlin-style Gold; Silver, Lead, Zinc, Copper, Gold Carbonate Replacement veins (CRDs); and stratabound Nickel-Zinc mineralization (See Figure 2). This style of overlapping mineralizing events is a key element of significant deposits like Ruby Hill, which lies just 70 km along trend southeast of the Gryphon project in the famous Eureka District, now known for its overlapping Carlin-style gold and historic CRD Pb-Zn-Ag deposits (See Figure 1). In addition, the Gryphon project contains an interpreted stratabound Nickel-Zinc sequence, providing a critical mineral opportunity in one of the best jurisdictions in the world (See Figure 3).</p><p>Historic exploration at Gryphon Summit was by Majors who focused on the gold and undertook extensive geological, geochemical, and geophysical programs. These resulted in localized shallow drilling programs, several of which showed strong results that were never followed up. Golden Gryphon Exploration subsequently recognized multiple superimposed silver-lead-zinc-copper and nickel mineralization events combined with a possible porphyry driver. Reyna Silver and Reyna Gold plan to deploy the first-ever integrated ore-systems approach here to unravel the individual components of this large, composite district-scale project.</p><p>&quot;Reyna Silver's strength is the ability to take on large, district-scale projects. The multiple overprinted silver, gold and nickel events seen here and increasingly by others in the immediate neighborhood suggests Gryphon fits perfectly into our wheelhouse,&quot; said Jorge Ramiro Monroy, CEO of Reyna Silver. &quot;We're delighted to team with our sister company Reyna Gold on this precious metals-rich multistage property smack dab in the middle of one of the world's best-understood gold mega-districts.&quot;</p><p>&quot;We are excited by the opportunity to expand into this new jurisdiction with shared talents and capital. Our geological team has considerable expertise in Carlin Gold deposits we can bring to bear,&quot; said Michael Wood, CEO of Reyna Gold. &quot;The investment structure of the deal allows us to build systematically on existing work, and the joint venture provides our shareholders jurisdictional diversity through exposure to a district-scale property in the U.S., complementing our La Gloria project in Mexico.&quot;</p><p>&quot;It's remarkable when the opportunity arises to acquire an exploration project on Main Street for both the Carlin Gold and Eureka-Ruby Hill CRD trends, especially one with a huge inventory of high quality but underutilized exploration data,&quot; noted Dr. Peter Megaw, Chief Exploration Advisor to Reyna Silver. &quot;Gryphon is just across the valley from i80 Gold's Ruby Hill, where the two major regional mineralization styles are co-mingled, creating some pretty special mining economics.&quot;</p><p><strong>The Agreement:</strong></p><p>The Agreement gives Reyna Silver and Reyna Gold, jointly, the ability to earn up to a 70% equity interest in the Project (the &quot;<strong>Option</strong>&quot;). Reyna Silver and Reyna Gold have formed an unincorporated joint venture for the purpose of holding the Option (the &quot;<strong>Reyna JV</strong>&quot;)<strong>. </strong>The Option is subject to the Reyna JV performing the following by April 30, 2027: (i) expending a total of US$9,500,000 on the Project; (ii) making cash payments to Gryphon in the aggregate amount of US$1,100,000; and (iii) issuing a total of 1,200,000 common shares in the capital of Reyna Silver and 1,200,000 common shares in the capital of Reyna Gold to Gryphon. Upon completion of the Option, Gryphon and Reyna JV will enter a joint venture to continue exploration and development of the Project. See below for the detailed terms.</p><p>Reyna Silver and Reyna Gold already share a number of technical team members and advisors; for efficiency, Reyna Silver will assume the technical lead of the Gryphon Summit project. Reyna Gold will contribute both capital and their gold expertise, including advisor Tony Longo, whose experience in Carlin-style Deposits will significantly benefit the project. The structure of the agreement is designed with the intent to focus funds for the first two years into the ground for exploration.</p><p><strong>The Project</strong></p><p>The project lies in the Basin and Range province of Nevada between the Battle Mountain-Eureka and Carlin trends, along the eastern boundary of the Roberts Mountain Thrust. This area's NS to NNW high-angle horst-graben structures provided excellent pathways for mineralizing fluids generated by a series of metallogenic events. Calcareous lithologies dominate the geologic sequence, including limestone, dolostone and calcareous shale, as well as clastics and quartzite. Particular rock units of interest include the Pogonip Group (the host rock for the Carlin-style mineralization in Eureka), Devil's Gate Limestone (a major host for Eureka CRD mineralization), and the Vinini Formation (a major host for gold mineralization in the Horse Canyon Carlin Gold mine).</p><figure class=\"image image_resized\" style=\"width:100%;display:table;text-align:center;margin:0.9em auto\" width=\"100%\"><img src=\"https://www.accesswire.com/users/newswire/images/780347/laFXUmcxwRnIurrEcpzRjYeKQWjevrdiSz30VaMRwZLOuJoYJ9OGXoBZ0rvKnOEWs58V0I7n9w_uE8KzuP4qSDEQYGnm2iNQQ72xTSK_9L1jb7BJ51W7vuMIWsTyciUcT1_ggqzuYgik.jpg\" width=\"100%\" /></figure><div style=\"clear: both\"> </div><div> </div><div> </div><div> </div><p>Figure 1. Gryphon Summit is located in Northeastern Nevada, 70 km NW of the Eureka district and 54 km from Carlin. The project is 73 km west of Reyna Silver's Medicine Springs CRD Project.</p><p>Gryphon Summit exhibits both the key features indicative of a Carlin-style system and at least 8 out of the 13 key features associated with major CRDs (See Figure 5). Extensive systematic sampling revealed gold grades up to 15-24 g/t Au, silver grades up to 300-2060 g/t Ag, nickel grades up to 0.2-0.4% Ni, and zinc grades up to 3-35% Zn (See Figures 2 and 3). The exceptional zinc grades concentrate along structures and associate with stratiform Ni-Zn mineralization (See Figure 3).</p><p>Exploration will build on extensive earlier work conducted by Golden Gryphon Exploration (GGE) or their prior optionees, including 133 RC holes (11,620 m with most under 100 m depth. We have complete data for 73 of these holes), 11 core holes (4862 m), and most recently, Agnico Eagle's 12 diamond drill holes (2987 m; 250 m average depth) (See Figure 4). In addition, the Reynas inherit over USD$2,000,000 of geochemical and geophysical data, including over 3,000 analyzed rock samples with a curated reference sample library, magnetic, gravimetric, 39 km of IP, CSAMT, and 17 km of NSAMT geophysics. The project is crossed by 35 km of well-maintained roads connecting all the key areas and existing permitted drill targets.</p><p>These combined elements make Gryphon primed for the Reyna's disciplined, systematic, ore-systems approach to exploration.</p><figure class=\"image image_resized\" style=\"width:100%;display:table;text-align:center;margin:0.9em auto\" width=\"100%\"><img src=\"https://www.accesswire.com/users/newswire/images/780347/vXrocGr7yLIFCHk_Yi6jHE9mReU0Q3w-B3aLxuFoF4Byt1TPTQ-Wss0b2uY3A2TrhxxW8Gzdi30B2EQolJ7fC9VL5-2lKAQSxnMfyhytBwOkqVG2hZ0Oa9GkUwq5BQ6Bpc94U4vxzaj5.jpg\" width=\"100%\" /></figure><div style=\"clear: both\"> </div><div> </div><div> </div><div> </div><p>Figure 2: Anomalous geochemical results from outcrop and grab samples. Gold is yellow, Silver is blue, and Nickel is purple. Claim boundary delineated by the grey line. (Data generated/compiled by Golden Gryphon USA).</p><figure class=\"image image_resized\" style=\"width:100%;display:table;text-align:center;margin:0.9em auto\" width=\"100%\"><img src=\"https://www.accesswire.com/users/newswire/images/780347/0jpT5ReruhDdv8xuaYsa7kQpRMjKtbOK-oEXTO-HwZiVGF1VdGnsj6djR1fu-Iz8hYf15ISUng4Vhau-6D2aYNc1bGevOEc0tkLo4ZTTSSs1bntmaaQ2c0JpqlNYgJ9koKTkg6e05mXX.jpg\" width=\"100%\" /></figure><div style=\"clear: both\"> </div><div> </div><div> </div><p>Figure 3. Nickel and Zn mineralization. Nickel is in purple, with grades up to 0.2-0.48%. Zinc is in green with grades up to 3-35%. (Data generated/compiled by Golden Gryphon USA).</p><figure class=\"image image_resized\" style=\"width:100%;display:table;text-align:center;margin:0.9em auto\" width=\"100%\"><img src=\"https://www.accesswire.com/users/newswire/images/780347/ggjJ9nTCg6dnH9hIA92t_n_xL0GWFnFpiSrggF3Ii4om6_j4ZNjJuFNlx3NR8SLaOJH_HAP2NEkAim2_pDklUyaGn44SzyqFFELjws3GVZg1bkAwXrd7NouqjF6WOLp_cwheSol62taV.jpg\" width=\"100%\" /></figure><div style=\"clear: both\"> </div><div> </div><div> </div><p>Figure 4. Historic Drilling at Gryphon. The previous drilling consisted of 133 RC holes displayed in grey and 23 Core holes displayed in dark grey. (Data generated/compiled by Golden Gryphon USA)</p><figure class=\"image image_resized\" style=\"width:100%;display:table;text-align:center;margin:0.9em auto\" width=\"100%\"><img src=\"https://www.accesswire.com/users/newswire/images/780347/qFIsTVf4DgQb6Mdrm1aODrYyFWCPpwH5_KSfjnL9X5BZqELAdPD_am_7uQehgywsfteU8OBUjmxpnTb34D3ny-b6mKCa1qVU9EO6eKjfeOVIQc5pQIxOU-Dql-q-f7BN0tw4sj7kKGkK.jpg\" width=\"100%\" /></figure><div style=\"clear: both\"> </div><div> </div><div> </div><p>Figure 5. The CRD Initial Checklist, with the 13 key features common to all large known CRD deposits. Gryphon exhibits 8 out of 13 to date.</p><p><strong>Key Terms of the Property Option Agreement</strong></p><p>To complete its full 70% earn-in under the Agreement, Reyna JV must complete the following:</p><ul><li>Make expenditures in relation to the Project up to the total amount of US$9,500,000, on the following schedule: US$500,000 on or prior to April 30, 2024; US$2,000,000 on or prior to April 30, 2025; US$3,000,000 on or prior to April 30, 2026; and US$4,000,000 on or prior to April 30, 2027;</li><li>Make cash payments to Gryphon in the total amount of US$1,100,000, on the following schedule: US$100,000 on entering into the Agreement; US$100,000 on or prior to April 30, 2024; US$100,000 on or prior to October 31, 2024; US$150,000 on or prior to April 30, 2025; US$150,000 on or prior to October 31, 2025; US$250,000 on or prior to April 30, 2026; and US$250,000 on or prior to October 31, 2026.;</li><li>Issue an aggregate of 1,200,000 Reyna Silver common shares to Gryphon, on the following schedule: 125,000 within five business days of acceptance of the Agreement by the TSX Venture Exchange; 125,000 on or prior to April 30, 2025; 200,000 on or prior to April 30, 2026; and 750,000 on or prior to April 30, 2027;</li><li>Issue an aggregate of 1,200,000 Reyna Gold common shares to Gryphon, on the following schedule: 125,000 within five business days of acceptance of the Agreement by the TSX Venture Exchange; 125,000 on or prior to April 30, 2025; 200,000 on or prior to April 30, 2026; and 750,000 on or prior to April 30, 2027.</li></ul><p>The initial US$2,500,000 in required expenditures, the initial US$300,000 in cash payments and the initial issuances of 250,000 Reyna Silver common shares and 250,000 Reyna Gold common shares are firm obligations and must be paid regardless of whether the Option is subsequently dropped by the Reyna JV. Reyna Silver and Reyna Gold will each be severally responsible for 50% of the required expenditures and required cash payments under the Agreement.</p><p>Upon exercising the Option in full, a new joint venture will be formed between Gryphon and Reyna JV, the terms of which will be negotiated on or before April 30, 2025.</p><p>Gryphon will be granted a 2% net smelter returns royalty on the Project (subject to a 50% buy down right to a 1% royalty), except that the part of the Project comprising the eight patented mining claims will be subject only to a 1% net smelter returns royalty (not subject to further buy-down) (the &quot;<strong>NSR Agreement</strong>&quot;). The terms of the NSR Agreement will be negotiated on or before April 30, 2025.</p><p>The Agreement is subject to (i) a 30-day due diligence period in favour of Reyna JV and (ii) acceptance by the TSX Venture Exchange.</p><p><strong>The technical data contained in this news release was reviewed and approved by Dr. Peter Megaw C.P.G., who is responsible for ensuring that the geologic information provided in this news release is accurate and who acts as a &quot;qualified person&quot; under National Instrument 43-101 Standards of Disclosure for Mineral Projects. Dr. Megaw is not independent as he and/or the companies with which he is affiliated hold Net Smelter Royalties on the Guigui and Batopilas Projects that predate Reyna Silver acquiring them and is Chief Technical Advisor for, and a shareholder of, Reyna Silver.</strong></p><p><i><strong>Jorge Ramiro Monroy</strong></i><br /><strong>Chief Executive Officer of Reyna Silver Corp.</strong></p><p><strong>For Further Information, Please Contact:</strong></p><p>Reyna Silver Corp.</p><p>Jorge Ramiro Monroy, Chief Executive Officer<br /><a href=\"mailto:info@reynasilver.com\"><u>info@reynasilver.com</u></a><br /><a href=\"https://pr.report/TI2vXCe6\"><u>www.reynasilver.com</u></a></p><p><i><strong>Michael Wood</strong></i><br /><strong>Chief Executive Officer of Reyna Gold Corp.</strong></p><p><strong>For Further Information, Please Contact:</strong></p><p>Reyna Gold Corp.<br />Michael Wood, Chief Executive Officer<br /><a href=\"mailto:info@reynagold.com\"><u>info@reynagold.com</u></a><br /><a href=\"https://pr.report/A4L8FRke\"><u>www.reynagold.com</u></a></p><p><strong>About Reyna Silver Corp.</strong></p><p>Reyna Silver Corp. (TSXV:RSLV) is a growth-oriented junior exploration and development company focused on exploring for high-grade, district-scale silver deposits in Mexico and USA.</p><p>Reyna's principal properties are the Guigui and Batopilas Properties in Chihuahua, Mexico, plus Medicine Springs and Gryphon Summit in Nevada, USA. Guigui covers the interpreted source area for the Santa Eulalia District, and Batopilas covers most of Mexico's historically highest-grade silver system. The Company also has an option to acquire 100% of the Medicine Springs CRD project in Elko Co., Nevada, USA, and the 10,300-hectare combined Carlin-style and CRD Griffin Summit Project in Eureka Co., Nevada, USA, as well as several early-stage properties in Mexico.</p><p><strong>About Reyna Gold Corp.</strong></p><p>Reyna Gold Corp. is a gold exploration company focused on district-scale exploration. The Company has a portfolio of assets on the Mojave-Sonora Megashear and the Sierra Madre Gold in Mexico, and an option to acquire the 10,300-hectare combined Carlin-style and CRD Gryphon Summit Project in Eureka Co., Nevada, USA. The Company has an experienced management team with a proven track record of wealth creation through project discovery, advancement, and monetization.</p><p><strong>Neither the TSX Venture Exchange nor its Regulation Services Provider (as that term is defined in policies of the TSX Venture Exchange) accepts responsibility for the adequacy or accuracy of this release.</strong></p><p><strong>CAUTIONARY STATEMENT REGARDING FORWARD-LOOKING INFORMATION</strong>: This news release includes certain &quot;forward-looking statements&quot; under applicable Canadian securities legislation. Forward-looking statements include, but are not limited to, statements with respect to: the terms and conditions of the option agreement; the ability of the Reyna JV to fully-earn in the Option, use of funds; the business and operations of the Reyna JV and the exploration of the Property. Forward-looking statements are necessarily based upon a number of estimates and assumptions that, while considered reasonable, are subject to known and unknown risks, uncertainties, and other factors which may cause the actual results and future events to differ materially from those expressed or implied by such forward-looking statements. Such factors include, but are not limited to: general business, economic, competitive, political and social uncertainties; delay or failure to receive board, shareholder or regulatory approvals; and the uncertainties surrounding the mineral exploration industry. There can be no assurance that such statements will prove to be accurate, as actual results and future events could differ materially from those anticipated in such statements. Accordingly, readers should not place undue reliance on forward looking statements. The Company disclaims any intention or obligation to update or revise any forward-looking statements, whether as a result of new information, future events or otherwise, except as required by law.</p><p><strong>SOURCE: </strong>Reyna Silver Corp.</p></span><br><br>View source version on accesswire.com: <br><a href='https://www.accesswire.com/780347/reyna-silver-and-reyna-gold-announce-signing-of-option-agreement-for-gryphon-project-in-nevada'>https://www.accesswire.com/780347/reyna-silver-and-reyna-gold-announce-signing-of-option-agreement-for-gryphon-project-in-nevada</a><br><br>",
    "search_terms": "Gryphon Summit,Reyna Silver Corp.,RSLV",
    "master_gid": 5331,
    "date": "2023-09-05T11:00:00.000Z",
    "tags": "China,USA|||Gold,Silver|Project Acquisition",
    "image_id": null,
    "hidden": false,
    "company_id": 969,
    "provider": "accesswire",
    "excerpt": "NOT FOR DISSEMINATION IN THE UNITED STATES OR FOR DISTRIBUTION TO U.S. NEWSWIRE SERVICES.VANCOUVER, BC and HONG KONG, CHINA / ACCESSWIRE / September 5, 2023 / Reyna Silver Corp. (TSXV:RSLV)(OTCQX:RSNVF)(FRA:4ZC)(&quot;Reyna Silver&quot;) andReyna Gold Corp. (TSXV:REYG)(OTCQB:REYFG)(&quot;Reyna Gold&quot;)are pleased to announce that they have entered into a Property Option Agreement (the &quot;Agreement&quot;)",
    "is_regulatory": false,
    "refined_tags": [
      "Project Acquisition"
    ],
    "ftp_filename": null,
    "company_name": "Reyna Gold Corp.",
    "exchange": "TSXV",
    "root_ticker": "RSLV",
    "project_name": "Gryphon Summit",
    "gid": 5331,
    "location": "Nevada, United States",
    "plan_id": "companytier2",
    "description_text": "NOT FOR DISSEMINATION IN THE UNITED STATES OR FOR DISTRIBUTION TO U.S. NEWSWIRE SERVICES. VANCOUVER, BC and HONG KONG, CHINA / ACCESSWIRE / September 5, 2023 / Reyna Silver Corp. (TSXV:RSLV)(OTCQX:RSNVF)(FRA:4ZC) (\" Reyna Silver \") and Reyna Gold Corp. (TSXV:REYG)(OTCQB:REYFG) (\" Reyna Gold \") are pleased to announce that they have entered into a Property Option Agreement (the \" Agreement \") with Golden Gryphon USA Inc. (\" Gryphon \") on the Gryphon Summit Project (the \" Project \") located in Eureka and Elko Counties, Nevada. The Project comprises 1286 unpatented and 8 patented lode mining claims located in the Diablo Range, which lies in an area of excellent infrastructure between the Carlin and Eureka-Battle Trends of north-central Nevada. The 10,300-hectare Gryphon project covers 8 by 16 kilometres of ground laced by well-developed, variably mineralized structures. The structures show strong evidence of having sequentially controlled multiple mineralizing events, including Carlin-style Gold; Silver, Lead, Zinc, Copper, Gold Carbonate Replacement veins (CRDs); and stratabound Nickel-Zinc mineralization (See Figure 2). This style of overlapping mineralizing events is a key element of significant deposits like Ruby Hill, which lies just 70 km along trend southeast of the Gryphon project in the famous Eureka District, now known for its overlapping Carlin-style gold and historic CRD Pb-Zn-Ag deposits (See Figure 1). In addition, the Gryphon project contains an interpreted stratabound Nickel-Zinc sequence, providing a critical mineral opportunity in one of the best jurisdictions in the world (See Figure 3). Historic exploration at Gryphon Summit was by Majors who focused on the gold and undertook extensive geological, geochemical, and geophysical programs. These resulted in localized shallow drilling programs, several of which showed strong results that were never followed up. Golden Gryphon Exploration subsequently recognized multiple superimposed silver-lead-zinc-copper and nickel mineralization events combined with a possible porphyry driver. Reyna Silver and Reyna Gold plan to deploy the first-ever integrated ore-systems approach here to unravel the individual components of this large, composite district-scale project. \"Reyna Silver's strength is the ability to take on large, district-scale projects. The multiple overprinted silver, gold and nickel events seen here and increasingly by others in the immediate neighborhood suggests Gryphon fits perfectly into our wheelhouse,\" said Jorge Ramiro Monroy, CEO of Reyna Silver. \"We're delighted to team with our sister company Reyna Gold on this precious metals-rich multistage property smack dab in the middle of one of the world's best-understood gold mega-districts.\" \"We are excited by the opportunity to expand into this new jurisdiction with shared talents and capital. Our geological team has considerable expertise in Carlin Gold deposits we can bring to bear,\" said Michael Wood, CEO of Reyna Gold. \"The investment structure of the deal allows us to build systematically on existing work, and the joint venture provides our shareholders jurisdictional diversity through exposure to a district-scale property in the U.S., complementing our La Gloria project in Mexico.\" \"It's remarkable when the opportunity arises to acquire an exploration project on Main Street for both the Carlin Gold and Eureka-Ruby Hill CRD trends, especially one with a huge inventory of high quality but underutilized exploration data,\" noted Dr. Peter Megaw, Chief Exploration Advisor to Reyna Silver. \"Gryphon is just across the valley from i80 Gold's Ruby Hill, where the two major regional mineralization styles are co-mingled, creating some pretty special mining economics.\" The Agreement: The Agreement gives Reyna Silver and Reyna Gold, jointly, the ability to earn up to a 70% equity interest in the Project (the \" Option \"). Reyna Silver and Reyna Gold have formed an unincorporated joint venture for the purpose of holding the Option (the \" Reyna JV \") . The Option is subject to the Reyna JV performing the following by April 30, 2027: (i) expending a total of US$9,500,000 on the Project; (ii) making cash payments to Gryphon in the aggregate amount of US$1,100,000; and (iii) issuing a total of 1,200,000 common shares in the capital of Reyna Silver and 1,200,000 common shares in the capital of Reyna Gold to Gryphon. Upon completion of the Option, Gryphon and Reyna JV will enter a joint venture to continue exploration and development of the Project. See below for the detailed terms. Reyna Silver and Reyna Gold already share a number of technical team members and advisors; for efficiency, Reyna Silver will assume the technical lead of the Gryphon Summit project. Reyna Gold will contribute both capital and their gold expertise, including advisor Tony Longo, whose experience in Carlin-style Deposits will significantly benefit the project. The structure of the agreement is designed with the intent to focus funds for the first two years into the ground for exploration. The Project The project lies in the Basin and Range province of Nevada between the Battle Mountain-Eureka and Carlin trends, along the eastern boundary of the Roberts Mountain Thrust. This area's NS to NNW high-angle horst-graben structures provided excellent pathways for mineralizing fluids generated by a series of metallogenic events. Calcareous lithologies dominate the geologic sequence, including limestone, dolostone and calcareous shale, as well as clastics and quartzite. Particular rock units of interest include the Pogonip Group (the host rock for the Carlin-style mineralization in Eureka), Devil's Gate Limestone (a major host for Eureka CRD mineralization), and the Vinini Formation (a major host for gold mineralization in the Horse Canyon Carlin Gold mine). Figure 1. Gryphon Summit is located in Northeastern Nevada, 70 km NW of the Eureka district and 54 km from Carlin. The project is 73 km west of Reyna Silver's Medicine Springs CRD Project. Gryphon Summit exhibits both the key features indicative of a Carlin-style system and at least 8 out of the 13 key features associated with major CRDs (See Figure 5). Extensive systematic sampling revealed gold grades up to 15-24 g/t Au, silver grades up to 300-2060 g/t Ag, nickel grades up to 0.2-0.4% Ni, and zinc grades up to 3-35% Zn (See Figures 2 and 3). The exceptional zinc grades concentrate along structures and associate with stratiform Ni-Zn mineralization (See Figure 3). Exploration will build on extensive earlier work conducted by Golden Gryphon Exploration (GGE) or their prior optionees, including 133 RC holes (11,620 m with most under 100 m depth. We have complete data for 73 of these holes), 11 core holes (4862 m), and most recently, Agnico Eagle's 12 diamond drill holes (2987 m; 250 m average depth) (See Figure 4). In addition, the Reynas inherit over USD$2,000,000 of geochemical and geophysical data, including over 3,000 analyzed rock samples with a curated reference sample library, magnetic, gravimetric, 39 km of IP, CSAMT, and 17 km of NSAMT geophysics. The project is crossed by 35 km of well-maintained roads connecting all the key areas and existing permitted drill targets. These combined elements make Gryphon primed for the Reyna's disciplined, systematic, ore-systems approach to exploration. Figure 2: Anomalous geochemical results from outcrop and grab samples. Gold is yellow, Silver is blue, and Nickel is purple. Claim boundary delineated by the grey line. (Data generated/compiled by Golden Gryphon USA). Figure 3. Nickel and Zn mineralization. Nickel is in purple, with grades up to 0.2-0.48%. Zinc is in green with grades up to 3-35%. (Data generated/compiled by Golden Gryphon USA). Figure 4. Historic Drilling at Gryphon. The previous drilling consisted of 133 RC holes displayed in grey and 23 Core holes displayed in dark grey. (Data generated/compiled by Golden Gryphon USA) Figure 5. The CRD Initial Checklist, with the 13 key features common to all large known CRD deposits. Gryphon exhibits 8 out of 13 to date. Key Terms of the Property Option Agreement To complete its full 70% earn-in under the Agreement, Reyna JV must complete the following: Make expenditures in relation to the Project up to the total amount of US$9,500,000, on the following schedule: US$500,000 on or prior to April 30, 2024; US$2,000,000 on or prior to April 30, 2025; US$3,000,000 on or prior to April 30, 2026; and US$4,000,000 on or prior to April 30, 2027; Make cash payments to Gryphon in the total amount of US$1,100,000, on the following schedule: US$100,000 on entering into the Agreement; US$100,000 on or prior to April 30, 2024; US$100,000 on or prior to October 31, 2024; US$150,000 on or prior to April 30, 2025; US$150,000 on or prior to October 31, 2025; US$250,000 on or prior to April 30, 2026; and US$250,000 on or prior to October 31, 2026.; Issue an aggregate of 1,200,000 Reyna Silver common shares to Gryphon, on the following schedule: 125,000 within five business days of acceptance of the Agreement by the TSX Venture Exchange; 125,000 on or prior to April 30, 2025; 200,000 on or prior to April 30, 2026; and 750,000 on or prior to April 30, 2027; Issue an aggregate of 1,200,000 Reyna Gold common shares to Gryphon, on the following schedule: 125,000 within five business days of acceptance of the Agreement by the TSX Venture Exchange; 125,000 on or prior to April 30, 2025; 200,000 on or prior to April 30, 2026; and 750,000 on or prior to April 30, 2027. The initial US$2,500,000 in required expenditures, the initial US$300,000 in cash payments and the initial issuances of 250,000 Reyna Silver common shares and 250,000 Reyna Gold common shares are firm obligations and must be paid regardless of whether the Option is subsequently dropped by the Reyna JV. Reyna Silver and Reyna Gold will each be severally responsible for 50% of the required expenditures and required cash payments under the Agreement. Upon exercising the Option in full, a new joint venture will be formed between Gryphon and Reyna JV, the terms of which will be negotiated on or before April 30, 2025. Gryphon will be granted a 2% net smelter returns royalty on the Project (subject to a 50% buy down right to a 1% royalty), except that the part of the Project comprising the eight patented mining claims will be subject only to a 1% net smelter returns royalty (not subject to further buy-down) (the \" NSR Agreement \"). The terms of the NSR Agreement will be negotiated on or before April 30, 2025. The Agreement is subject to (i) a 30-day due diligence period in favour of Reyna JV and (ii) acceptance by the TSX Venture Exchange. The technical data contained in this news release was reviewed and approved by Dr. Peter Megaw C.P.G., who is responsible for ensuring that the geologic information provided in this news release is accurate and who acts as a \"qualified person\" under National Instrument 43-101 Standards of Disclosure for Mineral Projects. Dr. Megaw is not independent as he and/or the companies with which he is affiliated hold Net Smelter Royalties on the Guigui and Batopilas Projects that predate Reyna Silver acquiring them and is Chief Technical Advisor for, and a shareholder of, Reyna Silver. Jorge Ramiro Monroy Chief Executive Officer of Reyna Silver Corp. For Further Information, Please Contact: Reyna Silver Corp. Jorge Ramiro Monroy, Chief Executive Officer info@reynasilver.com www.reynasilver.com Michael Wood Chief Executive Officer of Reyna Gold Corp. For Further Information, Please Contact: Reyna Gold Corp. Michael Wood, Chief Executive Officer info@reynagold.com www.reynagold.com About Reyna Silver Corp. Reyna Silver Corp. (TSXV:RSLV) is a growth-oriented junior exploration and development company focused on exploring for high-grade, district-scale silver deposits in Mexico and USA. Reyna's principal properties are the Guigui and Batopilas Properties in Chihuahua, Mexico, plus Medicine Springs and Gryphon Summit in Nevada, USA. Guigui covers the interpreted source area for the Santa Eulalia District, and Batopilas covers most of Mexico's historically highest-grade silver system. The Company also has an option to acquire 100% of the Medicine Springs CRD project in Elko Co., Nevada, USA, and the 10,300-hectare combined Carlin-style and CRD Griffin Summit Project in Eureka Co., Nevada, USA, as well as several early-stage properties in Mexico. About Reyna Gold Corp. Reyna Gold Corp. is a gold exploration company focused on district-scale exploration. The Company has a portfolio of assets on the Mojave-Sonora Megashear and the Sierra Madre Gold in Mexico, and an option to acquire the 10,300-hectare combined Carlin-style and CRD Gryphon Summit Project in Eureka Co., Nevada, USA. The Company has an experienced management team with a proven track record of wealth creation through project discovery, advancement, and monetization. Neither the TSX Venture Exchange nor its Regulation Services Provider (as that term is defined in policies of the TSX Venture Exchange) accepts responsibility for the adequacy or accuracy of this release. CAUTIONARY STATEMENT REGARDING FORWARD-LOOKING INFORMATION : This news release includes certain \"forward-looking statements\" under applicable Canadian securities legislation. Forward-looking statements include, but are not limited to, statements with respect to: the terms and conditions of the option agreement; the ability of the Reyna JV to fully-earn in the Option, use of funds; the business and operations of the Reyna JV and the exploration of the Property. Forward-looking statements are necessarily based upon a number of estimates and assumptions that, while considered reasonable, are subject to known and unknown risks, uncertainties, and other factors which may cause the actual results and future events to differ materially from those expressed or implied by such forward-looking statements. Such factors include, but are not limited to: general business, economic, competitive, political and social uncertainties; delay or failure to receive board, shareholder or regulatory approvals; and the uncertainties surrounding the mineral exploration industry. There can be no assurance that such statements will prove to be accurate, as actual results and future events could differ materially from those anticipated in such statements. Accordingly, readers should not place undue reliance on forward looking statements. The Company disclaims any intention or obligation to update or revise any forward-looking statements, whether as a result of new information, future events or otherwise, except as required by law. SOURCE: Reyna Silver Corp. View source version on accesswire.com: https://www.accesswire.com/780347/reyna-silver-and-reyna-gold-announce-signing-of-option-agreement-for-gryphon-project-in-nevada",
    "primary_commodity": "Ag"
  },
  "articleProject": {
    "gid": 5331,
    "project_name": "Gryphon Summit",
    "location": "Nevada, United States"
  },
  "articleExchange": "TSXV",
  "articleCompanyId": 969,
  "articleTicker": "RSLV",
  "articleCompanyName": "Reyna Silver Corp.",
  "allOtherCompanyProjects": [
    {
      "company_id": 969,
      "gid": 2250,
      "project_name": "Batopilas",
      "location": "Chihuahua, Mexico"
    },
    {
      "company_id": 969,
      "gid": 5331,
      "project_name": "Gryphon Summit",
      "location": "Nevada, United States"
    },
    {
      "company_id": 969,
      "gid": 3832,
      "project_name": "Guigui",
      "location": "Chihuahua, Mexico"
    },
    {
      "company_id": 969,
      "gid": 3375,
      "project_name": "Medicine Springs",
      "location": null
    },
    {
      "company_id": 969,
      "gid": 4589,
      "project_name": "El Durazno",
      "location": "Sonora, Mexico"
    },
    {
      "company_id": 969,
      "gid": 4590,
      "project_name": "Matilde",
      "location": "Sonora, Mexico"
    },
    {
      "company_id": 969,
      "gid": 2253,
      "project_name": "La Reyna",
      "location": "Chihuahua, Mexico"
    }
  ],
  "allOtherCompanyNews": [
    {
      "id": 106632,
      "company_id": 969,
      "title": "Reyna Silver Corp. Announces Resignation of Director",
      "link": null,
      "date": "2025-06-02T20:30:00.000Z",
      "hidden": false
    },
    {
      "id": 91422,
      "company_id": 969,
      "title": "Reyna Silver Announces Final Tranche Closing of Previously Announced Non-Brokered Private Placement",
      "link": null,
      "date": "2025-03-14T20:58:00.000Z",
      "hidden": false
    },
    {
      "id": 89716,
      "company_id": 969,
      "title": "Reyna Silver Announces Third Tranche Closing Of Previously Announced Non-brokered Private Placement ",
      "link": "https://www.accessnewswire.com/newsroom/en/metals-and-mining/reyna-silver-announces-third-tranche-closing-of-previously-announced-non-brokered--993759",
      "date": "2025-02-28T21:20:00.000Z",
      "hidden": false
    },
    {
      "id": 87937,
      "company_id": 969,
      "title": "Reyna Silver Announces Second Tranche Closing of Previously Announced Non-Brokered Private Placement",
      "link": "https://www.accessnewswire.com/newsroom/en/metals-and-mining/reyna-silver-announces-second-tranche-closing-of-previously-announced-non-brokered-985724",
      "date": "2025-02-14T22:50:00.000Z",
      "hidden": false
    },
    {
      "id": 87033,
      "company_id": 969,
      "title": "Reyna Silver Announces First Tranche Closing of Previously Announced Non-brokered Private Placement ",
      "link": "https://www.accessnewswire.com/newsroom/en/metals-and-mining/reyna-silver-announces-first-tranche-closing-of-previously-announced-non-brokered--980447",
      "date": "2025-02-05T22:47:00.000Z",
      "hidden": false
    },
    {
      "id": 85942,
      "company_id": 969,
      "title": "Reyna Silver Announces 3 Million CAD Private Placement",
      "link": "https://www.accessnewswire.com/newsroom/en/metals-and-mining/reyna-silver-announces-3-million-cad-private-placement-975920",
      "date": "2025-01-30T12:45:00.000Z",
      "hidden": false
    },
    {
      "id": 85050,
      "company_id": 969,
      "title": "Reyna Silver Drills Anomalous CRD and Gold Mineralization at Gryphon Summit",
      "link": "https://www.accessnewswire.com/newsroom/en/metals-and-mining/reyna-silver-drills-anomalous-crd-and-gold-mineralization-at-gryphon-summit-972629",
      "date": "2025-01-23T12:45:00.000Z",
      "hidden": false
    },
    {
      "id": -180171,
      "company_id": 969,
      "title": "REYNA GOLD AND REYNA SILVER COMPLETE PLAN OF ARRANGEMENT AND AMEND GRYPHON SUMMIT OPTION AGREEMENT",
      "link": "https://app.quotemedia.com/data/downloadFiling?webmasterId=104408&ref=6722a7b7332c2b0902171882&type=PDFC&formType=002-002-001089-003001&formDescription=News+release&dateFiled=2024-10-30",
      "date": "2024-10-30T21:40:07.000Z",
      "hidden": false
    },
    {
      "id": 74466,
      "company_id": 969,
      "title": "Reyna Gold Obtains Shareholder and Court Approval for Acquisition by Reyna Silver",
      "link": "https://www.accesswire.com/viewarticle.aspx?id=930220&lang=en",
      "date": "2024-10-11T11:30:00.000Z",
      "hidden": false
    },
    {
      "id": 74129,
      "company_id": 969,
      "title": "Reyna Silver Amends Terms of Medicine Springs Option Agreement",
      "link": "https://www.accesswire.com/viewarticle.aspx?id=929034&lang=en",
      "date": "2024-10-08T20:15:00.000Z",
      "hidden": false
    }
  ]
}