{
  "article": {
    "id": 67281,
    "link": "https://www.accesswire.com/viewarticle.aspx?id=895234&lang=en",
    "title": "Reyna Silver Acquires the Mineral Hill District Within the Gryphon Project and Provides Operation Update",
    "description": "<p><strong>VANCOUVER, BC AND HONG KONG, CHINA / ACCESSWIRE / August 1, 2024 / Reyna Silver Corp. (TSXV:RSLV)(OTCQX:RSNVF)(FRA:4ZC) (&quot;Reyna&quot; or the &quot;Company&quot;) </strong>is pleased to announce that it has entered into an Option Agreement (the &quot;Agreement&quot;) with Minquest Ltd. (&quot;Minquest&quot;) on the Mineral Hill Project (the &quot;Project&quot;) located in Eureka County, Nevada. This historic district was an inlier including 8 patented claims and 20 unpatented claims within the overall Gryphon Project (Figure 1.)</p><p>&quot;Mineral Hill was producing some of the highest-grade silver-rich CRD mineralization ever found in this part of Nevada well before its neighbors Eureka, Cortez and Railroad were even discovered, so acquiring these patented claims fills an important missing piece in the Gryphon property puzzle,&quot;<a rel=\"nofollow\" href=\"https://pr.report/16mo\"><u> said Jorge Ramiro Monroy, CEO of Reyna Silver.</u></a> &quot;All these districts show overlapping Carlin Gold and CRD mineralization, but previous exploration at Gryphon just focused on the gold, so filling this hole lets us apply our broader integrated vision to unlock the full Gold, Silver and Critical Metals potential of the overall Gryphon system.&quot;</p><figure class=\"image image_resized\" style=\"width:100%;text-align:center;margin:0.9em auto\" width=\"100%\"><img style=\"aspect-ratio:370/370;\" src=\"https://www.accesswire.com/imagelibrary/c9df3469-b646-4cf3-92a9-ed65035699e9/895234/AD_4nXff0Kyge3mq-lbI2oPXfInME4XJRonaSPVdvlIO4eLMyCA3VAtrAJNSqrDdjm54MbneaawjyfuZgjJbl6FumZQyfhWr1bslHC-h24hewqCWFPmcjg65wpvHdSXB24qQn0LBPPjG4spa_5O9h3vH5bJ0qfes6ltPuoFKMCMHpA.jpg\" width=\"100%\" height=\"370\" /></figure><div style=\"clear: both\"> </div><div> </div><div> </div><div> </div><div> </div><div> </div><div> </div><div> </div><div> </div><p>Figure 1. Map of Gryphon claims with the Mineral Hill 8 patented claims and surrounding 20 claims noted in red on the western side of the property. The blue outline delineates the 10,300 ha existing claims package encompassing the Gryphon Project.</p><p>Mineral Hill was a significant historic Ag-Pb-Zn CRD producer with an average grade of 140 oz/ton Ag (3,968 g/t Age) production during its prime in the 1870s with average grades lowering to 24 oz/ton Ag (680 g/t Age) towards the end of mine life. Studying this portion of the Gryphon system allows the technical team to understand the geometry of the mineralization and begin following it towards source and potentially more mineralization.</p><p>The major deposits of the Lander and Eureka county area, including the Battle Mountain - Eureka trend and the Carlin trend, were noted as CRD deposits prior to discovery of the massive Carlin gold systems in the 1960s. Ralph Roberts, famous Carlin trailblazer, cited CRDs as the significant deposits in his papers in 1960 and 1966 including Eureka, Railroad and Cortez which are now collectively known for producing over 60 Moz of Gold. The association of CRDs and Carlin deposits has been recognized for years though the relationship is not fully understood, yet (See Figure 2.)</p><figure class=\"image image_resized\" style=\"width:100%;text-align:center;margin:0.9em auto\" width=\"100%\"><img style=\"aspect-ratio:499/464;\" src=\"https://www.accesswire.com/imagelibrary/d8b493b2-8bd7-437a-a0f1-3938dc20467e/895234/AD_4nXcJo-XUlb6cyqy29Z_ON4OiIM0MA7j-Jaitu2LiQglsLJWAfq2qVNcEPAQVK9xjhG_lmZ33l9wZEomS5xaT9z5Zl2xz2XJ4n6oycvg9bwOiftnreTbuXKWKvD8xIEClM4WhmK2taBY7DY5h9ggs2K1g5K1pHEYB8akAkewr.jpg\" width=\"100%\" height=\"464\" /></figure><div style=\"clear: both\"> </div><div> </div><div> </div><div> </div><div> </div><div> </div><div> </div><p>Figure 2. Map of the major Carlin deposits noted in gold (scaled relative to production) and Ag-Pb-Zn CRDs noted red as identified by R. Roberts in his famous 1960 &quot;Alignment of Mining Districts in North-Central Nevada&quot; (USGS Professional Paper 400-B) and 1966, Metallogenic provinces and mineral belts in Nevada (Nevada Bureau of Mines Report 13, pt. A, p. 47-72).</p><p><strong>The Agreement</strong></p><p>The Agreement gives Reyna Silver the ability to earn a 100% ownership interest in the Mineral Hill Project (the &quot;Option&quot;). The Option is subject to Reyna Silver performing the following by July 31, 2030: (i) incurring aggregate exploration expenditures of US$1,550,000 on the Project; and (ii) making cash payments to Minquest in the aggregate amount of US$1,810,000. On exercise of the Option by Reyna Silver, Reyna Silver will grant Minquest a 2.5% net smelter return (&quot;NSR&quot;) royalty. Reyna Silver will have the option to repurchase 1.25% of the 2.5% NSR royalty at any time by paying Minquest US$2,500,000.</p><p>The Reyna Silver technical team's depth of experience exploring and discovering major CRDs provides the opportunity to take a serious look at Gryphon from a new angle. Leveraging the CRD system to reveal all the ore-systems contained within Gryphon.</p><p><strong>Gryphon Project Update</strong></p><p>Additionally, Reyna Silver is looking forward to <strong>starting the 2024 drill program imminently</strong> building upon the concatenation of historic work, extensive mapping and reinterpretation of geology resulting in exciting new targets. The camp is ready to go, Earthworks on the east side are almost finished and the drill rig will arrive soon.</p><p><strong>For Further Information, Please Contact:</strong></p><p>Bethany Terracina, VP Investor Relations<br /><a rel=\"nofollow\" href=\"mailto:bethany@reynasilver.com\">bethany@reynasilver.com</a> <br /><a rel=\"nofollow\" href=\"https://pr.report/gne9sZTC\">www.reynasilver.com</a></p><p><strong>About Reyna Silver Corp.</strong></p><p>Reyna Silver is a growth-oriented junior exploration and development company. The Company focuses on exploring for high-grade, district-scale silver deposits in Mexico and the United States. In Nevada USA, the Company has recently entered into an option to acquire 70% of the 10,300-hectare &quot;Gryphon Summit Project&quot; in a 50/50 partnership with Reyna Gold Corp. (TSXV:REYG). The Gryphon Project shows features indicating uniquely superimposed/overprinted Silver-Lead-Zinc-Copper Carbonate Replacement (CRD), Carlin Gold and Critical Metals mineralization. Also in Nevada, the Company is advancing its option to acquire 100% of the &quot;Medicine Springs Project&quot; where the Company is exploring a potentially significant Silver-Lead-Zinc-Copper CRD-skarn-Porphyry system. The Company's Mexican assets are 100% owned and include the &quot;Guigui Project&quot; and &quot;Batopilas Project&quot;, both located in Chihuahua State. The Guigui Project covers the interpreted source area for the Santa Eulalia Carbonate Replacement Deposit District and Batopilas covers most of Mexico's historically highest-grade silver system.</p><p><strong>Forward Looking Information</strong></p><p>This release may contain forward-looking statements. Forward-looking statements are statements that are not historical facts and are generally, but not always, identified by the words &quot;expects&quot;, &quot;plans&quot;, &quot;anticipates&quot;, &quot;believes&quot;, &quot;intends&quot;, &quot;estimates&quot;, &quot;projects&quot;, &quot;potential&quot; and similar expressions, or that events or conditions &quot;will&quot;, &quot;would&quot;, &quot;may&quot;, &quot;could&quot; or &quot;should&quot; occur. Forward-looking statements may include, without limitation, statements relating to the Offering and the use of proceeds therefrom. The forward-looking statements contained in this press release are expressly qualified in their entirety by this cautionary statement. All forward-looking statements in this press release are made as of the date of this press release. The forward-looking statements contained herein are also subject generally to assumptions and risks and uncertainties that are described from time to time in the Company's public securities filings with the Canadian securities commissions. Although the Company believes the expectations expressed in such forward-looking statements are based on reasonable assumptions, such statements are not guarantees of future performance and actual results may differ materially from those in forward looking statements. The Company expressly disclaims any intention or obligation to update or revise any forward-looking statements whether as a result of new information, future events or otherwise.</p><p><strong>SOURCE: </strong>Reyna Silver Corp.</p><br><br>View the original <a href='https://www.accesswire.com/895234/reyna-silver-acquires-the-mineral-hill-district-within-the-gryphon-project-and-provides-operation-update'>press release</a> on accesswire.com<br><br>",
    "search_terms": "Gryphon Summit,Reyna Silver Corp.,RSLV",
    "master_gid": 5331,
    "date": "2024-08-01T10:55:00.000Z",
    "tags": "China,USA|Nevada||Silver|Project Acquisition",
    "image_id": null,
    "hidden": false,
    "company_id": 969,
    "provider": "accesswire",
    "excerpt": "VANCOUVER, BC AND HONG KONG, CHINA / ACCESSWIRE / August 1, 2024 / Reyna Silver Corp. (TSXV:RSLV)(OTCQX:RSNVF)(FRA:4ZC) (&quot;Reyna&quot; or the &quot;Company&quot;)is pleased to announce that it has entered into an Option Agreement (the &quot;Agreement&quot;) with Minquest Ltd. (&quot;Minquest&quot;) on the Mineral Hill Project (the &quot;Project&quot;) located in Eureka County, Nevada.",
    "is_regulatory": false,
    "refined_tags": null,
    "ftp_filename": null,
    "company_name": "Reyna Gold Corp.",
    "exchange": "TSXV",
    "root_ticker": "RSLV",
    "project_name": "Gryphon Summit",
    "gid": 5331,
    "location": "Nevada, United States",
    "plan_id": "companytier2",
    "description_text": "VANCOUVER, BC AND HONG KONG, CHINA / ACCESSWIRE / August 1, 2024 / Reyna Silver Corp. (TSXV:RSLV)(OTCQX:RSNVF)(FRA:4ZC) (\"Reyna\" or the \"Company\") is pleased to announce that it has entered into an Option Agreement (the \"Agreement\") with Minquest Ltd. (\"Minquest\") on the Mineral Hill Project (the \"Project\") located in Eureka County, Nevada. This historic district was an inlier including 8 patented claims and 20 unpatented claims within the overall Gryphon Project (Figure 1.) \"Mineral Hill was producing some of the highest-grade silver-rich CRD mineralization ever found in this part of Nevada well before its neighbors Eureka, Cortez and Railroad were even discovered, so acquiring these patented claims fills an important missing piece in the Gryphon property puzzle,\" said Jorge Ramiro Monroy, CEO of Reyna Silver. \"All these districts show overlapping Carlin Gold and CRD mineralization, but previous exploration at Gryphon just focused on the gold, so filling this hole lets us apply our broader integrated vision to unlock the full Gold, Silver and Critical Metals potential of the overall Gryphon system.\" Figure 1. Map of Gryphon claims with the Mineral Hill 8 patented claims and surrounding 20 claims noted in red on the western side of the property. The blue outline delineates the 10,300 ha existing claims package encompassing the Gryphon Project. Mineral Hill was a significant historic Ag-Pb-Zn CRD producer with an average grade of 140 oz/ton Ag (3,968 g/t Age) production during its prime in the 1870s with average grades lowering to 24 oz/ton Ag (680 g/t Age) towards the end of mine life. Studying this portion of the Gryphon system allows the technical team to understand the geometry of the mineralization and begin following it towards source and potentially more mineralization. The major deposits of the Lander and Eureka county area, including the Battle Mountain - Eureka trend and the Carlin trend, were noted as CRD deposits prior to discovery of the massive Carlin gold systems in the 1960s. Ralph Roberts, famous Carlin trailblazer, cited CRDs as the significant deposits in his papers in 1960 and 1966 including Eureka, Railroad and Cortez which are now collectively known for producing over 60 Moz of Gold. The association of CRDs and Carlin deposits has been recognized for years though the relationship is not fully understood, yet (See Figure 2.) Figure 2. Map of the major Carlin deposits noted in gold (scaled relative to production) and Ag-Pb-Zn CRDs noted red as identified by R. Roberts in his famous 1960 \"Alignment of Mining Districts in North-Central Nevada\" (USGS Professional Paper 400-B) and 1966, Metallogenic provinces and mineral belts in Nevada (Nevada Bureau of Mines Report 13, pt. A, p. 47-72). The Agreement The Agreement gives Reyna Silver the ability to earn a 100% ownership interest in the Mineral Hill Project (the \"Option\"). The Option is subject to Reyna Silver performing the following by July 31, 2030: (i) incurring aggregate exploration expenditures of US$1,550,000 on the Project; and (ii) making cash payments to Minquest in the aggregate amount of US$1,810,000. On exercise of the Option by Reyna Silver, Reyna Silver will grant Minquest a 2.5% net smelter return (\"NSR\") royalty. Reyna Silver will have the option to repurchase 1.25% of the 2.5% NSR royalty at any time by paying Minquest US$2,500,000. The Reyna Silver technical team's depth of experience exploring and discovering major CRDs provides the opportunity to take a serious look at Gryphon from a new angle. Leveraging the CRD system to reveal all the ore-systems contained within Gryphon. Gryphon Project Update Additionally, Reyna Silver is looking forward to starting the 2024 drill program imminently building upon the concatenation of historic work, extensive mapping and reinterpretation of geology resulting in exciting new targets. The camp is ready to go, Earthworks on the east side are almost finished and the drill rig will arrive soon. For Further Information, Please Contact: Bethany Terracina, VP Investor Relations bethany@reynasilver.com www.reynasilver.com About Reyna Silver Corp. Reyna Silver is a growth-oriented junior exploration and development company. The Company focuses on exploring for high-grade, district-scale silver deposits in Mexico and the United States. In Nevada USA, the Company has recently entered into an option to acquire 70% of the 10,300-hectare \"Gryphon Summit Project\" in a 50/50 partnership with Reyna Gold Corp. (TSXV:REYG). The Gryphon Project shows features indicating uniquely superimposed/overprinted Silver-Lead-Zinc-Copper Carbonate Replacement (CRD), Carlin Gold and Critical Metals mineralization. Also in Nevada, the Company is advancing its option to acquire 100% of the \"Medicine Springs Project\" where the Company is exploring a potentially significant Silver-Lead-Zinc-Copper CRD-skarn-Porphyry system. The Company's Mexican assets are 100% owned and include the \"Guigui Project\" and \"Batopilas Project\", both located in Chihuahua State. The Guigui Project covers the interpreted source area for the Santa Eulalia Carbonate Replacement Deposit District and Batopilas covers most of Mexico's historically highest-grade silver system. Forward Looking Information This release may contain forward-looking statements. Forward-looking statements are statements that are not historical facts and are generally, but not always, identified by the words \"expects\", \"plans\", \"anticipates\", \"believes\", \"intends\", \"estimates\", \"projects\", \"potential\" and similar expressions, or that events or conditions \"will\", \"would\", \"may\", \"could\" or \"should\" occur. Forward-looking statements may include, without limitation, statements relating to the Offering and the use of proceeds therefrom. The forward-looking statements contained in this press release are expressly qualified in their entirety by this cautionary statement. All forward-looking statements in this press release are made as of the date of this press release. The forward-looking statements contained herein are also subject generally to assumptions and risks and uncertainties that are described from time to time in the Company's public securities filings with the Canadian securities commissions. Although the Company believes the expectations expressed in such forward-looking statements are based on reasonable assumptions, such statements are not guarantees of future performance and actual results may differ materially from those in forward looking statements. The Company expressly disclaims any intention or obligation to update or revise any forward-looking statements whether as a result of new information, future events or otherwise. SOURCE: Reyna Silver Corp. View the original press release on accesswire.com",
    "primary_commodity": "Ag"
  },
  "articleProject": {
    "gid": 5331,
    "project_name": "Gryphon Summit",
    "location": "Nevada, United States"
  },
  "articleExchange": "TSXV",
  "articleCompanyId": 969,
  "articleTicker": "RSLV",
  "articleCompanyName": "Reyna Silver Corp.",
  "allOtherCompanyProjects": [
    {
      "company_id": 969,
      "gid": 2250,
      "project_name": "Batopilas",
      "location": "Chihuahua, Mexico"
    },
    {
      "company_id": 969,
      "gid": 5331,
      "project_name": "Gryphon Summit",
      "location": "Nevada, United States"
    },
    {
      "company_id": 969,
      "gid": 3832,
      "project_name": "Guigui",
      "location": "Chihuahua, Mexico"
    },
    {
      "company_id": 969,
      "gid": 3375,
      "project_name": "Medicine Springs",
      "location": null
    },
    {
      "company_id": 969,
      "gid": 4589,
      "project_name": "El Durazno",
      "location": "Sonora, Mexico"
    },
    {
      "company_id": 969,
      "gid": 4590,
      "project_name": "Matilde",
      "location": "Sonora, Mexico"
    },
    {
      "company_id": 969,
      "gid": 2253,
      "project_name": "La Reyna",
      "location": "Chihuahua, Mexico"
    }
  ],
  "allOtherCompanyNews": [
    {
      "id": 106632,
      "company_id": 969,
      "title": "Reyna Silver Corp. Announces Resignation of Director",
      "link": null,
      "date": "2025-06-02T20:30:00.000Z",
      "hidden": false
    },
    {
      "id": 91422,
      "company_id": 969,
      "title": "Reyna Silver Announces Final Tranche Closing of Previously Announced Non-Brokered Private Placement",
      "link": null,
      "date": "2025-03-14T20:58:00.000Z",
      "hidden": false
    },
    {
      "id": 89716,
      "company_id": 969,
      "title": "Reyna Silver Announces Third Tranche Closing Of Previously Announced Non-brokered Private Placement ",
      "link": "https://www.accessnewswire.com/newsroom/en/metals-and-mining/reyna-silver-announces-third-tranche-closing-of-previously-announced-non-brokered--993759",
      "date": "2025-02-28T21:20:00.000Z",
      "hidden": false
    },
    {
      "id": 87937,
      "company_id": 969,
      "title": "Reyna Silver Announces Second Tranche Closing of Previously Announced Non-Brokered Private Placement",
      "link": "https://www.accessnewswire.com/newsroom/en/metals-and-mining/reyna-silver-announces-second-tranche-closing-of-previously-announced-non-brokered-985724",
      "date": "2025-02-14T22:50:00.000Z",
      "hidden": false
    },
    {
      "id": 87033,
      "company_id": 969,
      "title": "Reyna Silver Announces First Tranche Closing of Previously Announced Non-brokered Private Placement ",
      "link": "https://www.accessnewswire.com/newsroom/en/metals-and-mining/reyna-silver-announces-first-tranche-closing-of-previously-announced-non-brokered--980447",
      "date": "2025-02-05T22:47:00.000Z",
      "hidden": false
    },
    {
      "id": 85942,
      "company_id": 969,
      "title": "Reyna Silver Announces 3 Million CAD Private Placement",
      "link": "https://www.accessnewswire.com/newsroom/en/metals-and-mining/reyna-silver-announces-3-million-cad-private-placement-975920",
      "date": "2025-01-30T12:45:00.000Z",
      "hidden": false
    },
    {
      "id": 85050,
      "company_id": 969,
      "title": "Reyna Silver Drills Anomalous CRD and Gold Mineralization at Gryphon Summit",
      "link": "https://www.accessnewswire.com/newsroom/en/metals-and-mining/reyna-silver-drills-anomalous-crd-and-gold-mineralization-at-gryphon-summit-972629",
      "date": "2025-01-23T12:45:00.000Z",
      "hidden": false
    },
    {
      "id": -180171,
      "company_id": 969,
      "title": "REYNA GOLD AND REYNA SILVER COMPLETE PLAN OF ARRANGEMENT AND AMEND GRYPHON SUMMIT OPTION AGREEMENT",
      "link": "https://app.quotemedia.com/data/downloadFiling?webmasterId=104408&ref=6722a7b7332c2b0902171882&type=PDFC&formType=002-002-001089-003001&formDescription=News+release&dateFiled=2024-10-30",
      "date": "2024-10-30T21:40:07.000Z",
      "hidden": false
    },
    {
      "id": 74466,
      "company_id": 969,
      "title": "Reyna Gold Obtains Shareholder and Court Approval for Acquisition by Reyna Silver",
      "link": "https://www.accesswire.com/viewarticle.aspx?id=930220&lang=en",
      "date": "2024-10-11T11:30:00.000Z",
      "hidden": false
    },
    {
      "id": 74129,
      "company_id": 969,
      "title": "Reyna Silver Amends Terms of Medicine Springs Option Agreement",
      "link": "https://www.accesswire.com/viewarticle.aspx?id=929034&lang=en",
      "date": "2024-10-08T20:15:00.000Z",
      "hidden": false
    }
  ]
}