{
  "article": {
    "id": 39274,
    "link": "https://www.globenewswire.com/news-release/2023/08/10/2723043/0/en/Almadex-Acquires-New-Copper-Porphyry-Project-in-Arizona-USA.html",
    "title": "Almadex Acquires New Copper Porphyry Project in Arizona, USA",
    "description": "<p align=\"justify\">VANCOUVER, British Columbia, Aug.  10, 2023  (GLOBE NEWSWIRE) -- Almadex Minerals Ltd. (\"Almadex\" or the \"Company\") (TSX-V: “DEX”) is pleased to announce that, further to its news release of July 11<sup>th</sup> 2023 describing the identification of new targets, it has acquired by staking a 100% interest in the New Hope porphyry copper exploration project in Arizona, USA (see attached location map). The 950 hectare New Hope project covers a roughly 3.5 by 1.5 kilometre area of intense hydrothermal alteration developed in volcanic rocks and crosscutting intrusive dykes. The observed hydrothermal alteration is characteristic of the upper levels of a porphyry system. Almadex has completed a surface alteration and geologic mapping program. Remnants of an advanced argillic altered lithocap with Na-alunite, pyrophyllite and dickite along with a phyllic alteration signature including high crystallinity muscovite at surface have been mapped with a Terraspec mineral spectrometer. Complete results from this work are being compiled presently as additional analyses are being carried out. Almadex looks forward to reporting on these and its exploration plans for the New Hope project moving forward. Subsequent to identifying the New Hope target, Almadex research identified reports describing some of the past work in the area from the 1950s to the 1970s. These summary reports mention shallow drilling, some geophysics and a description of two diamond drill holes with uncertain collar locations. One of these was a deep hole believed to have been drilled adjacent to the argillic alteration zone. Drill logs for this hole obtained by Almadex describe propylitic epidote-chlorite alteration and weak copper mineralisation, consistent with the periphery environment of a porphyry copper system.<br /></p>  <p align=\"justify\">J. Duane Poliquin, Chairman of Almadex commented, “New Hope is an exciting new addition to our portfolio. It is the result of first principals based conceptual exploration. We hope to make more additions to our project portfolio in 2023. This portfolio of mineral projects is the result of years of effort and invested intellectual capital. Our CAD$18 Million cash position as of Q1 2023 gives us the luxury of advancing these projects in the manner best suited for shareholders. We have a track record of discoveries, and we feel the varied and exciting projects in our portfolio have the potential to add to that record.”</p>  <p align=\"justify\"><strong>Qualified Persons</strong><br />Morgan J. Poliquin, PhD, PEng, the President and CEO of Almadex and a Qualified Person as defined by National Instrument 43-101 (\"NI 43-101\"), has reviewed, and approved the scientific and technical contents of this news release.</p>  <p align=\"justify\"><strong>About Almadex</strong><br />Almadex Minerals Ltd. is an exploration company that holds a large mineral portfolio consisting of projects and NSR royalties in Canada, the U.S., and Mexico. This portfolio is the direct result of many years of prospecting and deal-making by Almadex's management team. The Company owns a number of portable diamond drill rigs, enabling it to conduct cost effective first pass exploration drilling in house.</p>  <p align=\"justify\">On behalf of the Board of Directors,</p>  <p align=\"justify\">“J. Duane Poliquin”        </p>  <p align=\"justify\">J. Duane Poliquin, Chairman<br />Almadex Minerals Ltd.</p>  <p align=\"justify\"><em>Neither the TSX Venture Exchange nor its Regulation Services Provider (as that term is defined in policies of the TSX Venture Exchange) accepts responsibility for the adequacy or accuracy of this release.</em></p>  <p align=\"justify\"><em>This news release includes forward-looking statements that are subject to risks and uncertainties. All statements within it, other than statements of historical fact, are to be considered forward looking. Forward-looking statements in this news release include, among other things, the ongoing receipt of results from the New Hope property and the plans to release details of future exploration programs at New Hope, the addition of more projects to the portfolio during 2023, and the likelihood of future discoveries. Although the Company believes the expectations expressed in such forward-looking statements are based on reasonable assumptions, such statements are not guarantees of future performance and actual results or developments may differ materially from those in forward-looking statements. Factors that could cause actual results to differ materially from those in forward-looking statements include market prices, exploitation and exploration successes, permitting, continued availability of capital and financing, equipment availability, relationships with third-party clientele and their willingness or ability to continue to use the Company’s drills for exploration, and general economic, market or business conditions. There can be no assurances that such statements will prove accurate and, therefore, readers are advised to rely on their own evaluation of such uncertainties. The Company does not assume any obligation to update any forward-looking statements, other than as required pursuant to applicable securities laws.</em></p>  <p align=\"justify\">Contact Information:<br />Almadex Minerals Ltd.<br />Tel. 604.689.7644<br />Email: info@almadexminerals.com<br />http://www.almadexminerals.com/</p>  <p align=\"justify\">An image accompanying this announcement is available at<br /><img src=\"https://ml.globenewswire.com/Resource/Download/0dd4a223-3c96-4c21-8c18-ec80a65f9a70?size=original\" alt=\"\"/></p>  <br /><img src='https://ml.globenewswire.com/media/MzAxMzQxMDgtNTUyMC00ODMyLTk3N2EtZGVkOTJlNTQ4NmFkLTExMzI1MzU=/tiny/Almadex-Minerals-Ltd-.png' referrerpolicy='no-referrer-when-downgrade' />",
    "search_terms": "New Hope,Almadex Minerals Ltd.,DEX",
    "master_gid": 5243,
    "date": "2023-08-10T17:15:00.000Z",
    "tags": "USA|Arizona||Copper|Project Acquisition",
    "image_id": null,
    "hidden": false,
    "company_id": 1052,
    "provider": null,
    "excerpt": "VANCOUVER, British Columbia, Aug.  10, 2023  (GLOBE NEWSWIRE) -- Almadex Minerals Ltd. (\"Almadex\" or the \"Company\") (TSX-V: “DEX”) is pleased to announce that, further to its news release of July 11th2023 describing the identification of new targets, it has acquired by staking a 100% interest in the New Hope porphyry",
    "is_regulatory": false,
    "refined_tags": [
      "Project Acquisition"
    ],
    "ftp_filename": null,
    "company_name": "Almadex Minerals Ltd.",
    "exchange": "TSXV",
    "root_ticker": "DEX",
    "project_name": "New Hope",
    "gid": 5243,
    "location": "Arizona, United States",
    "plan_id": null,
    "description_text": "VANCOUVER, British Columbia, Aug.  10, 2023  (GLOBE NEWSWIRE) -- Almadex Minerals Ltd. (\"Almadex\" or the \"Company\") (TSX-V: “DEX”) is pleased to announce that, further to its news release of July 11 th 2023 describing the identification of new targets, it has acquired by staking a 100% interest in the New Hope porphyry copper exploration project in Arizona, USA (see attached location map). The 950 hectare New Hope project covers a roughly 3.5 by 1.5 kilometre area of intense hydrothermal alteration developed in volcanic rocks and crosscutting intrusive dykes. The observed hydrothermal alteration is characteristic of the upper levels of a porphyry system. Almadex has completed a surface alteration and geologic mapping program. Remnants of an advanced argillic altered lithocap with Na-alunite, pyrophyllite and dickite along with a phyllic alteration signature including high crystallinity muscovite at surface have been mapped with a Terraspec mineral spectrometer. Complete results from this work are being compiled presently as additional analyses are being carried out. Almadex looks forward to reporting on these and its exploration plans for the New Hope project moving forward. Subsequent to identifying the New Hope target, Almadex research identified reports describing some of the past work in the area from the 1950s to the 1970s. These summary reports mention shallow drilling, some geophysics and a description of two diamond drill holes with uncertain collar locations. One of these was a deep hole believed to have been drilled adjacent to the argillic alteration zone. Drill logs for this hole obtained by Almadex describe propylitic epidote-chlorite alteration and weak copper mineralisation, consistent with the periphery environment of a porphyry copper system. J. Duane Poliquin, Chairman of Almadex commented, “New Hope is an exciting new addition to our portfolio. It is the result of first principals based conceptual exploration. We hope to make more additions to our project portfolio in 2023. This portfolio of mineral projects is the result of years of effort and invested intellectual capital. Our CAD$18 Million cash position as of Q1 2023 gives us the luxury of advancing these projects in the manner best suited for shareholders. We have a track record of discoveries, and we feel the varied and exciting projects in our portfolio have the potential to add to that record.” Qualified Persons Morgan J. Poliquin, PhD, PEng, the President and CEO of Almadex and a Qualified Person as defined by National Instrument 43-101 (\"NI 43-101\"), has reviewed, and approved the scientific and technical contents of this news release. About Almadex Almadex Minerals Ltd. is an exploration company that holds a large mineral portfolio consisting of projects and NSR royalties in Canada, the U.S., and Mexico. This portfolio is the direct result of many years of prospecting and deal-making by Almadex's management team. The Company owns a number of portable diamond drill rigs, enabling it to conduct cost effective first pass exploration drilling in house. On behalf of the Board of Directors, “J. Duane Poliquin” J. Duane Poliquin, Chairman Almadex Minerals Ltd. Neither the TSX Venture Exchange nor its Regulation Services Provider (as that term is defined in policies of the TSX Venture Exchange) accepts responsibility for the adequacy or accuracy of this release. This news release includes forward-looking statements that are subject to risks and uncertainties. All statements within it, other than statements of historical fact, are to be considered forward looking. Forward-looking statements in this news release include, among other things, the ongoing receipt of results from the New Hope property and the plans to release details of future exploration programs at New Hope, the addition of more projects to the portfolio during 2023, and the likelihood of future discoveries. Although the Company believes the expectations expressed in such forward-looking statements are based on reasonable assumptions, such statements are not guarantees of future performance and actual results or developments may differ materially from those in forward-looking statements. Factors that could cause actual results to differ materially from those in forward-looking statements include market prices, exploitation and exploration successes, permitting, continued availability of capital and financing, equipment availability, relationships with third-party clientele and their willingness or ability to continue to use the Company’s drills for exploration, and general economic, market or business conditions. There can be no assurances that such statements will prove accurate and, therefore, readers are advised to rely on their own evaluation of such uncertainties. The Company does not assume any obligation to update any forward-looking statements, other than as required pursuant to applicable securities laws. Contact Information: Almadex Minerals Ltd. Tel. 604.689.7644 Email: info@almadexminerals.com http://www.almadexminerals.com/ An image accompanying this announcement is available at",
    "primary_commodity": "Cu"
  },
  "articleProject": {
    "gid": 5243,
    "project_name": "New Hope",
    "location": "Arizona, United States"
  },
  "articleExchange": "TSXV",
  "articleCompanyId": 1052,
  "articleTicker": "DEX",
  "articleCompanyName": "Almadex Minerals Ltd.",
  "allOtherCompanyProjects": [
    {
      "company_id": 1052,
      "gid": 2953,
      "project_name": "Logan",
      "location": "Yukon, Canada"
    },
    {
      "company_id": 1052,
      "gid": 10573,
      "project_name": "Petaca",
      "location": "New Mexico, United States"
    },
    {
      "company_id": 1052,
      "gid": 2849,
      "project_name": "Davis/Paradise",
      "location": "Nevada, United States"
    },
    {
      "company_id": 1052,
      "gid": 9369,
      "project_name": "Nicoamen River",
      "location": "British Columbia, Canada"
    },
    {
      "company_id": 1052,
      "gid": 9370,
      "project_name": "Merit",
      "location": "British Columbia, Canada"
    },
    {
      "company_id": 1052,
      "gid": 5243,
      "project_name": "New Hope",
      "location": "Arizona, United States"
    },
    {
      "company_id": 1052,
      "gid": 3804,
      "project_name": "San Pedro",
      "location": "Jalisco, Mexico"
    },
    {
      "company_id": 1052,
      "gid": 10267,
      "project_name": "Confusion Hills",
      "location": "Nevada, United States"
    },
    {
      "company_id": 1052,
      "gid": 10268,
      "project_name": "Red Ring",
      "location": "Nevada, United States"
    }
  ],
  "allOtherCompanyNews": [
    {
      "id": -203425,
      "company_id": 1052,
      "title": "Almadex Acquires Ruby Hill Silver-Gold Exploration Project by Staking, Surface Sampling returns 992 g/t Silver",
      "link": null,
      "date": "2025-06-04T18:14:48.000Z",
      "hidden": false
    },
    {
      "id": 106259,
      "company_id": 1052,
      "title": "Almadex Stakes Pegmatite Dyke Complex with Rare Earth Element Potential in New Mexico, USA",
      "link": null,
      "date": "2025-05-28T20:30:05.000Z",
      "hidden": false
    },
    {
      "id": -201706,
      "company_id": 1052,
      "title": "Almadex Announces Early Repayment of Gold Loan",
      "link": null,
      "date": "2025-05-22T11:30:00.000Z",
      "hidden": false
    },
    {
      "id": 104786,
      "company_id": 1052,
      "title": "Geophysics Defines Two Large Porphyry Drill Targets with Magnetics and IP Chargeability on its Paradise Project, Nevada",
      "link": null,
      "date": "2025-05-14T16:04:25.000Z",
      "hidden": false
    },
    {
      "id": 103011,
      "company_id": 1052,
      "title": "Almadex Announces Option-Joint Venture Agreement on Three Nevada Properties with Azucar Minerals Ltd.",
      "link": null,
      "date": "2025-05-01T11:30:00.000Z",
      "hidden": false
    },
    {
      "id": 100696,
      "company_id": 1052,
      "title": "Almadex Defines Large IP Geophysical Anomaly at The New Hope Copper Porphyry Project, Arizona, USA",
      "link": null,
      "date": "2025-04-23T21:24:40.000Z",
      "hidden": false
    },
    {
      "id": 99990,
      "company_id": 1052,
      "title": "Almadex Provides Exploration Update on its Confusion Hills and Red Ring Gold Projects, Nevada, Surface Sampling returns 7.1 g/t Gold",
      "link": null,
      "date": "2025-04-15T18:46:36.000Z",
      "hidden": false
    },
    {
      "id": -189808,
      "company_id": 1052,
      "title": "Almadex Acquires Three New Gold Exploration Projects by Staking in the Western USA, Surface Sampling returns 3.5 g/t Gold",
      "link": null,
      "date": "2025-04-09T17:48:37.000Z",
      "hidden": false
    },
    {
      "id": 92054,
      "company_id": 1052,
      "title": "Almadex Files Memorial Documentation for Investment Arbitration Claim Against Mexico",
      "link": null,
      "date": "2025-03-21T11:30:00.000Z",
      "hidden": false
    },
    {
      "id": 86036,
      "company_id": 1052,
      "title": "Almadex Provides Western USA Porphyry Copper-Gold Exploration Update and Plans for 2025",
      "link": "https://www.globenewswire.com/news-release/2025/01/30/3018371/0/en/Almadex-Provides-Western-USA-Porphyry-Copper-Gold-Exploration-Update-and-Plans-for-2025.html",
      "date": "2025-01-30T19:55:00.000Z",
      "hidden": false
    }
  ]
}
