{
  "article": {
    "id": 41532,
    "link": "https://contentapi.cision.com/api/v1.0/releases/20230927C0842",
    "title": "Eminent Acquires Gilbert South Property in Nevada",
    "description": "\n\n<p><span class=\"legendSpanClass\"><span class=\"xn-location\">VANCOUVER, BC</span></span>, <span class=\"legendSpanClass\"><span class=\"xn-chron\">Sept. 27, 2023</span></span> /CNW/ - <b>Eminent Gold Corp. </b>(TSXV: EMNT) (OTCQB: EMGDF) (the \"<b>Company</b>\" or \"<b>Eminent</b>\") is pleased to report it has signed a purchase and sale agreement with Orogen Royalties Inc. (\"<b>Orogen</b>\") for its Gilbert South property (\"<b>Gilbert South</b>\" or \"<b>Property</b>\") located 30 km west of <span class=\"xn-location\">Tonopah</span> in the Walker Lane Trend (total gold endowment of over 80 Moz Au and <span class=\"xn-money\">700 M</span> oz Ag<sup>(1)</sup>), <span class=\"xn-location\">Nevada</span> (Figure 1).</p>\n<p>Under the terms of the purchase agreement, Eminent will acquire 100-per-cent interest in the 110 unpatented claims (890 hectares) in exchange for 350,000 Eminent common shares. An additional 200,000 Eminent common shares will be issued to Orogen when the Company initiates a drill program at Gilbert South. As a result, the existing option agreement (the \"<b>Option Agreement</b>\") with Orogen has been terminated. The Property is comprised of three different claim blocks: (i) 2 unpatented claims known as the \"<b>Nevada Select Claims</b>\", (ii) 27 unpatented claims known as the \"<b>GL Claims</b>\", and (iii) 81 unpatented claims known as the \"<b>Timberline Claims</b>\". The Timberline Claims are currently subject to a 3% Net Smelter Return royalty, the Nevada Select Claims are currently subject to a 2% Net Smelter Return royalty, and GL Claims are currently subject to a 2.25% Net Smelter Return royalty (the \"<b>GL Royalty</b>\"). The Company shall have the option and right to repurchase one percent (1%) of the GL Royalty for <span class=\"xn-money\">US$1,000,000</span>, thus reducing the GL Royalty to 1.25% of all products from the GL Claims. Orogen shall have the option to buydown 1% of the Timberline Net Smelter Return for <span class=\"xn-money\">US$1,500,000</span>.</p>\n<p><b><span class=\"xn-person\">Paul Sun</span>, President and CEO of the Company commented:</b></p>\n<p>\"The Gilbert South Property represents an exceptional opportunity to explore a well-known historic gold district and having ownership of it puts the company in a much better position to advance the project on its own timeline. We consider this to be one of the best epithermal prospects in the Walker Lane district in <span class=\"xn-location\">Nevada</span>.\"</p>\n<p><b><span class=\"xn-person\">Dan McCoy</span>, Chief Geologist and Director commented:</b></p>\n<p>\"The Gilbert South Property is a classic large epithermal system with high grades of gold. Previous drilling did not test the most prospective targets and little targeting has been done with respect to the potential bonanza grade gold that may exist at depth.\"</p>\n<p>Eminent's exploration work on the Property's target areas identified by surface samples and mapping have been corroborated by geophysical data (Figure 2). The geophysical conductive anomalies commonly correlate with alteration of the host rock to clay minerals produced by the same fluids that formed veins; a common association in bonanza gold targets and one that Eminent geologists mapped on the surface at Gilbert South (Figure 3). The Company plans to prioritize and permit drill targets at Pretty Boy, Bighorn, and the East Bound areas in preparation for a drill program planned for 2024.</p>\n<p><i>All scientific and technical information in this news release has been prepared by, or approved by Justin Milliard, PGeo. Mr. Milliard is Project Geologist for Eminent and is a qualified person for the purposes of National Instrument 43-101 - Standards of Disclosure for Mineral Projects. </i></p>\n<div class=\"PRN_ImbeddedAssetReference\" id=\"DivAssetPlaceHolder5628\"><p><a href=\"https://mma.prnewswire.com/media/2222563/Eminent_Gold_Corp__Eminent_Acquires_Gilbert_South_Property_in_Ne.html\" rel=\"nofollow\" target=\"_blank\"><img alt=\"Figure 1. Location map showing the Gilbert South project in Walker Lane Trend, Nevada. (CNW Group/Eminent Gold Corp.)\" src=\"https://mma.prnewswire.com/media/2222563/Eminent_Gold_Corp__Eminent_Acquires_Gilbert_South_Property_in_Ne.jpg?p=original\" title=\"Figure 1. Location map showing the Gilbert South project in Walker Lane Trend, Nevada. (CNW Group/Eminent Gold Corp.)\"></img></a></p>\n</div><div class=\"PRN_ImbeddedAssetReference\" id=\"DivAssetPlaceHolder8534\"><p><a href=\"https://mma.prnewswire.com/media/2222564/Eminent_Gold_Corp__Eminent_Acquires_Gilbert_South_Property_in_Ne.html\" rel=\"nofollow\" target=\"_blank\"><img alt=\"Figure 2. Geologic map overlain on terrain sourced from ESRI online map database showing; recent (star) and historic (diamond) rock samples and geophysical transects (yellow). Drill target locations shown by magenta hexgons. Cross-sections from CSAMT transects (A-A’ &amp; B-B’) are shown in Figures 3 and 4, respectively. (CNW Group/Eminent Gold Corp.)\" src=\"https://mma.prnewswire.com/media/2222564/Eminent_Gold_Corp__Eminent_Acquires_Gilbert_South_Property_in_Ne.jpg?p=original\" title=\"Figure 2. Geologic map overlain on terrain sourced from ESRI online map database showing; recent (star) and historic (diamond) rock samples and geophysical transects (yellow). Drill target locations shown by magenta hexgons. Cross-sections from CSAMT transects (A-A’ &amp; B-B’) are shown in Figures 3 and 4, respectively. (CNW Group/Eminent Gold Corp.)\"></img></a></p>\n</div><div class=\"PRN_ImbeddedAssetReference\" id=\"DivAssetPlaceHolder7288\"><p><a href=\"https://mma.prnewswire.com/media/2222565/Eminent_Gold_Corp__Eminent_Acquires_Gilbert_South_Property_in_Ne.html\" rel=\"nofollow\" target=\"_blank\"><img alt=\"Figure 3. Two-dimensional CSAMT section of Line 2 showing the principle structural targets with nearest surface rock and soil samples projected to line. Dashed magenta lines represent target zones. (CNW Group/Eminent Gold Corp.)\" src=\"https://mma.prnewswire.com/media/2222565/Eminent_Gold_Corp__Eminent_Acquires_Gilbert_South_Property_in_Ne.jpg?p=original\" title=\"Figure 3. Two-dimensional CSAMT section of Line 2 showing the principle structural targets with nearest surface rock and soil samples projected to line. Dashed magenta lines represent target zones. (CNW Group/Eminent Gold Corp.)\"></img></a></p>\n</div><p> </p>\n<div><table border=\"0\" cellpadding=\"1\" cellspacing=\"0\" class=\"prnbcc\"><tr><td class=\"prngen2\" colspan=\"2\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\"><b>References</b></span></p>\n</td></tr><tr><td class=\"prngen2\" colspan=\"2\" rowspan=\"1\"><br></br></td></tr><tr><td class=\"prngen2\" colspan=\"1\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\">1.</span></p>\n</td><td class=\"prngen2\" colspan=\"1\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\">Energyandgold.com. <i>A Junior Mining Management Team That Doesn't Know How To Lose Is Back With The Next Incredible Opportunity In Nevada Gold Exploration</i>. 2020 8/24/2020; Available from: <a class=\"prnews_a\" href=\"https://c212.net/c/link/?t=0&amp;l=en&amp;o=3980155-1&amp;h=3347055495&amp;u=http%3A%2F%2Fenergyandgold.com%2F2020%2F08%2F24%2Fa-junior-mining-management-team-that-doesnt-know-how-to-lose-is-back-with-the-next-incredible-opportunity-in-nevada-gold-exploration%2F&amp;a=http%3A%2F%2Fenergyandgold.com%2F2020%2F08%2F24%2Fa-junior-mining-management-team-that-doesnt-know-how-to-lose-is-back-with-the-next-incredible-opportunity-in-nevada-gold-exploration%2F\" rel=\"nofollow\" target=\"_blank\">http://energyandgold.com/2020/08/24/a-junior-mining-management-team-that-doesnt-know-how-to-lose-is-back-with-the-next-incredible-opportunity-in-nevada-gold-exploration/</a>.</span></p>\n</td></tr></table></div><p> </p>\n<p>On behalf of the Board of Directors,</p>\n<p><i>\"Paul Sun\"<br></br></i>CEO and Director</p>\n<div aria-level=\"3\" class=\"wcag-arialevel-3\" role=\"heading\" style=\"display: block; font-size: 1.17em; margin-block-start: 1em; margin-block-end: 1em; margin-inline-start: 0px; margin-inline-end: 0px; font-weight: bold;\"><b>About Eminent Gold</b></div><p>Eminent Gold is a gold exploration company focused on creating shareholder value through the exploration and discovery of world-class gold deposits in <span class=\"xn-location\">Nevada</span>. Its multidisciplinary team has had multiple successes in gold discoveries and brings expertise and new ideas to the Great Basin. The Company's exploration assets in the Great Basin include: Hot Springs Range Project, Weepah, Gilbert South, and Spanish Moon District.</p>\n<p><i>Neither TSX Venture Exchange nor its Regulation Services Provider (as that term is defined in the policies of the TSX Venture Exchange) accepts responsibility for the adequacy or accuracy of this release. </i></p>\n<p><i>This news release contains certain statements that may be deemed \"forward-looking statements\" with respect to the Company within the meaning of applicable securities laws. Forward-looking statements are statements that are not historical facts and are generally, but not always, identified by the words \"expects\", \"plans\", \"anticipates\", \"believes\", \"intends\", \"estimates\", \"projects\", \"potential\" and similar expressions, or that events or conditions \"will\", \"would\", \"may\", \"could\" or \"should\" occur. Forward-looking statements made in this news release include the Company's exploration plans for the Gilbert South property, the Company's expectations for the potential of the Gilbert South property, the Company's plans for generating drill targets based on current information and the generation of information from the proposed geophysical survey. Although Eminent Gold Corp. believes the expectations expressed in such forward-looking statements are based on reasonable assumptions, including the assumption that records and reports of historical work on the Gilbert South property are accurate and correct and that the sampling results are indicative of the target areas as a whole, such statements are not guarantees of future performance, are subject to risks and uncertainties, and actual results or realities may differ materially from those in the forward-looking statements. Such material risks and uncertainties include, but are not limited to, the Company's ability to raise sufficient capital to fund its obligations under its property agreements going forward, to maintain its mineral tenures and concessions in good standing, the Company's assumptions may prove incorrect; changes in economic conditions or financial markets; the inherent hazards associated with mineral exploration and mining operations, future prices of gold, silver and other metals, changes in general economic conditions, accuracy of mineral resource and reserve estimates, the ability of the Company to obtain the necessary permits and consents required to explore, drill and develop the Company's projects and if obtained, to obtain such permits and consents in a timely fashion relative to the Company's plans and business objectives for the projects; the general ability of the Company to monetize its mineral resources; adverse weather conditions may affect the Company's ability to conduct work programs, availability of qualified personnel, changes in environmental and other laws or regulations that could have an impact on the Company's operations, compliance with environmental laws and regulations, dependence on key management personnel and general competition in the mining industry. Forward-looking statements are based on the reasonable beliefs, estimates and opinions of the Company's management on the date the statements are made. Except as required by law, the Company undertakes no obligation to update these forward looking statements in the event that management's beliefs, estimates or opinions, or other factors, should change.</i></p>\n\n<div class=\"PRN_ImbeddedAssetReference\" id=\"DivAssetPlaceHolder0\">\n</div>\n<p>SOURCE  Eminent Gold Corp.</p>\n<img alt=\"\" src=\"https://rt.newswire.ca/rt.gif?NewsItemId=C0842&amp;Transmission_Id=202309270730CANADANWCANADAPR_C0842&amp;DateId=20230927\" style=\"border:0px; width:1px; height:1px;\"></img>\n\n",
    "search_terms": "Gilbert South,Eminent Gold Corp.,EMNT",
    "master_gid": 988,
    "date": "2023-09-27T11:30:00.000Z",
    "tags": "USA|Nevada||Gold|Mergers & Acquisitions,Project Acquisition",
    "image_id": null,
    "hidden": false,
    "company_id": 136,
    "provider": null,
    "excerpt": "VANCOUVER, BC,Sept. 27, 2023/CNW/ - Eminent Gold Corp.(TSXV: EMNT) (OTCQB: EMGDF) (the \"Company\" or \"Eminent\") is pleased to report it has signed a purchase and sale agreement with Orogen Royalties Inc. (\"Orogen\") for its Gilbert South property (\"Gilbert South\" or \"Property\") located 30 km west ofTonopahin the Walker Lane Trend (total",
    "is_regulatory": false,
    "refined_tags": [
      "Mergers & Acquisitions",
      "Project Acquisition"
    ],
    "ftp_filename": null,
    "company_name": "Eminent Gold Corp.",
    "exchange": "TSXV",
    "root_ticker": "EMNT",
    "project_name": "Gilbert South",
    "gid": 988,
    "location": "Nevada, USA",
    "plan_id": null,
    "description_text": "VANCOUVER, BC , Sept. 27, 2023 /CNW/ - Eminent Gold Corp. (TSXV: EMNT) (OTCQB: EMGDF) (the \" Company \" or \" Eminent \") is pleased to report it has signed a purchase and sale agreement with Orogen Royalties Inc. (\" Orogen \") for its Gilbert South property (\" Gilbert South \" or \" Property \") located 30 km west of Tonopah in the Walker Lane Trend (total gold endowment of over 80 Moz Au and 700 M oz Ag (1) ), Nevada (Figure 1). Under the terms of the purchase agreement, Eminent will acquire 100-per-cent interest in the 110 unpatented claims (890 hectares) in exchange for 350,000 Eminent common shares. An additional 200,000 Eminent common shares will be issued to Orogen when the Company initiates a drill program at Gilbert South. As a result, the existing option agreement (the \" Option Agreement \") with Orogen has been terminated. The Property is comprised of three different claim blocks: (i) 2 unpatented claims known as the \" Nevada Select Claims \", (ii) 27 unpatented claims known as the \" GL Claims \", and (iii) 81 unpatented claims known as the \" Timberline Claims \". The Timberline Claims are currently subject to a 3% Net Smelter Return royalty, the Nevada Select Claims are currently subject to a 2% Net Smelter Return royalty, and GL Claims are currently subject to a 2.25% Net Smelter Return royalty (the \" GL Royalty \"). The Company shall have the option and right to repurchase one percent (1%) of the GL Royalty for US$1,000,000 , thus reducing the GL Royalty to 1.25% of all products from the GL Claims. Orogen shall have the option to buydown 1% of the Timberline Net Smelter Return for US$1,500,000 . Paul Sun , President and CEO of the Company commented: \"The Gilbert South Property represents an exceptional opportunity to explore a well-known historic gold district and having ownership of it puts the company in a much better position to advance the project on its own timeline. We consider this to be one of the best epithermal prospects in the Walker Lane district in Nevada .\" Dan McCoy , Chief Geologist and Director commented: \"The Gilbert South Property is a classic large epithermal system with high grades of gold. Previous drilling did not test the most prospective targets and little targeting has been done with respect to the potential bonanza grade gold that may exist at depth.\" Eminent's exploration work on the Property's target areas identified by surface samples and mapping have been corroborated by geophysical data (Figure 2). The geophysical conductive anomalies commonly correlate with alteration of the host rock to clay minerals produced by the same fluids that formed veins; a common association in bonanza gold targets and one that Eminent geologists mapped on the surface at Gilbert South (Figure 3). The Company plans to prioritize and permit drill targets at Pretty Boy, Bighorn, and the East Bound areas in preparation for a drill program planned for 2024. All scientific and technical information in this news release has been prepared by, or approved by Justin Milliard, PGeo. Mr. Milliard is Project Geologist for Eminent and is a qualified person for the purposes of National Instrument 43-101 - Standards of Disclosure for Mineral Projects. References 1. Energyandgold.com. A Junior Mining Management Team That Doesn't Know How To Lose Is Back With The Next Incredible Opportunity In Nevada Gold Exploration . 2020 8/24/2020; Available from: http://energyandgold.com/2020/08/24/a-junior-mining-management-team-that-doesnt-know-how-to-lose-is-back-with-the-next-incredible-opportunity-in-nevada-gold-exploration/ . On behalf of the Board of Directors, \"Paul Sun\" CEO and Director About Eminent Gold Eminent Gold is a gold exploration company focused on creating shareholder value through the exploration and discovery of world-class gold deposits in Nevada . Its multidisciplinary team has had multiple successes in gold discoveries and brings expertise and new ideas to the Great Basin. The Company's exploration assets in the Great Basin include: Hot Springs Range Project, Weepah, Gilbert South, and Spanish Moon District. Neither TSX Venture Exchange nor its Regulation Services Provider (as that term is defined in the policies of the TSX Venture Exchange) accepts responsibility for the adequacy or accuracy of this release. This news release contains certain statements that may be deemed \"forward-looking statements\" with respect to the Company within the meaning of applicable securities laws. Forward-looking statements are statements that are not historical facts and are generally, but not always, identified by the words \"expects\", \"plans\", \"anticipates\", \"believes\", \"intends\", \"estimates\", \"projects\", \"potential\" and similar expressions, or that events or conditions \"will\", \"would\", \"may\", \"could\" or \"should\" occur. Forward-looking statements made in this news release include the Company's exploration plans for the Gilbert South property, the Company's expectations for the potential of the Gilbert South property, the Company's plans for generating drill targets based on current information and the generation of information from the proposed geophysical survey. Although Eminent Gold Corp. believes the expectations expressed in such forward-looking statements are based on reasonable assumptions, including the assumption that records and reports of historical work on the Gilbert South property are accurate and correct and that the sampling results are indicative of the target areas as a whole, such statements are not guarantees of future performance, are subject to risks and uncertainties, and actual results or realities may differ materially from those in the forward-looking statements. Such material risks and uncertainties include, but are not limited to, the Company's ability to raise sufficient capital to fund its obligations under its property agreements going forward, to maintain its mineral tenures and concessions in good standing, the Company's assumptions may prove incorrect; changes in economic conditions or financial markets; the inherent hazards associated with mineral exploration and mining operations, future prices of gold, silver and other metals, changes in general economic conditions, accuracy of mineral resource and reserve estimates, the ability of the Company to obtain the necessary permits and consents required to explore, drill and develop the Company's projects and if obtained, to obtain such permits and consents in a timely fashion relative to the Company's plans and business objectives for the projects; the general ability of the Company to monetize its mineral resources; adverse weather conditions may affect the Company's ability to conduct work programs, availability of qualified personnel, changes in environmental and other laws or regulations that could have an impact on the Company's operations, compliance with environmental laws and regulations, dependence on key management personnel and general competition in the mining industry. Forward-looking statements are based on the reasonable beliefs, estimates and opinions of the Company's management on the date the statements are made. Except as required by law, the Company undertakes no obligation to update these forward looking statements in the event that management's beliefs, estimates or opinions, or other factors, should change. SOURCE  Eminent Gold Corp.",
    "primary_commodity": "Au"
  },
  "articleProject": {
    "gid": 988,
    "project_name": "Gilbert South",
    "location": "Nevada, USA"
  },
  "articleExchange": "TSXV",
  "articleCompanyId": 136,
  "articleTicker": "EMNT",
  "articleCompanyName": "Eminent Gold Corp.",
  "allOtherCompanyProjects": [
    {
      "company_id": 136,
      "gid": 988,
      "project_name": "Gilbert South",
      "location": "Nevada, USA"
    },
    {
      "company_id": 136,
      "gid": 6615,
      "project_name": "Hot Springs Range",
      "location": "Nevada, United States"
    }
  ],
  "allOtherCompanyNews": [
    {
      "id": 103829,
      "company_id": 136,
      "title": "Eminent Provides Drilling Update at Hot Springs Range Project",
      "link": null,
      "date": "2025-05-07T11:30:00.000Z",
      "hidden": false
    },
    {
      "id": 103457,
      "company_id": 136,
      "title": "Eminent Closes Private Placement Including $3 Million Strategic Investment by Kinross Gold Corp.",
      "link": null,
      "date": "2025-05-05T11:30:00.000Z",
      "hidden": false
    },
    {
      "id": 99504,
      "company_id": 136,
      "title": "Eminent Acquires 100% Ownership of Getchell Trend Analogue, Hot Springs Range Project",
      "link": null,
      "date": "2025-04-11T20:05:00.000Z",
      "hidden": false
    },
    {
      "id": 98861,
      "company_id": 136,
      "title": "Eminent To Raise $5 Million Led by Strategic Investor, Kinross Gold Corp.",
      "link": null,
      "date": "2025-04-07T11:30:00.000Z",
      "hidden": false
    },
    {
      "id": 90771,
      "company_id": 136,
      "title": "Eminent Confirms Structure Under Celts Steam Cap Analogous to Silicon",
      "link": null,
      "date": "2025-03-12T11:30:00.000Z",
      "hidden": false
    },
    {
      "id": 89850,
      "company_id": 136,
      "title": "Eminent Begins IP Program at Celts Project in Nevada",
      "link": "https://www.newsfilecorp.com/release/242990/Eminent-Begins-IP-Program-at-Celts-Project-in-Nevada",
      "date": "2025-03-03T12:30:00.000Z",
      "hidden": false
    },
    {
      "id": 87599,
      "company_id": 136,
      "title": "Eminent Closes Acquisition of Celts Project in Nevada",
      "link": "https://www.globenewswire.com/news-release/2025/02/12/3024941/0/en/Eminent-Closes-Acquisition-of-Celts-Project-in-Nevada.html",
      "date": "2025-02-12T12:30:00.000Z",
      "hidden": false
    },
    {
      "id": 86908,
      "company_id": 136,
      "title": "Eminent's Remaining Assays from First Completed Drill Hole Hits up to 8 g/t Gold in Getchell Trend Analogue",
      "link": "https://www.newsfilecorp.com/release/239648/Eminents-Remaining-Assays-from-First-Completed-Drill-Hole-Hits-up-to-8-gt-Gold-in-Getchell-Trend-Analogue",
      "date": "2025-02-05T12:30:00.000Z",
      "hidden": false
    },
    {
      "id": 84275,
      "company_id": 136,
      "title": "Eminent's First Drill Hole Hits Significant Gold-Arsenic in Getchell Trend Analogue and Commences Second Hole at Hot Springs Range Project",
      "link": "https://www.newsfilecorp.com/release/237380/Eminents-First-Drill-Hole-Hits-Significant-GoldArsenic-in-Getchell-Trend-Analogue-and-Commences-Second-Hole-at-Hot-Springs-Range-Project",
      "date": "2025-01-16T11:00:00.000Z",
      "hidden": false
    },
    {
      "id": 84194,
      "company_id": 136,
      "title": "Eminent Gold Corp. Invites Shareholders and Investment Community to Visit Us at Booth 118 at the VRIC in Vancouver, January 19-20, 2025",
      "link": "https://www.newsfilecorp.com/release/237323/Eminent-Gold-Corp.-Invites-Shareholders-and-Investment-Community-to-Visit-Us-at-Booth-118-at-the-VRIC-in-Vancouver-January-1920-2025",
      "date": "2025-01-15T16:56:00.000Z",
      "hidden": false
    }
  ]
}
