{
  "article": {
    "id": 50058,
    "link": "https://www.thenewswire.com/press-releases?id=1k6WFEWP6",
    "title": "Ashley Gold signs LOI to Acquire Advanced Utah Uranium - Vanadium Asset",
    "description": "<table style='width:fit-content; border: none;'><tr style='background: none;'><td colspan='10' style='padding: 0; margin: 0; border: none; background: none;' valign='bottom'><a target='_blank' href='https://ashleygoldcorp.com/'><img src=\"https://www.thenewswire.com/data/tnw/clients/logos/1Bz4FrMgm.png?t=1698097310\" alt=\"Ashley Gold Corp.\" /></a></td></tr><tr style='background: none;'><td style='width: 34px; padding: 0; margin: 0; border: none; background: none;' valign='bottom'><a target='_blank' href='https://thenewswire.com/api/apps/tnw/r?i=1Bz4FrMgm&amp;m=fac'><img src=\"https://www.thenewswire.com/data/tnw/img/fac.png\" /></a></td><td style='width: 34px; padding: 0; margin: 0; border: none; background: none;' valign='bottom'><a target='_blank' href='https://thenewswire.com/api/apps/tnw/r?i=1Bz4FrMgm&amp;m=twi'><img src=\"https://www.thenewswire.com/data/tnw/img/twi.png\" /></a></td><td style='width: 34px; padding: 0; margin: 0; border: none; background: none;' valign='bottom'><a target='_blank' href='https://thenewswire.com/api/apps/tnw/r?i=1Bz4FrMgm&amp;m=lin'><img src=\"https://www.thenewswire.com/data/tnw/img/lin.png\" /></a></td><td style='width: 34px; padding: 0; margin: 0; border: none; background: none;' valign='bottom'><a target='_blank' href='https://thenewswire.com/api/apps/tnw/r?i=1Bz4FrMgm&amp;m=you'><img src=\"https://www.thenewswire.com/data/tnw/img/you.png\" /></a></td><td style='padding: 0; margin: 0; border: none; background: none;'></td></tr></table> \n<p style='text-align:justify; '>\n<span style='font-weight:bold; '>Calgary, Alberta – TheNewswire - March 4, 2024 - </span><span style='font-weight:bold; '>Ashley Gold</span> <span style='font-weight:bold; '>Corp.</span> <span style='font-weight:bold; '>(</span><span style='font-weight:bold; '>CSE</span><span style='font-weight:bold; '>:</span><span style='font-weight:bold; '> “</span><span style='font-weight:bold; '>ASHL”) (“Ashley” </span><span style=''>or the </span><span style='font-weight:bold; '>“Company”)</span> <span style=''>has signed a non-binding Letter of Intent (LOI) to enter into an Option Agreement for the 100% acquisition of the Sahara Uranium-Vanadium Property located in Emery County, Utah.  The property is located 12 miles away from the town of Green River, Utah where Western Uranium and Vanadium (WUC) is in the process of permitting a processing facility for its San Rafael and Sunday Mine complex resources as well as third party processing.  First ore processing for the facility is expected in 2026. The Company is looking to rapidly advance the asset to provide future feed to the new proposed processing facility.</span>\n</p>\n \n<p style='text-align:justify; '>\n<span style='font-weight:bold; '>Highlights</span>\n</p>\n\r\n<ul>\r\n<li>\n<p style='text-align:justify; '>\n<span style=''>LOI to earn 100% of Property over 5 years</span> \n</p>\n</li><li>\n<p style='text-align:justify; '>\n<span style=''>Over 900 historical drillholes most with data</span> \n</p>\n</li><li>\n<p style='text-align:justify; '>\n<span style=''>12 miles from WUC’s Green River Mill slated for production 2026</span> \n</p>\n</li><li>\n<p style='text-align:justify; '>\n<span style=''>Drill ready for resource confirmation and expansion</span> \n</p>\n</li><li>\n<p style='text-align:justify; '>\n<span style=''>Includes historic mine decline and 700ft of haulage drifts </span> \n</p>\n</li>\r\n</ul>\r\n\n<p style='text-align:justify; '>\n<span style=''>Historical resource with recent 3D modelling suggesting significant room for expansion with addition of modern drilling</span>\n</p>\n\r\n<ul>\r\n<li>\n<p style='text-align:justify; '>\n<span style=''>Over 40 square-kilometers of contiguous prospective ground</span> \n</p>\n</li>\r\n</ul>\r\n \n<p style='text-align:justify; '>\n<span style=''>Darcy Christian, CEO of Ashley comments “This is an excellent opportunity for both existing and new shareholders of Ashley.  We all know how gold exploration projects are not being valued in the current market.  This acquisition should allow us to continue to advance our gold assets in a less dilutive way while providing the opportunity for cashflow in the next few years. Historically a 500,000 lbs non-compliant uranium reserve was defined on the Sahara Property by Energy Fuels with recent modelling of historic drilling suggests this number is significantly larger.  It will be our goal in the first stage of the Option agreement to confirm historic drilling and bring in a compliant resource we can work towards permitting for production.”  </span>\n</p>\n\n<p style='text-align:justify; '>\n<span style='text-align:center; '><a href='https://www.thenewswire.com/data/tnw/clients/img/2c3a6042d37ef841457f3c6f1f9cfe88.png' target='_blank'><img src=\"https://www.thenewswire.com/data/tnw/clients/img/2c3a6042d37ef841457f3c6f1f9cfe88_.png\" /></a><br />\nClick Image To View Full Size</span>\n</p>\n \n<p style='text-align:justify; '>\n<span style=''>Figure 1 - Ariel image of the Sahara Uranium-Vanadium Property with respect to Green River, Utah </span>\n</p>\n \n<p style='text-align:justify; '>\n<span style='font-weight:bold; '>About the Sahara Property</span>\n</p>\n\n<p style='text-align:left; '>\n<span style=''>The Sahara Property is located 12 miles southwest of Green River, Utah and consists of over 400 claims totalling over 10,000 acres.  The region has produced 4,000,000 lbs of Uranium and 5,000,000 lbs of Vanadium with some historical production occuring on the Property until 1980. The Project is located one mile off of the I-80 and is accessed by all weather gravel roads.  Water wells are located on the property and power is located less than a mile away to the northeast. In addition, a nearby telecommunicaions tower and fibre optics at the property provide internet and phone access. </span>\n</p>\n\n<p style='text-align:left; '>\n<span style=''>The property has over 900 historical drill holes over  the Sahara, Jessies Twist and Acheson discoveries. Mineralization occurs in the Salt Wash Member of the Morrison Formation within fluvial sandstones.  Additional targets have been identified with surficial gamma-ray spectrometry readings across the property.  In additon,  bulk tonnage targets have been identified for drilling as well as the hydrodynamic conditions for roll-front bluesky potential.   </span>\n</p>\n \n<p style='text-align:center; '>\n<span style='text-align:center; '><a href='https://www.thenewswire.com/data/tnw/clients/img/ad39e589db448062bf8a24ec7e914aea.png' target='_blank'><img src=\"https://www.thenewswire.com/data/tnw/clients/img/ad39e589db448062bf8a24ec7e914aea_.png\" /></a><br />\nClick Image To View Full Size</span>\n</p>\n \n<p style='text-align:center; '>\n<span style=''>Figure 3. Gamm Ray Spectrometer (RS-125) readings at outcrop exposure of horsetail type uranium and vanadium mineralization showing 41,730 counts per second. </span>\n</p>\n  \n<p style='text-align:justify; '>\n<span style='font-weight:bold; '>Terms</span>\n</p>\n\n<p style='text-align:justify; '>\n<span style=''>Upon execution of the LOI, Ashley has 30 days to pursue due diligence, site visit and develop the Definitive Agreement.  Ashley will issue 500,000 shares as consideration of the LOI.</span>\n</p>\n\n<p style='text-align:justify; '>\n<span style=''>Upon signing the Definitive Agreement and successful financing Ashley will issue 4,500,000 shares.  Ashley will drill an initial 1,000m program and produce a NI-43-101 report for the property. </span>\n</p>\n\n<p style='text-align:justify; '>\n<span style=''>With election to pursue 100% ownership a consideration of approximately CAD $5,000,000 payable in cash and shares over 5 years.  The terms will be also subject to certain work commitments, a 2% NSR and bonus’ linked to successful delineation of 10MM and 30MM pounds of Uranium tied into a Preliminary Economic Assessment.  </span>\n</p>\n\n<p style='text-align:justify; '>\n<span style=''>Full details of the terms will be released in a future press-release when finalized.  Closing of the Definitive Agreement will be subject to due-diligence results, financing, as well as CSE and shareholder approvals.</span>\n</p>\n\n<p style='text-align:justify; '>\n<span style=''>The Qualified Person responsible for the technical content of this press release is Shannon Baird, P.Geo, Exploration Manager of Ashley Gold Corp. </span>\n</p>\n \n<p style='text-align:justify; '>\n<span style='font-weight:bold; '>ABOUT ASHLEY GOLD CORP. </span>\n</p>\n\n<p style='text-align:justify; '>\n<span style=''>Ashley Gold is focused on creating substantive, long-term value for its shareholders through the discovery and development of world class gold deposits. Ashley has acquired, 100% of the Tabor Lake Lease subject to a 1.5% royalty, 100% of the Santa Maria Project subject to a 1.75% royalty, 100% interest in the Howie Lake Project subject to a 0.5% royalty, 100% interest in the Alto-Gardnar Project subject to a 0.5% royalty, 100% interest in the Burnthut Property subject to a 1.5% NSR, and an option to earn 100% of the Sakoose claims subject to a 1.5% NSR.</span>\n</p>\n\n<p style='text-align:justify; '>\n<span style=''>Ashley Gold Corp. is an early-stage natural resource company engaged primarily in the acquisition, exploration, and if warranted, development of mineral projects. The Corporation’s objective is to conduct efficient and economical exploration on its growing portfolio of high-quality gold projects, currently focused in northwestern Ontario within the Eagle-Wabigoon-Manitou Lakes Greenstone Belts.</span>\n</p>\n\n<p style='text-align:justify; '>\n<span style=''>The responsibility of this release lies with </span><span style=''><span style=''>Mr. </span></span><span style=''>Darcy Christian, President and CEO • +1 (587) </span><span style=''>777-9072</span><span style=''> • </span><a href='mailto:dchristian@ashleygoldcorp.com%20' target='_blank'><span style=''>dchristian@ashleygoldcorp.com </span></a><span style=''><span style=''>, may be contacted for further information.</span></span> <a href='http://www.ashleygoldcorp.com' target='_blank'><span style='font-weight:bold; '>www.ashleygoldcorp.com</span></a>\n</p>\n\n<p style='text-align:justify; '>\n<span style=''>Neither the CSE nor its Regulation Services Provider (as that term is defined in the policies of the CSE) accepts responsibility for the adequacy or accuracy of this release.</span>\n</p>\n\n<p style='text-align:justify; '>\n<span style='font-weight:bold; '>DISCLAIMER &amp; FORWARD-LOOKING STATEMENTS</span>\n</p>\n\n<p style='text-align:justify; '>\n<span style=''>This news release includes certain “forward-looking statements” which are not comprised of historical facts. Forward-looking statements are based on assumptions and address future events and conditions, and by their very nature involve inherent risks and uncertainties. Although these statements are based on currently available information, Ashley Gold Corp. provides no assurance that actual results will meet management’s expectations. Factors which cause results to differ materially are set out in the Company’s documents filed on SEDAR. Undue reliance should not be placed on “forward looking statements”.</span>\n</p>\n\n\n<p>Copyright (c) 2024 TheNewswire - All rights reserved.</p>\n",
    "search_terms": "Sahara,Ashley Gold Corp.,ASHL",
    "master_gid": 6483,
    "date": "2024-03-04T13:30:00.000Z",
    "tags": "USA|Utah||Gold,Uranium,Vanadium|Project Acquisition",
    "image_id": null,
    "hidden": false,
    "company_id": 1926,
    "provider": null,
    "excerpt": "Calgary, Alberta – TheNewswire - March 4, 2024 -Ashley GoldCorp.(CSE:“ASHL”) (“Ashley”or the“Company”)has signed a non-binding Letter of Intent (LOI) to enter into an Option Agreement for the 100% acquisition of the Sahara Uranium-Vanadium Property located in Emery County, Utah.  The property is located 12 miles away from the town of",
    "is_regulatory": false,
    "refined_tags": [
      "Project Acquisition"
    ],
    "ftp_filename": null,
    "company_name": "Energy Fuels Inc.",
    "exchange": "CSE",
    "root_ticker": "ASHL",
    "project_name": "Sahara",
    "gid": 6483,
    "location": null,
    "plan_id": "companytier2",
    "description_text": "Calgary, Alberta – TheNewswire - March 4, 2024 - Ashley Gold Corp. ( CSE : “ ASHL”) (“Ashley” or the “Company”) has signed a non-binding Letter of Intent (LOI) to enter into an Option Agreement for the 100% acquisition of the Sahara Uranium-Vanadium Property located in Emery County, Utah.  The property is located 12 miles away from the town of Green River, Utah where Western Uranium and Vanadium (WUC) is in the process of permitting a processing facility for its San Rafael and Sunday Mine complex resources as well as third party processing.  First ore processing for the facility is expected in 2026. The Company is looking to rapidly advance the asset to provide future feed to the new proposed processing facility. Highlights LOI to earn 100% of Property over 5 years Over 900 historical drillholes most with data 12 miles from WUC’s Green River Mill slated for production 2026 Drill ready for resource confirmation and expansion Includes historic mine decline and 700ft of haulage drifts Historical resource with recent 3D modelling suggesting significant room for expansion with addition of modern drilling Over 40 square-kilometers of contiguous prospective ground Darcy Christian, CEO of Ashley comments “This is an excellent opportunity for both existing and new shareholders of Ashley.  We all know how gold exploration projects are not being valued in the current market.  This acquisition should allow us to continue to advance our gold assets in a less dilutive way while providing the opportunity for cashflow in the next few years. Historically a 500,000 lbs non-compliant uranium reserve was defined on the Sahara Property by Energy Fuels with recent modelling of historic drilling suggests this number is significantly larger.  It will be our goal in the first stage of the Option agreement to confirm historic drilling and bring in a compliant resource we can work towards permitting for production.” Click Image To View Full Size Figure 1 - Ariel image of the Sahara Uranium-Vanadium Property with respect to Green River, Utah About the Sahara Property The Sahara Property is located 12 miles southwest of Green River, Utah and consists of over 400 claims totalling over 10,000 acres.  The region has produced 4,000,000 lbs of Uranium and 5,000,000 lbs of Vanadium with some historical production occuring on the Property until 1980. The Project is located one mile off of the I-80 and is accessed by all weather gravel roads.  Water wells are located on the property and power is located less than a mile away to the northeast. In addition, a nearby telecommunicaions tower and fibre optics at the property provide internet and phone access. The property has over 900 historical drill holes over  the Sahara, Jessies Twist and Acheson discoveries. Mineralization occurs in the Salt Wash Member of the Morrison Formation within fluvial sandstones.  Additional targets have been identified with surficial gamma-ray spectrometry readings across the property.  In additon,  bulk tonnage targets have been identified for drilling as well as the hydrodynamic conditions for roll-front bluesky potential. Click Image To View Full Size Figure 3. Gamm Ray Spectrometer (RS-125) readings at outcrop exposure of horsetail type uranium and vanadium mineralization showing 41,730 counts per second. Terms Upon execution of the LOI, Ashley has 30 days to pursue due diligence, site visit and develop the Definitive Agreement.  Ashley will issue 500,000 shares as consideration of the LOI. Upon signing the Definitive Agreement and successful financing Ashley will issue 4,500,000 shares.  Ashley will drill an initial 1,000m program and produce a NI-43-101 report for the property. With election to pursue 100% ownership a consideration of approximately CAD $5,000,000 payable in cash and shares over 5 years.  The terms will be also subject to certain work commitments, a 2% NSR and bonus’ linked to successful delineation of 10MM and 30MM pounds of Uranium tied into a Preliminary Economic Assessment. Full details of the terms will be released in a future press-release when finalized.  Closing of the Definitive Agreement will be subject to due-diligence results, financing, as well as CSE and shareholder approvals. The Qualified Person responsible for the technical content of this press release is Shannon Baird, P.Geo, Exploration Manager of Ashley Gold Corp. ABOUT ASHLEY GOLD CORP. Ashley Gold is focused on creating substantive, long-term value for its shareholders through the discovery and development of world class gold deposits. Ashley has acquired, 100% of the Tabor Lake Lease subject to a 1.5% royalty, 100% of the Santa Maria Project subject to a 1.75% royalty, 100% interest in the Howie Lake Project subject to a 0.5% royalty, 100% interest in the Alto-Gardnar Project subject to a 0.5% royalty, 100% interest in the Burnthut Property subject to a 1.5% NSR, and an option to earn 100% of the Sakoose claims subject to a 1.5% NSR. Ashley Gold Corp. is an early-stage natural resource company engaged primarily in the acquisition, exploration, and if warranted, development of mineral projects. The Corporation’s objective is to conduct efficient and economical exploration on its growing portfolio of high-quality gold projects, currently focused in northwestern Ontario within the Eagle-Wabigoon-Manitou Lakes Greenstone Belts. The responsibility of this release lies with Mr. Darcy Christian, President and CEO • +1 (587) 777-9072 • dchristian@ashleygoldcorp.com , may be contacted for further information. www.ashleygoldcorp.com Neither the CSE nor its Regulation Services Provider (as that term is defined in the policies of the CSE) accepts responsibility for the adequacy or accuracy of this release. DISCLAIMER & FORWARD-LOOKING STATEMENTS This news release includes certain “forward-looking statements” which are not comprised of historical facts. Forward-looking statements are based on assumptions and address future events and conditions, and by their very nature involve inherent risks and uncertainties. Although these statements are based on currently available information, Ashley Gold Corp. provides no assurance that actual results will meet management’s expectations. Factors which cause results to differ materially are set out in the Company’s documents filed on SEDAR. Undue reliance should not be placed on “forward looking statements”. Copyright (c) 2024 TheNewswire - All rights reserved.",
    "primary_commodity": "U"
  },
  "articleProject": {
    "gid": 6483,
    "project_name": "Sahara",
    "location": null
  },
  "articleExchange": "CSE",
  "articleCompanyId": 1926,
  "articleTicker": "ASHL",
  "articleCompanyName": "Ashley Gold Corp.",
  "allOtherCompanyProjects": [
    {
      "company_id": 1926,
      "gid": 5300,
      "project_name": "Howie Lake",
      "location": "Ontario, Canada"
    },
    {
      "company_id": 1926,
      "gid": 10763,
      "project_name": "Alto-Gardnar",
      "location": "Canada"
    },
    {
      "company_id": 1926,
      "gid": 3883,
      "project_name": "Tabor Lake-Sakoose",
      "location": null
    },
    {
      "company_id": 1926,
      "gid": 6876,
      "project_name": "Burnthut",
      "location": "Ontario, Canada"
    },
    {
      "company_id": 1926,
      "gid": 10219,
      "project_name": "Echo",
      "location": "Ontario, Canada"
    }
  ],
  "allOtherCompanyNews": [
    {
      "id": 107236,
      "company_id": 1926,
      "title": "Ashley Gold Corp. Mobilizes Field Crew for Prospecting at Burnthut and Tabor Properties, Targeting New Gold Discoveries",
      "link": "https://www.thenewswire.com/press-releases?id=1BQPFNRYO",
      "date": "2025-06-06T12:30:00.000Z",
      "hidden": false
    },
    {
      "id": 106582,
      "company_id": 1926,
      "title": "Ashley Gold Corp. Adds Jody Dahrouge, PGeo to Advisory Board",
      "link": "https://www.thenewswire.com/press-releases?id=1BQPFNOxY",
      "date": "2025-06-02T12:30:00.000Z",
      "hidden": false
    },
    {
      "id": 105765,
      "company_id": 1926,
      "title": "Ashley Gold Corp. Announces Up to 20.2 g/t Au from Mechanized Stripping and Channel Sampling Program, Howie Project",
      "link": "https://golddiscovery.com/legacy/user/news_details/759658-ashlcnx-ashley-gold-corp-announces-up-to-202-gt-au-from-mechanized-stripping-and-channel-sampling-program-howie-project",
      "date": "2025-05-26T13:20:00.000Z",
      "hidden": false
    },
    {
      "id": 104936,
      "company_id": 1926,
      "title": "Ashley Gold Completes Mechanical Stripping and Channel Sampling at Katisha Zone on Howie Project",
      "link": "https://www.thenewswire.com/press-releases?id=1kZaFqYXy",
      "date": "2025-05-16T12:30:00.000Z",
      "hidden": false
    },
    {
      "id": 104500,
      "company_id": 1926,
      "title": "Ashley Gold Corp. Names Noah Komavli as President and Director, Grants Stock Options",
      "link": "https://www.thenewswire.com/press-releases?id=1k6WF444V",
      "date": "2025-05-13T12:30:00.000Z",
      "hidden": false
    },
    {
      "id": 103664,
      "company_id": 1926,
      "title": "Ashley Gold Confirms Surface Mineralization at Depth with over 65 Metre Gold Mineralized Zone at Burnthut",
      "link": "https://www.thenewswire.com/press-releases?id=1k6WF4g2w",
      "date": "2025-05-06T12:30:00.000Z",
      "hidden": false
    },
    {
      "id": 100174,
      "company_id": 1926,
      "title": "Ashley Gold Closes Oversubscribed Unit Private Placement & Announces Completion of Icefield Acquisition",
      "link": "https://www.thenewswire.com/press-releases?id=1LpMFqdl5",
      "date": "2025-04-17T12:30:00.000Z",
      "hidden": false
    },
    {
      "id": 99097,
      "company_id": 1926,
      "title": "Ashley Gold Announces Financing and Echo Project Option",
      "link": "https://www.thenewswire.com/press-releases?id=1k49F6dVg",
      "date": "2025-04-09T00:00:00.000Z",
      "hidden": false
    },
    {
      "id": 98324,
      "company_id": 1926,
      "title": "Ashley Gold Corp. Further Consolidates Burnthut Project",
      "link": "https://www.thenewswire.com/press-releases?id=1Bz4FpRQY",
      "date": "2025-04-01T12:30:00.000Z",
      "hidden": false
    },
    {
      "id": -175781,
      "company_id": 1926,
      "title": "Canadian Investment Regulatory Organization Trade Resumption - ASHL",
      "link": "https://contentapi.cision.com/api/v1.0/releases/20250320C5222",
      "date": "2025-03-20T16:23:00.000Z",
      "hidden": false
    }
  ]
}