{
  "article": {
    "id": 52556,
    "link": "https://www.thenewswire.com/press-releases?id=1k49Fgjpy",
    "title": "Ashley Gold Closes Option Agreement on the Sahara Uranium-Vanadium Property",
    "description": "<table style='width:fit-content; border: none;'><tr style='background: none;'><td colspan='10' style='padding: 0; margin: 0; border: none; background: none;' valign='bottom'><a target='_blank' href='https://ashleygoldcorp.com/'><img src=\"https://www.thenewswire.com/data/tnw/clients/logos/1Bz4FrMgm.png?t=1698097310\" alt=\"Ashley Gold Corp.\" /></a></td></tr><tr style='background: none;'><td style='width: 34px; padding: 0; margin: 0; border: none; background: none;' valign='bottom'><a target='_blank' href='https://thenewswire.com/api/apps/tnw/r?i=1Bz4FrMgm&amp;m=fac'><img src=\"https://www.thenewswire.com/data/tnw/img/fac.png\" /></a></td><td style='width: 34px; padding: 0; margin: 0; border: none; background: none;' valign='bottom'><a target='_blank' href='https://thenewswire.com/api/apps/tnw/r?i=1Bz4FrMgm&amp;m=twi'><img src=\"https://www.thenewswire.com/data/tnw/img/twi.png\" /></a></td><td style='width: 34px; padding: 0; margin: 0; border: none; background: none;' valign='bottom'><a target='_blank' href='https://thenewswire.com/api/apps/tnw/r?i=1Bz4FrMgm&amp;m=lin'><img src=\"https://www.thenewswire.com/data/tnw/img/lin.png\" /></a></td><td style='width: 34px; padding: 0; margin: 0; border: none; background: none;' valign='bottom'><a target='_blank' href='https://thenewswire.com/api/apps/tnw/r?i=1Bz4FrMgm&amp;m=you'><img src=\"https://www.thenewswire.com/data/tnw/img/you.png\" /></a></td><td style='padding: 0; margin: 0; border: none; background: none;'></td></tr></table> \n<p style='text-align:justify; '>\n<span style='font-weight:bold; '>CALGARY, ALBERTA – </span><span style='font-weight:bold; '>TheNewswire - April 23, 2024 - </span><span style='font-weight:bold; '>Ashley Gold</span> <span style='font-weight:bold; '>Corp.</span> <span style='font-weight:bold; '>(</span><span style='font-weight:bold; '>CSE</span><span style='font-weight:bold; '>:ASHL) (“Ashley” </span><span style=''>or the </span><span style='font-weight:bold; '>“Company”)</span> <span style=''>is </span><span style=''>pleased to announce that, further to the news release dated March 4, 2024, it has executed a property option agreement dated April 22, 2024 (the “</span><span style='font-weight:bold; '>Agreement</span><span style=''>”) with San Rafael Resources LLC (“</span><span style='font-weight:bold; '>San Rafael</span><span style=''>”)  to acquire a 100%-interest in the Sahara </span><span style=''>uranium-vanadium property, located in Emery County, Utah. (the “</span><span style='font-weight:bold; '>Property</span><span style=''>”)</span><span style=''>. </span>\n</p>\n \n<p style='text-align:justify; '>\n<span style=''>Darcy Christian, CEO of Ashley comments “</span><span style='font-style:italic; '>This is a defining moment for the Company as Ashley now has line of sight for production cash-flow to continue to develop its existing assets and provide capital for new opportunities. In addition, we have solidified a relationship with San Rafael and Greg Kofford, the Optionor, bringing his capital experience and knowledge to the table. Mr. Kofford is going to be aligned with the shareholders for the long-haul, participating in financings alongside new and existing shareholders, with the intent to grow Ashley into one of the largest public multi-district producers in North America.” </span> \n</p>\n \n<p style='text-align:justify; '>\n<span style='font-weight:bold; '>Option Agreement Terms</span>\n</p>\n\n<p style='text-align:justify; '>\n<span style=''>Under the terms of the Agreement, Ashley has the right to acquire a 100% undivided interest in the Property through staged cash and share payments, plus minimum work expenditures totaling USD $10 million over a three-year period, as summarized below:</span>\n</p>\n\r\n<ul>\r\n<li>\n<p style='text-align:justify; '>\n<span style=''>4,500,000 Ashley common shares within 30 days of Ashley completing a private placement financing for first stage earn-in.  Terms and conditions of the private placement will be disclosed in a future press release when finalized. Ashley previously issued 500,000 common shares to San Rafael as a deposit upon execution of the letter of intent. </span> \n</p>\n</li><li>\n<p style='text-align:justify; '>\n<span style=''>1,000m drill program and completion of National Instrument 43-101 Report on the Property within 30 days of the first anniversary</span> \n</p>\n</li>\r\n</ul>\r\n \n<p style='text-align:justify; '>\n<span style=''>To earn an initial 30% interest to the Property:</span>\n</p>\n \r\n<ul>\r\n<li>\n<p style='text-align:justify; '>\n<span style=''>issue 18,500,000 common shares; and</span> \n</p>\n</li><li>\n<p style='text-align:justify; '>\n<span style=''>pay USD $100,000 cash to San Rafael.</span> \n</p>\n</li>\r\n</ul>\r\n \n<p style='text-align:justify; '>\n<span style=''>To earn a 50% interest to the Property:</span>\n</p>\n \r\n<ul>\r\n<li>\n<p style='text-align:justify; '>\n<span style=''>issue 20,000,000 common shares; and</span> \n</p>\n</li><li>\n<p style='text-align:justify; '>\n<span style=''>complete expenditures of USD $3,000,000 on the Property.</span> \n</p>\n</li>\r\n</ul>\r\n \n<p style='text-align:justify; '>\n<span style=''>To earn 100% of the Property:</span>\n</p>\n \r\n<ul>\r\n<li>\n<p style='text-align:justify; '>\n<span style=''>issue to San Rafael, the greater of 36,500,000 common shares and the number of Ashley common shares that would result in the aggregate number of common shares issued to San Rafael pursuant to the Agreement representing 40% of the issued and outstanding common shares;</span> \n</p>\n</li><li>\n<p style='text-align:justify; '>\n<span style=''>pay USD $1,000,000 cash; and</span> \n</p>\n</li><li>\n<p style='text-align:justify; '>\n<span style=''>USD $7,000,000 of expenditures on the Property. </span> \n</p>\n</li>\r\n</ul>\r\n  \n<p style='text-align:justify; '>\n<span style=''>In addition to the 100% earn-in, Ashley has agreed to issue additional common shares to San Rafael  based on certain economic Uranium Resource identified in a Preliminary Economic Assessment, as follows: </span>\n</p>\n\r\n<ul>\r\n<li>\n<p style='text-align:justify; '>\n<span style=''>10 million pounds of uranium in Preliminary Economic Assessment – 15,000,000 common shares and USD $500,000; and</span> \n</p>\n</li><li>\n<p style='text-align:justify; '>\n<span style=''>30 million pounds of uranium in Preliminary Economic Assessment – 35,000,000 common shares and USD $2,500,000.</span> \n</p>\n</li>\r\n</ul>\r\n \n<p style='text-align:justify; '>\n<span style=''>Upon completion of the acquisition of a 100% interest in the Property, Ashley will grant a 2% Net Smelter Return Royalty (the “</span><span style='font-weight:bold; '>NSR</span><span style=''>”) to San Rafael. Ashley will have the option to buy back 50% of the NSR for USD $2,000,000 prior to the commencement of commercial production.</span>\n</p>\n \n<p style='text-align:justify; '>\n<span style=''>As a prerequisite to executing the Agreement, Ashley has entered in to an investor rights agreement with San Rafael which gives San Rafael the right to participate in future financings on equal terms as well as the right to top up their equity position in any dilutive issuance (i.e., convertible securities) at the average 20-day Volume Weighted Average Price to maintain minimum ownership percentage.  San Rafael shall also have the right to nominate a director to join the Board of Directors as Chairman upon initial earn-in, subject to regulatory approval. </span>\n</p>\n\n<p style='text-align:justify; '>\n<span style='font-weight:bold; '>About the Sahara Property</span>\n</p>\n\n<p style='text-align:justify; '>\n<span style=''>The Property represents 402 Federal claims and 3 State Claims locate in Emery County Utah. </span><span style=''>The Property is located 12 miles southwest of Green River, Utah and consists of over 10,000 acres. The region has produced 4,000,000 lbs of Uranium and 5,000,000 lbs of Vanadium with some historical production occuring on the Property until 1980. The Property is located one mile off of the I-70 and is accessed by all weather gravel roads.  Water wells are located on the property and power is located less than a mile away to the northeast. In addition, a nearby telecommunicaions tower and fibre optics at the property provide internet and phone access. </span>\n</p>\n\n<p style='text-align:justify; '>\n<span style=''>The Property has over 900 historical drill holes over the Sahara, Jessies Twist and Acheson discoveries. Mineralization occurs in the Salt Wash Member of the Morrison Formation within fluvial sandstones.  Additional targets have been identified with surficial gamma-ray spectrometry readings across the property.  In additon,  bulk tonnage targets have been identified for drilling as well as the hydrodynamic conditions for roll-front bluesky potential.</span>\n</p>\n \n<p style='text-align:justify; '>\n<span style='text-align:center; '><a href='https://www.thenewswire.com/data/tnw/clients/img/2c3a6042d37ef841457f3c6f1f9cfe88.png' target='_blank'><img src=\"https://www.thenewswire.com/data/tnw/clients/img/2c3a6042d37ef841457f3c6f1f9cfe88_.png\" /></a><br />\nClick Image To View Full Size</span>\n</p>\n \n<p style='text-align:justify; '>\n<span style=''>Figure 1 - Ariel image of the Sahara Uranium-Vanadium Property with respect to Green River, Utah </span>\n</p>\n\n<p style='text-align:justify; '>\n<span style='font-weight:bold; '><br />\nABOUT ASHLEY GOLD CORP. </span>\n</p>\n\n<p style='text-align:justify; '>\n<span style=''>Ashley Gold Corp. is focused on creating substantive, long-term value for its shareholders through the discovery and development of world class gold deposits. Ashley has acquired, 100% of the Tabor Lake Lease subject to a 1.5% royalty, 100% of the Santa Maria Project subject to a 1.75% royalty, 100% interest in the Howie Lake Project subject to a 0.5% royalty, 100% interest in the Alto-Gardnar Project subject to a 0.5% royalty, 100% interest in the Burnthut Property subject to a 1.5% NSR, and an option to earn 100% of the Sakoose claims subject to a 1.5% NSR. In addition, Ashley has entered into a Option to earn 100% of the Sahara Uranium-Vanadium property in Emery County, Utah subject to a 2% NSR.</span>\n</p>\n\n<p style='text-align:justify; '>\n<span style=''>Ashley Gold Corp. is an early-stage natural resource company engaged primarily in the acquisition, exploration, and if warranted, development of mineral projects. The Corporation’s objective is to conduct efficient and economical exploration on its growing portfolio of high-quality gold projects, currently focused in northwestern Ontario within the Eagle-Wabigoon-Manitou Lakes Greenstone Belts. In addition, Ashley has entered into a LOI to earn 100% of the Sahara Uranium-Vanadium property in Emery County, Utah subject to a 2% NSR.</span>\n</p>\n \n<p style='text-align:left; '>\n<span style='font-weight:bold; '>Qualified Person</span>\n</p>\n\n<p style='text-align:left; '>\n<span style=''>The technical and scientific information in this news release has been reviewed and approved by Darcy Christian, P.Geo., President of Ashley, who is a Qualified Person as defined by NI 43-101. </span>\n</p>\n \n<p style='text-align:justify; '>\n<span style=''>Neither the CSE nor its Regulation Services Provider (as that term is defined in the policies of the CSE) accepts responsibility for the adequacy or accuracy of this release.</span>\n</p>\n\n<p style='text-align:justify; '>\n<span style='font-weight:bold; '>DISCLAIMER &amp; FORWARD-LOOKING STATEMENTS</span>\n</p>\n \n<p style='text-align:justify; '>\n<span style=''>This news release includes certain “forward-looking statements” which are not comprised of historical facts. Forward-looking statements are based on assumptions and address future events and conditions, and by their very nature involve inherent risks and uncertainties. Although these statements are based on currently available information, Ashley Gold Corp. provides no assurance that actual results will meet management’s expectations. Factors which cause results to differ materially are set out in the Company’s documents filed on SEDAR. Undue reliance should not be placed on “forward looking statements”.</span>\n</p>\n\n\n<p>Copyright (c) 2024 TheNewswire - All rights reserved.</p>\n",
    "search_terms": "Sahara,Ashley Gold Corp.,ASHL",
    "master_gid": 6483,
    "date": "2024-04-23T15:05:00.000Z",
    "tags": "USA|Utah||Gold,Uranium,Vanadium|Project Acquisition",
    "image_id": null,
    "hidden": false,
    "company_id": 1926,
    "provider": null,
    "excerpt": "CALGARY, ALBERTA –TheNewswire - April 23, 2024 -Ashley GoldCorp.(CSE:ASHL) (“Ashley”or the“Company”)ispleased to announce that, further to the news release dated March 4, 2024, it has executed a property option agreement dated April 22, 2024 (the “Agreement”) with San Rafael Resources LLC (“San Rafael”)  to acquire a 100%-interest in the Saharauranium-vanadium",
    "is_regulatory": false,
    "refined_tags": [
      "Project Acquisition"
    ],
    "ftp_filename": null,
    "company_name": "Energy Fuels Inc.",
    "exchange": "CSE",
    "root_ticker": "ASHL",
    "project_name": "Sahara",
    "gid": 6483,
    "location": null,
    "plan_id": "companytier2",
    "description_text": "CALGARY, ALBERTA – TheNewswire - April 23, 2024 - Ashley Gold Corp. ( CSE :ASHL) (“Ashley” or the “Company”) is pleased to announce that, further to the news release dated March 4, 2024, it has executed a property option agreement dated April 22, 2024 (the “ Agreement ”) with San Rafael Resources LLC (“ San Rafael ”)  to acquire a 100%-interest in the Sahara uranium-vanadium property, located in Emery County, Utah. (the “ Property ”) . Darcy Christian, CEO of Ashley comments “ This is a defining moment for the Company as Ashley now has line of sight for production cash-flow to continue to develop its existing assets and provide capital for new opportunities. In addition, we have solidified a relationship with San Rafael and Greg Kofford, the Optionor, bringing his capital experience and knowledge to the table. Mr. Kofford is going to be aligned with the shareholders for the long-haul, participating in financings alongside new and existing shareholders, with the intent to grow Ashley into one of the largest public multi-district producers in North America.” Option Agreement Terms Under the terms of the Agreement, Ashley has the right to acquire a 100% undivided interest in the Property through staged cash and share payments, plus minimum work expenditures totaling USD $10 million over a three-year period, as summarized below: 4,500,000 Ashley common shares within 30 days of Ashley completing a private placement financing for first stage earn-in.  Terms and conditions of the private placement will be disclosed in a future press release when finalized. Ashley previously issued 500,000 common shares to San Rafael as a deposit upon execution of the letter of intent. 1,000m drill program and completion of National Instrument 43-101 Report on the Property within 30 days of the first anniversary To earn an initial 30% interest to the Property: issue 18,500,000 common shares; and pay USD $100,000 cash to San Rafael. To earn a 50% interest to the Property: issue 20,000,000 common shares; and complete expenditures of USD $3,000,000 on the Property. To earn 100% of the Property: issue to San Rafael, the greater of 36,500,000 common shares and the number of Ashley common shares that would result in the aggregate number of common shares issued to San Rafael pursuant to the Agreement representing 40% of the issued and outstanding common shares; pay USD $1,000,000 cash; and USD $7,000,000 of expenditures on the Property. In addition to the 100% earn-in, Ashley has agreed to issue additional common shares to San Rafael  based on certain economic Uranium Resource identified in a Preliminary Economic Assessment, as follows: 10 million pounds of uranium in Preliminary Economic Assessment – 15,000,000 common shares and USD $500,000; and 30 million pounds of uranium in Preliminary Economic Assessment – 35,000,000 common shares and USD $2,500,000. Upon completion of the acquisition of a 100% interest in the Property, Ashley will grant a 2% Net Smelter Return Royalty (the “ NSR ”) to San Rafael. Ashley will have the option to buy back 50% of the NSR for USD $2,000,000 prior to the commencement of commercial production. As a prerequisite to executing the Agreement, Ashley has entered in to an investor rights agreement with San Rafael which gives San Rafael the right to participate in future financings on equal terms as well as the right to top up their equity position in any dilutive issuance (i.e., convertible securities) at the average 20-day Volume Weighted Average Price to maintain minimum ownership percentage.  San Rafael shall also have the right to nominate a director to join the Board of Directors as Chairman upon initial earn-in, subject to regulatory approval. About the Sahara Property The Property represents 402 Federal claims and 3 State Claims locate in Emery County Utah. The Property is located 12 miles southwest of Green River, Utah and consists of over 10,000 acres. The region has produced 4,000,000 lbs of Uranium and 5,000,000 lbs of Vanadium with some historical production occuring on the Property until 1980. The Property is located one mile off of the I-70 and is accessed by all weather gravel roads.  Water wells are located on the property and power is located less than a mile away to the northeast. In addition, a nearby telecommunicaions tower and fibre optics at the property provide internet and phone access. The Property has over 900 historical drill holes over the Sahara, Jessies Twist and Acheson discoveries. Mineralization occurs in the Salt Wash Member of the Morrison Formation within fluvial sandstones.  Additional targets have been identified with surficial gamma-ray spectrometry readings across the property.  In additon,  bulk tonnage targets have been identified for drilling as well as the hydrodynamic conditions for roll-front bluesky potential. Click Image To View Full Size Figure 1 - Ariel image of the Sahara Uranium-Vanadium Property with respect to Green River, Utah ABOUT ASHLEY GOLD CORP. Ashley Gold Corp. is focused on creating substantive, long-term value for its shareholders through the discovery and development of world class gold deposits. Ashley has acquired, 100% of the Tabor Lake Lease subject to a 1.5% royalty, 100% of the Santa Maria Project subject to a 1.75% royalty, 100% interest in the Howie Lake Project subject to a 0.5% royalty, 100% interest in the Alto-Gardnar Project subject to a 0.5% royalty, 100% interest in the Burnthut Property subject to a 1.5% NSR, and an option to earn 100% of the Sakoose claims subject to a 1.5% NSR. In addition, Ashley has entered into a Option to earn 100% of the Sahara Uranium-Vanadium property in Emery County, Utah subject to a 2% NSR. Ashley Gold Corp. is an early-stage natural resource company engaged primarily in the acquisition, exploration, and if warranted, development of mineral projects. The Corporation’s objective is to conduct efficient and economical exploration on its growing portfolio of high-quality gold projects, currently focused in northwestern Ontario within the Eagle-Wabigoon-Manitou Lakes Greenstone Belts. In addition, Ashley has entered into a LOI to earn 100% of the Sahara Uranium-Vanadium property in Emery County, Utah subject to a 2% NSR. Qualified Person The technical and scientific information in this news release has been reviewed and approved by Darcy Christian, P.Geo., President of Ashley, who is a Qualified Person as defined by NI 43-101. Neither the CSE nor its Regulation Services Provider (as that term is defined in the policies of the CSE) accepts responsibility for the adequacy or accuracy of this release. DISCLAIMER & FORWARD-LOOKING STATEMENTS This news release includes certain “forward-looking statements” which are not comprised of historical facts. Forward-looking statements are based on assumptions and address future events and conditions, and by their very nature involve inherent risks and uncertainties. Although these statements are based on currently available information, Ashley Gold Corp. provides no assurance that actual results will meet management’s expectations. Factors which cause results to differ materially are set out in the Company’s documents filed on SEDAR. Undue reliance should not be placed on “forward looking statements”. Copyright (c) 2024 TheNewswire - All rights reserved.",
    "primary_commodity": "U"
  },
  "articleProject": {
    "gid": 6483,
    "project_name": "Sahara",
    "location": null
  },
  "articleExchange": "CSE",
  "articleCompanyId": 1926,
  "articleTicker": "ASHL",
  "articleCompanyName": "Ashley Gold Corp.",
  "allOtherCompanyProjects": [
    {
      "company_id": 1926,
      "gid": 5300,
      "project_name": "Howie Lake",
      "location": "Ontario, Canada"
    },
    {
      "company_id": 1926,
      "gid": 10763,
      "project_name": "Alto-Gardnar",
      "location": "Canada"
    },
    {
      "company_id": 1926,
      "gid": 3883,
      "project_name": "Tabor Lake-Sakoose",
      "location": null
    },
    {
      "company_id": 1926,
      "gid": 6876,
      "project_name": "Burnthut",
      "location": "Ontario, Canada"
    },
    {
      "company_id": 1926,
      "gid": 10219,
      "project_name": "Echo",
      "location": "Ontario, Canada"
    }
  ],
  "allOtherCompanyNews": [
    {
      "id": 107236,
      "company_id": 1926,
      "title": "Ashley Gold Corp. Mobilizes Field Crew for Prospecting at Burnthut and Tabor Properties, Targeting New Gold Discoveries",
      "link": "https://www.thenewswire.com/press-releases?id=1BQPFNRYO",
      "date": "2025-06-06T12:30:00.000Z",
      "hidden": false
    },
    {
      "id": 106582,
      "company_id": 1926,
      "title": "Ashley Gold Corp. Adds Jody Dahrouge, PGeo to Advisory Board",
      "link": "https://www.thenewswire.com/press-releases?id=1BQPFNOxY",
      "date": "2025-06-02T12:30:00.000Z",
      "hidden": false
    },
    {
      "id": 105765,
      "company_id": 1926,
      "title": "Ashley Gold Corp. Announces Up to 20.2 g/t Au from Mechanized Stripping and Channel Sampling Program, Howie Project",
      "link": "https://golddiscovery.com/legacy/user/news_details/759658-ashlcnx-ashley-gold-corp-announces-up-to-202-gt-au-from-mechanized-stripping-and-channel-sampling-program-howie-project",
      "date": "2025-05-26T13:20:00.000Z",
      "hidden": false
    },
    {
      "id": 104936,
      "company_id": 1926,
      "title": "Ashley Gold Completes Mechanical Stripping and Channel Sampling at Katisha Zone on Howie Project",
      "link": "https://www.thenewswire.com/press-releases?id=1kZaFqYXy",
      "date": "2025-05-16T12:30:00.000Z",
      "hidden": false
    },
    {
      "id": 104500,
      "company_id": 1926,
      "title": "Ashley Gold Corp. Names Noah Komavli as President and Director, Grants Stock Options",
      "link": "https://www.thenewswire.com/press-releases?id=1k6WF444V",
      "date": "2025-05-13T12:30:00.000Z",
      "hidden": false
    },
    {
      "id": 103664,
      "company_id": 1926,
      "title": "Ashley Gold Confirms Surface Mineralization at Depth with over 65 Metre Gold Mineralized Zone at Burnthut",
      "link": "https://www.thenewswire.com/press-releases?id=1k6WF4g2w",
      "date": "2025-05-06T12:30:00.000Z",
      "hidden": false
    },
    {
      "id": 100174,
      "company_id": 1926,
      "title": "Ashley Gold Closes Oversubscribed Unit Private Placement & Announces Completion of Icefield Acquisition",
      "link": "https://www.thenewswire.com/press-releases?id=1LpMFqdl5",
      "date": "2025-04-17T12:30:00.000Z",
      "hidden": false
    },
    {
      "id": 99097,
      "company_id": 1926,
      "title": "Ashley Gold Announces Financing and Echo Project Option",
      "link": "https://www.thenewswire.com/press-releases?id=1k49F6dVg",
      "date": "2025-04-09T00:00:00.000Z",
      "hidden": false
    },
    {
      "id": 98324,
      "company_id": 1926,
      "title": "Ashley Gold Corp. Further Consolidates Burnthut Project",
      "link": "https://www.thenewswire.com/press-releases?id=1Bz4FpRQY",
      "date": "2025-04-01T12:30:00.000Z",
      "hidden": false
    },
    {
      "id": -175781,
      "company_id": 1926,
      "title": "Canadian Investment Regulatory Organization Trade Resumption - ASHL",
      "link": "https://contentapi.cision.com/api/v1.0/releases/20250320C5222",
      "date": "2025-03-20T16:23:00.000Z",
      "hidden": false
    }
  ]
}