{
  "article": {
    "id": 34577,
    "link": "https://www.newsfilecorp.com/release/164483/Kraken-Energy-Executes-Binding-Letter-Agreement-for-the-Harts-Point-Uranium-Property-Utah",
    "title": "Kraken Energy Executes Binding Letter Agreement for the Harts Point Uranium Property, Utah",
    "description": "<img id=\"367\" width=\"2\" height=\"2\" style=\"width: 1px;  height: 1px;border: 0px solid;\" src=\"https://api.newsfilecorp.com/newsinfo/164483/367\" /><p><b></b>Vancouver, British Columbia--(Newsfile Corp. - May 2, 2023) - <b>Kraken Energy Corp. </b>(<b>CSE: UUSA) (OTCQB: UUSAF</b>) (the \"<b>Company</b>\" or \"<b>Kraken</b>\") is pleased to announce that it has entered into a binding letter of agreement (the \"<b>Agreement</b>\") to acquire up to a 75% interest in the Harts Point Uranium Property (Figures 1 &#38; 2) in San Juan County, southeast Utah (\"<b>Harts Point</b>\" or the \"<b>Property</b>\"). The Property is located in the center of the Colorado Plateau, referred to by some as \"the US version of the Athabasca Basin,\" and is 64 kilometers (\"km\") (40 miles) north of the White Mesa Uranium Mill, the only fully licensed and operating conventional uranium mill in the United States.</p><p><i>Garrett Ainsworth, Chairman of Kraken, commented: \"Since Kraken's inception in mid-2022, we have been reviewing numerous uranium properties in the western US to acquire or option. This process has led us to selecting the Harts Point Uranium Property based on its potential to host another Lisbon Valley style trend of uranium deposits. Harts Point has been de-risked from an exploration standpoint given that there are three widely spaced historic oil and gas wells that encountered intervals of off-scale radioactivity within the favorable Chinle Formation host rock. Historic uranium mining has taken place 11 km west of the Property where the Chinle Formation outcrops, which confirms that significant uranium mineralization is associated with the flanks of the Harts Point anticline feature.\"</i></p><p><b>Harts Point Property Highlights:</b></p><ul style=\"list-style-type: disc;\"><li><b>World class uranium jurisdiction:</b> located in the center of the Colorado Plateau, which has produced <b>over 328 million (\"M\") pounds (\"lbs\") U</b><sub><b>3</b></sub><b>O</b><sub><b>8</b></sub><b> at 0.2 to 0.4% U</b><sub><b>3</b></sub><b>O</b><sub><b>8</b></sub> since the 1950s<sup>1</sup>.</li><li>Property consists of <b>324 lode mining claims</b> on Bureau of Land Management (\"<b>BLM</b>\") ground that covers an area of <b>2,622 hectares (\"ha\") (6,480 acres)</b>.</li><li><b>Harts Point Anticline is Analogous to the Lisbon Valley Anticline: </b>where the Lisbon Valley Uranium District (Figure 1) had <b>17 large uranium mines which produced approximately 80M lbs U</b><sub><b>3</b></sub><b>O</b><sub><b>8</b></sub><b> at 0.34% U</b><sub><b>3</b></sub><b>O</b><sub><b>8</b></sub> from 1948 to 1988<sup>2</sup>.<ul style=\"list-style-type: circle;\"><li>The dimensions of these tabular sandstone-hosted uranium deposits range from <b>2 to 13 meters (\"m\") (7 to 43 feet) thick, 100 to 3,048 m (328 to 10,000 feet) long, and 31 to 427 m (100 to 1,400 feet) wide</b><sup>3</sup>.</li></ul></li><li><b>Significant Historic Uranium Production:</b><ul style=\"list-style-type: circle;\"><li>Several historic mines located 11 km (7 miles) west of the Harts Point Property produced approximately <b>280,000 lbs U</b><sub><b>3</b></sub><b>O</b><sub><b>8</b></sub><b> at 0.3% U</b><sub><b>3</b></sub><b>O</b><sub><b>8</b></sub> from the <b>favorable Chinle Formation host rock</b><sup>4</sup><b>.</b></li><li>The Lisbon Valley Anticline is located 31 km (19 miles) to the east of the Harts Point Property (Figure 1) produced approximately <b>80M lbs U</b><sub><b>3</b></sub><b>O</b><sub><b>8</b></sub><b> 0.3% U</b><sub><b>3</b></sub><b>O</b><sub><b>8</b></sub><sup>2</sup><b>.</b></li></ul></li><li><b>Historic Exploration:</b> <b>Three wide-spaced historic oil and gas wells on the Property</b> (Figure 2) along the east flank of the Harts Point Anticline <b>show 'off-scale' radioactivity within the favorable Chinle Formation host rock.</b></li><li><b>Permitted to Drill:</b> The Harts Point Property is <b>permitted for up to 25 exploration drill holes</b> upon payment of the US$58,000 bond to the BLM.</li><li><b>Excellent Infrastructure:</b> located approximately <b>64 km (40 miles) north of the White Mesa uranium processing facility.</b><ul style=\"list-style-type: circle;\"><ul style=\"list-style-type: circle;\"><li>There is excellent access throughout the Property, which is situated 45 km (28 miles) from the town of Monticello, Utah.</li></ul></ul></li></ul><p style=\"text-align: center;\"><a rel=\"nofollow\" href=\"https://images.newsfilecorp.com/files/8684/164483_f908ea45944fabf5_001full.jpg\"><img src=\"https://images.newsfilecorp.com/files/8684/164483_f908ea45944fabf5_001.jpg\" style=\"border-width: 0px;\" alt=\"Cannot view this image? Visit: https://images.newsfilecorp.com/files/8684/164483_f908ea45944fabf5_001.jpg\" /></a></p><p style=\"text-align: center;\"><u><b>Figure 1</b></u><b>: Harts Point Location Map within Colorado Plateau</b></p><p style=\"text-align: center;\">To view an enhanced version of this graphic, please visit:<br /><a rel=\"nofollow\" href=\"https://images.newsfilecorp.com/files/8684/164483_f908ea45944fabf5_001full.jpg\">https://images.newsfilecorp.com/files/8684/164483_f908ea45944fabf5_001full.jpg</a></p><p><i>\"We are very excited to bring the Harts Point Property into our current portfolio of prospective US uranium projects.\" Stated Matthew Schwab, CEO of Kraken. \"With drilling permits in place and targets selected at Harts Point, our team is eager to begin work on this property in the most prominent uranium mining jurisdiction in the United States.\"</i></p><p style=\"text-align: center;\"><a rel=\"nofollow\" href=\"https://images.newsfilecorp.com/files/8684/164483_f908ea45944fabf5_002full.jpg\"><img src=\"https://images.newsfilecorp.com/files/8684/164483_f908ea45944fabf5_002.jpg\" style=\"border-width: 0px;\" alt=\"Cannot view this image? Visit: https://images.newsfilecorp.com/files/8684/164483_f908ea45944fabf5_002.jpg\" /></a></p><p style=\"text-align: center;\"><u><b>Figure 2</b></u><b>: Harts Point Property with Regional Uranium Occurrences</b></p><p style=\"text-align: center;\">To view an enhanced version of this graphic, please visit:<br /><a rel=\"nofollow\" href=\"https://images.newsfilecorp.com/files/8684/164483_f908ea45944fabf5_002full.jpg\">https://images.newsfilecorp.com/files/8684/164483_f908ea45944fabf5_002full.jpg</a></p><p><b>Terms of the Agreement:</b></p><p>Under the terms of the Agreement, the parties will enter into a definitive option agreement (the \"Option Agreement\") within 60 days, pursuant to which the Company may acquire up to 75% of the Harts Point Property from Atomic Minerals Corporation (<b>TSXV: ATOM</b>) (\"<b>Atomic</b>\") by meeting the following requirements:</p><ul style=\"list-style-type: disc;\"><li>Kraken will be the operator and must incur US$1.5 million of eligible expenditures within 18 months from the date of the Option Agreement to earn a 65% interest.</li><li>Kraken has the option to increase interest in the Property from 65% to 75% by incurring an additional US$2.0 million of eligible expenditures within 30 months from the date of the Option Agreement and issuing Atomic 2.0 million common shares of Kraken.</li><li>Kraken will grant Atomic a 2.0% net smelter royalty (subject to a buy down to 1.0% for US$5.0 million).</li><li>After the initial option (Kraken 65%: Atomic 35%) or the extended option (Kraken 75%: Atomic 25%), a definitive Joint Venture Agreement will be formed.</li></ul><p>As consideration for identifying the Harts Point Property and facilitating completion of the proposed transaction, finder's fees are being considered according to CSE policy for a \"non-arm's length party\" to the Company.</p><p><b>References</b></p><p><sup>1</sup> Holger Albrethsen, Jr. and Frank E. McGinley (1982). Summary History of Domestic Procurement Under U.S. Atomic Energy Commission Contracts, September 1982.</p><p><sup>2</sup> Chenoweth, W.L. (1990). Lisbon Valley, Utah's Premier Uranium Area, a Summary of Exploration and Ore Production. Utah Geological Survey Open File Report 188, July 1990.</p><p><sup>3</sup> Gordon W. Weir and Willard P. Puffett (1981). Incomplete manuscript on stratigraphy and structural geology and uranium-vanadium and copper deposits of the Lisbon Valley area, Utah-Colorado. Open-File Report 81-39. Pages 153 to 163. United States Department of the Interior</p><p>Geological Survey.</p><p><sup>4</sup> Chenoweth, W.L. (1993): The geology and Production History of the Uranium deposits in the White Canyon Mining District, San Juan County, Utah, Utah Geological Survey Miscellaneous Publication 93-3.</p><p><b>Technical Information:</b></p><p>All scientific and technical information in this news release has been prepared by or reviewed and approved by Matthew Schwab, P.Geo., President and CEO of the Company, and Garrett Ainsworth, P.Geo., Chairman of the Company. Each of Mr. Schwab and Mr. Ainsworth is a Qualified Person for the purposes of National Instrument 43-101 - Standards of Disclosure for Mineral Projects.</p><p>The data disclosed in this news release is related to historical drilling results. Kraken has not undertaken any independent investigation of the sampling, nor has it independently analyzed the results of the historical exploration work in order to verify the results. Kraken considers these historical drill results relevant as the Company is using this data as a guide to plan exploration programs. The Company's current and future exploration work includes verification of the historical data through drilling.</p><p><b>About Kraken Energy Corp.:</b></p><p>Kraken Energy Corp. is a new energy company advancing its portfolio of high-grade uranium properties in the Unites States. The Company is advancing its 100%-owned Apex Uranium Property, located 280 km (174 miles) east from Reno, Nevada which is recognized as Nevada's largest past-producing uranium mine. The Company has additionally entered into an option agreement to earn 100% of the Garfield Hills Uranium Property. The past-producing Garfield Hills Uranium Property covers 1,238 ha (3,060 acres) and is located 19 km (12 miles) east of Hawthorne in Mineral County, Nevada. The Company has also recently staked the Huber Hills Uranium Property, located 136 km (85 miles) north of Elko, Nevada which covers 1,044 ha (2,580 acres) and encompasses the historic Race Track open pit mine.</p><p>For more information about the Company, please visit; <a href=\"https://api.newsfilecorp.com/redirect/VmagAT740B\">www.krakenenergycorp.com</a>.</p><p><b>On Behalf of the Board of Kraken Energy Corp.</b></p><p>Matthew Schwab<br />President &#38; Chief Executive Officer</p><p>Corporate Office: <br />Suite 907 - 1030 West Georgia Street<br />Vancouver, British Columbia<br />V6E 2Y3<br />T: (604) 737-2303</p><p>For investor relations inquiries, contact:<br />Kin Communications Inc.<br />T: (604) 684-6730<br />E: <a href=\"mailto:uusa@kincommunications.com\">uusa@kincommunications.com</a></p><p><i>This news release contains forward-looking information which is subject to a variety of risks and uncertainties and other factors that could cause actual events or results to differ from those projected in the forward-looking statements. Forward-looking statements in this press release include our plans for exploration at the properties. These forward-looking statements are subject to a variety of risks and uncertainties and other factors that could cause actual events or results to differ materially from those projected in the forward-looking information. Risks that could change or prevent these statements from coming to fruition include changing costs for mining and processing; increased capital costs; the timing and content of upcoming work programs; geological interpretations based on drilling that may change with more detailed information; potential process methods and mineral recoveries assumption based on limited test work and by comparison to what are considered analogous deposits that with further test work may not be comparable; the availability of labour, equipment and markets for the products produced; and despite the current expected viability of the project, conditions changing such that the minerals on our property cannot be economically mined, or that the required permits to build and operate the envisaged mine can be obtained. The forward-looking information contained herein is given as of the date hereof and the Company assumes no responsibility to update or revise such information to reflect new events or circumstances, except as required by law.</i></p><p id=\"corporateNewsLogoContainer\"><img src=\"https://images.newsfilecorp.com/files/8684/164483_f908ea45944fabf5_logo.jpg\" id=\"corporateNewsLogo\" alt=\"Corporate Logo\" /></p><p id=\"corporateLinkBack\">To view the source version of this press release, please visit <a href=\"https://api.newsfilecorp.com/redirect/zWy5vinOXP\">https://www.newsfilecorp.com/release/164483</a></p>",
    "search_terms": "Harts Point,Kraken Energy Corp.,UUSA",
    "master_gid": 4561,
    "date": "2023-05-02T12:00:00.000Z",
    "tags": "USA|Colorado,Utah||Uranium|Project Acquisition",
    "image_id": null,
    "hidden": false,
    "company_id": 1429,
    "provider": null,
    "excerpt": "Vancouver, British Columbia--(Newsfile Corp. - May 2, 2023) -Kraken Energy Corp.(CSE: UUSA) (OTCQB: UUSAF) (the \"Company\" or \"Kraken\") is pleased to announce that it has entered into a binding letter of agreement (the \"Agreement\") to acquire up to a 75% interest in the Harts Point Uranium Property (Figures 1 &#38;",
    "is_regulatory": false,
    "refined_tags": [
      "Project Acquisition"
    ],
    "ftp_filename": null,
    "company_name": "Kraken Energy Corp.",
    "exchange": "CSE",
    "root_ticker": "UUSA",
    "project_name": "Harts Point",
    "gid": 4561,
    "location": "Utah, United States",
    "plan_id": null,
    "description_text": "Vancouver, British Columbia--(Newsfile Corp. - May 2, 2023) - Kraken Energy Corp. ( CSE: UUSA) (OTCQB: UUSAF ) (the \" Company \" or \" Kraken \") is pleased to announce that it has entered into a binding letter of agreement (the \" Agreement \") to acquire up to a 75% interest in the Harts Point Uranium Property (Figures 1 & 2) in San Juan County, southeast Utah (\" Harts Point \" or the \" Property \"). The Property is located in the center of the Colorado Plateau, referred to by some as \"the US version of the Athabasca Basin,\" and is 64 kilometers (\"km\") (40 miles) north of the White Mesa Uranium Mill, the only fully licensed and operating conventional uranium mill in the United States. Garrett Ainsworth, Chairman of Kraken, commented: \"Since Kraken's inception in mid-2022, we have been reviewing numerous uranium properties in the western US to acquire or option. This process has led us to selecting the Harts Point Uranium Property based on its potential to host another Lisbon Valley style trend of uranium deposits. Harts Point has been de-risked from an exploration standpoint given that there are three widely spaced historic oil and gas wells that encountered intervals of off-scale radioactivity within the favorable Chinle Formation host rock. Historic uranium mining has taken place 11 km west of the Property where the Chinle Formation outcrops, which confirms that significant uranium mineralization is associated with the flanks of the Harts Point anticline feature.\" Harts Point Property Highlights: World class uranium jurisdiction: located in the center of the Colorado Plateau, which has produced over 328 million (\"M\") pounds (\"lbs\") U 3 O 8 at 0.2 to 0.4% U 3 O 8 since the 1950s 1 . Property consists of 324 lode mining claims on Bureau of Land Management (\" BLM \") ground that covers an area of 2,622 hectares (\"ha\") (6,480 acres) . Harts Point Anticline is Analogous to the Lisbon Valley Anticline: where the Lisbon Valley Uranium District (Figure 1) had 17 large uranium mines which produced approximately 80M lbs U 3 O 8 at 0.34% U 3 O 8 from 1948 to 1988 2 . The dimensions of these tabular sandstone-hosted uranium deposits range from 2 to 13 meters (\"m\") (7 to 43 feet) thick, 100 to 3,048 m (328 to 10,000 feet) long, and 31 to 427 m (100 to 1,400 feet) wide 3 . Significant Historic Uranium Production: Several historic mines located 11 km (7 miles) west of the Harts Point Property produced approximately 280,000 lbs U 3 O 8 at 0.3% U 3 O 8 from the favorable Chinle Formation host rock 4 . The Lisbon Valley Anticline is located 31 km (19 miles) to the east of the Harts Point Property (Figure 1) produced approximately 80M lbs U 3 O 8 0.3% U 3 O 8 2 . Historic Exploration: Three wide-spaced historic oil and gas wells on the Property (Figure 2) along the east flank of the Harts Point Anticline show 'off-scale' radioactivity within the favorable Chinle Formation host rock. Permitted to Drill: The Harts Point Property is permitted for up to 25 exploration drill holes upon payment of the US$58,000 bond to the BLM. Excellent Infrastructure: located approximately 64 km (40 miles) north of the White Mesa uranium processing facility. There is excellent access throughout the Property, which is situated 45 km (28 miles) from the town of Monticello, Utah. Figure 1 : Harts Point Location Map within Colorado Plateau To view an enhanced version of this graphic, please visit: https://images.newsfilecorp.com/files/8684/164483_f908ea45944fabf5_001full.jpg \"We are very excited to bring the Harts Point Property into our current portfolio of prospective US uranium projects.\" Stated Matthew Schwab, CEO of Kraken. \"With drilling permits in place and targets selected at Harts Point, our team is eager to begin work on this property in the most prominent uranium mining jurisdiction in the United States.\" Figure 2 : Harts Point Property with Regional Uranium Occurrences To view an enhanced version of this graphic, please visit: https://images.newsfilecorp.com/files/8684/164483_f908ea45944fabf5_002full.jpg Terms of the Agreement: Under the terms of the Agreement, the parties will enter into a definitive option agreement (the \"Option Agreement\") within 60 days, pursuant to which the Company may acquire up to 75% of the Harts Point Property from Atomic Minerals Corporation ( TSXV: ATOM ) (\" Atomic \") by meeting the following requirements: Kraken will be the operator and must incur US$1.5 million of eligible expenditures within 18 months from the date of the Option Agreement to earn a 65% interest. Kraken has the option to increase interest in the Property from 65% to 75% by incurring an additional US$2.0 million of eligible expenditures within 30 months from the date of the Option Agreement and issuing Atomic 2.0 million common shares of Kraken. Kraken will grant Atomic a 2.0% net smelter royalty (subject to a buy down to 1.0% for US$5.0 million). After the initial option (Kraken 65%: Atomic 35%) or the extended option (Kraken 75%: Atomic 25%), a definitive Joint Venture Agreement will be formed. As consideration for identifying the Harts Point Property and facilitating completion of the proposed transaction, finder's fees are being considered according to CSE policy for a \"non-arm's length party\" to the Company. References 1 Holger Albrethsen, Jr. and Frank E. McGinley (1982). Summary History of Domestic Procurement Under U.S. Atomic Energy Commission Contracts, September 1982. 2 Chenoweth, W.L. (1990). Lisbon Valley, Utah's Premier Uranium Area, a Summary of Exploration and Ore Production. Utah Geological Survey Open File Report 188, July 1990. 3 Gordon W. Weir and Willard P. Puffett (1981). Incomplete manuscript on stratigraphy and structural geology and uranium-vanadium and copper deposits of the Lisbon Valley area, Utah-Colorado. Open-File Report 81-39. Pages 153 to 163. United States Department of the Interior Geological Survey. 4 Chenoweth, W.L. (1993): The geology and Production History of the Uranium deposits in the White Canyon Mining District, San Juan County, Utah, Utah Geological Survey Miscellaneous Publication 93-3. Technical Information: All scientific and technical information in this news release has been prepared by or reviewed and approved by Matthew Schwab, P.Geo., President and CEO of the Company, and Garrett Ainsworth, P.Geo., Chairman of the Company. Each of Mr. Schwab and Mr. Ainsworth is a Qualified Person for the purposes of National Instrument 43-101 - Standards of Disclosure for Mineral Projects. The data disclosed in this news release is related to historical drilling results. Kraken has not undertaken any independent investigation of the sampling, nor has it independently analyzed the results of the historical exploration work in order to verify the results. Kraken considers these historical drill results relevant as the Company is using this data as a guide to plan exploration programs. The Company's current and future exploration work includes verification of the historical data through drilling. About Kraken Energy Corp.: Kraken Energy Corp. is a new energy company advancing its portfolio of high-grade uranium properties in the Unites States. The Company is advancing its 100%-owned Apex Uranium Property, located 280 km (174 miles) east from Reno, Nevada which is recognized as Nevada's largest past-producing uranium mine. The Company has additionally entered into an option agreement to earn 100% of the Garfield Hills Uranium Property. The past-producing Garfield Hills Uranium Property covers 1,238 ha (3,060 acres) and is located 19 km (12 miles) east of Hawthorne in Mineral County, Nevada. The Company has also recently staked the Huber Hills Uranium Property, located 136 km (85 miles) north of Elko, Nevada which covers 1,044 ha (2,580 acres) and encompasses the historic Race Track open pit mine. For more information about the Company, please visit; www.krakenenergycorp.com . On Behalf of the Board of Kraken Energy Corp. Matthew Schwab President & Chief Executive Officer Corporate Office: Suite 907 - 1030 West Georgia Street Vancouver, British Columbia V6E 2Y3 T: (604) 737-2303 For investor relations inquiries, contact: Kin Communications Inc. T: (604) 684-6730 E: uusa@kincommunications.com This news release contains forward-looking information which is subject to a variety of risks and uncertainties and other factors that could cause actual events or results to differ from those projected in the forward-looking statements. Forward-looking statements in this press release include our plans for exploration at the properties. These forward-looking statements are subject to a variety of risks and uncertainties and other factors that could cause actual events or results to differ materially from those projected in the forward-looking information. Risks that could change or prevent these statements from coming to fruition include changing costs for mining and processing; increased capital costs; the timing and content of upcoming work programs; geological interpretations based on drilling that may change with more detailed information; potential process methods and mineral recoveries assumption based on limited test work and by comparison to what are considered analogous deposits that with further test work may not be comparable; the availability of labour, equipment and markets for the products produced; and despite the current expected viability of the project, conditions changing such that the minerals on our property cannot be economically mined, or that the required permits to build and operate the envisaged mine can be obtained. The forward-looking information contained herein is given as of the date hereof and the Company assumes no responsibility to update or revise such information to reflect new events or circumstances, except as required by law. To view the source version of this press release, please visit https://www.newsfilecorp.com/release/164483",
    "primary_commodity": "U"
  },
  "articleProject": {
    "gid": 4561,
    "project_name": "Harts Point",
    "location": "Utah, United States"
  },
  "articleExchange": "CSE",
  "articleCompanyId": 1429,
  "articleTicker": "UUSA",
  "articleCompanyName": "Kraken Energy Corp.",
  "allOtherCompanyProjects": [
    {
      "company_id": 1429,
      "gid": 3885,
      "project_name": "Huber Hills",
      "location": "Nevada, United States"
    },
    {
      "company_id": 1429,
      "gid": 3475,
      "project_name": "Garfield Hills",
      "location": "Nevada, United States"
    },
    {
      "company_id": 1429,
      "gid": 2673,
      "project_name": "Apex",
      "location": "Nevada"
    }
  ],
  "allOtherCompanyNews": [
    {
      "id": 104907,
      "company_id": 1429,
      "title": "Kraken Mails Meeting Materials to Approve Acquisition by Aero Energy",
      "link": null,
      "date": "2025-05-16T11:00:00.000Z",
      "hidden": false
    },
    {
      "id": -193787,
      "company_id": 1429,
      "title": "Aero Energy and Kraken Energy Combine to Create a Premier North American Uranium Developer",
      "link": "https://app.quotemedia.com/data/downloadFiling?webmasterId=104408&ref=67ed1d69bac2286d58225bf1&type=PDFC&formType=002-002-001089-003001&formDescription=News+release&dateFiled=2025-04-02",
      "date": "2025-04-02T04:20:09.000Z",
      "hidden": false
    },
    {
      "id": 81166,
      "company_id": 1429,
      "title": "Kraken Energy Provides an Update on the Drilling Permit for the Apex Property in Nevada",
      "link": "https://www.newsfilecorp.com/release/232726/Kraken-Energy-Provides-an-Update-on-the-Drilling-Permit-for-the-Apex-Property-in-Nevada",
      "date": "2024-12-06T13:00:00.000Z",
      "hidden": false
    },
    {
      "id": 70459,
      "company_id": 1429,
      "title": "Kraken Energy Appoints Brian Goss as Interim Chief Executive Officer",
      "link": "https://www.newsfilecorp.com/release/222200/Kraken-Energy-Appoints-Brian-Goss-as-Interim-Chief-Executive-Officer",
      "date": "2024-09-05T12:30:00.000Z",
      "hidden": false
    },
    {
      "id": 68462,
      "company_id": 1429,
      "title": "Kraken Energy Provides Corporate Update",
      "link": "https://www.newsfilecorp.com/release/220007/Kraken-Energy-Provides-Corporate-Update",
      "date": "2024-08-15T12:00:00.000Z",
      "hidden": false
    },
    {
      "id": 63870,
      "company_id": 1429,
      "title": "Kraken Energy Completes First Tranche of Private Placement",
      "link": "https://www.newsfilecorp.com/release/214946/Kraken-Energy-Completes-First-Tranche-of-Private-Placement",
      "date": "2024-06-28T20:40:00.000Z",
      "hidden": false
    },
    {
      "id": 54504,
      "company_id": 1429,
      "title": "Kraken Energy Announces Financing",
      "link": "https://www.newsfilecorp.com/release/210665/Kraken-Energy-Announces-Financing",
      "date": "2024-05-27T12:00:00.000Z",
      "hidden": false
    },
    {
      "id": 53812,
      "company_id": 1429,
      "title": "Kraken Energy Reports on Positive Radon Results and Drill Permitting Update at Apex Uranium Property, Nevada",
      "link": "https://www.newsfilecorp.com/release/209080/Kraken-Energy-Reports-on-Positive-Radon-Results-and-Drill-Permitting-Update-at-Apex-Uranium-Property-Nevada",
      "date": "2024-05-14T12:00:00.000Z",
      "hidden": false
    },
    {
      "id": 51033,
      "company_id": 1429,
      "title": "Kraken Energy Confirms Elevated Radioactivity in Both Initial Drill Holes at Harts Point Property, Utah",
      "link": "https://www.newsfilecorp.com/release/203107/Kraken-Energy-Confirms-Elevated-Radioactivity-in-Both-Initial-Drill-Holes-at-Harts-Point-Property-Utah",
      "date": "2024-03-26T12:00:00.000Z",
      "hidden": false
    },
    {
      "id": 50738,
      "company_id": 1429,
      "title": "Kraken Energy to Present at the 2024 Kinvestor Critical Minerals & Mining Virtual Conference",
      "link": "https://www.newsfilecorp.com/release/202173/Kraken-Energy-to-Present-at-the-2024-Kinvestor-Critical-Minerals-Mining-Virtual-Conference",
      "date": "2024-03-19T12:00:00.000Z",
      "hidden": false
    }
  ]
}
