{
  "article": {
    "id": 30640,
    "link": "https://www.newsfilecorp.com/release/153089/Pancon-Acquires-Historic-Sawyer-Gold-Mine-North-Carolina",
    "title": "Pancon Acquires Historic Sawyer Gold Mine, North Carolina",
    "description": "<img id=\"367\" width=\"2\" height=\"2\" style=\"width: 1px;  height: 1px;border: 0px solid;\" src=\"https://api.newsfilecorp.com/newsinfo/153089/367\" /><p>Toronto, Ontario--(Newsfile Corp. - February 1, 2023) - Pancontinental Resources Corporation (TSXV: PUC) (OTCQB: PUCCF) (\"Pancon\" or the \"Company\") has entered into an exploration lease and purchase option agreement (the \"Agreement\") with the owner of Carolina Mining Company (\"CMC\") for the historic Sawyer Gold Mine Property (\"Sawyer\" or the \"Property\"), a past-producing gold mine. The 54.6 hectare (135 acre) property is located 5.0 km southwest along trend from the Company's recently announced New Sawyer mine acquisition (<a href=\"https://www.newsfilecorp.com/redirect/rYZp2FD4Mk\">see January 24, 2023 news release</a>). </p><p>Mineralization style and host rocks are similar at both Sawyer and New Sawyer properties and they both lie within the Sawyer-Keystone Gold Trend (\"Sawyer Trend\") (Moye 2018) (see Figure 1). The Sawyer Mine property has an Historic gold resource estimate (2021) which contains  3.9 million tonnes at 1.1 g/t Au for 134,600 ounces of gold,  at a 0.4 g/t Au cut-off grade. The mineralization is outcropping and is mainly near surface, containing mostly oxide and mixed oxide/sulfide mineralization with lesser sulfide resources. The mineralization remains open for expansion in several areas.</p><p>Pancon's Senior Technical Advisor Keith Laskowski, QP, stated: \"The acquisition of these two historic gold mines, both located within the recently recognized Sawyer Gold Trend, provides Pancon with a high quality exploration target. The properties enjoy the combination of tropical weathering, near surface mineralization and untested extensions of known mineralization, all of which make this a very exciting exploration opportunity. By verifying and expanding historic gold resources at Sawyer, and creating new resources at New Sawyer, the Sawyer Trend exploration program has the capacity to produce a large, near surface, oxide gold deposit in a predictable and short time frame. The Sawyer Trend was recognized in the last decade, and this will be the first modern evaluation of the distribution and controls on known gold mineralization.\"</p><p style=\"text-align: center;\"><a rel=\"nofollow\" href=\"https://images.newsfilecorp.com/files/5156/153089_7d68cbe424534ac4_003full.jpg\"><img src=\"https://images.newsfilecorp.com/files/5156/153089_7d68cbe424534ac4_003.jpg\" style=\"border-width: 0px;\" alt=\"Cannot view this image? Visit: https://images.newsfilecorp.com/files/5156/153089_7d68cbe424534ac4_003.jpg\" /></a><br /><br /><b>Figure 1. Location of the Sawyer Gold Trend in Randolph County, North Carolina</b></p><p style=\"text-align: center;\">To view an enhanced version of this graphic, please visit:<br /><a rel=\"nofollow\" href=\"https://images.newsfilecorp.com/files/5156/153089_7d68cbe424534ac4_003full.jpg\">https://images.newsfilecorp.com/files/5156/153089_7d68cbe424534ac4_003full.jpg</a></p><p><b>History:</b>  The Sawyer Gold Mine property lies within the Sawyer Gold Trend, a &#62;20 km long structurally-controlled alignment of mainly volcanic-hosted, Haile-type alteration and historic gold mines (Moye, 2018). The Sawyer Mine was discovered around 1820 and was reported to be in operation. Mineralization was identified along 5-6 parallel zones of strongly foliated Au-bearing silicified schist. The mine was active in 1902 with a 46 meter-deep shaft on the Miller Vein completed around 1906, with six shallower shafts opened along other lodes. The site was inactive by 1913, but some prospecting was reported as late as 1930.  Moye (2018) compiled the following map (Figure 2) which notes historic gold grades in ounces/ton as shown (not g/t).  (<i>The Property line does not accurately reflect the current property and gold assay values have not been confirmed</i>.)</p><p style=\"text-align: center;\"><a rel=\"nofollow\" href=\"https://images.newsfilecorp.com/files/5156/153089_7d68cbe424534ac4_004full.jpg\"><img src=\"https://images.newsfilecorp.com/files/5156/153089_7d68cbe424534ac4_004.jpg\" style=\"border-width: 0px;\" alt=\"Cannot view this image? Visit: https://images.newsfilecorp.com/files/5156/153089_7d68cbe424534ac4_004.jpg\" /></a><br /><br /><b>Figure 2. Map of Sawyer Gold Mine showing historic mining locations and gold grades in ounce per ton (Moye, 2018*)</b></p><p style=\"text-align: center;\">To view an enhanced version of this graphic, please visit:<br /><a rel=\"nofollow\" href=\"https://images.newsfilecorp.com/files/5156/153089_7d68cbe424534ac4_004full.jpg\">https://images.newsfilecorp.com/files/5156/153089_7d68cbe424534ac4_004full.jpg</a></p><p>The Sawyer Mine has been explored at various times by several companies, including:</p><ul style=\"list-style-type: disc;\"><li><b>1979-80</b>:  New Jersey Zinc explored and collected bulk sample.</li><li><b>1983-85</b>: Goldfields drilled 7 core and 19 RC holes for a total of 1,884 meters.</li><li><b>1990: </b>Corona conducted extensive trenching program.</li><li><b>1993-95: </b>Minefinders drilled 55 rotary RC holes for a total of 1,676 meters.</li><li><b>2009: </b>NCAU/HB Engineering drilled 60 RRC (1436.5 m) and 6 core holes (85 m); <ul style=\"list-style-type: circle;\"><li>most holes drilled 15 - 45.7 m.  </li><li>prepared initial engineering studies for open pit, heap leach gold mine. </li></ul></li><li><b>2011: </b>Romarco Minerals drilled 16 holes/5000 m core program based on similarities to the Haile Gold Mine which they owned and operated.</li></ul><p><font style=\"font-size: 11px;\">*Reference:  <i>Moye, Robert J., 2018, </i><u><i>Sawyer-Keystone Trend of Au-Ag-As deposits in Randolph County, North Carolina: Geologic and metallogenic analysis</i></u><i>: North Carolina Geological Survey, Open-File Report 2018-18, 45p.</i></font></p><p><b>Historic Resource Estimate:</b>  CMC prepared an Historical polygonal, mineral resource estimate (2020) with an internal consultant which confirmed the potential of the property.  In 2021, CMC contracted RockRidge Partnership &#38; Associates of British Columbia to evaluate the available data and to prepare a geostatistical resource evaluation of the Hickory Gold Deposit (Sawyer Mine). The resource evaluation was based on a total of 3,666 assay records from 120 reverse circulation (RC) drill holes, 40 diamond (core) drill holes, and 14 trenches (see Figure 3). Following modelling of the mineralized domain wireframe, a block model was constructed within the domain wireframe solid to cover the extents of the Sawyer mineralization. Ordinary Kriging was used to estimate grades into the blocks. RockRidge is of the opinion that the current drilling information is sufficiently reliable to interpret with confidence the boundaries of the mineralization domains, and that the assay sample data is sufficiently reliable to support estimating mineral resources. The resource evaluation estimates a mineral resource of 3.9 million tonnes at a grade of 1.1 g/t Au containing 134,600 ounces of gold, based on a cut off grade of 0.4 g/t Au.<i> </i></p><p><i>The Company cautions that a Qualified Person has not done sufficient work to classify the Historic Estimate as current mineral resources or mineral reserves under NI 43-101. The Company is not treating the Historical Estimate as current mineral resources or mineral reserves. There can be no certainty, following further evaluation and/or exploration work, that the Historic Estimate can be upgraded or verified as mineral resources or mineral reserves in accordance with NI 43-101. However, the Company plans to conduct further evaluation and/or exploration work with the objective of verifying or upgrading the Historic Estimate as mineral resources or mineral reserves in accordance with NI 43-101.</i></p><p style=\"text-align: center;\"><a rel=\"nofollow\" href=\"https://images.newsfilecorp.com/files/5156/153089_7d68cbe424534ac4_005full.jpg\"><img src=\"https://images.newsfilecorp.com/files/5156/153089_7d68cbe424534ac4_005.jpg\" style=\"border-width: 0px;\" alt=\"Cannot view this image? Visit: https://images.newsfilecorp.com/files/5156/153089_7d68cbe424534ac4_005.jpg\" /></a></p><p style=\"text-align: center;\"><b>Figure 3. Sawyer Mine Compilation of Drill Holes, Trench Data and Cross Sections</b></p><p style=\"text-align: center;\">To view an enhanced version of this graphic, please visit:<br /><a rel=\"nofollow\" href=\"https://images.newsfilecorp.com/files/5156/153089_7d68cbe424534ac4_005full.jpg\">https://images.newsfilecorp.com/files/5156/153089_7d68cbe424534ac4_005full.jpg</a></p><p><b>Exploration Data:  </b>Pancon has the exclusive right to purchase exploration data from CMC, including a high-resolution VTEM and airborne Magnetics survey flown by Geotech Ltd. in 2020, covering the properties. The 100 meter-spaced flight lines provide resistivity/conductivity and magnetics data covering both of Pancon's new exploration properties and the Sawyer Trend, extending from the west side of the Sawyer Mine (see Figure 4) to the east side of the New Sawyer mine, a distance of about 10 km. the Geotech Survey was supervised and processed by Wave Geophysics (Craig Beasley) of Evergreen, Colorado.</p><p style=\"text-align: center;\"><a rel=\"nofollow\" href=\"https://images.newsfilecorp.com/files/5156/153089_7d68cbe424534ac4_006full.jpg\"><img src=\"https://images.newsfilecorp.com/files/5156/153089_7d68cbe424534ac4_006.jpg\" style=\"border-width: 0px;\" alt=\"Cannot view this image? Visit: https://images.newsfilecorp.com/files/5156/153089_7d68cbe424534ac4_006.jpg\" /></a><br /><br /><b>Figure 4. Location of the Sawyer Mine and the New Sawyer Mine Properties with VTEM survey and flight line locations</b></p><p style=\"text-align: center;\">To view an enhanced version of this graphic, please visit:<br /><a rel=\"nofollow\" href=\"https://images.newsfilecorp.com/files/5156/153089_7d68cbe424534ac4_006full.jpg\">https://images.newsfilecorp.com/files/5156/153089_7d68cbe424534ac4_006full.jpg</a></p><p><b>Details of the Agreement</b></p><ul style=\"list-style-type: disc;\"><li>The initial term of the Agreement is ten (10) years (the \"Initial Term\"). Pancon retains the exclusive first right to automatically renew the Agreement for an additional ten (10) years (the \"Additional Term\");</li><li>No cash payments for years one to five (1-5) of the Initial Term;</li><li>Advanced Royalty Payments of US$25,000 per year for years six to ten (6-10) of the Initial Term;</li><li>Advanced Royalty Payments of US$50,000 per year for years eleven to twenty (11-20) (the Additional Term); </li><li>Pancon grants a 2% net smelter royalty (\"NSR\"), subject to the ability of Pancon to purchase 1% of the NSR for a purchase price of US$5,000,000. All Advanced Royalty Payments shall be credited against future NSR payments; and</li><li>Pancon has the exclusive option to purchase the Property (in order to develop new mining operations) at anytime during the Agreement at a price equal to three (3) times the fair market value of the Property, excluding any value or potential value of the Minerals.</li></ul><p><b>Qualified Person<br /></b>Keith Laskowski (MSc) is Senior Technical Advisor for the Company and is a Qualified Professional (#01221QP) of the Mining and Metallurgical Society of America and a Qualified Person as defined by Canadian National Instrument 43-101. He has reviewed and approved the technical information in this press release.</p><p><b>About Pancon<br /></b>Pancontinental Resources Corporation (TSXV: PUC) (OTCQB: PUCCF), or Pancon, is exploring the Carolina Terrane in the southeastern USA. Its flagship project is the past-producing Brewer Gold Mine, located in Chesterfield County, South Carolina, 12 kilometers along trend from the producing Haile Gold Mine. Pancon's 100%-owned, 673 hectare Jefferson Gold Project is continuous with and mostly surrounds the 389 hectare Brewer property. In January 2023, the Company announced exclusive mineral exploration lease and purchase option agreements for both the 246.6 hectare  New Sawyer Gold Mine Property and the 54.6 hectare Sawyer Gold Mine Property, both located on the Sawyer Gold Trend and in Randolph County, North Carolina.</p><p><b>For further information, please contact:<br /></b>Jeanny So, External Relations Manager<br />E: <a href=\"mailto:info@panconresources.com\">info@panconresources.com</a><br />T: +1.647.202.0994</p><p>For additional information please visit our new website at <a href=\"https://www.newsfilecorp.com/redirect/VmZvJi1LQa\">http://www.panconresources.com/</a> and our Twitter feed: <a href=\"https://www.newsfilecorp.com/redirect/zW4A2uBqWM\">@PanconResources</a>.</p><p>Neither TSX Venture Exchange nor its Regulation Services Provider (as that term is defined in the policies of the TSX Venture Exchange) accepts responsibility for the adequacy or accuracy of this release. </p><p>This news release contains forward-looking information which is not comprised of historical facts. Forward-looking information is characterized by words such as \"plan\", \"expect\", \"project\", \"intend\", \"believe\", \"anticipate\", \"estimate\" and other similar words, or statements that certain events or conditions \"may\" or \"will\" occur. Forward-looking information involves risks, uncertainties and other factors that could cause actual events, results, and opportunities to differ materially from those expressed or implied by such forward-looking information. Factors that could cause actual results to differ materially from such forward-looking information include, but are not limited to, changes in the state of equity and debt markets, fluctuations in commodity prices, delays in obtaining required regulatory or governmental approvals, and other risks involved in the mineral exploration and development industry, including those risks set out in the Company's management's discussion and analysis as filed under the Company's profile at <a href=\"https://www.newsfilecorp.com/redirect/4W4YXurVKX\">www.sedar.com</a>. Forward-looking information in this news release is based on the opinions and assumptions of management considered reasonable as of the date hereof, including that all necessary governmental and regulatory approvals will be received as and when expected. Although the Company believes that the assumptions and factors used in preparing the forward-looking information in this news release are reasonable, undue reliance should not be placed on such information. The Company disclaims any intention or obligation to update or revise any forward-looking information, other than as required by applicable securities laws.</p><p id=\"corporateNewsLogoContainer\"><img src=\"https://images.newsfilecorp.com/files/5156/153089_7d68cbe424534ac4_logo.jpg\" id=\"corporateNewsLogo\" alt=\"Corporate Logo\" /></p><p id=\"corporateLinkBack\">To view the source version of this press release, please visit <a href=\"https://www.newsfilecorp.com/redirect/jVZNqFQ5vp\">https://www.newsfilecorp.com/release/153089</a></p>",
    "search_terms": "Sawyer,Carolina Rush Corporation,PUC",
    "master_gid": 3983,
    "date": "2023-02-01T11:30:00.000Z",
    "tags": "|||Gold|Project Acquisition",
    "image_id": null,
    "hidden": false,
    "company_id": 1622,
    "provider": null,
    "excerpt": "Toronto, Ontario--(Newsfile Corp. - February 1, 2023) - Pancontinental Resources Corporation (TSXV: PUC) (OTCQB: PUCCF) (\"Pancon\" or the \"Company\") has entered into an exploration lease and purchase option agreement (the \"Agreement\") with the owner of Carolina Mining Company (\"CMC\") for the historic Sawyer Gold Mine Property (\"Sawyer\" or the \"Property\"),",
    "is_regulatory": false,
    "refined_tags": [
      "Project Acquisition"
    ],
    "ftp_filename": null,
    "company_name": "Carolina Rush Corporation",
    "exchange": "TSXV",
    "root_ticker": "RUSH",
    "project_name": "Sawyer",
    "gid": 3983,
    "location": "North Carolina, United States",
    "plan_id": null,
    "description_text": "Toronto, Ontario--(Newsfile Corp. - February 1, 2023) - Pancontinental Resources Corporation (TSXV: PUC) (OTCQB: PUCCF) (\"Pancon\" or the \"Company\") has entered into an exploration lease and purchase option agreement (the \"Agreement\") with the owner of Carolina Mining Company (\"CMC\") for the historic Sawyer Gold Mine Property (\"Sawyer\" or the \"Property\"), a past-producing gold mine. The 54.6 hectare (135 acre) property is located 5.0 km southwest along trend from the Company's recently announced New Sawyer mine acquisition ( see January 24, 2023 news release ). Mineralization style and host rocks are similar at both Sawyer and New Sawyer properties and they both lie within the Sawyer-Keystone Gold Trend (\"Sawyer Trend\") (Moye 2018) (see Figure 1). The Sawyer Mine property has an Historic gold resource estimate (2021) which contains  3.9 million tonnes at 1.1 g/t Au for 134,600 ounces of gold,  at a 0.4 g/t Au cut-off grade. The mineralization is outcropping and is mainly near surface, containing mostly oxide and mixed oxide/sulfide mineralization with lesser sulfide resources. The mineralization remains open for expansion in several areas. Pancon's Senior Technical Advisor Keith Laskowski, QP, stated: \"The acquisition of these two historic gold mines, both located within the recently recognized Sawyer Gold Trend, provides Pancon with a high quality exploration target. The properties enjoy the combination of tropical weathering, near surface mineralization and untested extensions of known mineralization, all of which make this a very exciting exploration opportunity. By verifying and expanding historic gold resources at Sawyer, and creating new resources at New Sawyer, the Sawyer Trend exploration program has the capacity to produce a large, near surface, oxide gold deposit in a predictable and short time frame. The Sawyer Trend was recognized in the last decade, and this will be the first modern evaluation of the distribution and controls on known gold mineralization.\" Figure 1. Location of the Sawyer Gold Trend in Randolph County, North Carolina To view an enhanced version of this graphic, please visit: https://images.newsfilecorp.com/files/5156/153089_7d68cbe424534ac4_003full.jpg History: The Sawyer Gold Mine property lies within the Sawyer Gold Trend, a >20 km long structurally-controlled alignment of mainly volcanic-hosted, Haile-type alteration and historic gold mines (Moye, 2018). The Sawyer Mine was discovered around 1820 and was reported to be in operation. Mineralization was identified along 5-6 parallel zones of strongly foliated Au-bearing silicified schist. The mine was active in 1902 with a 46 meter-deep shaft on the Miller Vein completed around 1906, with six shallower shafts opened along other lodes. The site was inactive by 1913, but some prospecting was reported as late as 1930.  Moye (2018) compiled the following map (Figure 2) which notes historic gold grades in ounces/ton as shown (not g/t).  ( The Property line does not accurately reflect the current property and gold assay values have not been confirmed .) Figure 2. Map of Sawyer Gold Mine showing historic mining locations and gold grades in ounce per ton (Moye, 2018*) To view an enhanced version of this graphic, please visit: https://images.newsfilecorp.com/files/5156/153089_7d68cbe424534ac4_004full.jpg The Sawyer Mine has been explored at various times by several companies, including: 1979-80 :  New Jersey Zinc explored and collected bulk sample. 1983-85 : Goldfields drilled 7 core and 19 RC holes for a total of 1,884 meters. 1990: Corona conducted extensive trenching program. 1993-95: Minefinders drilled 55 rotary RC holes for a total of 1,676 meters. 2009: NCAU/HB Engineering drilled 60 RRC (1436.5 m) and 6 core holes (85 m); most holes drilled 15 - 45.7 m. prepared initial engineering studies for open pit, heap leach gold mine. 2011: Romarco Minerals drilled 16 holes/5000 m core program based on similarities to the Haile Gold Mine which they owned and operated. *Reference: Moye, Robert J., 2018, Sawyer-Keystone Trend of Au-Ag-As deposits in Randolph County, North Carolina: Geologic and metallogenic analysis : North Carolina Geological Survey, Open-File Report 2018-18, 45p. Historic Resource Estimate: CMC prepared an Historical polygonal, mineral resource estimate (2020) with an internal consultant which confirmed the potential of the property.  In 2021, CMC contracted RockRidge Partnership & Associates of British Columbia to evaluate the available data and to prepare a geostatistical resource evaluation of the Hickory Gold Deposit (Sawyer Mine). The resource evaluation was based on a total of 3,666 assay records from 120 reverse circulation (RC) drill holes, 40 diamond (core) drill holes, and 14 trenches (see Figure 3). Following modelling of the mineralized domain wireframe, a block model was constructed within the domain wireframe solid to cover the extents of the Sawyer mineralization. Ordinary Kriging was used to estimate grades into the blocks. RockRidge is of the opinion that the current drilling information is sufficiently reliable to interpret with confidence the boundaries of the mineralization domains, and that the assay sample data is sufficiently reliable to support estimating mineral resources. The resource evaluation estimates a mineral resource of 3.9 million tonnes at a grade of 1.1 g/t Au containing 134,600 ounces of gold, based on a cut off grade of 0.4 g/t Au. The Company cautions that a Qualified Person has not done sufficient work to classify the Historic Estimate as current mineral resources or mineral reserves under NI 43-101. The Company is not treating the Historical Estimate as current mineral resources or mineral reserves. There can be no certainty, following further evaluation and/or exploration work, that the Historic Estimate can be upgraded or verified as mineral resources or mineral reserves in accordance with NI 43-101. However, the Company plans to conduct further evaluation and/or exploration work with the objective of verifying or upgrading the Historic Estimate as mineral resources or mineral reserves in accordance with NI 43-101. Figure 3. Sawyer Mine Compilation of Drill Holes, Trench Data and Cross Sections To view an enhanced version of this graphic, please visit: https://images.newsfilecorp.com/files/5156/153089_7d68cbe424534ac4_005full.jpg Exploration Data: Pancon has the exclusive right to purchase exploration data from CMC, including a high-resolution VTEM and airborne Magnetics survey flown by Geotech Ltd. in 2020, covering the properties. The 100 meter-spaced flight lines provide resistivity/conductivity and magnetics data covering both of Pancon's new exploration properties and the Sawyer Trend, extending from the west side of the Sawyer Mine (see Figure 4) to the east side of the New Sawyer mine, a distance of about 10 km. the Geotech Survey was supervised and processed by Wave Geophysics (Craig Beasley) of Evergreen, Colorado. Figure 4. Location of the Sawyer Mine and the New Sawyer Mine Properties with VTEM survey and flight line locations To view an enhanced version of this graphic, please visit: https://images.newsfilecorp.com/files/5156/153089_7d68cbe424534ac4_006full.jpg Details of the Agreement The initial term of the Agreement is ten (10) years (the \"Initial Term\"). Pancon retains the exclusive first right to automatically renew the Agreement for an additional ten (10) years (the \"Additional Term\"); No cash payments for years one to five (1-5) of the Initial Term; Advanced Royalty Payments of US$25,000 per year for years six to ten (6-10) of the Initial Term; Advanced Royalty Payments of US$50,000 per year for years eleven to twenty (11-20) (the Additional Term); Pancon grants a 2% net smelter royalty (\"NSR\"), subject to the ability of Pancon to purchase 1% of the NSR for a purchase price of US$5,000,000. All Advanced Royalty Payments shall be credited against future NSR payments; and Pancon has the exclusive option to purchase the Property (in order to develop new mining operations) at anytime during the Agreement at a price equal to three (3) times the fair market value of the Property, excluding any value or potential value of the Minerals. Qualified Person Keith Laskowski (MSc) is Senior Technical Advisor for the Company and is a Qualified Professional (#01221QP) of the Mining and Metallurgical Society of America and a Qualified Person as defined by Canadian National Instrument 43-101. He has reviewed and approved the technical information in this press release. About Pancon Pancontinental Resources Corporation (TSXV: PUC) (OTCQB: PUCCF), or Pancon, is exploring the Carolina Terrane in the southeastern USA. Its flagship project is the past-producing Brewer Gold Mine, located in Chesterfield County, South Carolina, 12 kilometers along trend from the producing Haile Gold Mine. Pancon's 100%-owned, 673 hectare Jefferson Gold Project is continuous with and mostly surrounds the 389 hectare Brewer property. In January 2023, the Company announced exclusive mineral exploration lease and purchase option agreements for both the 246.6 hectare  New Sawyer Gold Mine Property and the 54.6 hectare Sawyer Gold Mine Property, both located on the Sawyer Gold Trend and in Randolph County, North Carolina. For further information, please contact: Jeanny So, External Relations Manager E: info@panconresources.com T: +1.647.202.0994 For additional information please visit our new website at http://www.panconresources.com/ and our Twitter feed: @PanconResources . Neither TSX Venture Exchange nor its Regulation Services Provider (as that term is defined in the policies of the TSX Venture Exchange) accepts responsibility for the adequacy or accuracy of this release. This news release contains forward-looking information which is not comprised of historical facts. Forward-looking information is characterized by words such as \"plan\", \"expect\", \"project\", \"intend\", \"believe\", \"anticipate\", \"estimate\" and other similar words, or statements that certain events or conditions \"may\" or \"will\" occur. Forward-looking information involves risks, uncertainties and other factors that could cause actual events, results, and opportunities to differ materially from those expressed or implied by such forward-looking information. Factors that could cause actual results to differ materially from such forward-looking information include, but are not limited to, changes in the state of equity and debt markets, fluctuations in commodity prices, delays in obtaining required regulatory or governmental approvals, and other risks involved in the mineral exploration and development industry, including those risks set out in the Company's management's discussion and analysis as filed under the Company's profile at www.sedar.com . Forward-looking information in this news release is based on the opinions and assumptions of management considered reasonable as of the date hereof, including that all necessary governmental and regulatory approvals will be received as and when expected. Although the Company believes that the assumptions and factors used in preparing the forward-looking information in this news release are reasonable, undue reliance should not be placed on such information. The Company disclaims any intention or obligation to update or revise any forward-looking information, other than as required by applicable securities laws. To view the source version of this press release, please visit https://www.newsfilecorp.com/release/153089",
    "primary_commodity": "Au"
  },
  "articleProject": {
    "gid": 3983,
    "project_name": "Sawyer",
    "location": "North Carolina, United States"
  },
  "articleExchange": "TSXV",
  "articleCompanyId": 1622,
  "articleTicker": "RUSH",
  "articleCompanyName": "Carolina Rush Corporation",
  "allOtherCompanyProjects": [
    {
      "company_id": 1622,
      "gid": 2853,
      "project_name": "Brewer",
      "location": "South Carolina, United States"
    },
    {
      "company_id": 1622,
      "gid": 3983,
      "project_name": "Sawyer",
      "location": "North Carolina, United States"
    }
  ],
  "allOtherCompanyNews": [
    {
      "id": 103309,
      "company_id": 1622,
      "title": "Carolina Rush Announces Filing of Maiden Mineral Resource Technical Report for Brewer Gold-Copper Project",
      "link": null,
      "date": "2025-05-02T18:10:00.000Z",
      "hidden": false
    },
    {
      "id": 101814,
      "company_id": 1622,
      "title": "Carolina Rush Identifies Compelling Porphyry Drill Targets from Deep-Sensing MT-IP Geophysical Survey at Brewer Gold-Copper Project",
      "link": null,
      "date": "2025-04-28T10:30:00.000Z",
      "hidden": false
    },
    {
      "id": 91920,
      "company_id": 1622,
      "title": "Carolina Rush Reports Maiden Mineral Resource Estimate for Brewer Gold-Copper Project, South Carolina, USA",
      "link": null,
      "date": "2025-03-20T10:30:00.000Z",
      "hidden": false
    },
    {
      "id": 88117,
      "company_id": 1622,
      "title": "Carolina Rush Provides Exploration Update on Brewer Gold-Copper Project",
      "link": "https://www.newsfilecorp.com/release/241012/Carolina-Rush-Provides-Exploration-Update-on-Brewer-GoldCopper-Project",
      "date": "2025-02-18T11:30:00.000Z",
      "hidden": false
    },
    {
      "id": 84853,
      "company_id": 1622,
      "title": "Carolina Rush Reports Elevated Molybdenum in Deepest Hole Drilled at Brewer, Samples up to 1,320 ppm Mo",
      "link": "https://www.newsfilecorp.com/release/238019/Carolina-Rush-Reports-Elevated-Molybdenum-in-Deepest-Hole-Drilled-at-Brewer-Samples-up-to-1320-ppm-Mo",
      "date": "2025-01-22T11:30:00.000Z",
      "hidden": false
    },
    {
      "id": 81028,
      "company_id": 1622,
      "title": "Carolina Rush Intersects 206 m @ 0.66 g/t Au, Extends Tanyard Breccia Zone at Brewer",
      "link": "https://www.newsfilecorp.com/release/232526/Carolina-Rush-Intersects-206-m-0.66-gt-Au-Extends-Tanyard-Breccia-Zone-at-Brewer",
      "date": "2024-12-05T11:30:00.000Z",
      "hidden": false
    },
    {
      "id": 75345,
      "company_id": 1622,
      "title": "Carolina Rush Intersects 61 m @ 1.7 g/t Au and 0.3% Cu including 10.6 m @ 4.4 g/t Au and 1% Cu at Brewer",
      "link": "https://www.newsfilecorp.com/release/227155/Carolina-Rush-Intersects-61-m-1.7-gt-Au-and-0.3-Cu-including-10.6-m-4.4-gt-Au-and-1-Cu-at-Brewer",
      "date": "2024-10-21T10:30:00.000Z",
      "hidden": false
    },
    {
      "id": 103039,
      "company_id": 1622,
      "title": "Carolina Rush Reports Promising Results from Brewer Gold and Copper Project Drilling",
      "link": "https://app.quotemedia.com/data/downloadFiling?webmasterId=104408&ref=67163a423749450c2971024b&type=PDFC&formType=002-002-001089-003001&formDescription=News+release&dateFiled=2024-10-21",
      "date": "2024-10-21T04:25:54.000Z",
      "hidden": false
    },
    {
      "id": 69417,
      "company_id": 1622,
      "title": "Carolina Rush Resumes Drilling at Brewer Gold-Copper Project",
      "link": "https://www.newsfilecorp.com/release/221210/Carolina-Rush-Resumes-Drilling-at-Brewer-GoldCopper-Project",
      "date": "2024-08-27T10:30:00.000Z",
      "hidden": false
    },
    {
      "id": 66713,
      "company_id": 1622,
      "title": "Carolina Rush Expands Tanyard Breccia with Three Holes Including 50.0 m @ 1.0 g/t Au Including 11.2 m @ 1.8 g/t Au",
      "link": "https://www.newsfilecorp.com/release/218136/Carolina-Rush-Expands-Tanyard-Breccia-with-Three-Holes-Including-50.0-m-1.0-gt-Au-Including-11.2-m-1.8-gt-Au",
      "date": "2024-07-30T10:30:00.000Z",
      "hidden": false
    }
  ]
}
