{
  "article": {
    "id": 31885,
    "link": "http://www.businesswire.com/news/home/20230228006338/en/Arizona-Sonoran-Purchases-Contiguous-MainSpring-Property-Providing-Additional-Planning-Flexibility-for-the-PFS/?feedref=JjAwJuNHiystnCoBq_hl-WM0HSwaiJOV4ew37VhmA-V_AFChGO3y0nEP3RiLje9i7fxFuNFTHSunhvli30RlBNXya2izy9YOgHlBiZQk2LP6oD-t3eB0qV-nJQ-WeFyC2oJ72yfyvUvvaxllIYV0HQ==",
    "title": "Arizona Sonoran Purchases Contiguous MainSpring Property Providing Additional Planning Flexibility for the PFS",
    "description": "\n        <p>CASA GRANDE, Ariz. &amp; TORONTO--(<span itemprop=\"provider publisher copyrightHolder\" itemscope=\"itemscope\" itemtype=\"https://schema.org/Organization\" itemid=\"https://www.businesswire.com\"><span itemprop=\"name\"><a referrerpolicy=\"unsafe-url\" rel=\"nofollow\" itemprop=\"url\" href=\"https://www.businesswire.com/\">BUSINESS WIRE</a></span></span>)--<b>Arizona Sonoran Copper Company Inc.</b> (TSX:ASCU | OTCQX:ASCUF) (“ASCU” or the “Company”), an emerging US-based copper developer and near-term producer, is pleased to announce that it has entered into a purchase and sale agreement (“PSA”) in respect of the MainSpring property, 523 acres of private land immediately south of the Parks/Salyer project and east of the mine access road (the “MainSpring Property”). The total increased land position of the combined Cactus and Parks/Salyer project is expected to be 5,368 acres, up from 4,845 acres. As a result, operational flexibility significantly improves with regards to planning requirements for the re-scoped pre-feasibility study (“PFS”) (see <a referrerpolicy=\"unsafe-url\" target=\"_blank\" href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=https%3A%2F%2Farizonasonoran.com%2Fprojects%2Fcactus-mine-project%2Fpress-release-images%2F&amp;esheet=53353714&amp;newsitemid=20230228006338&amp;lan=en-US&amp;anchor=FIGURE+1&amp;index=1&amp;md5=ef7184a6302c73746d574ad6479801fe\" rel=\"nofollow\" shape=\"rect\"><b>FIGURE 1</b></a>).\n</p><p>\n<b>George Ogilvie, Arizona Sonoran President and CEO stated</b>, “As we continue to progress towards the design, engineering and infrastructure layout phases of the study, the MainSpring Property provides the Company with strategic alternatives to plan and optimize the re-scoped PFS. Specifically, the additional land allows for optimization within production scenarios being reviewed at Parks/Salyer and further flexibility in a potential Nuton scenario, thus allowing consideration of the most value accretive proposition for shareholders.”\n</p><p>\n<b>Key Terms of the PSA</b>\n</p><p>\nCactus 110 LLC (a group company of ASCU) has entered into a purchase and sale agreement in respect of certain parcels of real property situated in Pinal County comprising of approximately 523 acres. The total purchase price for the property is US$14 million to be paid as below:\n</p><ul class=\"bwlistdisc\">\n<li>\nPayment of a US$1 million non-refundable deposit into an escrow account at the time of signing of the agreement;\n</li>\n<li>\nPayment of US$2 million on or prior to the expiry of the PSA Due Diligence date (such date being 5 months (subject to one month’s extension at the option of ASCU) into escrow;\n</li>\n<li>\nPayment of US$5 million one year from the effective date (being the signing date of the PSA) (“Closing Date”). Title is then transferred to Cactus 110 LLC;\n</li>\n<li>\nPayment of US$6 million together with accrued interest at 6% per annum, within 1 year from the Closing Date secured by way of a promissory note and deed of trust on the subject property. The promissory note may be repaid at any time prior to maturity with no penalties following which the deed of trust will be released.\n</li>\n</ul><p>\nThe agreements also include customary terms and conditions as applicable to transactions of a similar nature.\n</p><p>\nThe MainSpring Property demonstrates exploration upside contiguous to the Parks/Salyer project and may be the subject of future work programs for the Company. However, in the medium term, the Company’s focus remains on mine planning and engineering required for the upcoming PFS incorporating the existing Parks/Salyer and Cactus resource base.\n</p><p>\nPermitting activities will be directed to the State and County levels in a similar process to owning private land.\n</p><p>\nTechnical aspects of this news release have been reviewed and verified by Allan Schappert – CPG #11758, who is a qualified person as defined by National Instrument 43-101– Standards of Disclosure for Mineral Projects.\n</p><p>\n<strong>Links: </strong><a referrerpolicy=\"unsafe-url\" target=\"_blank\" href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=https%3A%2F%2Farizonasonoran.com%2Fprojects%2Fcactus-mine-project%2Fpress-release-images%2F&amp;esheet=53353714&amp;newsitemid=20230228006338&amp;lan=en-US&amp;anchor=https%3A%2F%2Farizonasonoran.com%2Fprojects%2Fcactus-mine-project%2Fpress-release-images%2F&amp;index=2&amp;md5=87b14dbb023cd754244dc3c5de0e1301\" rel=\"nofollow\" shape=\"rect\">https://arizonasonoran.com/projects/cactus-mine-project/press-release-images/</a>\n</p><p>\n<i>Neither the TSX nor the regulating authority has approved or disproved the information contained in this press release.</i>\n</p><p>\n<strong>About Arizona Sonoran Copper Company (</strong><a referrerpolicy=\"unsafe-url\" target=\"_blank\" href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=http%3A%2F%2Fwww.arizonasonoran.com&amp;esheet=53353714&amp;newsitemid=20230228006338&amp;lan=en-US&amp;anchor=www.arizonasonoran.com&amp;index=3&amp;md5=e203ea969b3e50f05e3055c13306f8b6\" rel=\"nofollow\" shape=\"rect\">www.arizonasonoran.com</a><strong> | </strong><a referrerpolicy=\"unsafe-url\" target=\"_blank\" href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=http%3A%2F%2Fwww.cactusmine.com&amp;esheet=53353714&amp;newsitemid=20230228006338&amp;lan=en-US&amp;anchor=www.cactusmine.com&amp;index=4&amp;md5=652d89a1f06a35a942918c01af3d4d82\" rel=\"nofollow\" shape=\"rect\">www.cactusmine.com</a><strong>)</strong>\n</p><p>\nASCU’s objective is to become a mid-tier copper producer with low operating costs and to develop the Cactus and Parks/Salyer Projects that could generate robust returns for investors and provide a long term sustainable and responsible operation for the community and all stakeholders. The Company's principal asset is a 100% interest in the Cactus Project (former ASARCO, Sacaton mine) which is situated on private land in an infrastructure-rich area of Arizona. Contiguous to the Cactus Project is the Company’s 100%-owned Parks/Salyer deposit that could allow for a phased expansion of the Cactus Mine once it becomes a producing asset. The Company is led by an executive management team and Board which have a long-standing track record of successful project delivery in North America complemented by global capital markets expertise.\n</p><p>\n<b>Forward-Looking Statements</b>\n</p><p>\nForward-looking statements involve known and unknown risks, uncertainties and other factors which may cause the actual results, performance or achievements of ASCU to be materially different from any future results, performance or achievements expressed or implied by the forward-looking statements. Factors that could affect the outcome include, among others: future prices and the supply of metals; the results of drilling; inability to raise the money necessary to incur the expenditures required to retain and advance the properties; environmental liabilities (known and unknown); general business, economic, competitive, political and social uncertainties; results of exploration programs; accidents, labour disputes and other risks of the mining industry; political instability, terrorism, insurrection or war; or delays in obtaining governmental approvals, projected cash operating costs, failure to obtain regulatory or shareholder approvals.\n</p><p>\nAlthough ASCU has attempted to identify important factors that could cause actual actions, events or results to differ materially from those described in forward-looking statements, there may be other factors that cause actions, events or results to differ from those anticipated, estimated or intended. Forward-looking statements contained herein are made as of the date of this news release and ASCU disclaims any obligation to update any forward-looking statements, whether as a result of new information, future events or results or otherwise, except as required by applicable securities laws.\n</p>\n        \n      \n        \n          <h2>Contacts</h2>\n          <p>\n<b>For more information: \n</b><br>Alison Dwoskin, Director, Investor Relations\n<br>647-233-4348\n<br><a referrerpolicy=\"unsafe-url\" target=\"_blank\" href=\"mailto:adwoskin@arizonasonoran.com\" rel=\"nofollow\" shape=\"rect\">adwoskin@arizonasonoran.com \n</a><br>\n<br>George Ogilvie, President, CEO and Director\n<br>416-723-0458\n<br><a referrerpolicy=\"unsafe-url\" target=\"_blank\" href=\"mailto:gogilvie@arizonasonoran.com\" rel=\"nofollow\" shape=\"rect\">gogilvie@arizonasonoran.com</a>\n</p>\n        \n      ",
    "search_terms": "Parks/Salyer,Arizona Sonoran Copper Company Inc.,ASCU",
    "master_gid": 3101,
    "date": "2023-02-28T21:33:00.000Z",
    "tags": "USA|Arizona||Copper|Project Acquisition",
    "image_id": null,
    "hidden": false,
    "company_id": 1099,
    "provider": null,
    "excerpt": "CASA GRANDE, Ariz. &amp; TORONTO--(BUSINESS WIRE)--Arizona Sonoran Copper Company Inc.(TSX:ASCU | OTCQX:ASCUF) (“ASCU” or the “Company”), an emerging US-based copper developer and near-term producer, is pleased to announce that it has entered into a purchase and sale agreement (“PSA”) in respect of the MainSpring property, 523 acres of private land",
    "is_regulatory": false,
    "refined_tags": [
      "Project Acquisition"
    ],
    "ftp_filename": null,
    "company_name": "Arizona Sonoran Copper Company Inc.",
    "exchange": "TSX",
    "root_ticker": "ASCU",
    "project_name": "Parks/Salyer",
    "gid": 3101,
    "location": "Arizona, United States",
    "plan_id": null,
    "description_text": "CASA GRANDE, Ariz. & TORONTO--( BUSINESS WIRE )-- Arizona Sonoran Copper Company Inc. (TSX:ASCU | OTCQX:ASCUF) (“ASCU” or the “Company”), an emerging US-based copper developer and near-term producer, is pleased to announce that it has entered into a purchase and sale agreement (“PSA”) in respect of the MainSpring property, 523 acres of private land immediately south of the Parks/Salyer project and east of the mine access road (the “MainSpring Property”). The total increased land position of the combined Cactus and Parks/Salyer project is expected to be 5,368 acres, up from 4,845 acres. As a result, operational flexibility significantly improves with regards to planning requirements for the re-scoped pre-feasibility study (“PFS”) (see FIGURE 1 ). George Ogilvie, Arizona Sonoran President and CEO stated , “As we continue to progress towards the design, engineering and infrastructure layout phases of the study, the MainSpring Property provides the Company with strategic alternatives to plan and optimize the re-scoped PFS. Specifically, the additional land allows for optimization within production scenarios being reviewed at Parks/Salyer and further flexibility in a potential Nuton scenario, thus allowing consideration of the most value accretive proposition for shareholders.” Key Terms of the PSA Cactus 110 LLC (a group company of ASCU) has entered into a purchase and sale agreement in respect of certain parcels of real property situated in Pinal County comprising of approximately 523 acres. The total purchase price for the property is US$14 million to be paid as below: Payment of a US$1 million non-refundable deposit into an escrow account at the time of signing of the agreement; Payment of US$2 million on or prior to the expiry of the PSA Due Diligence date (such date being 5 months (subject to one month’s extension at the option of ASCU) into escrow; Payment of US$5 million one year from the effective date (being the signing date of the PSA) (“Closing Date”). Title is then transferred to Cactus 110 LLC; Payment of US$6 million together with accrued interest at 6% per annum, within 1 year from the Closing Date secured by way of a promissory note and deed of trust on the subject property. The promissory note may be repaid at any time prior to maturity with no penalties following which the deed of trust will be released. The agreements also include customary terms and conditions as applicable to transactions of a similar nature. The MainSpring Property demonstrates exploration upside contiguous to the Parks/Salyer project and may be the subject of future work programs for the Company. However, in the medium term, the Company’s focus remains on mine planning and engineering required for the upcoming PFS incorporating the existing Parks/Salyer and Cactus resource base. Permitting activities will be directed to the State and County levels in a similar process to owning private land. Technical aspects of this news release have been reviewed and verified by Allan Schappert – CPG #11758, who is a qualified person as defined by National Instrument 43-101– Standards of Disclosure for Mineral Projects. Links: https://arizonasonoran.com/projects/cactus-mine-project/press-release-images/ Neither the TSX nor the regulating authority has approved or disproved the information contained in this press release. About Arizona Sonoran Copper Company ( www.arizonasonoran.com | www.cactusmine.com ) ASCU’s objective is to become a mid-tier copper producer with low operating costs and to develop the Cactus and Parks/Salyer Projects that could generate robust returns for investors and provide a long term sustainable and responsible operation for the community and all stakeholders. The Company's principal asset is a 100% interest in the Cactus Project (former ASARCO, Sacaton mine) which is situated on private land in an infrastructure-rich area of Arizona. Contiguous to the Cactus Project is the Company’s 100%-owned Parks/Salyer deposit that could allow for a phased expansion of the Cactus Mine once it becomes a producing asset. The Company is led by an executive management team and Board which have a long-standing track record of successful project delivery in North America complemented by global capital markets expertise. Forward-Looking Statements Forward-looking statements involve known and unknown risks, uncertainties and other factors which may cause the actual results, performance or achievements of ASCU to be materially different from any future results, performance or achievements expressed or implied by the forward-looking statements. Factors that could affect the outcome include, among others: future prices and the supply of metals; the results of drilling; inability to raise the money necessary to incur the expenditures required to retain and advance the properties; environmental liabilities (known and unknown); general business, economic, competitive, political and social uncertainties; results of exploration programs; accidents, labour disputes and other risks of the mining industry; political instability, terrorism, insurrection or war; or delays in obtaining governmental approvals, projected cash operating costs, failure to obtain regulatory or shareholder approvals. Although ASCU has attempted to identify important factors that could cause actual actions, events or results to differ materially from those described in forward-looking statements, there may be other factors that cause actions, events or results to differ from those anticipated, estimated or intended. Forward-looking statements contained herein are made as of the date of this news release and ASCU disclaims any obligation to update any forward-looking statements, whether as a result of new information, future events or results or otherwise, except as required by applicable securities laws. Contacts For more information: Alison Dwoskin, Director, Investor Relations 647-233-4348 adwoskin@arizonasonoran.com George Ogilvie, President, CEO and Director 416-723-0458 gogilvie@arizonasonoran.com",
    "primary_commodity": "Cu"
  },
  "articleProject": {
    "gid": 3101,
    "project_name": "Parks/Salyer",
    "location": "Arizona, United States"
  },
  "articleExchange": "TSX",
  "articleCompanyId": 1099,
  "articleTicker": "ASCU",
  "articleCompanyName": "Arizona Sonoran Copper Company Inc.",
  "allOtherCompanyProjects": [
    {
      "company_id": 1099,
      "gid": 4083,
      "project_name": "Cactus",
      "location": "Arizona, United States"
    },
    {
      "company_id": 1099,
      "gid": 6489,
      "project_name": "Mainspring",
      "location": null
    },
    {
      "company_id": 1099,
      "gid": 3101,
      "project_name": "Parks/Salyer",
      "location": "Arizona, United States"
    }
  ],
  "allOtherCompanyNews": [
    {
      "id": 107972,
      "company_id": 1099,
      "title": "Arizona Sonoran Announces Filing of Final Short Form Prospectus in Connection With C$45,000,000 Bought Deal Financing",
      "link": null,
      "date": "2025-06-13T14:47:00.000Z",
      "hidden": false
    },
    {
      "id": 106629,
      "company_id": 1099,
      "title": "Arizona Sonoran Announces C$45 Million Bought Deal Public Offering of Common Shares",
      "link": null,
      "date": "2025-06-02T20:00:04.000Z",
      "hidden": false
    },
    {
      "id": -203095,
      "company_id": 1099,
      "title": "Canadian Investment Regulatory Organization Trading Halt - ASCU",
      "link": "https://contentapi.cision.com/api/v1.0/releases/20250602C0657",
      "date": "2025-06-02T19:59:00.000Z",
      "hidden": false
    },
    {
      "id": 106514,
      "company_id": 1099,
      "title": "Arizona Sonoran Appoints Hannam & Partners as Project Finance Advisor for the Cactus Project",
      "link": null,
      "date": "2025-06-02T10:30:00.000Z",
      "hidden": false
    },
    {
      "id": 103981,
      "company_id": 1099,
      "title": "Arizona Sonoran Updates on PFS Workstreams at the Cactus Project",
      "link": null,
      "date": "2025-05-08T10:30:00.000Z",
      "hidden": false
    },
    {
      "id": 89122,
      "company_id": 1099,
      "title": "Arizona Sonoran Reports the Southern Extension of the High-Grade Core at Parks/Salyer through Infill Drilling, including 391 m @ 0.74% Total Copper",
      "link": "https://golddiscovery.com/news/740574-ascuca-arizona-sonoran-reports-the-southern-extension-of-the-high-grade-core-at-parkssalyer-through-infill-drilling-including-391-m--074-total-copper/",
      "date": "2025-02-25T12:22:00.000Z",
      "hidden": false
    },
    {
      "id": 95529,
      "company_id": 1099,
      "title": "Arizona Sonoran Announces Royal Gold’s Purchase of Existing NSR on the Cactus Project",
      "link": "https://app.quotemedia.com/data/downloadFiling?webmasterId=104408&ref=67add9fee2edbb726f7b1f08&type=PDFC&formType=002-002-001089-003001&formDescription=News+release&dateFiled=2025-02-13",
      "date": "2025-02-13T11:39:42.000Z",
      "hidden": false
    },
    {
      "id": 86726,
      "company_id": 1099,
      "title": "Arizona Sonoran Provides 2024 Recap and 2025 Work Plan",
      "link": "http://www.businesswire.com/news/home/20250204240882/en/Arizona-Sonoran-Provides-2024-Recap-and-2025-Work-Plan/?feedref=JjAwJuNHiystnCoBq_hl-WM0HSwaiJOV4ew37VhmA-V_AFChGO3y0nEP3RiLje9i7fxFuNFTHSunhvli30RlBNXya2izy9YOgHlBiZQk2LP6oD-t3eB0qV-nJQ-WeFyC2oJ72yfyvUvvaxllIYV0HQ==",
      "date": "2025-02-04T11:34:00.000Z",
      "hidden": false
    },
    {
      "id": 86596,
      "company_id": 1099,
      "title": "Arizona Sonoran Adopts Shareholder Rights Plan",
      "link": "http://www.businesswire.com/news/home/20250203340441/en/Arizona-Sonoran-Adopts-Shareholder-Rights-Plan/?feedref=JjAwJuNHiystnCoBq_hl-WM0HSwaiJOV4ew37VhmA-V_AFChGO3y0nEP3RiLje9i7fxFuNFTHSunhvli30RlBNXya2izy9YOgHlBiZQk2LP6oD-t3eB0qV-nJQ-WeFyC2oJ72yfyvUvvaxllIYV0HQ==",
      "date": "2025-02-03T11:30:00.000Z",
      "hidden": false
    },
    {
      "id": 86380,
      "company_id": 1099,
      "title": "Arizona Sonoran Closes C$21.6 Million Private Placement with Hudbay and Nuton",
      "link": "http://www.businesswire.com/news/home/20250130804431/en/Arizona-Sonoran-Closes-C21.6-Million-Private-Placement-with-Hudbay-and-Nuton/?feedref=JjAwJuNHiystnCoBq_hl-WM0HSwaiJOV4ew37VhmA-V_AFChGO3y0nEP3RiLje9i7fxFuNFTHSunhvli30RlBNXya2izy9YOgHlBiZQk2LP6oD-t3eB0qV-nJQ-WeFyC2oJ72yfyvUvvaxllIYV0HQ==",
      "date": "2025-01-31T14:09:00.000Z",
      "hidden": false
    }
  ]
}
