{
  "article": {
    "id": 28912,
    "link": "http://www.businesswire.com/news/home/20221214005378/en/CORRECTING-and-REPLACING-Electra-Acquires-New-Cobalt-Project-and-Provides-Update-on-Exploration-Activities-in-Idaho/?feedref=JjAwJuNHiystnCoBq_hl-YChnX-dlxR7bnql9VXy9e4oA7YDyAkGYePCay1BFUHxrCOi9QzgjCezTS3Nw_X6kJUrpSBm-Hav1w-UkdSlG3koCCZWVwbUIkYolaj9FCMEuY882fGf0lt1RTkSC2Xm4A==",
    "title": "CORRECTING and REPLACING Electra Acquires New Cobalt Project and Provides Update on Exploration Activities in Idaho",
    "description": "\n        <p>TORONTO--(<span itemprop=\"provider publisher copyrightHolder\" itemscope=\"itemscope\" itemtype=\"https://schema.org/Organization\" itemid=\"https://www.businesswire.com\"><span itemprop=\"name\"><a referrerpolicy=\"unsafe-url\" rel=\"nofollow\" itemprop=\"url\" href=\"https://www.businesswire.com/\">BUSINESS WIRE</a></span></span>)--Please replace the release with the following corrected version due to revisions in the \"CAS Property\" section (second paragraph, last sentence) and \"Iron Creek and Ruby Drilling\" section (second paragraph). Please also replace image captions with the revised captions.\n</p>\n<blockquote><p id=\"pull-quote\"></p></blockquote>\n<p>\nThe updated release reads:\n</p><p class=\"bwalignc\">\n<b>ELECTRA ACQUIRES NEW COBALT PROJECT AND PROVIDES UPDATE ON EXPLORATION ACTIVITIES IN IDAHO</b>\n</p><p>\n<b>Electra Battery Materials Corporation (NASDAQ: ELBM; TSX-V: ELBM)</b> (“Electra” or the “Company”) today announced the acquisition of a cobalt property in proximity to the Company’s projects in Idaho and provided an update on exploration activities in the Idaho Cobalt Belt, home to the largest unmined cobalt resource in the U.S.\n</p><p>\n<b>Highlights</b>\n</p><ul class=\"bwlistdisc\">\n<li>\nOptioned a 5.3 km<sup>2 </sup>land package adjacent to the Iron Creek deposit with historic drilling highlights that include 6.25 metres at 0.51% cobalt and 7.5 ppm gold from 77.5 to 83.8 metres in historic drilling\n</li>\n<li>\nAdditional mineralization intercepted on the eastern extension of the Iron Creek resource area of 5.6 m at 0.25% cobalt in IC22-01 from 228.8 to 234.3 m.\n</li>\n<li>\nAdditional mineralization intercepted at the Ruby Target, 1.5 km southeast of the Iron Creek deposit, of 4.3 m at 0.25% cobalt in IC22-04 from 211.4 to 215.8 m\n</li>\n<li>\nPermitting underway for a 10-year, 92 drill pad plan of operations with the U.S. Department of Agriculture’s Forest Service (USFS) to conduct systematic exploration at the camp scale on Iron Creek, Ruby, CAS, and additional exploration targets within Electra’s 32.6 km<sup>2</sup> land package\n</li>\n</ul><p>\n“Sourcing domestic supply of cobalt has become even more critical with the passage of the Inflation Reduction Act,” said Trent Mell, Electra’s CEO. “While our primary focus continues to centre on the commissioning of North American’s first cobalt sulfate refinery and launching our battery materials recycling demonstration plant in the coming weeks, advancing exploration activities in the Idaho Cobalt Belt are key to our long-term growth and efforts to onshore the EV battery supply chain.”\n</p><p>\n<b>CAS Property</b>\n</p><p>\nFollowing the success of the 2022 field season, the Company concluded an option agreement to acquire the CAS property, a 5.3 square kilometer land package of lode mining claims adjacent to Electra’s Iron Creek deposit (Figure 1). The CAS property includes an outcropping mesothermal quartz vein swarm with cobalt and gold mineralization. Historic reports indicate 2,622 metres of drilling were completed in 19 holes. This historic drilling intercepted anomalous zones of gold and cobalt associated with the vein swarms with up to 6.25 m at 0.51% cobalt and 7.5 ppm gold from 77.5 to 83.8 metres. Material from historic drilling is no longer available for check assays and as these results cannot be verified by Electra, they cannot be relied upon at this time.\n</p><p>\nRights to CAS were acquired for US$1.5 million, payable over 10 years upon completion of specific milestones. The underlying claim owner will retain a 1.5% NSR purchasable by Electra for US$500,000 within 1 year of commercial production from the CAS property. Terms to acquire CAS were reached in March 2022 and formally ratified by Electra’s Board of Directors this week.\n</p><p>\nWith this latest transaction, Electra’s land package now covers 32.6 km2 of prospective property with known occurrences of cobalt, copper and gold. Combined with Electra’s Iron Creek and Ruby properties, the addition of CAS provides Electra with three significant areas of cobalt occurrences within close proximity to each other, with potential to expand the cobalt endowment of the camp.\n</p><div class=\"bwpagebreakafter\">\n</div><p>\n<b>Iron Creek and Ruby Drilling</b>\n</p><p>\nSignificant cobalt mineralization was intercepted in all drillholes completed by Electra in 2022 at both Iron Creek and Ruby. At Iron Creek, intercepts indicate that the Iron Creek system remains open to the east, and that the Ruby system remains open to the west (Figure 2). There is a possibility that Iron Creek and Ruby may be structurally dismembered portions of the same deposit. Given the potential upside that this would represent, additional exploration is warranted to explore the gap between the two target areas.\n</p><p>\nThe final drill assays from the 2022 season included 5.6 m at 0.25% cobalt in Iron Creek drill hole IC22-01 from 228.8 to 234.3 m as well as 4.3 m at 0.25% cobalt in Ruby drill hole IC22-04 from 211.4 to 215.8 m.\n</p><p>\nAll intercepts reported in this release are drilled thickness. True thickness is estimated at 50-65% of the reported intercept in IC22-01 and 65-95% of the reported intercept in IC22-04 based on the contact angle of the sulfide zones to the core axis. Cobalt intercepts are calculated using a 0.18% cobalt cutoff and allowing one sample interval of internal dilution. The Company has commissioned an independent engineering company to complete an updated 43-101 Technical Report on the project. The updated Report is expected in the first quarter of 2023.\n</p><div class=\"bwpagebreakafter\">\n</div><p>\n<b>Permitting Update</b>\n</p><p>\nThe Company is currently advancing permitting with the USFS for 92 drill pads encompassing Iron Creek, Ruby and CAS, which could be explored over a 10-year period. The permit scoping documents were published by the USFS for a 30-day public comment period, which commenced on November 24, 2022.\n</p><p>\n<b>About Iron Creek</b>\n</p><p>\nThe Iron Creek Project consists of mining patents and exploration claims over an area of 3,300 hectares covering the strike extent of strata hosting mineralization. Historic underground development at Iron Creek includes 600 metres of drifting from three adits. An all-weather road connects the property to a state highway and nearby towns, Challis and Salmon. Iron Creek is one of several cobalt-copper resources and prospects within the Idaho Cobalt Belt, a prospective mineralized system that contains the largest primary resources of cobalt in the United States, according to the U.S. Geological Survey. A corporate video of the Iron Creek Project is available at <a referrerpolicy=\"unsafe-url\" target=\"_blank\" href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=https%3A%2F%2Fyoutu.be%2FQGz9Ga0mqd8&amp;esheet=53062749&amp;newsitemid=20221214005378&amp;lan=en-US&amp;anchor=https%3A%2F%2Fyoutu.be%2FQGz9Ga0mqd8&amp;index=1&amp;md5=fed6f0f2b105cfea9c8c5728a813e093\" rel=\"nofollow\" shape=\"rect\">https://youtu.be/QGz9Ga0mqd8</a> and the Company’s social media sites.\n</p><p>\n<b>Quality Assurance and Quality Control</b>\n</p><p>\nBlanks, duplicates, and standards were inserted into the sample chain at the core processing site as part of the QA/QC program representing approximately 15% of the total samples analyzed. All samples were submitted to ALS laboratories in Twin Falls, Idaho by Company staff. Drill core samples are dried, weighed, crushed to 70% passing 2mm, split to 250g pulps crushed to 85% passing minus 75 microns. Samples from hole IC22-01 were dissolved with a sodium peroxide fusion with gravimetric dilution in glassless labware and analyzed using super trace methods via ICP-MS and ICP-AES. IC22-04 was dissolved with a four-acid digestion and analyzed by ICP-AES and ICP-MS.\n</p><p>\n<b>Qualified Person Statement</b>\n</p><p>\nDan Pace is a Registered Member of the Society for Mining, Metallurgy &amp; Exploration and is the Qualified Person as defined by National Instrument 43-101 who has reviewed and approved the contents of this news release. Mr. Pace is employed on a full-time basis as Principal Geologist for Electra.\n</p><p>\n<b>About Electra Battery Materials</b>\n</p><p>\nElectra is a processor of low-carbon, ethically-sourced battery materials. Currently commissioning North America’s only cobalt sulfate refinery, Electra is executing a multipronged strategy focused on onshoring the electric vehicle supply chain. Keys to its strategy are integrating black mass recycling and nickel sulfate production at Electra’s refinery located north of Toronto, advancing Iron Creek, its cobalt-copper exploration-stage project in the Idaho Cobalt Belt, and expanding cobalt sulfate processing into Bécancour, Quebec. For more information visit <a referrerpolicy=\"unsafe-url\" target=\"_blank\" href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=http%3A%2F%2Fwww.electrabmc.com&amp;esheet=53062749&amp;newsitemid=20221214005378&amp;lan=en-US&amp;anchor=www.electrabmc.com&amp;index=2&amp;md5=38ebc43b574de6a9922780000db154de\" rel=\"nofollow\" shape=\"rect\">www.electrabmc.com</a>.\n</p><div class=\"bwpagebreakafter\">\n</div><p>\n<i>Neither the TSX Venture Exchange nor its Regulation Services Provider (as that term is defined in policies of the TSX Venture Exchange) accepts responsibility for the adequacy or accuracy of this release.</i>\n</p><p>\n<b><i>Cautionary Note Regarding Estimates of Resources</i></b>\n</p><p>\n<i>Readers are cautioned that mineral resources are not economic mineral reserves and that the economic viability of resources that are not mineral reserves has not been demonstrated. The estimate of mineral resources may be materially affected by geology, environmental, permitting, legal, title, socio-political, marketing or other relevant issues. The mineral resource estimate is classified in accordance with the Canadian Institute of Mining, Metallurgy and Petroleum's (CIM) \"2014 CIM Definition Standards on Mineral Resources and Mineral Reserves\" incorporated by reference into NI 43-101. Under Canadian rules, estimates of inferred mineral resources may not form the basis of feasibility or pre-feasibility studies or economic studies except for a Preliminary Economic Assessment as defined under NI 43-101. Readers are cautioned not to assume that further work on the stated resources will lead to mineral reserves that can be mined economically. An Inferred Mineral Resource as defined by the CIM Standing Committee is \"that part of a Mineral Resource for which quantity and grade or quality are estimated on the basis of limited geological evidence and sampling. Geological evidence is sufficient to imply but not verify geological and grade or quality continuity. An Inferred Mineral Resource has a lower level of confidence than that applying to an Indicated Mineral Resource and must not be converted to a Mineral Reserve. It is reasonably expected that the majority of Inferred Mineral Resources could be upgraded to Indicated Mineral Resources with continued exploration. United States investors are cautioned that CIM and NI 43-101 standards for resource classification and public disclosure differ from the requirements of the U.S. Securities and Exchange Commission (SEC) and resource information contained in this news release may not be comparable to similar information disclosed by domestic United States companies subject to the SEC’s reporting and disclosure requirements.</i>\n</p><p>\n<b><i>Cautionary Note Regarding Forward-Looking Statements</i></b>\n</p><p>\n<i>This news release may contain forward-looking statements and forward-looking information (together, “forward-looking statements”) within the meaning of applicable securities laws and the United States Private Securities Litigation Reform Act of 1995. All statements, other than statements of historical facts, are forward-looking statements. Generally, forward-looking statements can be identified by the use of terminology such as “plans”, “expects', “estimates”, “intends”, “anticipates”, “believes” or variations of such words, or statements that certain actions, events or results “may”, “could”, “would”, “might”, “occur” or “be achieved”. Forward-looking statements involve risks, uncertainties and other factors that could cause actual results, performance, and opportunities to differ materially from those implied by such forward-looking statements. Factors that could cause actual results to differ materially from these forward-looking statements are set forth in the management discussion and analysis and other disclosures of risk factors for Electra, filed on SEDAR at <a referrerpolicy=\"unsafe-url\" target=\"_blank\" href=\"https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=http%3A%2F%2Fwww.sedar.com&amp;esheet=53062749&amp;newsitemid=20221214005378&amp;lan=en-US&amp;anchor=www.sedar.com&amp;index=3&amp;md5=a09c46d98117b373eab387e10905c9e2\" rel=\"nofollow\" shape=\"rect\">www.sedar.com</a>. Although Electra believes that the information and assumptions used in preparing the forward-looking statements are reasonable, undue reliance should not be placed on these statements, which only apply as of the date of this news release, and no assurance can be given that such events will occur in the disclosed times frames or at all. Except where required by applicable law, Electra disclaims any intention or obligation to update or revise any forward-looking statement, whether as a result of new information, future events or otherwise.</i>\n</p>\n        \n      \n        \n          <h2>Contacts</h2>\n          <p>\nJoe Racanelli\n<br>Vice President, Investor Relations\n<br><a referrerpolicy=\"unsafe-url\" target=\"_blank\" href=\"mailto:info@ElectraBMC.com\" rel=\"nofollow\" shape=\"rect\">info@ElectraBMC.com \n</a><br>1.416.900.3891\n</p>\n        \n      ",
    "search_terms": "Iron Creek,Electra Battery Materials Corporation,ELBM",
    "master_gid": 1094,
    "date": "2022-12-15T01:46:00.000Z",
    "tags": "USA|Idaho||Cobalt,Gold|Exploration update,Project Acquisition",
    "image_id": null,
    "hidden": false,
    "company_id": 319,
    "provider": null,
    "excerpt": "TORONTO--(BUSINESS WIRE)--Please replace the release with the following corrected version due to revisions in the \"CAS Property\" section (second paragraph, last sentence) and \"Iron Creek and Ruby Drilling\" section (second paragraph). Please also replace image captions with the revised captions.The updated release reads:ELECTRA ACQUIRES NEW COBALT PROJECT AND PROVIDES UPDATE",
    "is_regulatory": false,
    "refined_tags": [
      "Project Acquisition",
      "Exploration Update"
    ],
    "ftp_filename": null,
    "company_name": "Electra Battery Materials Corporation",
    "exchange": "TSXV",
    "root_ticker": "ELBM",
    "project_name": "Iron Creek",
    "gid": 1094,
    "location": "Idaho, United States",
    "plan_id": null,
    "description_text": "TORONTO--( BUSINESS WIRE )--Please replace the release with the following corrected version due to revisions in the \"CAS Property\" section (second paragraph, last sentence) and \"Iron Creek and Ruby Drilling\" section (second paragraph). Please also replace image captions with the revised captions. The updated release reads: ELECTRA ACQUIRES NEW COBALT PROJECT AND PROVIDES UPDATE ON EXPLORATION ACTIVITIES IN IDAHO Electra Battery Materials Corporation (NASDAQ: ELBM; TSX-V: ELBM) (“Electra” or the “Company”) today announced the acquisition of a cobalt property in proximity to the Company’s projects in Idaho and provided an update on exploration activities in the Idaho Cobalt Belt, home to the largest unmined cobalt resource in the U.S. Highlights Optioned a 5.3 km 2 land package adjacent to the Iron Creek deposit with historic drilling highlights that include 6.25 metres at 0.51% cobalt and 7.5 ppm gold from 77.5 to 83.8 metres in historic drilling Additional mineralization intercepted on the eastern extension of the Iron Creek resource area of 5.6 m at 0.25% cobalt in IC22-01 from 228.8 to 234.3 m. Additional mineralization intercepted at the Ruby Target, 1.5 km southeast of the Iron Creek deposit, of 4.3 m at 0.25% cobalt in IC22-04 from 211.4 to 215.8 m Permitting underway for a 10-year, 92 drill pad plan of operations with the U.S. Department of Agriculture’s Forest Service (USFS) to conduct systematic exploration at the camp scale on Iron Creek, Ruby, CAS, and additional exploration targets within Electra’s 32.6 km 2 land package “Sourcing domestic supply of cobalt has become even more critical with the passage of the Inflation Reduction Act,” said Trent Mell, Electra’s CEO. “While our primary focus continues to centre on the commissioning of North American’s first cobalt sulfate refinery and launching our battery materials recycling demonstration plant in the coming weeks, advancing exploration activities in the Idaho Cobalt Belt are key to our long-term growth and efforts to onshore the EV battery supply chain.” CAS Property Following the success of the 2022 field season, the Company concluded an option agreement to acquire the CAS property, a 5.3 square kilometer land package of lode mining claims adjacent to Electra’s Iron Creek deposit (Figure 1). The CAS property includes an outcropping mesothermal quartz vein swarm with cobalt and gold mineralization. Historic reports indicate 2,622 metres of drilling were completed in 19 holes. This historic drilling intercepted anomalous zones of gold and cobalt associated with the vein swarms with up to 6.25 m at 0.51% cobalt and 7.5 ppm gold from 77.5 to 83.8 metres. Material from historic drilling is no longer available for check assays and as these results cannot be verified by Electra, they cannot be relied upon at this time. Rights to CAS were acquired for US$1.5 million, payable over 10 years upon completion of specific milestones. The underlying claim owner will retain a 1.5% NSR purchasable by Electra for US$500,000 within 1 year of commercial production from the CAS property. Terms to acquire CAS were reached in March 2022 and formally ratified by Electra’s Board of Directors this week. With this latest transaction, Electra’s land package now covers 32.6 km2 of prospective property with known occurrences of cobalt, copper and gold. Combined with Electra’s Iron Creek and Ruby properties, the addition of CAS provides Electra with three significant areas of cobalt occurrences within close proximity to each other, with potential to expand the cobalt endowment of the camp. Iron Creek and Ruby Drilling Significant cobalt mineralization was intercepted in all drillholes completed by Electra in 2022 at both Iron Creek and Ruby. At Iron Creek, intercepts indicate that the Iron Creek system remains open to the east, and that the Ruby system remains open to the west (Figure 2). There is a possibility that Iron Creek and Ruby may be structurally dismembered portions of the same deposit. Given the potential upside that this would represent, additional exploration is warranted to explore the gap between the two target areas. The final drill assays from the 2022 season included 5.6 m at 0.25% cobalt in Iron Creek drill hole IC22-01 from 228.8 to 234.3 m as well as 4.3 m at 0.25% cobalt in Ruby drill hole IC22-04 from 211.4 to 215.8 m. All intercepts reported in this release are drilled thickness. True thickness is estimated at 50-65% of the reported intercept in IC22-01 and 65-95% of the reported intercept in IC22-04 based on the contact angle of the sulfide zones to the core axis. Cobalt intercepts are calculated using a 0.18% cobalt cutoff and allowing one sample interval of internal dilution. The Company has commissioned an independent engineering company to complete an updated 43-101 Technical Report on the project. The updated Report is expected in the first quarter of 2023. Permitting Update The Company is currently advancing permitting with the USFS for 92 drill pads encompassing Iron Creek, Ruby and CAS, which could be explored over a 10-year period. The permit scoping documents were published by the USFS for a 30-day public comment period, which commenced on November 24, 2022. About Iron Creek The Iron Creek Project consists of mining patents and exploration claims over an area of 3,300 hectares covering the strike extent of strata hosting mineralization. Historic underground development at Iron Creek includes 600 metres of drifting from three adits. An all-weather road connects the property to a state highway and nearby towns, Challis and Salmon. Iron Creek is one of several cobalt-copper resources and prospects within the Idaho Cobalt Belt, a prospective mineralized system that contains the largest primary resources of cobalt in the United States, according to the U.S. Geological Survey. A corporate video of the Iron Creek Project is available at https://youtu.be/QGz9Ga0mqd8 and the Company’s social media sites. Quality Assurance and Quality Control Blanks, duplicates, and standards were inserted into the sample chain at the core processing site as part of the QA/QC program representing approximately 15% of the total samples analyzed. All samples were submitted to ALS laboratories in Twin Falls, Idaho by Company staff. Drill core samples are dried, weighed, crushed to 70% passing 2mm, split to 250g pulps crushed to 85% passing minus 75 microns. Samples from hole IC22-01 were dissolved with a sodium peroxide fusion with gravimetric dilution in glassless labware and analyzed using super trace methods via ICP-MS and ICP-AES. IC22-04 was dissolved with a four-acid digestion and analyzed by ICP-AES and ICP-MS. Qualified Person Statement Dan Pace is a Registered Member of the Society for Mining, Metallurgy & Exploration and is the Qualified Person as defined by National Instrument 43-101 who has reviewed and approved the contents of this news release. Mr. Pace is employed on a full-time basis as Principal Geologist for Electra. About Electra Battery Materials Electra is a processor of low-carbon, ethically-sourced battery materials. Currently commissioning North America’s only cobalt sulfate refinery, Electra is executing a multipronged strategy focused on onshoring the electric vehicle supply chain. Keys to its strategy are integrating black mass recycling and nickel sulfate production at Electra’s refinery located north of Toronto, advancing Iron Creek, its cobalt-copper exploration-stage project in the Idaho Cobalt Belt, and expanding cobalt sulfate processing into Bécancour, Quebec. For more information visit www.electrabmc.com . Neither the TSX Venture Exchange nor its Regulation Services Provider (as that term is defined in policies of the TSX Venture Exchange) accepts responsibility for the adequacy or accuracy of this release. Cautionary Note Regarding Estimates of Resources Readers are cautioned that mineral resources are not economic mineral reserves and that the economic viability of resources that are not mineral reserves has not been demonstrated. The estimate of mineral resources may be materially affected by geology, environmental, permitting, legal, title, socio-political, marketing or other relevant issues. The mineral resource estimate is classified in accordance with the Canadian Institute of Mining, Metallurgy and Petroleum's (CIM) \"2014 CIM Definition Standards on Mineral Resources and Mineral Reserves\" incorporated by reference into NI 43-101. Under Canadian rules, estimates of inferred mineral resources may not form the basis of feasibility or pre-feasibility studies or economic studies except for a Preliminary Economic Assessment as defined under NI 43-101. Readers are cautioned not to assume that further work on the stated resources will lead to mineral reserves that can be mined economically. An Inferred Mineral Resource as defined by the CIM Standing Committee is \"that part of a Mineral Resource for which quantity and grade or quality are estimated on the basis of limited geological evidence and sampling. Geological evidence is sufficient to imply but not verify geological and grade or quality continuity. An Inferred Mineral Resource has a lower level of confidence than that applying to an Indicated Mineral Resource and must not be converted to a Mineral Reserve. It is reasonably expected that the majority of Inferred Mineral Resources could be upgraded to Indicated Mineral Resources with continued exploration. United States investors are cautioned that CIM and NI 43-101 standards for resource classification and public disclosure differ from the requirements of the U.S. Securities and Exchange Commission (SEC) and resource information contained in this news release may not be comparable to similar information disclosed by domestic United States companies subject to the SEC’s reporting and disclosure requirements. Cautionary Note Regarding Forward-Looking Statements This news release may contain forward-looking statements and forward-looking information (together, “forward-looking statements”) within the meaning of applicable securities laws and the United States Private Securities Litigation Reform Act of 1995. All statements, other than statements of historical facts, are forward-looking statements. Generally, forward-looking statements can be identified by the use of terminology such as “plans”, “expects', “estimates”, “intends”, “anticipates”, “believes” or variations of such words, or statements that certain actions, events or results “may”, “could”, “would”, “might”, “occur” or “be achieved”. Forward-looking statements involve risks, uncertainties and other factors that could cause actual results, performance, and opportunities to differ materially from those implied by such forward-looking statements. Factors that could cause actual results to differ materially from these forward-looking statements are set forth in the management discussion and analysis and other disclosures of risk factors for Electra, filed on SEDAR at www.sedar.com . Although Electra believes that the information and assumptions used in preparing the forward-looking statements are reasonable, undue reliance should not be placed on these statements, which only apply as of the date of this news release, and no assurance can be given that such events will occur in the disclosed times frames or at all. Except where required by applicable law, Electra disclaims any intention or obligation to update or revise any forward-looking statement, whether as a result of new information, future events or otherwise. Contacts Joe Racanelli Vice President, Investor Relations info@ElectraBMC.com 1.416.900.3891",
    "primary_commodity": "Co"
  },
  "articleProject": {
    "gid": 1094,
    "project_name": "Iron Creek",
    "location": "Idaho, United States"
  },
  "articleExchange": "TSXV",
  "articleCompanyId": 319,
  "articleTicker": "ELBM",
  "articleCompanyName": "Electra Battery Materials Corporation",
  "allOtherCompanyProjects": [
    {
      "company_id": 319,
      "gid": 9867,
      "project_name": "CAS",
      "location": "Idaho, United States"
    },
    {
      "company_id": 319,
      "gid": 9868,
      "project_name": "Ruby",
      "location": "Idaho, United States"
    },
    {
      "company_id": 319,
      "gid": 1094,
      "project_name": "Iron Creek",
      "location": "Idaho, United States"
    },
    {
      "company_id": 319,
      "gid": 8845,
      "project_name": "Temiskaming Shores Cobalt Refinery",
      "location": null
    }
  ],
  "allOtherCompanyNews": [
    {
      "id": -204334,
      "company_id": 319,
      "title": "Electra and Three Fires Group Advance Canada’s First Indigenous-Led Battery Recycling Venture",
      "link": null,
      "date": "2025-06-12T11:00:23.000Z",
      "hidden": false
    },
    {
      "id": 107078,
      "company_id": 319,
      "title": "Electra Completes Feasibility Level Study on Battery Recycling Facility",
      "link": null,
      "date": "2025-06-05T11:00:10.000Z",
      "hidden": false
    },
    {
      "id": 105348,
      "company_id": 319,
      "title": "Electra Welcomes Ontario’s $500M Fund to Boost Critical Minerals Processing and Bolster North American Supply Chains",
      "link": null,
      "date": "2025-05-21T11:00:00.000Z",
      "hidden": false
    },
    {
      "id": 104529,
      "company_id": 319,
      "title": "Electra Files First Quarter 2025 Financial Reports",
      "link": null,
      "date": "2025-05-13T21:00:21.000Z",
      "hidden": false
    },
    {
      "id": 99680,
      "company_id": 319,
      "title": "Electra Closes Final Tranche of Oversubscribed Private Placement",
      "link": null,
      "date": "2025-04-14T21:00:05.000Z",
      "hidden": false
    },
    {
      "id": 98700,
      "company_id": 319,
      "title": "Electra Closes First Tranche of Oversubscribed Private Placement",
      "link": null,
      "date": "2025-04-04T11:00:00.000Z",
      "hidden": false
    },
    {
      "id": 93039,
      "company_id": 319,
      "title": "Electra Provides Update on 2024 Activities and Files 2024 Financials",
      "link": null,
      "date": "2025-03-31T11:00:46.000Z",
      "hidden": false
    },
    {
      "id": 92353,
      "company_id": 319,
      "title": "Electra Confirms Private Placement is Fully Subscribed",
      "link": null,
      "date": "2025-03-25T11:00:30.000Z",
      "hidden": false
    },
    {
      "id": 92212,
      "company_id": 319,
      "title": "Electra Announces Non-Brokered Private Placement for up to US$3.5 Million",
      "link": null,
      "date": "2025-03-24T10:01:54.000Z",
      "hidden": false
    },
    {
      "id": 92211,
      "company_id": 319,
      "title": "Electra Advances Financing for North America’s Only Cobalt Sulfate Refinery",
      "link": null,
      "date": "2025-03-24T10:00:13.000Z",
      "hidden": false
    }
  ]
}
