{
  "article": {
    "id": 70636,
    "link": "https://contentapi.cision.com/api/v1.0/releases/20240908C7437",
    "title": "Getchell Gold Corp. Increases Claim Holdings at the Dixie Comstock Project, Nevada",
    "description": "\n\n<p><span class=\"legendSpanClass\"><span class=\"xn-location\">VANCOUVER, BC</span></span>, <span class=\"legendSpanClass\"><span class=\"xn-chron\">Sept. 8, 2024</span></span> /CNW/ - <b>Getchell Gold Corp. </b>(CSE: GTCH) (OTCQB: GGLDF) (FWB: GGA1) (\"<b>Getchell</b>\" or the \"<b>Company</b>\") is pleased to announce the staking of 16 unpatented mining claims at its Dixie Comstock project bringing the total number of claims to 44, covering 725 acres (293.5 hectares).</p>\n<p>The Dixie Comstock Mine (\"Dixie Comstock\" or the \"Project\") is a past small-scale producer of gold, located in <span class=\"xn-location\">Churchill County, Nevada</span>, 160 kms East of <span class=\"xn-location\">Reno</span> abutting the eastern flank of the Stillwater Range in Dixie Valley.  Dixie Comstock is a low-sulfidation, epithermal gold system localized along a moderately east-dipping range-front normal fault.  Multiple episodes of gold bearing fluids have produced a <span class=\"xn-money\">100m</span> thick, shallowly dipping to the East, zone of mineralization that exhibits high-grade structurally controlled zones as well as an overall lower grade stockwork forming a rather consistent halo of mineralization.</p>\n<p>Gold was discovered at Dixie Comstock in 1935 with the majority of the historic development and mining taking place in the intervening years through to 1942 when mining activities were halted by an order issued by the War Production Board requiring all non-essential gold mines to cease production.  Through this period four mining levels, vertical shafts, and 200-foot decline were developed and a flotation circuit mill with a cyanide plant constructed.  Cumulative production was reported as having 17,880 tons of ore mined at a 0.8 ounces per ton (\"opt\") Au equivalent grade with recoveries of 4,182 ounces of Au and 6,737 ounces of Ag.   </p>\n<p>Sporadic activity occurred between 1952 and 1975 culminating in the select mining and shipping of 86 tons of material grading 2.3 opt Au to the ASARCO smelter that produced 172 ounces of Au equating to recoveries of 87%.  At the end of this period, all production occurred within 100 feet of surface.</p>\n<p>From 1982 through to 1991 various operators completed 64,563 feet of drilling, consisting of 179 reverse circulation, core, and rotary drill holes, with an average spacing of 50-70 feet.  Drilling has delineated a well mineralized zone trending <span class=\"xn-money\">300m</span> NNE, approximately <span class=\"xn-money\">100m</span> thick, that has been traced for <span class=\"xn-money\">200m</span> down dip (Figure 1).  The mineralization remains open down dip to the East (Figure 2).</p>\n<div class=\"PRN_ImbeddedAssetReference\" id=\"DivAssetPlaceHolder9965\"><p><a href=\"https://mma.prnewswire.com/media/2499407/Getchell_Gold_Corp__Getchell_Gold_Corp__Increases_Claim_Holdings.html\" rel=\"nofollow\" target=\"_blank\"><img alt=\"Table 1:  Highlighted Drill Hole Composites (Sample cutoff at &gt;0.25 g/t Au) (CNW Group/Getchell Gold Corp.)\" src=\"https://mma.prnewswire.com/media/2499407/Getchell_Gold_Corp__Getchell_Gold_Corp__Increases_Claim_Holdings.jpg?p=original\" title=\"Table 1:  Highlighted Drill Hole Composites (Sample cutoff at &gt;0.25 g/t Au) (CNW Group/Getchell Gold Corp.)\"></img></a></p>\n</div><div class=\"PRN_ImbeddedAssetReference\" id=\"DivAssetPlaceHolder9938\"><p><a href=\"https://mma.prnewswire.com/media/2499408/Getchell_Gold_Corp__Getchell_Gold_Corp__Increases_Claim_Holdings.html\" rel=\"nofollow\" target=\"_blank\"><img alt=\"Figure 1: Dixie Comstock gold project claim boundary and drill hole location map showing grade x thickness (CNW Group/Getchell Gold Corp.)\" src=\"https://mma.prnewswire.com/media/2499408/Getchell_Gold_Corp__Getchell_Gold_Corp__Increases_Claim_Holdings.jpg?p=original\" title=\"Figure 1: Dixie Comstock gold project claim boundary and drill hole location map showing grade x thickness (CNW Group/Getchell Gold Corp.)\"></img></a></p>\n</div><div class=\"PRN_ImbeddedAssetReference\" id=\"DivAssetPlaceHolder7366\"><p><a href=\"https://mma.prnewswire.com/media/2499410/Getchell_Gold_Corp__Getchell_Gold_Corp__Increases_Claim_Holdings.html\" rel=\"nofollow\" target=\"_blank\"><img alt=\"Figure 2: Dixie Comstock Mine 50m wide section showing lithology, drill hole sample grades, and shallowly dipping gold zone. (CNW Group/Getchell Gold Corp.)\" src=\"https://mma.prnewswire.com/media/2499410/Getchell_Gold_Corp__Getchell_Gold_Corp__Increases_Claim_Holdings.jpg?p=original\" title=\"Figure 2: Dixie Comstock Mine 50m wide section showing lithology, drill hole sample grades, and shallowly dipping gold zone. (CNW Group/Getchell Gold Corp.)\"></img></a></p>\n</div><p>Following the 1990 drill program, Mine Development Associates Inc. (\"MDA\") of <span class=\"xn-location\">Reno, Nevada</span>, was retained to review and model the data with the objective of generating a mineral resource estimate and mine model.  In <span class=\"xn-chron\">March 1991</span>, MDA produced a technical report titled \"Geologic &amp; Mineable Reserve Study on the Dixie Comstock Property, <span class=\"xn-location\">Churchill County, Nevada</span>, USA\" (the \"1991 MDA Study\") in which the following was estimated (Table 2):</p>\n<div class=\"PRN_ImbeddedAssetReference\" id=\"DivAssetPlaceHolder1461\"><p><a href=\"https://mma.prnewswire.com/media/2499406/Getchell_Gold_Corp__Getchell_Gold_Corp__Increases_Claim_Holdings.html\" rel=\"nofollow\" target=\"_blank\"><img alt=\"Table 2: Historic Geologic Resources* (CNW Group/Getchell Gold Corp.)\" src=\"https://mma.prnewswire.com/media/2499406/Getchell_Gold_Corp__Getchell_Gold_Corp__Increases_Claim_Holdings.jpg?p=original\" title=\"Table 2: Historic Geologic Resources* (CNW Group/Getchell Gold Corp.)\"></img></a></p>\n</div><p>MDA progressed to estimate a [Historic] mineable resource* (presented in Table 3), open pit mine model (Figure 3), and pit production schedule.</p>\n<div class=\"PRN_ImbeddedAssetReference\" id=\"DivAssetPlaceHolder3802\"><p><a href=\"https://mma.prnewswire.com/media/2499405/Getchell_Gold_Corp__Getchell_Gold_Corp__Increases_Claim_Holdings.html\" rel=\"nofollow\" target=\"_blank\"><img alt=\"Table 3: Historic Mineable Resources* (CNW Group/Getchell Gold Corp.)\" src=\"https://mma.prnewswire.com/media/2499405/Getchell_Gold_Corp__Getchell_Gold_Corp__Increases_Claim_Holdings.jpg?p=original\" title=\"Table 3: Historic Mineable Resources* (CNW Group/Getchell Gold Corp.)\"></img></a></p>\n</div><p>* These estimates are considered historical in accordance with NI 43-101.  A qualified person has not done sufficient work to classify the historical estimates as current mineral resources or mineral reserves, and the issuer is not treating the historical estimates as current mineral resources or mineral reserves.  The issuer cautions the reader and directs the reader below to important disclosure regarding the historical estimates.</p>\n<p>The open pit mine model was designed using a 50° overall slope angle for the main Gabbro host rock unit and a 45° overall slope angle for Hot Springs and the Alluvium.  The pit was designed with 20-foot benches and a catch bench every 40 feet. A cutoff grade of 0.010 opt was used to obtain mineable reserves.  A life-of-mine schedule was generated at a mining rate of 90,000 tons of ore and 285,000 tons of waste per month translating to a mine life of 28 months.</p>\n<p>One of the primary factors underlining the reason that the commissioning of the Dixie Comstock Mine did not proceed was due to the presence of a Wilderness Survey Area (\"WSA\") partially overlying the Project, constraining development and negatively impacting the economics.  The WSA has been subsequently released, in <span class=\"xn-chron\">Dec. 2022</span>, completely removing the barrier and opening the greater area to mining and development.</p>\n<p>There has been no attempt to develop the Dixie Comstock Mine since 1991 (over 30 years) and the Project provides an excellent opportunity waiting to be realized.</p>\n<p><span class=\"xn-person\">Scott Frostad</span>, P.Geo., is non-independent and the Qualified Person (as defined in NI 43-101) who reviewed and approved the content and scientific and technical information in the news release.</p>\n<div class=\"PRN_ImbeddedAssetReference\" id=\"DivAssetPlaceHolder4583\"><p><a href=\"https://mma.prnewswire.com/media/2499409/Getchell_Gold_Corp__Getchell_Gold_Corp__Increases_Claim_Holdings.html\" rel=\"nofollow\" target=\"_blank\"><img alt=\"Figure 3: Dixie Comstock drill hole location map showing MDA’s 1991 open pit mine model (CNW Group/Getchell Gold Corp.)\" src=\"https://mma.prnewswire.com/media/2499409/Getchell_Gold_Corp__Getchell_Gold_Corp__Increases_Claim_Holdings.jpg?p=original\" title=\"Figure 3: Dixie Comstock drill hole location map showing MDA’s 1991 open pit mine model (CNW Group/Getchell Gold Corp.)\"></img></a></p>\n</div><p><b>Corporate</b></p>\n<p>The Company further announces the resignation of <span class=\"xn-person\">Bill Wagener</span> as CEO and Director of the Company.</p>\n<p><span class=\"xn-person\">Bill Wagener</span> has fully dedicated himself, over the last decade, to the operations and success of the Company.  He was instrumental in acquiring the rights to the Company's flagship project, the Fondaway Canyon advanced exploration stage gold project, and stewarding the incredible exploration success and growth of the asset during the latter part of his tenure.</p>\n<p>Regrettably, due to personal obligations, Bill has determined the need to curtail his full-time responsibilities and is stepping down as CEO and Director of the Company.  Bill will remain involved in the operations of the Company, albeit to a lesser extent, providing his services on a consultancy basis.</p>\n<p>\"Bill is highly respected, and his commitment and devotion have left a palpable impression on the Company and anyone who has had the fortune to do business with him.  I thank him for his years of service and thoroughly appreciate that Bill will remain involved with the Company to provide valuable continuity to the operations and administration.\" stated <span class=\"xn-person\">Bob Bass</span>, Chairman.</p>\n<p>\"I have been with Getchell Gold Corp. since its inception, and it is with a heavy but necessary heart that I have made this decision to step down as CEO.  I know that the Company has been left in good hands and look forward to what the future holds.\" stated Bill Wagener    </p>\n<p><b>About Getchell Gold Corp.</b></p>\n<p>The Company is a <span class=\"xn-location\">Nevada</span> focused gold and copper exploration company trading on the CSE: GTCH, OTCQB: GGLDF, and FWB: GGA1.   <span class=\"xn-person\">Getchell Gold</span> is primarily directing its efforts on its most advanced stage asset, Fondaway Canyon, a past gold producer with a large mineral resource estimate.  Complementing Getchell's asset portfolio is Dixie Comstock, a past gold producer with a historic resource and two earlier stage exploration projects, Star (Cu-Au-Ag) and Hot Springs Peak (Au).</p>\n<p>For further information please visit the Company's website at <u><a href=\"https://c212.net/c/link/?t=0&amp;l=en&amp;o=4249359-1&amp;h=2618073901&amp;u=http%3A%2F%2Fwww.getchellgold.com%2F&amp;a=www.getchellgold.com\" rel=\"nofollow\" target=\"_blank\">www.getchellgold.com</a></u> or contact the Company at <u><a href=\"mailto:info@getchellgold.com\" rel=\"nofollow\" target=\"_blank\">info@getchellgold.com</a></u>.</p>\n<div class=\"PRN_ImbeddedAssetReference\" id=\"DivAssetPlaceHolder3436\"><p><a href=\"https://mma.prnewswire.com/media/2499411/Getchell_Gold_Corp__Getchell_Gold_Corp__Increases_Claim_Holdings.html\" rel=\"nofollow\" target=\"_blank\"><img alt=\"Disclosure of Historical Estimates - Dixie Comstock Mine (CNW Group/Getchell Gold Corp.)\" src=\"https://mma.prnewswire.com/media/2499411/Getchell_Gold_Corp__Getchell_Gold_Corp__Increases_Claim_Holdings.jpg?p=original\" title=\"Disclosure of Historical Estimates - Dixie Comstock Mine (CNW Group/Getchell Gold Corp.)\"></img></a></p>\n</div><p><i>The Canadian Securities Exchange has not reviewed this press release and does not accept responsibility for the adequacy or accuracy of this news release.  </i></p>\n<p><i>Certain information contained herein constitutes \"forward-looking information\" under Canadian securities legislation. Forward-looking information includes, but is not limited to, statements with respect to the timing and execution of exploration or development at the Dixie Comstock Mine.  Generally, forward-looking information can be identified by the use of forward-looking terminology such as \"will\" or variations of such words and phrases or statements that certain actions, events or results \"will\" occur.  Forward-looking statements are based on the opinions and estimates of management as of the date such statements are made, and they are subject to known and unknown risks, uncertainties and other factors that may cause the actual results to be materially different from those expressed or implied by such forward-looking statements or forward-looking information. Although management of Getchell have attempted to identify important factors that could cause actual results to differ materially from those contained in forward-looking statements or forward-looking information, there may be other factors that cause results not to be as anticipated, estimated or intended.  There can be no assurance that such statements will prove to be accurate, as actual results and future events could differ materially from those anticipated in such statements.  Accordingly, readers should not place undue reliance on forward-looking statements and forward-looking information.  The Company will not update any forward-looking statements or forward-looking information that are incorporated by reference herein, except as required by applicable securities laws.</i></p>\n\n<div class=\"PRN_ImbeddedAssetReference\" id=\"DivAssetPlaceHolder0\">\n                    <p>\n                            <a href=\"https://mma.prnewswire.com/media/2499412/Getchell_Gold_Corp__Getchell_Gold_Corp__Increases_Claim_Holdings.html\" rel=\"nofollow\" target=\"_blank\">\n                        <img alt=\"Getchell Gold Corp. logo (CNW Group/Getchell Gold Corp.)\" src=\"https://mma.prnewswire.com/media/2499412/Getchell_Gold_Corp__Getchell_Gold_Corp__Increases_Claim_Holdings.jpg\" title=\"Getchell Gold Corp. logo (CNW Group/Getchell Gold Corp.)\"></img>\n                            </a>\n                    </p>\n\n</div>\n<p>SOURCE  Getchell Gold Corp.</p>\n<img alt=\"\" src=\"https://rt.newswire.ca/rt.gif?NewsItemId=C7437&amp;Transmission_Id=202409082100CANADANWCANADAPR_C7437&amp;DateId=20240908\" style=\"border:0px; width:1px; height:1px;\"></img>\n\n",
    "search_terms": "Dixie Comstock,Getchell Gold Corp.,GTCH",
    "master_gid": 5213,
    "date": "2024-09-09T01:00:00.000Z",
    "tags": "USA|Nevada||Gold|Project Acquisition",
    "image_id": null,
    "hidden": false,
    "company_id": 110,
    "provider": "cision",
    "excerpt": "VANCOUVER, BC,Sept. 8, 2024/CNW/ -Getchell Gold Corp.(CSE: GTCH) (OTCQB: GGLDF) (FWB: GGA1) (\"Getchell\" or the \"Company\") is pleased to announce the staking of 16 unpatented mining claims at its Dixie Comstock project bringing the total number of claims to 44, covering 725 acres (293.5 hectares).The Dixie Comstock Mine (\"Dixie Comstock\"",
    "is_regulatory": false,
    "refined_tags": [],
    "ftp_filename": null,
    "company_name": "Getchell Gold Corp.",
    "exchange": "CSE",
    "root_ticker": "GTCH",
    "project_name": "Dixie Comstock",
    "gid": 5213,
    "location": "Nevada, United States",
    "plan_id": null,
    "description_text": "VANCOUVER, BC , Sept. 8, 2024 /CNW/ - Getchell Gold Corp. (CSE: GTCH) (OTCQB: GGLDF) (FWB: GGA1) (\" Getchell \" or the \" Company \") is pleased to announce the staking of 16 unpatented mining claims at its Dixie Comstock project bringing the total number of claims to 44, covering 725 acres (293.5 hectares). The Dixie Comstock Mine (\"Dixie Comstock\" or the \"Project\") is a past small-scale producer of gold, located in Churchill County, Nevada , 160 kms East of Reno abutting the eastern flank of the Stillwater Range in Dixie Valley.  Dixie Comstock is a low-sulfidation, epithermal gold system localized along a moderately east-dipping range-front normal fault.  Multiple episodes of gold bearing fluids have produced a 100m thick, shallowly dipping to the East, zone of mineralization that exhibits high-grade structurally controlled zones as well as an overall lower grade stockwork forming a rather consistent halo of mineralization. Gold was discovered at Dixie Comstock in 1935 with the majority of the historic development and mining taking place in the intervening years through to 1942 when mining activities were halted by an order issued by the War Production Board requiring all non-essential gold mines to cease production.  Through this period four mining levels, vertical shafts, and 200-foot decline were developed and a flotation circuit mill with a cyanide plant constructed.  Cumulative production was reported as having 17,880 tons of ore mined at a 0.8 ounces per ton (\"opt\") Au equivalent grade with recoveries of 4,182 ounces of Au and 6,737 ounces of Ag. Sporadic activity occurred between 1952 and 1975 culminating in the select mining and shipping of 86 tons of material grading 2.3 opt Au to the ASARCO smelter that produced 172 ounces of Au equating to recoveries of 87%.  At the end of this period, all production occurred within 100 feet of surface. From 1982 through to 1991 various operators completed 64,563 feet of drilling, consisting of 179 reverse circulation, core, and rotary drill holes, with an average spacing of 50-70 feet.  Drilling has delineated a well mineralized zone trending 300m NNE, approximately 100m thick, that has been traced for 200m down dip (Figure 1).  The mineralization remains open down dip to the East (Figure 2). Following the 1990 drill program, Mine Development Associates Inc. (\"MDA\") of Reno, Nevada , was retained to review and model the data with the objective of generating a mineral resource estimate and mine model.  In March 1991 , MDA produced a technical report titled \"Geologic & Mineable Reserve Study on the Dixie Comstock Property, Churchill County, Nevada , USA\" (the \"1991 MDA Study\") in which the following was estimated (Table 2): MDA progressed to estimate a [Historic] mineable resource* (presented in Table 3), open pit mine model (Figure 3), and pit production schedule. * These estimates are considered historical in accordance with NI 43-101.  A qualified person has not done sufficient work to classify the historical estimates as current mineral resources or mineral reserves, and the issuer is not treating the historical estimates as current mineral resources or mineral reserves.  The issuer cautions the reader and directs the reader below to important disclosure regarding the historical estimates. The open pit mine model was designed using a 50° overall slope angle for the main Gabbro host rock unit and a 45° overall slope angle for Hot Springs and the Alluvium.  The pit was designed with 20-foot benches and a catch bench every 40 feet. A cutoff grade of 0.010 opt was used to obtain mineable reserves.  A life-of-mine schedule was generated at a mining rate of 90,000 tons of ore and 285,000 tons of waste per month translating to a mine life of 28 months. One of the primary factors underlining the reason that the commissioning of the Dixie Comstock Mine did not proceed was due to the presence of a Wilderness Survey Area (\"WSA\") partially overlying the Project, constraining development and negatively impacting the economics.  The WSA has been subsequently released, in Dec. 2022 , completely removing the barrier and opening the greater area to mining and development. There has been no attempt to develop the Dixie Comstock Mine since 1991 (over 30 years) and the Project provides an excellent opportunity waiting to be realized. Scott Frostad , P.Geo., is non-independent and the Qualified Person (as defined in NI 43-101) who reviewed and approved the content and scientific and technical information in the news release. Corporate The Company further announces the resignation of Bill Wagener as CEO and Director of the Company. Bill Wagener has fully dedicated himself, over the last decade, to the operations and success of the Company.  He was instrumental in acquiring the rights to the Company's flagship project, the Fondaway Canyon advanced exploration stage gold project, and stewarding the incredible exploration success and growth of the asset during the latter part of his tenure. Regrettably, due to personal obligations, Bill has determined the need to curtail his full-time responsibilities and is stepping down as CEO and Director of the Company.  Bill will remain involved in the operations of the Company, albeit to a lesser extent, providing his services on a consultancy basis. \"Bill is highly respected, and his commitment and devotion have left a palpable impression on the Company and anyone who has had the fortune to do business with him.  I thank him for his years of service and thoroughly appreciate that Bill will remain involved with the Company to provide valuable continuity to the operations and administration.\" stated Bob Bass , Chairman. \"I have been with Getchell Gold Corp. since its inception, and it is with a heavy but necessary heart that I have made this decision to step down as CEO.  I know that the Company has been left in good hands and look forward to what the future holds.\" stated Bill Wagener About Getchell Gold Corp. The Company is a Nevada focused gold and copper exploration company trading on the CSE: GTCH, OTCQB: GGLDF, and FWB: GGA1. Getchell Gold is primarily directing its efforts on its most advanced stage asset, Fondaway Canyon, a past gold producer with a large mineral resource estimate.  Complementing Getchell's asset portfolio is Dixie Comstock, a past gold producer with a historic resource and two earlier stage exploration projects, Star (Cu-Au-Ag) and Hot Springs Peak (Au). For further information please visit the Company's website at www.getchellgold.com or contact the Company at info@getchellgold.com . The Canadian Securities Exchange has not reviewed this press release and does not accept responsibility for the adequacy or accuracy of this news release. Certain information contained herein constitutes \"forward-looking information\" under Canadian securities legislation. Forward-looking information includes, but is not limited to, statements with respect to the timing and execution of exploration or development at the Dixie Comstock Mine.  Generally, forward-looking information can be identified by the use of forward-looking terminology such as \"will\" or variations of such words and phrases or statements that certain actions, events or results \"will\" occur.  Forward-looking statements are based on the opinions and estimates of management as of the date such statements are made, and they are subject to known and unknown risks, uncertainties and other factors that may cause the actual results to be materially different from those expressed or implied by such forward-looking statements or forward-looking information. Although management of Getchell have attempted to identify important factors that could cause actual results to differ materially from those contained in forward-looking statements or forward-looking information, there may be other factors that cause results not to be as anticipated, estimated or intended.  There can be no assurance that such statements will prove to be accurate, as actual results and future events could differ materially from those anticipated in such statements.  Accordingly, readers should not place undue reliance on forward-looking statements and forward-looking information.  The Company will not update any forward-looking statements or forward-looking information that are incorporated by reference herein, except as required by applicable securities laws. SOURCE  Getchell Gold Corp.",
    "primary_commodity": "Au"
  },
  "articleProject": {
    "gid": 5213,
    "project_name": "Dixie Comstock",
    "location": "Nevada, United States"
  },
  "articleExchange": "CSE",
  "articleCompanyId": 110,
  "articleTicker": "GTCH",
  "articleCompanyName": "Getchell Gold Corp.",
  "allOtherCompanyProjects": [
    {
      "company_id": 110,
      "gid": 3012,
      "project_name": "Star",
      "location": "Nevada, United States"
    },
    {
      "company_id": 110,
      "gid": 1010,
      "project_name": "Fondaway Canyon",
      "location": "Nevada, USA"
    },
    {
      "company_id": 110,
      "gid": 5213,
      "project_name": "Dixie Comstock",
      "location": "Nevada, United States"
    }
  ],
  "allOtherCompanyNews": [
    {
      "id": 108120,
      "company_id": 110,
      "title": "GETCHELL GOLD CORP. ANNOUNCES CLOSING OF UPSIZED $4 MILLION FINANCING AND CONVERSION OF FIRST TRANCHE OF DEBENTURES",
      "link": "https://contentapi.cision.com/api/v1.0/releases/20250616C9814",
      "date": "2025-06-16T08:00:00.000Z",
      "hidden": false
    },
    {
      "id": 105731,
      "company_id": 110,
      "title": "Getchell Gold Corp. Upsizes Financing Due to Increased Investor Interest",
      "link": "https://contentapi.cision.com/api/v1.0/releases/20250526C4910",
      "date": "2025-05-26T08:00:00.000Z",
      "hidden": false
    },
    {
      "id": 105601,
      "company_id": 110,
      "title": "Getchell Gold Corp. Announces $3 Million Financing and Debenture Conversion Option",
      "link": "https://contentapi.cision.com/api/v1.0/releases/20250523C6798",
      "date": "2025-05-23T08:00:00.000Z",
      "hidden": false
    },
    {
      "id": 100778,
      "company_id": 110,
      "title": "President's Message: Advancing the Fondaway Canyon Project During Record Gold Prices",
      "link": "https://contentapi.cision.com/api/v1.0/releases/20250424C9916",
      "date": "2025-04-24T08:00:00.000Z",
      "hidden": false
    },
    {
      "id": 99755,
      "company_id": 110,
      "title": "Getchell Gold Corp. Announces Bob Bass, Chairman, Increases Holdings",
      "link": "https://contentapi.cision.com/api/v1.0/releases/20250415C8719",
      "date": "2025-04-15T08:00:00.000Z",
      "hidden": false
    },
    {
      "id": -170440,
      "company_id": 110,
      "title": "GETCHELL GOLD CORP. ANNOUNCES WARRANT EXTENSION, DEBT SETTLEMENT, GRANT OF RSUs, AND CANCELLATION OF OPTIONS",
      "link": "https://contentapi.cision.com/api/v1.0/releases/20250220C2112",
      "date": "2025-02-20T23:00:00.000Z",
      "hidden": false
    },
    {
      "id": 87720,
      "company_id": 110,
      "title": "Getchell Gold Corp. Announces Bob Bass, Chairman, Exercises One Million Warrants",
      "link": "https://contentapi.cision.com/api/v1.0/releases/20250213C9533",
      "date": "2025-02-13T09:00:00.000Z",
      "hidden": false
    },
    {
      "id": 87173,
      "company_id": 110,
      "title": "Getchell Gold Corp. Files Robust Preliminary Economic Assessment Fondaway Canyon Gold Project, NV",
      "link": "https://contentapi.cision.com/api/v1.0/releases/20250207C5760",
      "date": "2025-02-07T22:30:00.000Z",
      "hidden": false
    },
    {
      "id": 85018,
      "company_id": 110,
      "title": "Getchell Gold Corp. Announces Positive Preliminary Economic Assessment Fondaway Canyon Gold Project, NV",
      "link": "https://contentapi.cision.com/api/v1.0/releases/20250123C7769",
      "date": "2025-01-23T12:00:00.000Z",
      "hidden": false
    },
    {
      "id": 84384,
      "company_id": 110,
      "title": "Getchell Gold Corp Invites Shareholders and Investment Community to Visit Us at Booth 402 at the VRIC in Vancouver, January 19-20, 2025",
      "link": "https://www.newsfilecorp.com/release/237443/Getchell-Gold-Corp-Invites-Shareholders-and-Investment-Community-to-Visit-Us-at-Booth-402-at-the-VRIC-in-Vancouver-January-1920-2025",
      "date": "2025-01-16T19:30:00.000Z",
      "hidden": false
    }
  ]
}
