{
  "article": {
    "id": 83425,
    "link": "https://contentapi.cision.com/api/v1.0/releases/20250107C9698",
    "title": "Black Mammoth Metals Acquires Coleman Canyon Gold Property in Nevada",
    "description": "\n\n<div class=\"PRN_ImbeddedAssetReference\" id=\"DivAssetPlaceHolder3198\"><p><a href=\"https://mma.prnewswire.com/media/2592016/Black_Mammoth_Metals_Corp_Black_Mammoth_Metals%C2%A0Acquires_Coleman.html\" rel=\"nofollow\" target=\"_blank\"><img alt=\"Black Mammoth Metals Corporation logo (CNW Group/Black Mammoth Metals Corp)\" src=\"https://mma.prnewswire.com/media/2592016/Black_Mammoth_Metals_Corp_Black_Mammoth_Metals%C2%A0Acquires_Coleman.jpg\" title=\"Black Mammoth Metals Corporation logo (CNW Group/Black Mammoth Metals Corp)\"></img></a></p>\n</div><p><b><i>No.25-02         </i></b><b>BMM: TSX-V       </b></p>\n<p><span class=\"legendSpanClass\"><span class=\"xn-location\">VANCOUVER, BC</span></span>, <span class=\"legendSpanClass\"><span class=\"xn-chron\">Jan. 7, 2025</span></span> /CNW/ - <b>Black Mammoth Metals Corporation</b> (TSXV: BMM) (OTC: LQRCF) <b> (\"Black Mammoth\" or the \"Company\")</b> is pleased to announce that Antelope Creek Gold Corporation (\"Antelope Creek\"), a wholly owned subsidiary of Black Mammoth, has entered into a mineral lease purchase agreement (the \"Agreement\") dated <span class=\"xn-chron\">January 3, 2025</span>, with TUVERA Exploration Inc. (formerly ARNEVUT Resources Inc.) (the \"Vendor\") to acquire a 100% interest in 8 leased patented claims (the \"Leases\"). The Company has also recently staked 89 federal unpatented lode claims.</p>\n<p><b>Claims:</b></p>\n<p>The patented and unpatented claims total approximately 710 contiguous hectares (1756 acres) and is called the Coleman Canyon Gold property, formerly the Island Mountain property (\"Coleman Canyon\" or the \"Property\") located in <span class=\"xn-location\">Elko County</span>, <span class=\"xn-location\">NE Nevada</span>, at the NE extent of the Jerritt Canyon Trend.</p>\n<p><b>Mineralization:</b></p>\n<ul type=\"disc\"><li>Gold resource modelling was performed after the 2013 drilling season to incorporate all drilling up to that point (the \"Resource Model\").</li><li>All known gold and silver mineralization are in the oxide zone.</li><li>An interim NI 43-101 technical report was completed in 2015 (the \"Technical Report\").</li><li><b>Gold mineralization in the indicated and inferred categories estimated in the Technical Report (the \"Mineralization\") is significant. </b></li><li>The Resource Model in addition to the Mineralization, the geochemical data and the geophysical data suggest that the Mineralization has the potential to expand significantly.</li><li>Silver mineralization, once fully modelled, will add to that overall potential. The silver–gold ratio is approximately 3 to 1.</li><li>Extensive jasperoid zones along the carbonate rock contact and distal to the modeled intrusion may indicate a potential <span class=\"xn-location\">Carlin</span>-type gold deposit at depth (see Figure 1), while strongly brecciated quartz veins in a shear zone provide the potential for a high-grade orogenic gold system within the district (see Figure 2).</li></ul><p><i>Black Mammoth is not treating the Mineralization as current mineral resources. A qualified person will have to perform sufficient work to verify and update the Resource Model so that all mineralization factors can be evaluated. The Technical Report will need to be revised to bring it into full compliance before being released along with its resource estimation. A qualified person has not yet determined the extent of what work needs to be done to upgrade or verify the Mineralization at Coleman Canyon as current mineral resources or mineral reserves. The existence of the Technical Report, along with the Resource Model is relevant for historical completeness, but should not be relied on.</i></p>\n<div class=\"PRN_ImbeddedAssetReference\" id=\"DivAssetPlaceHolder1650\"><p><a href=\"https://mma.prnewswire.com/media/2592014/Black_Mammoth_Metals_Corp_Black_Mammoth_Metals%C2%A0Acquires_Coleman.html\" rel=\"nofollow\" target=\"_blank\"><img alt=\"Figure 1 – Structurally-controlled jasperoids along the carbonate rock contact and distal to the modeled intrusion (looking east). (CNW Group/Black Mammoth Metals Corp)\" src=\"https://mma.prnewswire.com/media/2592014/Black_Mammoth_Metals_Corp_Black_Mammoth_Metals%C2%A0Acquires_Coleman.jpg?p=original\" title=\"Figure 1 – Structurally-controlled jasperoids along the carbonate rock contact and distal to the modeled intrusion (looking east). (CNW Group/Black Mammoth Metals Corp)\"></img></a></p>\n</div><p class=\"prntaj\"><i>Figure 1 – Structurally-controlled jasperoids along the carbonate rock contact and distal to the modeled intrusion (looking east).</i></p>\n<div class=\"PRN_ImbeddedAssetReference\" id=\"DivAssetPlaceHolder2411\"><p><a href=\"https://mma.prnewswire.com/media/2592013/Black_Mammoth_Metals_Corp_Black_Mammoth_Metals%C2%A0Acquires_Coleman.html\" rel=\"nofollow\" target=\"_blank\"><img alt=\"Figure 2 – Brecciated and iron-oxide-cemented quartz veining in shear zone. (CNW Group/Black Mammoth Metals Corp)\" src=\"https://mma.prnewswire.com/media/2592013/Black_Mammoth_Metals_Corp_Black_Mammoth_Metals%C2%A0Acquires_Coleman.jpg?p=original\" title=\"Figure 2 – Brecciated and iron-oxide-cemented quartz veining in shear zone. (CNW Group/Black Mammoth Metals Corp)\"></img></a></p>\n</div><p class=\"prntaj\"><i>Figure 2 – Brecciated and iron-oxide-cemented quartz veining in shear zone.</i></p>\n<p><b>Permitting status:</b></p>\n<p>There is an existing Plan of Operations (the \"Permit\") for drilling a total of 19 holes at Coleman Canyon. The drill holes are intended to provide infill of previous drilling and known mineralization and to test the outer limits of mineralization on the northern side of the Property. The Permit was approved in 2020 by the Nevada Bureau of Mining Reclamation and the U.S. <span class=\"xn-person\">Forest Service</span> and may now need to be updated.</p>\n<p><b>Geology:</b></p>\n<p>The majority of the known gold and silver mineralization is hosted by sedimentary and meta-sedimentary rocks surrounding a central intrusive stock. Mineralization in the sedimentary units is restricted to calcareous beds of the Hammond Canyon Formation and parts of the overlying Poorman Creek Formation, in keeping with a \"proximal <span class=\"xn-location\">Carlin</span>\" deposit model. These units have been pushed up during emplacement of the intrusive so that the units dip away from the intrusive on all sides, flattening with distance from the intrusive. Mineralization appears to be controlled by bedding and partly by structural features, including faults and fracturing interpreted to have provided pathways for mineralizing fluids. There is also vein mineralization in the intrusive stock.</p>\n<p>Sulphide mineralization is anticipated to exist because of similar geology to other intrusions and Carlin-style deposits in the Jerritt Canyon Trend.</p>\n<p><b>Historic production:</b></p>\n<p>There is a large mined-out placer deposit immediately downstream from the intrusion. This placer, known as the \"Gold Creek Placer,\" was one of the largest wet placers in <span class=\"xn-location\">Nevada</span>, along Coleman Creek and Gold Creek, producing approximately 40,000 oz gold from the 1890s through 1960s.</p>\n<p>A number of historic mines were developed along the border zone between the intrusive and sedimentary units both in Coleman Canyon and Hammond Canyon, the drainages bordering the intrusive on the southwest and northeast respectively, with production amounts from these mines unknown.</p>\n<p><b>Past drilling:</b></p>\n<p>Drilling at the Coleman Canyon property has been performed intermittently since the early 1980s. Drilling campaigns include operators: BHP, Aur Resources, Cordex Exploration, Western States Minerals, Kennecott Exploration, Gateway Gold and TUVERA Exploration with over 300 reverse circulation and core holes completed for a total of over <span class=\"xn-money\">55,000m</span>. Most core boxes and chip trays from the recent drilling programs have been preserved and are in storage along with the assay rejects and pulps.</p>\n<p>Most past drilling was performed in the sedimentary units on the west side of the property, in the west end of the intrusive, and in the sedimentary units around the intrusive on the south and southeast sides.  Because of the clustered nature of drilling in the 2000s, the known Mineralization has a \"string-of-pearls\" pattern in parts of the Resource Model. Infill drilling in 2012-2013 started to tie these clusters together in the western half of the Property and expanded Mineralization to the northwest. Further infill drilling will be needed to test between existing clusters and to test the continuity and lateral extent of Mineralization around the south and east sides of the intrusive. <b>Nearly all known Mineralization is open laterally within the sedimentary units and is potentially open vertically both in the deeper oxide zone and into the sulfide zone.</b> Possible extension of the intrusive and mineralized sedimentary units to the south, southeast, and east within the Coleman Canyon claims area is suggested by past geophysical work.</p>\n<p><b>Acquisition terms:</b></p>\n<p>Under the terms of the Agreement, Antelope Creek has acquired a 100% interest in the Leases from the Vendor in addition to acquiring the Vendor's extensive Property data, including drill core and RC chips in storage, in exchange for a 1% NSR royalty which covers the unpatented claims that the Company has staked.</p>\n<p>The Leases have annual payments that total approximately <span class=\"xn-money\">$35,500 USD</span> and have a 3% NSR royalty, in favor of their underlying owners. The Leases include mineral rights, surface rights and any water rights that the underlying owners may have. The Leases, signed in 2010 for an initial term of 20 years, can be extended for an additional 20 years under certain conditions. The Company understands that the Lease payments are in arrears but that the Leases are still in force.</p>\n<p>There are no payments, work commitment amounts, finder's fees or share compensation in connection with Coleman Canyon acquisition.</p>\n<p><b>About Black Mammoth Metals Corporation: </b></p>\n<p>In 2024, Black Mammoth Metals acquired a 100% interest in:</p>\n<ul type=\"disc\"><li><b>Leadore Silver-Lead property</b>, <span class=\"xn-location\">Lemhi County, ID</span>,</li><li><b>East Reveille Gold property</b>, <span class=\"xn-location\">Nye County, NV</span>,</li><li><b><span class=\"xn-person\">America Mine Gold</span> property</b>, <span class=\"xn-location\">San Bernardino, CA</span>,</li><li><b>Quito Gold property</b>, <span class=\"xn-location\">Lander County, NV</span></li><li><b>South Ravenswood</b> <b>District</b>, <span class=\"xn-location\">Lander County NV</span>,</li><li><b>Callaghan Gold District</b>, <span class=\"xn-location\">Lander County NV.</span></li></ul><p>At the Company's 100% owned, 1,213 hectare (2,997 acre) <b>Happy Cat Gold property</b>, <span class=\"xn-location\">Lander County, NV</span>, an approximate 4 square kilometre area is identified as being hydrothermally altered. Structural modelling suggests the density of the alteration and its' density contrast relative to the host rock is typical to that of alteration zones present at other <span class=\"xn-location\">Carlin</span>-type deposits in northern <span class=\"xn-location\">Nevada</span>. The alteration encompasses an area where northerly trending high-angle faults intersect indicated NW-trending re-activated faults that are known to be of age and orientation as ore-controlling faults occurring at other <span class=\"xn-location\">Carlin</span>-type deposits. The Company intends to drill approximately <span class=\"xn-money\">1500m</span> in <span class=\"xn-chron\">January 2025</span> to further understand the structure and stratigraphy. The required permit and bond are in place.</p>\n<p>Black Mammoth also has a 100% interest in the <b>Blanco Creek Gold property</b> in the Elk Creek Mining District, central <span class=\"xn-location\">Idaho</span>, which hosts three historic underground mines along 3,550 meters (11,644 feet) of strike on the north-east trending regional <span class=\"xn-person\">Blanco Shear Zone</span>. Exploration by two previous operators identified a geological target for the Blanco Creek property in the order of 1.70 to 2.48 million tons, grading 0.20 to 0.33 oz/ton Au (1.54 to 2.24 million tonnes, grading 6.85 to 11.31 g/tonne Au); see the Company's press release dated <span class=\"xn-chron\">February 14, 2017</span>.</p>\n<p><i>Black Mammoth cautions investors to note the potential quantity and grade of the geological target are conceptual in nature. A qualified person has not completed sufficient work to classify the geological target as mineral resources as defined by NI 43-101, and it is uncertain if future exploration will result in the target being delineated as mineral resources.</i></p>\n<p><span class=\"xn-person\">Mark J. Abrams</span>, CPG #11451, a Qualified Person as defined under National Instrument 43-101 - <i>Standards of Disclosure for Mineral Projects</i> (\"<b>NI 43-101</b>\") and director of Black Mammoth, has reviewed and approved the technical content in this release. Historical information contained in this news release cannot be relied upon as Mr. Abrams, the Company's Qualified Person, has not prepared or verified the historical information.</p>\n<p>On behalf of the board,</p>\n<p>\"Dustin Henderson\"</p>\n<p><span class=\"xn-person\">Dustin Henderson</span>, BBA<br></br>President &amp; CEO</p>\n<p>Website:  <a href=\"https://c212.net/c/link/?t=0&amp;l=en&amp;o=4334865-1&amp;h=4189788551&amp;u=http%3A%2F%2Fwww.blackmammothmetals.com%2F&amp;a=www.blackmammothmetals.com\" rel=\"nofollow\" target=\"_blank\">www.blackmammothmetals.com</a></p>\n<p><i>This press release contains forward-looking statements and forward-looking information (collectively, \"forward looking statements\") within the meaning of applicable securities laws. All statements, other than statements of historical fact, included herein, including statements regarding the Company's completion of the Transaction and related transactions are forward-looking statements. Forward-looking statements are typically identified by words such as: believe, expect, anticipate, intend, estimate, postulate and similar expressions or are those which, by their nature, refer to future events. Although the Company believes that such statements are reasonable, there can be no assurance that such statements will prove to be accurate, and actual results and future events could differ materially from those anticipated in such statements. The Company cautions investors that any forward-looking statements by the Company are not guarantees of future performance, and that actual results may differ materially from those in forward-looking statements. Important factors that could cause actual events and results to differ materially from the Company's expectations include that the requisite corporate and TSXV for the Transaction may not be obtained; that the Company or IDA Mining, as applicable, may be unable to satisfy any or all closing conditions necessary for the completion of the Transaction; and other risks that are customary to transactions of this nature. Trading in the securities of the Company should be considered highly speculative. All of the Company's public disclosure filings may be accessed via </i><i><a href=\"http://www.sedarplus.ca\" rel=\"nofollow\">www.sedarplus.ca</a></i> <i>and readers are urged to review these materials, including the latest technical reports filed with respect to the Company's mineral properties.</i></p>\n<p><i>Neither TSX Venture Exchange nor its Regulation Services Provider (as that term is defined in the policies of the TSX Venture Exchange) accepts responsibility for the adequacy or accuracy of this release.</i></p>\n\n<div class=\"PRN_ImbeddedAssetReference\" id=\"DivAssetPlaceHolder0\">\n</div>\n<p>SOURCE  Black Mammoth Metals Corp</p>\n<img alt=\"\" src=\"https://rt.newswire.ca/rt.gif?NewsItemId=C9698&amp;Transmission_Id=202501070915CANADANWCANADAPR_C9698&amp;DateId=20250107\" style=\"border:0px; width:1px; height:1px;\"></img>\n\n",
    "search_terms": "Coleman Canyon,Black Mammoth Metals Corp.,BMM",
    "master_gid": 9540,
    "date": "2025-01-07T14:15:00.000Z",
    "tags": "USA|Nevada||Gold,Silver|Project Acquisition",
    "image_id": null,
    "hidden": false,
    "company_id": 1153,
    "provider": "cision",
    "excerpt": "No.25-02BMM: TSX-VVANCOUVER, BC,Jan. 7, 2025/CNW/ -Black Mammoth Metals Corporation(TSXV: BMM) (OTC: LQRCF)(\"Black Mammoth\" or the \"Company\")is pleased to announce that Antelope Creek Gold Corporation (\"Antelope Creek\"), a wholly owned subsidiary of Black Mammoth, has entered into a mineral lease purchase agreement (the \"Agreement\") datedJanuary 3, 2025, with TUVERA Exploration Inc.",
    "is_regulatory": false,
    "refined_tags": null,
    "ftp_filename": null,
    "company_name": "Black Mammoth Metals Corporation",
    "exchange": "TSXV",
    "root_ticker": "BMM",
    "project_name": "Coleman Canyon",
    "gid": 9540,
    "location": "Nevada, United States",
    "plan_id": null,
    "description_text": "No.25-02 BMM: TSX-V VANCOUVER, BC , Jan. 7, 2025 /CNW/ - Black Mammoth Metals Corporation (TSXV: BMM) (OTC: LQRCF) (\"Black Mammoth\" or the \"Company\") is pleased to announce that Antelope Creek Gold Corporation (\"Antelope Creek\"), a wholly owned subsidiary of Black Mammoth, has entered into a mineral lease purchase agreement (the \"Agreement\") dated January 3, 2025 , with TUVERA Exploration Inc. (formerly ARNEVUT Resources Inc.) (the \"Vendor\") to acquire a 100% interest in 8 leased patented claims (the \"Leases\"). The Company has also recently staked 89 federal unpatented lode claims. Claims: The patented and unpatented claims total approximately 710 contiguous hectares (1756 acres) and is called the Coleman Canyon Gold property, formerly the Island Mountain property (\"Coleman Canyon\" or the \"Property\") located in Elko County , NE Nevada , at the NE extent of the Jerritt Canyon Trend. Mineralization: Gold resource modelling was performed after the 2013 drilling season to incorporate all drilling up to that point (the \"Resource Model\"). All known gold and silver mineralization are in the oxide zone. An interim NI 43-101 technical report was completed in 2015 (the \"Technical Report\"). Gold mineralization in the indicated and inferred categories estimated in the Technical Report (the \"Mineralization\") is significant. The Resource Model in addition to the Mineralization, the geochemical data and the geophysical data suggest that the Mineralization has the potential to expand significantly. Silver mineralization, once fully modelled, will add to that overall potential. The silver–gold ratio is approximately 3 to 1. Extensive jasperoid zones along the carbonate rock contact and distal to the modeled intrusion may indicate a potential Carlin -type gold deposit at depth (see Figure 1), while strongly brecciated quartz veins in a shear zone provide the potential for a high-grade orogenic gold system within the district (see Figure 2). Black Mammoth is not treating the Mineralization as current mineral resources. A qualified person will have to perform sufficient work to verify and update the Resource Model so that all mineralization factors can be evaluated. The Technical Report will need to be revised to bring it into full compliance before being released along with its resource estimation. A qualified person has not yet determined the extent of what work needs to be done to upgrade or verify the Mineralization at Coleman Canyon as current mineral resources or mineral reserves. The existence of the Technical Report, along with the Resource Model is relevant for historical completeness, but should not be relied on. Figure 1 – Structurally-controlled jasperoids along the carbonate rock contact and distal to the modeled intrusion (looking east). Figure 2 – Brecciated and iron-oxide-cemented quartz veining in shear zone. Permitting status: There is an existing Plan of Operations (the \"Permit\") for drilling a total of 19 holes at Coleman Canyon. The drill holes are intended to provide infill of previous drilling and known mineralization and to test the outer limits of mineralization on the northern side of the Property. The Permit was approved in 2020 by the Nevada Bureau of Mining Reclamation and the U.S. Forest Service and may now need to be updated. Geology: The majority of the known gold and silver mineralization is hosted by sedimentary and meta-sedimentary rocks surrounding a central intrusive stock. Mineralization in the sedimentary units is restricted to calcareous beds of the Hammond Canyon Formation and parts of the overlying Poorman Creek Formation, in keeping with a \"proximal Carlin \" deposit model. These units have been pushed up during emplacement of the intrusive so that the units dip away from the intrusive on all sides, flattening with distance from the intrusive. Mineralization appears to be controlled by bedding and partly by structural features, including faults and fracturing interpreted to have provided pathways for mineralizing fluids. There is also vein mineralization in the intrusive stock. Sulphide mineralization is anticipated to exist because of similar geology to other intrusions and Carlin-style deposits in the Jerritt Canyon Trend. Historic production: There is a large mined-out placer deposit immediately downstream from the intrusion. This placer, known as the \"Gold Creek Placer,\" was one of the largest wet placers in Nevada , along Coleman Creek and Gold Creek, producing approximately 40,000 oz gold from the 1890s through 1960s. A number of historic mines were developed along the border zone between the intrusive and sedimentary units both in Coleman Canyon and Hammond Canyon, the drainages bordering the intrusive on the southwest and northeast respectively, with production amounts from these mines unknown. Past drilling: Drilling at the Coleman Canyon property has been performed intermittently since the early 1980s. Drilling campaigns include operators: BHP, Aur Resources, Cordex Exploration, Western States Minerals, Kennecott Exploration, Gateway Gold and TUVERA Exploration with over 300 reverse circulation and core holes completed for a total of over 55,000m . Most core boxes and chip trays from the recent drilling programs have been preserved and are in storage along with the assay rejects and pulps. Most past drilling was performed in the sedimentary units on the west side of the property, in the west end of the intrusive, and in the sedimentary units around the intrusive on the south and southeast sides.  Because of the clustered nature of drilling in the 2000s, the known Mineralization has a \"string-of-pearls\" pattern in parts of the Resource Model. Infill drilling in 2012-2013 started to tie these clusters together in the western half of the Property and expanded Mineralization to the northwest. Further infill drilling will be needed to test between existing clusters and to test the continuity and lateral extent of Mineralization around the south and east sides of the intrusive. Nearly all known Mineralization is open laterally within the sedimentary units and is potentially open vertically both in the deeper oxide zone and into the sulfide zone. Possible extension of the intrusive and mineralized sedimentary units to the south, southeast, and east within the Coleman Canyon claims area is suggested by past geophysical work. Acquisition terms: Under the terms of the Agreement, Antelope Creek has acquired a 100% interest in the Leases from the Vendor in addition to acquiring the Vendor's extensive Property data, including drill core and RC chips in storage, in exchange for a 1% NSR royalty which covers the unpatented claims that the Company has staked. The Leases have annual payments that total approximately $35,500 USD and have a 3% NSR royalty, in favor of their underlying owners. The Leases include mineral rights, surface rights and any water rights that the underlying owners may have. The Leases, signed in 2010 for an initial term of 20 years, can be extended for an additional 20 years under certain conditions. The Company understands that the Lease payments are in arrears but that the Leases are still in force. There are no payments, work commitment amounts, finder's fees or share compensation in connection with Coleman Canyon acquisition. About Black Mammoth Metals Corporation: In 2024, Black Mammoth Metals acquired a 100% interest in: Leadore Silver-Lead property , Lemhi County, ID , East Reveille Gold property , Nye County, NV , America Mine Gold property , San Bernardino, CA , Quito Gold property , Lander County, NV South Ravenswood District , Lander County NV , Callaghan Gold District , Lander County NV. At the Company's 100% owned, 1,213 hectare (2,997 acre) Happy Cat Gold property , Lander County, NV , an approximate 4 square kilometre area is identified as being hydrothermally altered. Structural modelling suggests the density of the alteration and its' density contrast relative to the host rock is typical to that of alteration zones present at other Carlin -type deposits in northern Nevada . The alteration encompasses an area where northerly trending high-angle faults intersect indicated NW-trending re-activated faults that are known to be of age and orientation as ore-controlling faults occurring at other Carlin -type deposits. The Company intends to drill approximately 1500m in January 2025 to further understand the structure and stratigraphy. The required permit and bond are in place. Black Mammoth also has a 100% interest in the Blanco Creek Gold property in the Elk Creek Mining District, central Idaho , which hosts three historic underground mines along 3,550 meters (11,644 feet) of strike on the north-east trending regional Blanco Shear Zone . Exploration by two previous operators identified a geological target for the Blanco Creek property in the order of 1.70 to 2.48 million tons, grading 0.20 to 0.33 oz/ton Au (1.54 to 2.24 million tonnes, grading 6.85 to 11.31 g/tonne Au); see the Company's press release dated February 14, 2017 . Black Mammoth cautions investors to note the potential quantity and grade of the geological target are conceptual in nature. A qualified person has not completed sufficient work to classify the geological target as mineral resources as defined by NI 43-101, and it is uncertain if future exploration will result in the target being delineated as mineral resources. Mark J. Abrams , CPG #11451, a Qualified Person as defined under National Instrument 43-101 - Standards of Disclosure for Mineral Projects (\" NI 43-101 \") and director of Black Mammoth, has reviewed and approved the technical content in this release. Historical information contained in this news release cannot be relied upon as Mr. Abrams, the Company's Qualified Person, has not prepared or verified the historical information. On behalf of the board, \"Dustin Henderson\" Dustin Henderson , BBA President & CEO Website: www.blackmammothmetals.com This press release contains forward-looking statements and forward-looking information (collectively, \"forward looking statements\") within the meaning of applicable securities laws. All statements, other than statements of historical fact, included herein, including statements regarding the Company's completion of the Transaction and related transactions are forward-looking statements. Forward-looking statements are typically identified by words such as: believe, expect, anticipate, intend, estimate, postulate and similar expressions or are those which, by their nature, refer to future events. Although the Company believes that such statements are reasonable, there can be no assurance that such statements will prove to be accurate, and actual results and future events could differ materially from those anticipated in such statements. The Company cautions investors that any forward-looking statements by the Company are not guarantees of future performance, and that actual results may differ materially from those in forward-looking statements. Important factors that could cause actual events and results to differ materially from the Company's expectations include that the requisite corporate and TSXV for the Transaction may not be obtained; that the Company or IDA Mining, as applicable, may be unable to satisfy any or all closing conditions necessary for the completion of the Transaction; and other risks that are customary to transactions of this nature. Trading in the securities of the Company should be considered highly speculative. All of the Company's public disclosure filings may be accessed via www.sedarplus.ca and readers are urged to review these materials, including the latest technical reports filed with respect to the Company's mineral properties. Neither TSX Venture Exchange nor its Regulation Services Provider (as that term is defined in the policies of the TSX Venture Exchange) accepts responsibility for the adequacy or accuracy of this release. SOURCE  Black Mammoth Metals Corp",
    "primary_commodity": "Au"
  },
  "articleProject": {
    "gid": 9540,
    "project_name": "Coleman Canyon",
    "location": "Nevada, United States"
  },
  "articleExchange": "TSXV",
  "articleCompanyId": 1153,
  "articleTicker": "BMM",
  "articleCompanyName": "Black Mammoth Metals Corp.",
  "allOtherCompanyProjects": [
    {
      "company_id": 1153,
      "gid": 4437,
      "project_name": "Blanco Creek",
      "location": "Idaho, United States"
    },
    {
      "company_id": 1153,
      "gid": 10775,
      "project_name": "Big Bear",
      "location": "Arizona, United States"
    },
    {
      "company_id": 1153,
      "gid": 10776,
      "project_name": "Zulu",
      "location": "Arizona, United States"
    },
    {
      "company_id": 1153,
      "gid": 10777,
      "project_name": "Northern Star",
      "location": "Arizona, United States"
    },
    {
      "company_id": 1153,
      "gid": 9342,
      "project_name": "East Reveille",
      "location": "Nevada, United States"
    },
    {
      "company_id": 1153,
      "gid": 9343,
      "project_name": "Callaghan",
      "location": "Nevada, United States"
    },
    {
      "company_id": 1153,
      "gid": 9344,
      "project_name": "Quito",
      "location": "Nevada, United States"
    },
    {
      "company_id": 1153,
      "gid": 9345,
      "project_name": "Happy Cat",
      "location": "Nevada, United States"
    },
    {
      "company_id": 1153,
      "gid": 9712,
      "project_name": "Clover",
      "location": "Nevada, United States"
    },
    {
      "company_id": 1153,
      "gid": 9540,
      "project_name": "Coleman Canyon",
      "location": "Nevada, United States"
    },
    {
      "company_id": 1153,
      "gid": 9153,
      "project_name": " Leadore",
      "location": "Idaho, United States"
    },
    {
      "company_id": 1153,
      "gid": 10212,
      "project_name": "Diamond Jim",
      "location": "Nevada, United States"
    },
    {
      "company_id": 1153,
      "gid": 10211,
      "project_name": "St. Elmo",
      "location": "Nevada, United States"
    },
    {
      "company_id": 1153,
      "gid": 10258,
      "project_name": "Coal Canyon",
      "location": "Nevada, United States"
    }
  ],
  "allOtherCompanyNews": [
    {
      "id": 108165,
      "company_id": 1153,
      "title": "Black Mammoth Metals Stakes Claims and Samples Copper and Gold at Big Bear, Northern Star and Zulu Properties, AZ",
      "link": "https://contentapi.cision.com/api/v1.0/releases/20250616C3054",
      "date": "2025-06-16T13:13:00.000Z",
      "hidden": false
    },
    {
      "id": 106244,
      "company_id": 1153,
      "title": "Black Mammoth Metals Reports Rock Chip Sampling Results at Coal Canyon, NV",
      "link": "https://contentapi.cision.com/api/v1.0/releases/20250528C0077",
      "date": "2025-05-28T13:15:00.000Z",
      "hidden": false
    },
    {
      "id": 104650,
      "company_id": 1153,
      "title": "Black Mammoth Metals Reports Drill Results at Callaghan Gold Property, NV",
      "link": "https://contentapi.cision.com/api/v1.0/releases/20250514C9946",
      "date": "2025-05-14T13:15:00.000Z",
      "hidden": false
    },
    {
      "id": 99844,
      "company_id": 1153,
      "title": "Black Mammoth Metals Leases Coal Canyon Gold Property, NV",
      "link": "https://contentapi.cision.com/api/v1.0/releases/20250415C5484",
      "date": "2025-04-15T13:15:00.000Z",
      "hidden": false
    },
    {
      "id": 99032,
      "company_id": 1153,
      "title": "Black Mammoth Metals Consolidates Claims at St. Elmo High-Grade Gold and Diamond Jim Silver-Lead-Zinc-Antimony Properties, NV",
      "link": "https://contentapi.cision.com/api/v1.0/releases/20250408C6286",
      "date": "2025-04-08T13:15:00.000Z",
      "hidden": false
    },
    {
      "id": 90136,
      "company_id": 1153,
      "title": "Black Mammoth Metals Samples up to 7.6% TREO with 26% NdPr at Leadore, Idaho",
      "link": "https://contentapi.cision.com/api/v1.0/releases/20250305C9326",
      "date": "2025-03-05T14:41:00.000Z",
      "hidden": false
    },
    {
      "id": 87475,
      "company_id": 1153,
      "title": "Black Mammoth Metals to Drill Rast and Cottonwood Targets at Callaghan Gold District in Nevada",
      "link": "https://contentapi.cision.com/api/v1.0/releases/20250211C9457",
      "date": "2025-02-11T19:25:00.000Z",
      "hidden": false
    },
    {
      "id": 85723,
      "company_id": 1153,
      "title": "Black Mammoth Metals Options the High-Grade Clover Gold Property in Nevada",
      "link": "https://contentapi.cision.com/api/v1.0/releases/20250129C5296",
      "date": "2025-01-29T14:15:00.000Z",
      "hidden": false
    },
    {
      "id": 83425,
      "company_id": 1153,
      "title": "Black Mammoth Metals Acquires Coleman Canyon Gold Property in Nevada",
      "link": "https://contentapi.cision.com/api/v1.0/releases/20250107C9698",
      "date": "2025-01-07T14:15:00.000Z",
      "hidden": false
    },
    {
      "id": 83231,
      "company_id": 1153,
      "title": "Black Mammoth Metals to Drill Stratigraphic Holes at Happy Cat Property",
      "link": "https://contentapi.cision.com/api/v1.0/releases/20250103C9429",
      "date": "2025-01-03T21:00:00.000Z",
      "hidden": false
    }
  ]
}