{
  "article": {
    "id": 71325,
    "link": "https://www.newsfilecorp.com/release/223152/Canter-Resources-Acquires-Railroad-Valley-LithiumBoron-Project",
    "title": "Canter Resources Acquires Railroad Valley Lithium-Boron Project",
    "description": "<img src=\"https://api.newsfilecorp.com/newsinfo/223152/367\" id=\"367\" width=\"2\" height=\"2\" style=\"width: 1px;  height: 1px;border: 0px solid;\" /><p>Vancouver, British Columbia--(Newsfile Corp. - September 12, 2024) - <b>Canter Resources Corp. (CSE: CRC) (OTC Pink: CNRCF) (FSE: 601)</b> (\"<b>Canter</b>\" or the \"<b>Company</b>\") is pleased to report that it has acquired a prospective 1,000 acre property (\"RV Project\") in Railroad Valley, located in Nye county, Nevada. The RV Project is located 164 kilometres east-northeast of Tonopah, Nevada, and accessible via Highway 6, ideally located for exploration and potential development. Despite its promising geologic similarities to Clayton Valley, Railroad Valley remains largely underexplored for lithium and boron.</p><p>The Railroad Valley basin shares several critical geological features with Clayton Valley, which has been North America's leading lithium producer since 1966. Both valleys are structurally closed basins with similar fault-bounded graben structures, making them ideal for lithium and boron brine accumulation. However, Railroad Valley stands out due to its larger basin size, which is 2.5 times larger in catchment area and 3.5 times larger in playa surface area compared to Clayton Valley. </p><p>\"We are pleased to add another lithium-boron brine target to the Company's Nevada project portfolio in a valley we view as one of the most promising untapped lithium-boron brine opportunities in the region,\" commented Canter CEO, Joness Lang. \"We remain focused on advancing exploration at our flagship Columbus Project but will continue to leverage our targeting database to make low-cost strategic acquisitions to strengthen the Company's portfolio when opportunities present themselves.\"</p><p><b>Lithium and Boron Potential</b></p><p>Historic soil samples collected from the Railroad Valley site have returned values between 150 and 280 ppm lithium, a range consistent with known lithium brine-producing basins. Recent soil sampling by Canter returned surface values of up to 160 ppm lithium and 610 ppm boron. This, coupled with the area's high geothermal heat flux, enhances the potential for diagenetic alteration and lithium and boron release from surrounding volcanic and sedimentary formations into the underlying brine aquifers. The RV Project is contiguous with claims held by 3 Proton Lithium (private), who is the largest claim holder and most active lithium-boron exploration company in Railroad Valley. </p><p style=\"text-align: center;\"><a rel=\"nofollow\" href=\"https://images.newsfilecorp.com/files/10112/223152_f4c8cc6144acc81e_001full.jpg\"><img src=\"https://images.newsfilecorp.com/files/10112/223152_f4c8cc6144acc81e_001.jpg\" style=\"border-width: 0px;\" alt=\"Cannot view this image? Visit: https://images.newsfilecorp.com/files/10112/223152_f4c8cc6144acc81e_001.jpg\" /></a><br /><br /><b>Photo 1:</b>&#160;Soil sample collected at the newly acquired RV Project</p><p style=\"text-align: center;\">To view an enhanced version of this graphic, please visit:<br /><a rel=\"nofollow\" href=\"https://images.newsfilecorp.com/files/10112/223152_f4c8cc6144acc81e_001full.jpg\">https://images.newsfilecorp.com/files/10112/223152_f4c8cc6144acc81e_001full.jpg</a></p><p><b>Acquisition Terms</b></p><p>Canter, and its indirect, wholly owned subsidiary, Altitude Lithium USA Corp., entered into a Claims Acquisition Agreement with Ramp Metals USA Inc. to a 100% interest in 50 unpatented association placer claims in Railroad Valley for the following consideration:</p><ul style=\"list-style-type: disc;\"><li>300,000 Canter common shares (\"Consideration Shares\") with a deemed price of CAD$0.13 payable to Ramp Metals Inc. (TSXV: RAMP), the parent corporation of Ramp Metals USA Inc.; </li><li>Canter will pay transfer costs and reimburse recently paid BLM fees; and</li><li>Ramp Metals USA Inc. will retain a 0.5% NSR, with Canter having the ability to buy back the NSR for a one-time CAD$500,000 payment at any time.</li></ul><p>The Consideration Shares will be subject to a hold period of four months from the date of issuance pursuant to securities laws in Canada. The transaction remains subject to regulatory approval with a targeted closing date of September 19, 2024.</p><p><b>Qualified Person (QP)</b></p><p>The technical information contained in this news release was reviewed and approved by Eric Saderholm P.Geo, Director and Technical Advisor of Canter Resources, a Qualified Person (QP), as defined under National Instrument 43- 101 - Standards of Disclosure for Mineral Projects.</p><p>About Canter Resources Corp.</p><p>Canter Resources Corp. is a junior mineral exploration company advancing the Columbus Lithium-Boron Project in Nevada, USA and the Beaver Creek Lithium Property in Montana, USA. The Company is completing a phased drilling approach at Columbus to test highly prospective brine targets at varying depths for lithium-boron enrichment and plans to leverage the Company's critical metals targeting database to generate a portfolio of high-quality projects with the aim of defining mineral resources that support the technology and domestic clean energy supply chains in North America.</p><div id=\"contactInfo\"><p>For further information contact:</p><p>Joness Lang<br />Chief Executive Officer <br />Canter Resources Corp. <br />Tel: 778.382.1193<br /><a href=\"mailto:jlang@canterresources.com\">jlang@canterresources.com</a></p><p>For investor inquiries contact:</p><p>Kristina Pillon, High Tide Consulting Corp.<br />Tel: 604.908.1695<br /><a href=\"mailto:investors@canterresources.com\">investors@canterresources.com</a> </p></div><p><i>The Canadian Securities Exchange has neither approved nor disapproved the contents of this news release. The Canadian Securities Exchange does not accept responsibility for the adequacy or accuracy of this news release.</i></p><p id=\"corporateNewsLogoContainer\"><img src=\"https://images.newsfilecorp.com/files/10112/223152_f4c8cc6144acc81e_logo.jpg\" id=\"corporateNewsLogo\" alt=\"Corporate Logo\" /></p><p id=\"corporateLinkBack\">To view the source version of this press release, please visit <a href=\"https://api.newsfilecorp.com/redirect/3jD0JIqAMD\">https://www.newsfilecorp.com/release/223152</a></p>",
    "search_terms": "Railroad Valley,Canter Resources Corp,CRC",
    "master_gid": 8572,
    "date": "2024-09-12T20:25:00.000Z",
    "tags": "USA|Nevada|||Project Acquisition",
    "image_id": null,
    "hidden": false,
    "company_id": 1933,
    "provider": "newsfilecorp",
    "excerpt": "Vancouver, British Columbia--(Newsfile Corp. - September 12, 2024) -Canter Resources Corp. (CSE: CRC) (OTC Pink: CNRCF) (FSE: 601)(\"Canter\" or the \"Company\") is pleased to report that it has acquired a prospective 1,000 acre property (\"RV Project\") in Railroad Valley, located in Nye county, Nevada. The RV Project is located 164",
    "is_regulatory": false,
    "refined_tags": null,
    "ftp_filename": null,
    "company_name": "Canter Resources Corp",
    "exchange": "CSE",
    "root_ticker": "CRC",
    "project_name": "Railroad Valley",
    "gid": 8572,
    "location": null,
    "plan_id": "companytier2",
    "description_text": "Vancouver, British Columbia--(Newsfile Corp. - September 12, 2024) - Canter Resources Corp. (CSE: CRC) (OTC Pink: CNRCF) (FSE: 601) (\" Canter \" or the \" Company \") is pleased to report that it has acquired a prospective 1,000 acre property (\"RV Project\") in Railroad Valley, located in Nye county, Nevada. The RV Project is located 164 kilometres east-northeast of Tonopah, Nevada, and accessible via Highway 6, ideally located for exploration and potential development. Despite its promising geologic similarities to Clayton Valley, Railroad Valley remains largely underexplored for lithium and boron. The Railroad Valley basin shares several critical geological features with Clayton Valley, which has been North America's leading lithium producer since 1966. Both valleys are structurally closed basins with similar fault-bounded graben structures, making them ideal for lithium and boron brine accumulation. However, Railroad Valley stands out due to its larger basin size, which is 2.5 times larger in catchment area and 3.5 times larger in playa surface area compared to Clayton Valley. \"We are pleased to add another lithium-boron brine target to the Company's Nevada project portfolio in a valley we view as one of the most promising untapped lithium-boron brine opportunities in the region,\" commented Canter CEO, Joness Lang. \"We remain focused on advancing exploration at our flagship Columbus Project but will continue to leverage our targeting database to make low-cost strategic acquisitions to strengthen the Company's portfolio when opportunities present themselves.\" Lithium and Boron Potential Historic soil samples collected from the Railroad Valley site have returned values between 150 and 280 ppm lithium, a range consistent with known lithium brine-producing basins. Recent soil sampling by Canter returned surface values of up to 160 ppm lithium and 610 ppm boron. This, coupled with the area's high geothermal heat flux, enhances the potential for diagenetic alteration and lithium and boron release from surrounding volcanic and sedimentary formations into the underlying brine aquifers. The RV Project is contiguous with claims held by 3 Proton Lithium (private), who is the largest claim holder and most active lithium-boron exploration company in Railroad Valley. Photo 1: Soil sample collected at the newly acquired RV Project To view an enhanced version of this graphic, please visit: https://images.newsfilecorp.com/files/10112/223152_f4c8cc6144acc81e_001full.jpg Acquisition Terms Canter, and its indirect, wholly owned subsidiary, Altitude Lithium USA Corp., entered into a Claims Acquisition Agreement with Ramp Metals USA Inc. to a 100% interest in 50 unpatented association placer claims in Railroad Valley for the following consideration: 300,000 Canter common shares (\"Consideration Shares\") with a deemed price of CAD$0.13 payable to Ramp Metals Inc. (TSXV: RAMP), the parent corporation of Ramp Metals USA Inc.; Canter will pay transfer costs and reimburse recently paid BLM fees; and Ramp Metals USA Inc. will retain a 0.5% NSR, with Canter having the ability to buy back the NSR for a one-time CAD$500,000 payment at any time. The Consideration Shares will be subject to a hold period of four months from the date of issuance pursuant to securities laws in Canada. The transaction remains subject to regulatory approval with a targeted closing date of September 19, 2024. Qualified Person (QP) The technical information contained in this news release was reviewed and approved by Eric Saderholm P.Geo, Director and Technical Advisor of Canter Resources, a Qualified Person (QP), as defined under National Instrument 43- 101 - Standards of Disclosure for Mineral Projects. About Canter Resources Corp. Canter Resources Corp. is a junior mineral exploration company advancing the Columbus Lithium-Boron Project in Nevada, USA and the Beaver Creek Lithium Property in Montana, USA. The Company is completing a phased drilling approach at Columbus to test highly prospective brine targets at varying depths for lithium-boron enrichment and plans to leverage the Company's critical metals targeting database to generate a portfolio of high-quality projects with the aim of defining mineral resources that support the technology and domestic clean energy supply chains in North America. For further information contact: Joness Lang Chief Executive Officer Canter Resources Corp. Tel: 778.382.1193 jlang@canterresources.com For investor inquiries contact: Kristina Pillon, High Tide Consulting Corp. Tel: 604.908.1695 investors@canterresources.com The Canadian Securities Exchange has neither approved nor disapproved the contents of this news release. The Canadian Securities Exchange does not accept responsibility for the adequacy or accuracy of this news release. To view the source version of this press release, please visit https://www.newsfilecorp.com/release/223152",
    "primary_commodity": "Li"
  },
  "articleProject": {
    "gid": 8572,
    "project_name": "Railroad Valley",
    "location": null
  },
  "articleExchange": "CSE",
  "articleCompanyId": 1933,
  "articleTicker": "CRC",
  "articleCompanyName": "Canter Resources Corp",
  "allOtherCompanyProjects": [
    {
      "company_id": 1933,
      "gid": 8572,
      "project_name": "Railroad Valley",
      "location": null
    },
    {
      "company_id": 1933,
      "gid": 6827,
      "project_name": "Beaver Creek",
      "location": null
    },
    {
      "company_id": 1933,
      "gid": 5794,
      "project_name": "Columbus",
      "location": "Nevada, United States"
    }
  ],
  "allOtherCompanyNews": [
    {
      "id": 106746,
      "company_id": 1933,
      "title": "Canter Resources Advances Railroad Valley Project with Integration of Historical Data Sets",
      "link": null,
      "date": "2025-06-03T11:00:00.000Z",
      "hidden": false
    },
    {
      "id": 99780,
      "company_id": 1933,
      "title": "Canter Appoints Warwick Smith as Executive Chairman",
      "link": null,
      "date": "2025-04-15T11:00:00.000Z",
      "hidden": false
    },
    {
      "id": 99328,
      "company_id": 1933,
      "title": "Canter Resources Provides Corporate Updates and Comments on Potential Impact of Tariffs on Lithium and Boron Markets",
      "link": null,
      "date": "2025-04-10T11:00:00.000Z",
      "hidden": false
    },
    {
      "id": 98847,
      "company_id": 1933,
      "title": "Canter Resources Receives Approval of Amended Notice of Intent, Clearing Path for Expanded Drilling at the Columbus Lithium-Boron Project",
      "link": null,
      "date": "2025-04-07T11:00:00.000Z",
      "hidden": false
    },
    {
      "id": 89958,
      "company_id": 1933,
      "title": "Canter Submits Amended Notice of Intent for Columbus Lithium-Boron Project to Bureau of Land Management",
      "link": "https://www.newsfilecorp.com/release/243079/Canter-Submits-Amended-Notice-of-Intent-for-Columbus-LithiumBoron-Project-to-Bureau-of-Land-Management",
      "date": "2025-03-04T12:00:00.000Z",
      "hidden": false
    },
    {
      "id": 87729,
      "company_id": 1933,
      "title": "Canter Engages Sunstone Environmental Solutions to Finalize Amended Notice of Intent Submission with Bureau of Land Management",
      "link": "https://www.newsfilecorp.com/release/240733/Canter-Engages-Sunstone-Environmental-Solutions-to-Finalize-Amended-Notice-of-Intent-Submission-with-Bureau-of-Land-Management",
      "date": "2025-02-13T12:00:00.000Z",
      "hidden": false
    },
    {
      "id": 85025,
      "company_id": 1933,
      "title": "Canter Completes Updated 3D Model for The Columbus Lithium-Boron Project in Nevada",
      "link": "https://www.newsfilecorp.com/release/238162/Canter-Completes-Updated-3D-Model-for-The-Columbus-LithiumBoron-Project-in-Nevada",
      "date": "2025-01-23T12:00:00.000Z",
      "hidden": false
    },
    {
      "id": 81440,
      "company_id": 1933,
      "title": "Canter Acquires Key Central Claims at Columbus, Reports Highest Boron Grades To-date and Provides Targeting Update",
      "link": "https://www.newsfilecorp.com/release/233149/Canter-Acquires-Key-Central-Claims-at-Columbus-Reports-Highest-Boron-Grades-Todate-and-Provides-Targeting-Update",
      "date": "2024-12-10T12:00:00.000Z",
      "hidden": false
    },
    {
      "id": 76784,
      "company_id": 1933,
      "title": "Canter Completes Amendments to Columbus Project Agreements",
      "link": "https://www.newsfilecorp.com/release/228306/Canter-Completes-Amendments-to-Columbus-Project-Agreements",
      "date": "2024-10-30T11:00:00.000Z",
      "hidden": false
    },
    {
      "id": 75141,
      "company_id": 1933,
      "title": "Canter Completes Railroad Valley Acquisition",
      "link": "https://www.newsfilecorp.com/release/226911/Canter-Completes-Railroad-Valley-Acquisition",
      "date": "2024-10-17T13:25:00.000Z",
      "hidden": false
    }
  ]
}
