{
  "article": {
    "id": 75141,
    "link": "https://www.newsfilecorp.com/release/226911/Canter-Completes-Railroad-Valley-Acquisition",
    "title": "Canter Completes Railroad Valley Acquisition",
    "description": "<img src=\"https://api.newsfilecorp.com/newsinfo/226911/367\" id=\"367\" width=\"2\" height=\"2\" style=\"width: 1px;  height: 1px;border: 0px solid;\" /><p>Vancouver, British Columbia--(Newsfile Corp. - October 17, 2024) - <b>Canter Resources Corp. (CSE: CRC) (OTC Pink: CNRCF) (FSE: 6O1)</b> (\"<b>Canter</b>\" or the \"<b>Company</b>\") is pleased to report that the Company's transaction to acquire the Railroad Valley claims (\"<b>RV Project</b>\"), as previously reported (see Company news release on September 12, 2024), has now closed. </p><p>The RV Project claim block is contiguous with ground controlled by the most active critical mineral explorer in Railroad Valley, 3 Proton Lithium or 3PL (private). Canter has compiled historical data and plans to complete follow up sampling at the RV Project (164 kilometres from the Company's exploration base in Tonopah) in Q4/2024.</p><p>\"We are excited to have expanded our lithium-boron exploration footprint in Nevada with this strategic acquisition in a highly prospective, yet underexplored area,\" commented Canter CEO, Joness Lang. \"While our primary focus remains on advancing our flagship Columbus Project, we see value in adding low-cost, high-potential projects that strengthen our portfolio and align with our long-term growth strategy.\"</p><p>Railroad Valley presents a geologically favourable environment for lithium-boron exploration due to several key geological features:</p><p><b>Paleozoic and Tertiary Rock Units</b>:</p><ul style=\"list-style-type: circle;\"><li><p>The valley is flanked by <b>Paleozoic limestone and dolomite carbonate rocks</b>. These rocks are exposed in the <b>Pancake Range</b> to the west and the <b>Quinn Canyon</b> and <b>Grant Ranges</b> to the east.</p></li><li><p>The east side of Railroad Valley is underlain by <b>Paleozoic rocks</b>, while the west side is dominated by <b>Tertiary volcanic rocks</b> at depths of up to 4,900 feet. These formations, particularly the volcanic units, are essential in hosting lithium deposits.</p></li></ul><p style=\"text-align: center;\"><a rel=\"nofollow\" href=\"https://images.newsfilecorp.com/files/10112/226911_8e06befd9473c855_001full.jpg\"><img src=\"https://images.newsfilecorp.com/files/10112/226911_8e06befd9473c855_001.jpg\" style=\"border-width: 0px;\" alt=\"Cannot view this image? Visit: https://images.newsfilecorp.com/files/10112/226911_8e06befd9473c855_001.jpg\" /></a><br /><br /><b>Figure 1:</b>&#160;Showing location of Canter's flagship Columbus and Railroad Valley (RV) lithium-boron projects in Nevada.</p><p style=\"text-align: center;\">To view an enhanced version of this graphic, please visit:<br /><a rel=\"nofollow\" href=\"https://images.newsfilecorp.com/files/10112/226911_8e06befd9473c855_001full.jpg\">https://images.newsfilecorp.com/files/10112/226911_8e06befd9473c855_001full.jpg</a></p><p><b>Volcanic Calderas</b>:</p><ul style=\"list-style-type: circle;\"><li><p>A major geologic feature of interest is the <b>Hot Creek Valley Caldera Complex</b>, located in the Pancake Range to the west of Railroad Valley. This complex consists of five individual calderas. Additionally, three more calderas are present on the southern side of the valley and one on the northern side.</p></li><li><p>The presence of these volcanic calderas is considered highly favorable for lithium and boron exploration, as volcanic activity can lead to the concentration of these elements in the basin sediments.</p></li></ul><p><b>Geologic Activity and Basin Characteristics</b>:</p><ul style=\"list-style-type: circle;\"><li>The combination of the valley's <b>closed-basin structure</b>, underlying volcanic rocks, and <b>evaporation processes</b> creates ideal conditions for the concentration of lithium and boron in the playa areas and beneath the valley floor.</li></ul><p>For more information about boron and lithium, please visit the Company's <a href=\"https://api.newsfilecorp.com/redirect/q8a2pCWrQy\">Boron 101</a> and <a href=\"https://api.newsfilecorp.com/redirect/nVaWoc3N7X\">Lithium 101</a> pages on the website.</p><p>Disclaimer: Mineralization at nearby or adjacent projects is not necessarily indicative of mineralization at the Company's Columbus Project. </p><p><b>Qualified Person (QP)</b></p><p>The technical information contained in this news release was reviewed and approved by Eric Saderholm P.Geo, Director and Technical Advisor of Canter Resources, a Qualified Person (QP), as defined under National Instrument 43- 101&#160;&#8211; Standards of Disclosure for Mineral Projects.</p><p><b>About Canter Resources Corp.</b></p><p>Canter Resources Corp. is a junior mineral exploration company advancing the Columbus Lithium-Boron Project and the Railroad Valley (RV) Lithium-Boron Project in Nevada, USA. The Company is completing a phased drilling approach at Columbus to test highly prospective brine targets at varying depths for lithium-boron enrichment and plans to leverage the Company's critical metals targeting database to generate a portfolio of high-quality projects with the aim of defining mineral resources that support the technology and domestic clean energy supply chains in North America.</p><div id=\"contactInfo\"><p>For further information contact:</p><p>Joness Lang<br />Chief Executive Officer <br />Canter Resources Corp. <br />Tel: 778.382.1193<br /><a href=\"mailto:jlang@canterresources.com\">jlang@canterresources.com</a></p><p>For investor inquiries contact:</p><p>Kristina Pillon, High Tide Consulting Corp.<br />Tel: 604.908.1695<br /><a href=\"mailto:investors@canterresources.com\">investors@canterresources.com</a> </p></div><p><i>The Canadian Securities Exchange has neither approved nor disapproved the contents of this news release. The Canadian Securities Exchange does not accept responsibility for the adequacy or accuracy of this news release.</i></p><p id=\"corporateNewsLogoContainer\"><img src=\"https://images.newsfilecorp.com/files/10112/226911_8e06befd9473c855_logo.jpg\" id=\"corporateNewsLogo\" alt=\"Corporate Logo\" /></p><p id=\"corporateLinkBack\">To view the source version of this press release, please visit <a href=\"https://api.newsfilecorp.com/redirect/K8Y0LCr17O\">https://www.newsfilecorp.com/release/226911</a></p>",
    "search_terms": "Railroad Valley,Canter Resources Corp,CRC",
    "master_gid": 8572,
    "date": "2024-10-17T13:25:00.000Z",
    "tags": "|||Lithium|Project Acquisition",
    "image_id": null,
    "hidden": false,
    "company_id": 1933,
    "provider": "newsfilecorp",
    "excerpt": "Vancouver, British Columbia--(Newsfile Corp. - October 17, 2024) -Canter Resources Corp. (CSE: CRC) (OTC Pink: CNRCF) (FSE: 6O1)(\"Canter\" or the \"Company\") is pleased to report that the Company's transaction to acquire the Railroad Valley claims (\"RV Project\"), as previously reported (see Company news release on September 12, 2024), has now",
    "is_regulatory": false,
    "refined_tags": [],
    "ftp_filename": null,
    "company_name": "Canter Resources Corp",
    "exchange": "CSE",
    "root_ticker": "CRC",
    "project_name": "Railroad Valley",
    "gid": 8572,
    "location": null,
    "plan_id": "companytier2",
    "description_text": "Vancouver, British Columbia--(Newsfile Corp. - October 17, 2024) - Canter Resources Corp. (CSE: CRC) (OTC Pink: CNRCF) (FSE: 6O1) (\" Canter \" or the \" Company \") is pleased to report that the Company's transaction to acquire the Railroad Valley claims (\" RV Project \"), as previously reported (see Company news release on September 12, 2024), has now closed. The RV Project claim block is contiguous with ground controlled by the most active critical mineral explorer in Railroad Valley, 3 Proton Lithium or 3PL (private). Canter has compiled historical data and plans to complete follow up sampling at the RV Project (164 kilometres from the Company's exploration base in Tonopah) in Q4/2024. \"We are excited to have expanded our lithium-boron exploration footprint in Nevada with this strategic acquisition in a highly prospective, yet underexplored area,\" commented Canter CEO, Joness Lang. \"While our primary focus remains on advancing our flagship Columbus Project, we see value in adding low-cost, high-potential projects that strengthen our portfolio and align with our long-term growth strategy.\" Railroad Valley presents a geologically favourable environment for lithium-boron exploration due to several key geological features: Paleozoic and Tertiary Rock Units : The valley is flanked by Paleozoic limestone and dolomite carbonate rocks . These rocks are exposed in the Pancake Range to the west and the Quinn Canyon and Grant Ranges to the east. The east side of Railroad Valley is underlain by Paleozoic rocks , while the west side is dominated by Tertiary volcanic rocks at depths of up to 4,900 feet. These formations, particularly the volcanic units, are essential in hosting lithium deposits. Figure 1: Showing location of Canter's flagship Columbus and Railroad Valley (RV) lithium-boron projects in Nevada. To view an enhanced version of this graphic, please visit: https://images.newsfilecorp.com/files/10112/226911_8e06befd9473c855_001full.jpg Volcanic Calderas : A major geologic feature of interest is the Hot Creek Valley Caldera Complex , located in the Pancake Range to the west of Railroad Valley. This complex consists of five individual calderas. Additionally, three more calderas are present on the southern side of the valley and one on the northern side. The presence of these volcanic calderas is considered highly favorable for lithium and boron exploration, as volcanic activity can lead to the concentration of these elements in the basin sediments. Geologic Activity and Basin Characteristics : The combination of the valley's closed-basin structure , underlying volcanic rocks, and evaporation processes creates ideal conditions for the concentration of lithium and boron in the playa areas and beneath the valley floor. For more information about boron and lithium, please visit the Company's Boron 101 and Lithium 101 pages on the website. Disclaimer: Mineralization at nearby or adjacent projects is not necessarily indicative of mineralization at the Company's Columbus Project. Qualified Person (QP) The technical information contained in this news release was reviewed and approved by Eric Saderholm P.Geo, Director and Technical Advisor of Canter Resources, a Qualified Person (QP), as defined under National Instrument 43- 101 – Standards of Disclosure for Mineral Projects. About Canter Resources Corp. Canter Resources Corp. is a junior mineral exploration company advancing the Columbus Lithium-Boron Project and the Railroad Valley (RV) Lithium-Boron Project in Nevada, USA. The Company is completing a phased drilling approach at Columbus to test highly prospective brine targets at varying depths for lithium-boron enrichment and plans to leverage the Company's critical metals targeting database to generate a portfolio of high-quality projects with the aim of defining mineral resources that support the technology and domestic clean energy supply chains in North America. For further information contact: Joness Lang Chief Executive Officer Canter Resources Corp. Tel: 778.382.1193 jlang@canterresources.com For investor inquiries contact: Kristina Pillon, High Tide Consulting Corp. Tel: 604.908.1695 investors@canterresources.com The Canadian Securities Exchange has neither approved nor disapproved the contents of this news release. The Canadian Securities Exchange does not accept responsibility for the adequacy or accuracy of this news release. To view the source version of this press release, please visit https://www.newsfilecorp.com/release/226911",
    "primary_commodity": "Li"
  },
  "articleProject": {
    "gid": 8572,
    "project_name": "Railroad Valley",
    "location": null
  },
  "articleExchange": "CSE",
  "articleCompanyId": 1933,
  "articleTicker": "CRC",
  "articleCompanyName": "Canter Resources Corp",
  "allOtherCompanyProjects": [
    {
      "company_id": 1933,
      "gid": 8572,
      "project_name": "Railroad Valley",
      "location": null
    },
    {
      "company_id": 1933,
      "gid": 6827,
      "project_name": "Beaver Creek",
      "location": null
    },
    {
      "company_id": 1933,
      "gid": 5794,
      "project_name": "Columbus",
      "location": "Nevada, United States"
    }
  ],
  "allOtherCompanyNews": [
    {
      "id": 106746,
      "company_id": 1933,
      "title": "Canter Resources Advances Railroad Valley Project with Integration of Historical Data Sets",
      "link": null,
      "date": "2025-06-03T11:00:00.000Z",
      "hidden": false
    },
    {
      "id": 99780,
      "company_id": 1933,
      "title": "Canter Appoints Warwick Smith as Executive Chairman",
      "link": null,
      "date": "2025-04-15T11:00:00.000Z",
      "hidden": false
    },
    {
      "id": 99328,
      "company_id": 1933,
      "title": "Canter Resources Provides Corporate Updates and Comments on Potential Impact of Tariffs on Lithium and Boron Markets",
      "link": null,
      "date": "2025-04-10T11:00:00.000Z",
      "hidden": false
    },
    {
      "id": 98847,
      "company_id": 1933,
      "title": "Canter Resources Receives Approval of Amended Notice of Intent, Clearing Path for Expanded Drilling at the Columbus Lithium-Boron Project",
      "link": null,
      "date": "2025-04-07T11:00:00.000Z",
      "hidden": false
    },
    {
      "id": 89958,
      "company_id": 1933,
      "title": "Canter Submits Amended Notice of Intent for Columbus Lithium-Boron Project to Bureau of Land Management",
      "link": "https://www.newsfilecorp.com/release/243079/Canter-Submits-Amended-Notice-of-Intent-for-Columbus-LithiumBoron-Project-to-Bureau-of-Land-Management",
      "date": "2025-03-04T12:00:00.000Z",
      "hidden": false
    },
    {
      "id": 87729,
      "company_id": 1933,
      "title": "Canter Engages Sunstone Environmental Solutions to Finalize Amended Notice of Intent Submission with Bureau of Land Management",
      "link": "https://www.newsfilecorp.com/release/240733/Canter-Engages-Sunstone-Environmental-Solutions-to-Finalize-Amended-Notice-of-Intent-Submission-with-Bureau-of-Land-Management",
      "date": "2025-02-13T12:00:00.000Z",
      "hidden": false
    },
    {
      "id": 85025,
      "company_id": 1933,
      "title": "Canter Completes Updated 3D Model for The Columbus Lithium-Boron Project in Nevada",
      "link": "https://www.newsfilecorp.com/release/238162/Canter-Completes-Updated-3D-Model-for-The-Columbus-LithiumBoron-Project-in-Nevada",
      "date": "2025-01-23T12:00:00.000Z",
      "hidden": false
    },
    {
      "id": 81440,
      "company_id": 1933,
      "title": "Canter Acquires Key Central Claims at Columbus, Reports Highest Boron Grades To-date and Provides Targeting Update",
      "link": "https://www.newsfilecorp.com/release/233149/Canter-Acquires-Key-Central-Claims-at-Columbus-Reports-Highest-Boron-Grades-Todate-and-Provides-Targeting-Update",
      "date": "2024-12-10T12:00:00.000Z",
      "hidden": false
    },
    {
      "id": 76784,
      "company_id": 1933,
      "title": "Canter Completes Amendments to Columbus Project Agreements",
      "link": "https://www.newsfilecorp.com/release/228306/Canter-Completes-Amendments-to-Columbus-Project-Agreements",
      "date": "2024-10-30T11:00:00.000Z",
      "hidden": false
    },
    {
      "id": 75141,
      "company_id": 1933,
      "title": "Canter Completes Railroad Valley Acquisition",
      "link": "https://www.newsfilecorp.com/release/226911/Canter-Completes-Railroad-Valley-Acquisition",
      "date": "2024-10-17T13:25:00.000Z",
      "hidden": false
    }
  ]
}
