{
  "article": {
    "id": 38496,
    "link": "https://www.newsfilecorp.com/release/174941/Surge-Battery-Metals-Announces-100-Increase-in-Land-Position-at-Nevada-North-Lithium-Project",
    "title": "Surge Battery Metals Announces 100% Increase in Land Position at Nevada North Lithium Project",
    "description": "<img src=\"https://api.newsfilecorp.com/newsinfo/174941/367\" id=\"367\" width=\"2\" height=\"2\" style=\"width: 1px;  height: 1px;border: 0px solid;\" /><p>West Vancouver, British Columbia--(Newsfile Corp. - July 26, 2023) - Surge Battery Metals Inc. (TSXV: NILI) (OTC PINK: NILIF) (FSE: DJ5C)&#160; (the \"<b>Company</b>\" or \"<b>Surge</b>\") is pleased to announce a significant expansion of its land holdings at the Nevada North Lithium Project (\"NNLP\") through additional claim staking by the Company (100% interest without any royalties) and by way of an Agreement with M3 Metals Corp (\"M3M\").</p><p>With the additional staked lands and including the interest in the M3 Lands, the Company will have increased its land position in the area to approximately 12,800 acres or 5,180 hectares up from a previous area of 6,270 acres or 2,537 hectares.</p><p><u>Surge Battery Metals Property Map as of 2023-07-24</u></p><p style=\"text-align: center;\"><a rel=\"nofollow\" href=\"https://images.newsfilecorp.com/files/9838/174941_a0df858b04e19a92_001full.jpg\"><img src=\"https://images.newsfilecorp.com/files/9838/174941_a0df858b04e19a92_001.jpg\" style=\"border-width: 0px;\" alt=\"Cannot view this image? Visit: https://images.newsfilecorp.com/files/9838/174941_a0df858b04e19a92_001.jpg\" /></a><br /><br />To view an enhanced version of this graphic, please visit:<br /><a rel=\"nofollow\" href=\"https://images.newsfilecorp.com/files/9838/174941_a0df858b04e19a92_001full.jpg\">https://images.newsfilecorp.com/files/9838/174941_a0df858b04e19a92_001full.jpg</a></p><p><b>Mr. Greg Reimer, Chief Executive Officer and Director </b>commented \"I am very pleased to announce the M3M Agreement as a strategic acquisition by the Company that ensures it controls potential extensions of our existing high tenor, lithium clay deposit. In addition, over the last several months, Surge has completed additional staking which significantly adds to the strategic land package. These acquisitions support where our geological staff see strong indications for additional lithium bearing clay horizons. The Company will incorporate this package in its exploration activities over the coming months.\"</p><p><b>M3 Metals Corp Option and JV Agreement.  </b>The Company has entered into a mineral property option and joint venture agreement (the \"M3M Agreement\") with M3 Metals Corp. (\"M3M\"), a TSX Venture Exchange listed company.  </p><p>The M3M Agreement grants the Company the option (the \"Option\") to earn up to an eighty (80%) percent interest in and to the M3M Lands (as shown above as M3 Metals Claim Block) by making the following option payments: </p><p>(i)  to earn a fifty (50%) percent interest upon Closing in the M3M Lands, the Company must               make a cash payment to M3M of $500,000 and issue to M3M a total of 2,000,000 of the               Company's common shares.</p><p>(ii)  to earn an additional twenty (20%) percent interest in the M3M Lands, the Company must               make a cash payment to M3M of $250,000, issue to M3M a total of 2,000,000 of the Company's               shares and make $250,000 in exploration expenditures; and</p><p>(iii) to earn an additional ten (10%) percent interest in the M3M Lands, the Company must make               a cash payment to M3M of $500,000 and issue to M3M a total of 1,000,000 of the Company's               shares.  </p><p>Upon earning a fifty (50%) percent interest in the M3M Lands, the Company may either continue to earn the additional twenty (20%) percent interest and ten (10%) percent interest in the M3M Lands or may require M3M to enter into a joint venture agreement with it for further exploration and development of the M3M Lands.  Upon payment of the Full Option Exercise Price, M3M and the Company must enter into a joint venture agreement with industry customary terms including that the party with the greater interest in the M3M Lands will act as the Operator of the M3M Lands unless otherwise agreed between them. </p><p>Closing of the M3M Agreement is expected to occur within ten (10) days of TSX Venture Exchange approval of the M3M Agreement.  The M3M Agreement, and the Option, have a term of five (5) years and require, upon their termination, that the parties enter into a joint venture provided that Surge has earned at least a fifty (50%) percent interest in the M3M Lands. </p><p>No finder's fees are payable in connection with the M3M Agreement and M3M and the Company are not related parties for the purposes of MI 61-101 or otherwise subject to it. </p><p>The M3M Agreement, and the performance of the Company's obligations thereunder, are conditional upon the approval of the TSX Venture Exchange. </p><p><b>About Surge Battery Metals Inc. </b></p><p>The Company is a Canadian-based mineral exploration company active in the exploration for lithium in Nevada whose primary listing is on the TSX Venture Exchange.  The Company's maintains a focus on exploration for high value battery metals required for the electric vehicle (EV) market.</p><p><b>About the Nevada North Lithium Project</b></p><p>The Company owns or controls 12,800 acres in the <b>Nevada North Lithium Project, </b>consisting of  733 mineral claims, located in the Granite Range southeast of Jackpot, about 73 km north-northeast of Wells, Elko County, Nevada. The first round of drilling, completed in October 2022, identified a strongly mineralized zone of lithium bearing clays occupying a strike length of almost 1,620 meters from drillhole NN2205 in the north to drill hole NN2208 in the south. Widths of the mineralized horizons are not well determined since the holes are mostly on a north-south alignment, however, widths are at least 400 metres, supported by highly anomalous soil values indicating potential for the clay horizons to be much greater in extent. The potential for a significant lithium deposit can be illustrated by the results of drillhole NN2207 which intersected the thickest intervals of lithium-rich claystone encountered to date; a total of 120.4 metres (395 feet) averaging 3,943 ppm lithium in four zones. Additionally, drillhole NN2208 had the strongest downhole individual sample of 5,950 ppm lithium between 45 and 50 feet (13.72 and 15.24 metres). The average lithium content within all near surface clay zones intersected in 2022 drilling, applying a 1000 ppm cut-off, was 3254 ppm. </p><p><b>Qualified Person as Defined Under National Instrument 43-101</b></p><p>Alan J. Morris, MSc, CPG of Spring Creek, Nevada, a Qualified Person as defined under National Instrument 43-101 has reviewed and approved the technical aspects of this news release.</p><p><b>On behalf of the Board of Directors</b></p><p><i>\"Greg Reimer\"<br /></i><br />Greg Reimer, <br />President &#38; CEO</p><p><b>Contact Information<br /></b><br />Email :  <a href=\"mailto:info@surgebatterymetals.com\">info@surgebatterymetals.com</a><br />Phone : 778-945-2656<br />Website: <a href=\"https://api.newsfilecorp.com/redirect/nVV20H2qYZ\">surgebatterymetals.com</a></p><p><i><b>Neither the TSX Venture Exchange nor its Regulation Services Provider (as that term is defined in the policies of the TSX Venture Exchange) accepts responsibility for the adequacy or accuracy of this release.  </b></i></p><p>This document may contain certain \"Forward-Looking Statements\" within the meaning of the United States Private Securities Litigation Reform Act of 1995 and applicable Canadian securities laws. When used in this news release, the words \"anticipate\", \"believe\", \"estimate\", \"expect\", \"target, \"plan\" or \"planned\", \"possible\", \"potential\", \"forecast\", \"intend\", \"may\", \"schedule\" and similar words or expressions identify forward-looking statements or information. These forward-looking statements or information may relate to future prices of commodities including lithium and nickel, the accuracy of mineral or resource exploration activity, reserves or resources, regulatory or government requirements or approvals including approvals of title and mining rights or licenses and environmental, local community or indigenous community approvals, the reliability of third party information, continued access to mineral properties or infrastructure or water, changes in laws, rules and regulations including in the United States, Nevada or California or any other jurisdiction which may impact upon the Company or its properties or the commercial exploitation of those properties, currency risks including the exchange rate of USD$ for Cdn$ or other currencies, fluctuations in the market for lithium related products, changes in exploration costs and government royalties, export policies or taxes in the United States or any other jurisdiction and other factors or information. The Company's current plans, expectations and intentions with respect to development of its business and of its Nevada properties may be impacted by economic uncertainties arising out of any pandemic or by the impact of current financial and other market conditions (including US government subsidies or incentives) on its ability to secure further financing or funding of its Nevada properties. Such statements represent the Company's current views with respect to future events and are necessarily based upon a number of assumptions and estimates that, while considered reasonable by the Company, are inherently subject to significant business, economic, competitive, political, environmental (including endangered species, habitat preservation and water related risks) and social risks, contingencies and uncertainties. Many factors, both known and unknown, could cause results, performance or achievements to be materially different from the results, performance or achievements that are or may be expressed or implied by such forward-looking statements. The Company does not intend, and does not assume any obligation, to update these forward-looking statements or information to reflect changes in assumptions or changes in circumstances or any other events affecting such statements and information other than as required by applicable laws, rules and regulations.</p><p id=\"corporateNewsLogoContainer\"><img src=\"https://images.newsfilecorp.com/files/9838/174941_a0df858b04e19a92_logo.jpg\" id=\"corporateNewsLogo\" alt=\"Corporate Logo\" /></p><p id=\"corporateLinkBack\">To view the source version of this press release, please visit <a href=\"https://api.newsfilecorp.com/redirect/K88pEiOGeR\">https://www.newsfilecorp.com/release/174941</a></p>",
    "search_terms": "Nevada North,Surge Battery Metals Inc.,NILI",
    "master_gid": 3474,
    "date": "2023-07-26T12:00:00.000Z",
    "tags": "USA|Nevada||Lithium|Project Acquisition",
    "image_id": null,
    "hidden": false,
    "company_id": 480,
    "provider": null,
    "excerpt": "West Vancouver, British Columbia--(Newsfile Corp. - July 26, 2023) - Surge Battery Metals Inc. (TSXV: NILI) (OTC PINK: NILIF) (FSE: DJ5C)&#160; (the \"Company\" or \"Surge\") is pleased to announce a significant expansion of its land holdings at the Nevada North Lithium Project (\"NNLP\") through additional claim staking by the Company",
    "is_regulatory": false,
    "refined_tags": [
      "Project Acquisition"
    ],
    "ftp_filename": null,
    "company_name": "Surge Battery Metals Inc.",
    "exchange": "TSXV",
    "root_ticker": "NILI",
    "project_name": "Nevada North",
    "gid": 3474,
    "location": "Nevada, United States",
    "plan_id": null,
    "description_text": "West Vancouver, British Columbia--(Newsfile Corp. - July 26, 2023) - Surge Battery Metals Inc. (TSXV: NILI) (OTC PINK: NILIF) (FSE: DJ5C)  (the \" Company \" or \" Surge \") is pleased to announce a significant expansion of its land holdings at the Nevada North Lithium Project (\"NNLP\") through additional claim staking by the Company (100% interest without any royalties) and by way of an Agreement with M3 Metals Corp (\"M3M\"). With the additional staked lands and including the interest in the M3 Lands, the Company will have increased its land position in the area to approximately 12,800 acres or 5,180 hectares up from a previous area of 6,270 acres or 2,537 hectares. Surge Battery Metals Property Map as of 2023-07-24 To view an enhanced version of this graphic, please visit: https://images.newsfilecorp.com/files/9838/174941_a0df858b04e19a92_001full.jpg Mr. Greg Reimer, Chief Executive Officer and Director commented \"I am very pleased to announce the M3M Agreement as a strategic acquisition by the Company that ensures it controls potential extensions of our existing high tenor, lithium clay deposit. In addition, over the last several months, Surge has completed additional staking which significantly adds to the strategic land package. These acquisitions support where our geological staff see strong indications for additional lithium bearing clay horizons. The Company will incorporate this package in its exploration activities over the coming months.\" M3 Metals Corp Option and JV Agreement. The Company has entered into a mineral property option and joint venture agreement (the \"M3M Agreement\") with M3 Metals Corp. (\"M3M\"), a TSX Venture Exchange listed company. The M3M Agreement grants the Company the option (the \"Option\") to earn up to an eighty (80%) percent interest in and to the M3M Lands (as shown above as M3 Metals Claim Block) by making the following option payments: (i)  to earn a fifty (50%) percent interest upon Closing in the M3M Lands, the Company must               make a cash payment to M3M of $500,000 and issue to M3M a total of 2,000,000 of the               Company's common shares. (ii)  to earn an additional twenty (20%) percent interest in the M3M Lands, the Company must               make a cash payment to M3M of $250,000, issue to M3M a total of 2,000,000 of the Company's               shares and make $250,000 in exploration expenditures; and (iii) to earn an additional ten (10%) percent interest in the M3M Lands, the Company must make               a cash payment to M3M of $500,000 and issue to M3M a total of 1,000,000 of the Company's               shares. Upon earning a fifty (50%) percent interest in the M3M Lands, the Company may either continue to earn the additional twenty (20%) percent interest and ten (10%) percent interest in the M3M Lands or may require M3M to enter into a joint venture agreement with it for further exploration and development of the M3M Lands.  Upon payment of the Full Option Exercise Price, M3M and the Company must enter into a joint venture agreement with industry customary terms including that the party with the greater interest in the M3M Lands will act as the Operator of the M3M Lands unless otherwise agreed between them. Closing of the M3M Agreement is expected to occur within ten (10) days of TSX Venture Exchange approval of the M3M Agreement.  The M3M Agreement, and the Option, have a term of five (5) years and require, upon their termination, that the parties enter into a joint venture provided that Surge has earned at least a fifty (50%) percent interest in the M3M Lands. No finder's fees are payable in connection with the M3M Agreement and M3M and the Company are not related parties for the purposes of MI 61-101 or otherwise subject to it. The M3M Agreement, and the performance of the Company's obligations thereunder, are conditional upon the approval of the TSX Venture Exchange. About Surge Battery Metals Inc. The Company is a Canadian-based mineral exploration company active in the exploration for lithium in Nevada whose primary listing is on the TSX Venture Exchange.  The Company's maintains a focus on exploration for high value battery metals required for the electric vehicle (EV) market. About the Nevada North Lithium Project The Company owns or controls 12,800 acres in the Nevada North Lithium Project, consisting of  733 mineral claims, located in the Granite Range southeast of Jackpot, about 73 km north-northeast of Wells, Elko County, Nevada. The first round of drilling, completed in October 2022, identified a strongly mineralized zone of lithium bearing clays occupying a strike length of almost 1,620 meters from drillhole NN2205 in the north to drill hole NN2208 in the south. Widths of the mineralized horizons are not well determined since the holes are mostly on a north-south alignment, however, widths are at least 400 metres, supported by highly anomalous soil values indicating potential for the clay horizons to be much greater in extent. The potential for a significant lithium deposit can be illustrated by the results of drillhole NN2207 which intersected the thickest intervals of lithium-rich claystone encountered to date; a total of 120.4 metres (395 feet) averaging 3,943 ppm lithium in four zones. Additionally, drillhole NN2208 had the strongest downhole individual sample of 5,950 ppm lithium between 45 and 50 feet (13.72 and 15.24 metres). The average lithium content within all near surface clay zones intersected in 2022 drilling, applying a 1000 ppm cut-off, was 3254 ppm. Qualified Person as Defined Under National Instrument 43-101 Alan J. Morris, MSc, CPG of Spring Creek, Nevada, a Qualified Person as defined under National Instrument 43-101 has reviewed and approved the technical aspects of this news release. On behalf of the Board of Directors \"Greg Reimer\" Greg Reimer, President & CEO Contact Information Email : info@surgebatterymetals.com Phone : 778-945-2656 Website: surgebatterymetals.com Neither the TSX Venture Exchange nor its Regulation Services Provider (as that term is defined in the policies of the TSX Venture Exchange) accepts responsibility for the adequacy or accuracy of this release. This document may contain certain \"Forward-Looking Statements\" within the meaning of the United States Private Securities Litigation Reform Act of 1995 and applicable Canadian securities laws. When used in this news release, the words \"anticipate\", \"believe\", \"estimate\", \"expect\", \"target, \"plan\" or \"planned\", \"possible\", \"potential\", \"forecast\", \"intend\", \"may\", \"schedule\" and similar words or expressions identify forward-looking statements or information. These forward-looking statements or information may relate to future prices of commodities including lithium and nickel, the accuracy of mineral or resource exploration activity, reserves or resources, regulatory or government requirements or approvals including approvals of title and mining rights or licenses and environmental, local community or indigenous community approvals, the reliability of third party information, continued access to mineral properties or infrastructure or water, changes in laws, rules and regulations including in the United States, Nevada or California or any other jurisdiction which may impact upon the Company or its properties or the commercial exploitation of those properties, currency risks including the exchange rate of USD$ for Cdn$ or other currencies, fluctuations in the market for lithium related products, changes in exploration costs and government royalties, export policies or taxes in the United States or any other jurisdiction and other factors or information. The Company's current plans, expectations and intentions with respect to development of its business and of its Nevada properties may be impacted by economic uncertainties arising out of any pandemic or by the impact of current financial and other market conditions (including US government subsidies or incentives) on its ability to secure further financing or funding of its Nevada properties. Such statements represent the Company's current views with respect to future events and are necessarily based upon a number of assumptions and estimates that, while considered reasonable by the Company, are inherently subject to significant business, economic, competitive, political, environmental (including endangered species, habitat preservation and water related risks) and social risks, contingencies and uncertainties. Many factors, both known and unknown, could cause results, performance or achievements to be materially different from the results, performance or achievements that are or may be expressed or implied by such forward-looking statements. The Company does not intend, and does not assume any obligation, to update these forward-looking statements or information to reflect changes in assumptions or changes in circumstances or any other events affecting such statements and information other than as required by applicable laws, rules and regulations. To view the source version of this press release, please visit https://www.newsfilecorp.com/release/174941",
    "primary_commodity": "Li"
  },
  "articleProject": {
    "gid": 3474,
    "project_name": "Nevada North",
    "location": "Nevada, United States"
  },
  "articleExchange": "TSXV",
  "articleCompanyId": 480,
  "articleTicker": "NILI",
  "articleCompanyName": "Surge Battery Metals Inc.",
  "allOtherCompanyProjects": [
    {
      "company_id": 480,
      "gid": 3474,
      "project_name": "Nevada North",
      "location": "Nevada, United States"
    },
    {
      "company_id": 480,
      "gid": 10242,
      "project_name": "Galt",
      "location": "Nevada, United States"
    }
  ],
  "allOtherCompanyNews": [
    {
      "id": 107356,
      "company_id": 480,
      "title": "Surge Battery Metals Announces Webinar on PEA Results",
      "link": null,
      "date": "2025-06-09T20:30:00.000Z",
      "hidden": false
    },
    {
      "id": 107341,
      "company_id": 480,
      "title": "Surge Delivers Preliminary Economic Assessment For High-Grade Nevada North Lithium Project; After-Tax NPV8% US$9.21 Billion and After-Tax IRR of 22.8% OPEX of US$5,097/tonne LCE",
      "link": null,
      "date": "2025-06-09T14:20:00.000Z",
      "hidden": false
    },
    {
      "id": -203849,
      "company_id": 480,
      "title": "Canadian Investment Regulatory Organization Trading Halt - NILI",
      "link": "https://contentapi.cision.com/api/v1.0/releases/20250609C7313",
      "date": "2025-06-09T13:54:00.000Z",
      "hidden": false
    },
    {
      "id": 105392,
      "company_id": 480,
      "title": "Surge Battery Grants Stock Options",
      "link": null,
      "date": "2025-05-21T20:31:00.000Z",
      "hidden": false
    },
    {
      "id": 100003,
      "company_id": 480,
      "title": "Surge Battery Announces New Director",
      "link": null,
      "date": "2025-04-16T12:00:00.000Z",
      "hidden": false
    },
    {
      "id": 99651,
      "company_id": 480,
      "title": "Surge Battery Metals Closes Financing",
      "link": null,
      "date": "2025-04-14T12:00:00.000Z",
      "hidden": false
    },
    {
      "id": 93071,
      "company_id": 480,
      "title": "Surge Battery Metals Provides Corporate Update and Announces Financing",
      "link": null,
      "date": "2025-03-31T12:00:00.000Z",
      "hidden": false
    },
    {
      "id": 92363,
      "company_id": 480,
      "title": "Surge Battery Metals: President Trump Signs Executive Order to Increase America's Mineral Production",
      "link": null,
      "date": "2025-03-25T12:00:00.000Z",
      "hidden": false
    },
    {
      "id": 90137,
      "company_id": 480,
      "title": "Surge Receives Positive Record of Decision on its Exploration Plan of Operations Permit at the Nevada North Lithium Project",
      "link": "https://golddiscovery.com/legacy/user/news_details/742404-nilica-surge-receives-positive-record-of-decision-on-its-exploration-plan-of-operations-permit-at-the-nevada-north-lithium-project",
      "date": "2025-03-05T14:51:00.000Z",
      "hidden": false
    },
    {
      "id": 82682,
      "company_id": 480,
      "title": "Surge's Nevada North Lithium Project Moves to the 30-Day National Environmental Policy Act (NEPA) Environmental Assessment Public Comment Period",
      "link": "https://www.newsfilecorp.com/release/234697/Surges-Nevada-North-Lithium-Project-Moves-to-the-30Day-National-Environmental-Policy-Act-NEPA-Environmental-Assessment-Public-Comment-Period",
      "date": "2024-12-20T17:06:00.000Z",
      "hidden": false
    }
  ]
}
