{
  "article": {
    "id": 42958,
    "link": "https://www.newsfilecorp.com/release/185004/Surge-Closes-Initial-50-Acquisition-of-Lands-in-Area-of-Northern-Nevada-Lithium-Project",
    "title": "Surge Closes Initial 50% Acquisition of Lands in Area of Northern Nevada Lithium Project",
    "description": "<img src=\"https://api.newsfilecorp.com/newsinfo/185004/367\" id=\"367\" width=\"2\" height=\"2\" style=\"width: 1px;  height: 1px;border: 0px solid;\" /><p>West Vancouver, British Columbia--(Newsfile Corp. - October 24, 2023) - Surge Battery Metals Inc. (TSXV: NILI) (OTCQX: NILIF) (FSE: DJ5) (the \"<b>Company</b>\" or \"<b>Surge</b>\") announces that it has received regulatory approval for its option agreement, as amended, (the \"Option Agreement\") between M3 Metals Corp. (\"M3M\") and Surge concerning claims (the \"M3M Lands\") in the area of its NNLP Project.</p><p>Surge has acquired an initial fifty (50%) percent interest in the M3M Lands by way of payment of $500,000 to M3M and issuance of a total of 2,000,000 of Surge's common shares to M3M (the \"Surge Shares\").  </p><p>The Option Agreement provides that Surge can earn an additional twenty (20%) percent interest in the M3M Lands by making a cash payment to M3M of $250,000, issuing to M3M an additional 2,000,000 common shares and making $250,000 in exploration expenditures.  Surge can earn an additional ten (10%) percent interest in the M3M Lands, by making a cash payment to M3M of $500,000 and issuing to M3M a total of 1,000,000 additional common shares.   Should Surge earn a full eighty (80%) percent interest in the M3M Lands, Surge and M3M are required to enter into a joint venture agreement.  </p><p>Surge will act as the operator of the M3M Lands for the term of the Option Agreement unless otherwise agreed by the parties. </p><p>Further details of the Option Agreement are contained in Surge's news releases of July 26, 2023 and September 21, 2023.</p><p>No finder's fees are payable in connection with the Option Agreement and M3M and the Company were not related parties for the purposes of MI 61-101 or otherwise subject to it at the time of the entering into of the Option Agreement. </p><p>The Surge Shares are subject to an Exchange hold period expiring on February 23, 2024. </p><p><b>About Surge Battery Metals Inc. </b></p><p>The Company is a Canadian-based mineral exploration company active in the exploration for lithium in Nevada whose primary listing is on the TSX Venture Exchange.  The Company maintains a focus on exploration for high-value battery metals required for the electric vehicle (EV) market.</p><p><b>About the Nevada North Lithium Project</b></p><p>The Company owns the <b>Nevada North Lithium Project </b>located in the Granite Range southeast of Jackpot, Nevada about 73 km north-northeast of Wells, Elko County, Nevada. The first round of drilling, completed in October 2022, identified a strongly mineralized zone of lithium bearing clays occupying a strike length of almost 1,620 meters. Widths of the mineralized horizons are at least 400 meters, supported by highly anomalous soil values indicating potential for the clay horizons to be much greater in extent. The potential for a significant lithium deposit can be illustrated by the average lithium content within all near surface clay zones intersected in 2022 drilling, applying a 1000 ppm cut-off, was 3254 ppm. (See news release dated March 29, 2023).</p><p>The 2023 drill program is underway and is designed to expand the known lithium-rich clay from the current 1,620 meters strike length to more than 3,500 meters and the known width of the mineralization to 950 meters from the previously drill-indicated 400 meters. Initial assay results from the first hole of the 2023 season had a high of 8,070 ppm Lithium with an average 4,067 ppm lithium at a 1,000 ppm cut-off. (See news release dated August 13, 2023).</p><p><b>On behalf of the Board of Directors</b></p><p><i>\"Greg Reimer\"</i></p><p>Greg Reimer, <br />President &#38; CEO</p><p><b>Contact Information</b></p><p>Email :  <a href=\"mailto:info@surgebatterymetals.com\">info@surgebatterymetals.com</a><br />Phone : 778-945-2656<br />Website: <a href=\"https://api.newsfilecorp.com/redirect/85pvBUeaOG\">surgebatterymetals.com</a></p><p><i><b>Neither the TSX Venture Exchange nor its Regulation Services Provider (as that term is defined in the policies of the TSX Venture Exchange) accepts responsibility for the adequacy or accuracy of this release.  </b></i></p><p>This document may contain certain \"Forward-Looking Statements\" within the meaning of the United States Private Securities Litigation Reform Act of 1995 and applicable Canadian securities laws. When used in this news release, the words \"anticipate\", \"believe\", \"estimate\", \"expect\", \"target, \"plan\" or \"planned\", \"possible\", \"potential\", \"forecast\", \"intend\", \"may\", \"schedule\" and similar words or expressions identify forward-looking statements or information. These forward-looking statements or information may relate to future prices of commodities including lithium and nickel, the accuracy of mineral or resource exploration activity, reserves or resources, regulatory or government requirements or approvals including approvals of title and mining rights or licenses and environmental, local community or indigenous community approvals, the reliability of third party information, continued access to mineral properties or infrastructure or water, changes in laws, rules and regulations including in the United States, Nevada or California or any other jurisdiction which may impact upon the Company or its properties or the commercial exploitation of those properties, currency risks including the exchange rate of USD$ for Cdn$ or other currencies, fluctuations in the market for lithium related products, changes in exploration costs and government royalties, export policies or taxes in the United States or any other jurisdiction and other factors or information. The Company's current plans, expectations, and intentions with respect to development of its business and of its Nevada properties may be impacted by economic uncertainties arising out of any pandemic or by the impact of current financial and other market conditions (including US government subsidies or incentives) on its ability to secure further financing or funding of its Nevada properties. Such statements represent the Company's current views with respect to future events and are necessarily based upon several assumptions and estimates that, while considered reasonable by the Company, are inherently subject to significant business, economic, competitive, political, environmental (including endangered species, habitat preservation and water related risks) and social risks, contingencies, and uncertainties. Many factors, both known and unknown, could cause results, performance, or achievements to be materially different from the results, performance or achievements that are or may be expressed or implied by such forward-looking statements. The Company does not intend, and does not assume any obligation, to update these forward-looking statements or information to reflect changes in assumptions or changes in circumstances or any other events affecting such statements and information other than as required by applicable laws, rules, and regulations.</p><p id=\"corporateNewsLogoContainer\"><img src=\"https://images.newsfilecorp.com/files/9838/185004_2a7060a2b4cefab7_logo.jpg\" id=\"corporateNewsLogo\" alt=\"Corporate Logo\" /></p><p id=\"corporateLinkBack\">To view the source version of this press release, please visit <a href=\"https://api.newsfilecorp.com/redirect/yEpXYcwpbW\">https://www.newsfilecorp.com/release/185004</a></p>",
    "search_terms": "Nevada North,Surge Battery Metals Inc.,NILI",
    "master_gid": 3474,
    "date": "2023-10-24T12:00:00.000Z",
    "tags": "||||Project Acquisition",
    "image_id": null,
    "hidden": false,
    "company_id": 480,
    "provider": null,
    "excerpt": "West Vancouver, British Columbia--(Newsfile Corp. - October 24, 2023) - Surge Battery Metals Inc. (TSXV: NILI) (OTCQX: NILIF) (FSE: DJ5) (the \"Company\" or \"Surge\") announces that it has received regulatory approval for its option agreement, as amended, (the \"Option Agreement\") between M3 Metals Corp. (\"M3M\") and Surge concerning claims (the",
    "is_regulatory": false,
    "refined_tags": [
      "Project Acquisition"
    ],
    "ftp_filename": null,
    "company_name": "Surge Battery Metals Inc.",
    "exchange": "TSXV",
    "root_ticker": "NILI",
    "project_name": "Nevada North",
    "gid": 3474,
    "location": "Nevada, United States",
    "plan_id": null,
    "description_text": "West Vancouver, British Columbia--(Newsfile Corp. - October 24, 2023) - Surge Battery Metals Inc. (TSXV: NILI) (OTCQX: NILIF) (FSE: DJ5) (the \" Company \" or \" Surge \") announces that it has received regulatory approval for its option agreement, as amended, (the \"Option Agreement\") between M3 Metals Corp. (\"M3M\") and Surge concerning claims (the \"M3M Lands\") in the area of its NNLP Project. Surge has acquired an initial fifty (50%) percent interest in the M3M Lands by way of payment of $500,000 to M3M and issuance of a total of 2,000,000 of Surge's common shares to M3M (the \"Surge Shares\"). The Option Agreement provides that Surge can earn an additional twenty (20%) percent interest in the M3M Lands by making a cash payment to M3M of $250,000, issuing to M3M an additional 2,000,000 common shares and making $250,000 in exploration expenditures.  Surge can earn an additional ten (10%) percent interest in the M3M Lands, by making a cash payment to M3M of $500,000 and issuing to M3M a total of 1,000,000 additional common shares.   Should Surge earn a full eighty (80%) percent interest in the M3M Lands, Surge and M3M are required to enter into a joint venture agreement. Surge will act as the operator of the M3M Lands for the term of the Option Agreement unless otherwise agreed by the parties. Further details of the Option Agreement are contained in Surge's news releases of July 26, 2023 and September 21, 2023. No finder's fees are payable in connection with the Option Agreement and M3M and the Company were not related parties for the purposes of MI 61-101 or otherwise subject to it at the time of the entering into of the Option Agreement. The Surge Shares are subject to an Exchange hold period expiring on February 23, 2024. About Surge Battery Metals Inc. The Company is a Canadian-based mineral exploration company active in the exploration for lithium in Nevada whose primary listing is on the TSX Venture Exchange.  The Company maintains a focus on exploration for high-value battery metals required for the electric vehicle (EV) market. About the Nevada North Lithium Project The Company owns the Nevada North Lithium Project located in the Granite Range southeast of Jackpot, Nevada about 73 km north-northeast of Wells, Elko County, Nevada. The first round of drilling, completed in October 2022, identified a strongly mineralized zone of lithium bearing clays occupying a strike length of almost 1,620 meters. Widths of the mineralized horizons are at least 400 meters, supported by highly anomalous soil values indicating potential for the clay horizons to be much greater in extent. The potential for a significant lithium deposit can be illustrated by the average lithium content within all near surface clay zones intersected in 2022 drilling, applying a 1000 ppm cut-off, was 3254 ppm. (See news release dated March 29, 2023). The 2023 drill program is underway and is designed to expand the known lithium-rich clay from the current 1,620 meters strike length to more than 3,500 meters and the known width of the mineralization to 950 meters from the previously drill-indicated 400 meters. Initial assay results from the first hole of the 2023 season had a high of 8,070 ppm Lithium with an average 4,067 ppm lithium at a 1,000 ppm cut-off. (See news release dated August 13, 2023). On behalf of the Board of Directors \"Greg Reimer\" Greg Reimer, President & CEO Contact Information Email : info@surgebatterymetals.com Phone : 778-945-2656 Website: surgebatterymetals.com Neither the TSX Venture Exchange nor its Regulation Services Provider (as that term is defined in the policies of the TSX Venture Exchange) accepts responsibility for the adequacy or accuracy of this release. This document may contain certain \"Forward-Looking Statements\" within the meaning of the United States Private Securities Litigation Reform Act of 1995 and applicable Canadian securities laws. When used in this news release, the words \"anticipate\", \"believe\", \"estimate\", \"expect\", \"target, \"plan\" or \"planned\", \"possible\", \"potential\", \"forecast\", \"intend\", \"may\", \"schedule\" and similar words or expressions identify forward-looking statements or information. These forward-looking statements or information may relate to future prices of commodities including lithium and nickel, the accuracy of mineral or resource exploration activity, reserves or resources, regulatory or government requirements or approvals including approvals of title and mining rights or licenses and environmental, local community or indigenous community approvals, the reliability of third party information, continued access to mineral properties or infrastructure or water, changes in laws, rules and regulations including in the United States, Nevada or California or any other jurisdiction which may impact upon the Company or its properties or the commercial exploitation of those properties, currency risks including the exchange rate of USD$ for Cdn$ or other currencies, fluctuations in the market for lithium related products, changes in exploration costs and government royalties, export policies or taxes in the United States or any other jurisdiction and other factors or information. The Company's current plans, expectations, and intentions with respect to development of its business and of its Nevada properties may be impacted by economic uncertainties arising out of any pandemic or by the impact of current financial and other market conditions (including US government subsidies or incentives) on its ability to secure further financing or funding of its Nevada properties. Such statements represent the Company's current views with respect to future events and are necessarily based upon several assumptions and estimates that, while considered reasonable by the Company, are inherently subject to significant business, economic, competitive, political, environmental (including endangered species, habitat preservation and water related risks) and social risks, contingencies, and uncertainties. Many factors, both known and unknown, could cause results, performance, or achievements to be materially different from the results, performance or achievements that are or may be expressed or implied by such forward-looking statements. The Company does not intend, and does not assume any obligation, to update these forward-looking statements or information to reflect changes in assumptions or changes in circumstances or any other events affecting such statements and information other than as required by applicable laws, rules, and regulations. To view the source version of this press release, please visit https://www.newsfilecorp.com/release/185004",
    "primary_commodity": "Li"
  },
  "articleProject": {
    "gid": 3474,
    "project_name": "Nevada North",
    "location": "Nevada, United States"
  },
  "articleExchange": "TSXV",
  "articleCompanyId": 480,
  "articleTicker": "NILI",
  "articleCompanyName": "Surge Battery Metals Inc.",
  "allOtherCompanyProjects": [
    {
      "company_id": 480,
      "gid": 3474,
      "project_name": "Nevada North",
      "location": "Nevada, United States"
    },
    {
      "company_id": 480,
      "gid": 10242,
      "project_name": "Galt",
      "location": "Nevada, United States"
    }
  ],
  "allOtherCompanyNews": [
    {
      "id": 107356,
      "company_id": 480,
      "title": "Surge Battery Metals Announces Webinar on PEA Results",
      "link": null,
      "date": "2025-06-09T20:30:00.000Z",
      "hidden": false
    },
    {
      "id": 107341,
      "company_id": 480,
      "title": "Surge Delivers Preliminary Economic Assessment For High-Grade Nevada North Lithium Project; After-Tax NPV8% US$9.21 Billion and After-Tax IRR of 22.8% OPEX of US$5,097/tonne LCE",
      "link": null,
      "date": "2025-06-09T14:20:00.000Z",
      "hidden": false
    },
    {
      "id": -203849,
      "company_id": 480,
      "title": "Canadian Investment Regulatory Organization Trading Halt - NILI",
      "link": "https://contentapi.cision.com/api/v1.0/releases/20250609C7313",
      "date": "2025-06-09T13:54:00.000Z",
      "hidden": false
    },
    {
      "id": 105392,
      "company_id": 480,
      "title": "Surge Battery Grants Stock Options",
      "link": null,
      "date": "2025-05-21T20:31:00.000Z",
      "hidden": false
    },
    {
      "id": 100003,
      "company_id": 480,
      "title": "Surge Battery Announces New Director",
      "link": null,
      "date": "2025-04-16T12:00:00.000Z",
      "hidden": false
    },
    {
      "id": 99651,
      "company_id": 480,
      "title": "Surge Battery Metals Closes Financing",
      "link": null,
      "date": "2025-04-14T12:00:00.000Z",
      "hidden": false
    },
    {
      "id": 93071,
      "company_id": 480,
      "title": "Surge Battery Metals Provides Corporate Update and Announces Financing",
      "link": null,
      "date": "2025-03-31T12:00:00.000Z",
      "hidden": false
    },
    {
      "id": 92363,
      "company_id": 480,
      "title": "Surge Battery Metals: President Trump Signs Executive Order to Increase America's Mineral Production",
      "link": null,
      "date": "2025-03-25T12:00:00.000Z",
      "hidden": false
    },
    {
      "id": 90137,
      "company_id": 480,
      "title": "Surge Receives Positive Record of Decision on its Exploration Plan of Operations Permit at the Nevada North Lithium Project",
      "link": "https://golddiscovery.com/legacy/user/news_details/742404-nilica-surge-receives-positive-record-of-decision-on-its-exploration-plan-of-operations-permit-at-the-nevada-north-lithium-project",
      "date": "2025-03-05T14:51:00.000Z",
      "hidden": false
    },
    {
      "id": 82682,
      "company_id": 480,
      "title": "Surge's Nevada North Lithium Project Moves to the 30-Day National Environmental Policy Act (NEPA) Environmental Assessment Public Comment Period",
      "link": "https://www.newsfilecorp.com/release/234697/Surges-Nevada-North-Lithium-Project-Moves-to-the-30Day-National-Environmental-Policy-Act-NEPA-Environmental-Assessment-Public-Comment-Period",
      "date": "2024-12-20T17:06:00.000Z",
      "hidden": false
    }
  ]
}
