{
  "article": {
    "id": 45507,
    "link": "https://www.newsfilecorp.com/release/190198/Surge-Closes-Wilkins-Family-and-Y3II-Agreements",
    "title": "Surge Closes Wilkins Family and Y3-II Agreements",
    "description": "<img src=\"https://api.newsfilecorp.com/newsinfo/190198/367\" id=\"367\" width=\"2\" height=\"2\" style=\"width: 1px;  height: 1px;border: 0px solid;\" /><p>West Vancouver, British Columbia--(Newsfile Corp. - December 7, 2023) - Surge Battery Metals Inc. (TSXV: NILI) (OTCQX: NILIF) (FSE: DJ5) (the \"<b>Company</b>\" or \"<b>Surge</b>\") announces that on October 3, 2023, the Company entered into two mineral property purchase agreements to purchase a total twenty-five (25%) of the mineral rights (the \"Mineral Rights\") to private lands comprising approximately 880 acres (the \"Private Lands\") which Private Lands are located within the general boundaries of the Company's NNLP Project.  The Company's news release dated October 3, 2023 contained additional details, including a map, of the Private Lands and their location. </p><p>The first agreement, dated effective September 14, 2023 and later amended (the \"Wilkins Family Agreement\") called for the Company to acquire a twenty-one point two five (21.25%) percent interest in the Mineral Rights underlying the Private Lands (the \"Wilkins Interest\").  Details of the Wilkins Family Agreement can be found in the Company's news release dated October 3, 2023.</p><p>The closing of the acquisition of the Wilkins Interest has now occurred with payment to the Wilkins Family of USD$50,000 and issuance of a total of 1,250,000 shares (the \"Wilkins Shares\") of the Company's common stock.  The Wilkins Shares are subject to an Exchange hold period and cannot be traded before April 1, 2024. </p><p>The second agreement, dated effective September 15, 2023 (the \"Y3-II Agreement\") is also described in the October 3, 2023 news release.  The Y3-II Agreement provided for the purchase of an additional three point seven five (3.75%) percent interest in the Mineral Rights and has now also closed with the issuance of a total of 300,000 shares (the \"Y3-II Shares\") of the Company's common stock.  The Y3-II Shares are subject to an Exchange hold period and cannot be traded before April 6, 2024.</p><p>With the closing of the Wilkins Family Agreement and the Y3-II Agreement, the Company now has acquired control of a total twenty-five (25%) percent interest in the Private Lands inside the NNLP. </p><p><b>About Surge Battery Metals Inc. </b></p><p>The Company is a Canadian-based mineral exploration company active in the exploration for lithium in Nevada whose primary listing is on the TSX Venture Exchange in Canada and the OTCQX Market in the US.  The Company's maintains a focus on exploration for high value battery metals required for the electric vehicle (EV) market.</p><p><b>About the Nevada North Lithium Project</b></p><p>The Company owns the Nevada North Lithium Project located in the Granite Range southeast of Jackpot, Nevada about 73 km north-northeast of Wells, Elko County, Nevada. The first round of drilling, completed in October 2022, identified a strongly mineralized zone of lithium bearing clays occupying a strike length of almost 1,620 meters. Widths of the mineralized horizons are at least 400 meters, supported by highly anomalous soil values indicating potential for the clay horizons to be much greater in extent. The potential for a significant lithium deposit can be illustrated by the average lithium content within all near surface clay zones intersected in 2022 drilling, applying a 1000 ppm cut-off, was 3254 ppm. </p><p>The 2023 drill program is designed to expand the known lithium-rich clay from the current 1,620 meters strike length to more than 3,500 meters and the known width of the mineralization to 950 meters from the previously drill-indicated 400 meters. The program is now completed, and we are awaiting assay results. Initial assay results from the first hole of the 2023 season had a high of 8070 ppm lithium with an average of 4,067 ppm lithium at a 1,000 ppm cut-off (See news release September 12, 2023).</p><p><b>On behalf of the Board of Directors</b></p><p><i>\"Greg Reimer\"</i></p><p>Greg Reimer, <br />President &#38; CEO</p><p><b>Contact Information</b></p><p>Email:  <a href=\"mailto:info@surgebatterymetals.com\">info@surgebatterymetals.com</a><br />Phone: 604-662-8184<br />Website: <a href=\"https://api.newsfilecorp.com/redirect/DZAAGug18V\">surgebatterymetals.com</a></p><p><i><b>Keep up-to-date with Surge Battery Metals on </b></i><a href=\"https://api.newsfilecorp.com/redirect/rvRRWT5MWA\"><i><b>Twitter</b></i></a><i><b>, </b></i><a href=\"https://api.newsfilecorp.com/redirect/V7ppnIbQ7k\"><i><b>Facebook</b></i></a><i><b>, </b></i><a href=\"https://api.newsfilecorp.com/redirect/zELLVURWne\"><i><b>LinkedIn</b></i></a><i><b>, </b></i><a href=\"https://api.newsfilecorp.com/redirect/4Q220tkKov\"><i><b>Instagram </b></i></a><i><b>and </b></i><a href=\"https://api.newsfilecorp.com/redirect/jp77OIAv3b\"><i><b>YouTube</b></i></a><i><b>.</b></i></p><p><i><b>Neither the TSX Venture Exchange nor its Regulation Services Provider (as that term is defined in the policies of the TSX Venture Exchange) accepts responsibility for the adequacy or accuracy of this release.  </b></i></p><p>This document may contain certain \"Forward-Looking Statements\" within the meaning of the United States Private Securities Litigation Reform Act of 1995 and applicable Canadian securities laws. When used in this news release, the words \"anticipate\", \"believe\", \"estimate\", \"expect\", \"target, \"plan\" or \"planned\", \"possible\", \"potential\", \"forecast\", \"intend\", \"may\", \"schedule\" and similar words or expressions identify forward-looking statements or information. These forward-looking statements or information may relate to future prices of commodities including lithium and nickel, the accuracy of mineral or resource exploration activity, reserves or resources, regulatory or government requirements or approvals including approvals of title and mining rights or licenses and environmental, local community or indigenous community approvals, the reliability of third party information, continued access to mineral properties or infrastructure or water, changes in laws, rules and regulations including in the United States, Nevada or California or any other jurisdiction which may impact upon the Company or its properties or the commercial exploitation of those properties, currency risks including the exchange rate of USD$ for Cdn$ or other currencies, fluctuations in the market for lithium related products, changes in exploration costs and government royalties, export policies or taxes in the United States or any other jurisdiction and other factors or information. The Company's current plans, expectations, and intentions with respect to development of its business and of its Nevada properties may be impacted by economic uncertainties arising out of any pandemic or by the impact of current financial and other market conditions (including US government subsidies or incentives) on its ability to secure further financing or funding of its Nevada properties. Such statements represent the Company's current views with respect to future events and are necessarily based upon several assumptions and estimates that, while considered reasonable by the Company, are inherently subject to significant business, economic, competitive, political, environmental (including endangered species, habitat preservation and water related risks) and social risks, contingencies, and uncertainties. Many factors, both known and unknown, could cause results, performance, or achievements to be materially different from the results, performance or achievements that are or may be expressed or implied by such forward-looking statements. The Company does not intend, and does not assume any obligation, to update these forward-looking statements or information to reflect changes in assumptions or changes in circumstances or any other events affecting such statements and information other than as required by applicable laws, rules, and regulations.</p><p id=\"corporateNewsLogoContainer\"><img src=\"https://images.newsfilecorp.com/files/9838/190198_454f6aa9d4de5ac5_logo.jpg\" id=\"corporateNewsLogo\" alt=\"Corporate Logo\" /></p><p id=\"corporateLinkBack\">To view the source version of this press release, please visit <a href=\"https://api.newsfilecorp.com/redirect/v1LLNc5w2K\">https://www.newsfilecorp.com/release/190198</a></p>",
    "search_terms": "Nevada North,Surge Battery Metals Inc.,NILI",
    "master_gid": 3474,
    "date": "2023-12-07T13:00:00.000Z",
    "tags": "||||Project Acquisition",
    "image_id": null,
    "hidden": false,
    "company_id": 480,
    "provider": null,
    "excerpt": "West Vancouver, British Columbia--(Newsfile Corp. - December 7, 2023) - Surge Battery Metals Inc. (TSXV: NILI) (OTCQX: NILIF) (FSE: DJ5) (the \"Company\" or \"Surge\") announces that on October 3, 2023, the Company entered into two mineral property purchase agreements to purchase a total twenty-five (25%) of the mineral rights (the",
    "is_regulatory": false,
    "refined_tags": [
      "Project Acquisition"
    ],
    "ftp_filename": null,
    "company_name": "Surge Battery Metals Inc.",
    "exchange": "TSXV",
    "root_ticker": "NILI",
    "project_name": "Nevada North",
    "gid": 3474,
    "location": "Nevada, United States",
    "plan_id": null,
    "description_text": "West Vancouver, British Columbia--(Newsfile Corp. - December 7, 2023) - Surge Battery Metals Inc. (TSXV: NILI) (OTCQX: NILIF) (FSE: DJ5) (the \" Company \" or \" Surge \") announces that on October 3, 2023, the Company entered into two mineral property purchase agreements to purchase a total twenty-five (25%) of the mineral rights (the \"Mineral Rights\") to private lands comprising approximately 880 acres (the \"Private Lands\") which Private Lands are located within the general boundaries of the Company's NNLP Project.  The Company's news release dated October 3, 2023 contained additional details, including a map, of the Private Lands and their location. The first agreement, dated effective September 14, 2023 and later amended (the \"Wilkins Family Agreement\") called for the Company to acquire a twenty-one point two five (21.25%) percent interest in the Mineral Rights underlying the Private Lands (the \"Wilkins Interest\").  Details of the Wilkins Family Agreement can be found in the Company's news release dated October 3, 2023. The closing of the acquisition of the Wilkins Interest has now occurred with payment to the Wilkins Family of USD$50,000 and issuance of a total of 1,250,000 shares (the \"Wilkins Shares\") of the Company's common stock.  The Wilkins Shares are subject to an Exchange hold period and cannot be traded before April 1, 2024. The second agreement, dated effective September 15, 2023 (the \"Y3-II Agreement\") is also described in the October 3, 2023 news release.  The Y3-II Agreement provided for the purchase of an additional three point seven five (3.75%) percent interest in the Mineral Rights and has now also closed with the issuance of a total of 300,000 shares (the \"Y3-II Shares\") of the Company's common stock.  The Y3-II Shares are subject to an Exchange hold period and cannot be traded before April 6, 2024. With the closing of the Wilkins Family Agreement and the Y3-II Agreement, the Company now has acquired control of a total twenty-five (25%) percent interest in the Private Lands inside the NNLP. About Surge Battery Metals Inc. The Company is a Canadian-based mineral exploration company active in the exploration for lithium in Nevada whose primary listing is on the TSX Venture Exchange in Canada and the OTCQX Market in the US.  The Company's maintains a focus on exploration for high value battery metals required for the electric vehicle (EV) market. About the Nevada North Lithium Project The Company owns the Nevada North Lithium Project located in the Granite Range southeast of Jackpot, Nevada about 73 km north-northeast of Wells, Elko County, Nevada. The first round of drilling, completed in October 2022, identified a strongly mineralized zone of lithium bearing clays occupying a strike length of almost 1,620 meters. Widths of the mineralized horizons are at least 400 meters, supported by highly anomalous soil values indicating potential for the clay horizons to be much greater in extent. The potential for a significant lithium deposit can be illustrated by the average lithium content within all near surface clay zones intersected in 2022 drilling, applying a 1000 ppm cut-off, was 3254 ppm. The 2023 drill program is designed to expand the known lithium-rich clay from the current 1,620 meters strike length to more than 3,500 meters and the known width of the mineralization to 950 meters from the previously drill-indicated 400 meters. The program is now completed, and we are awaiting assay results. Initial assay results from the first hole of the 2023 season had a high of 8070 ppm lithium with an average of 4,067 ppm lithium at a 1,000 ppm cut-off (See news release September 12, 2023). On behalf of the Board of Directors \"Greg Reimer\" Greg Reimer, President & CEO Contact Information Email: info@surgebatterymetals.com Phone: 604-662-8184 Website: surgebatterymetals.com Keep up-to-date with Surge Battery Metals on Twitter , Facebook , LinkedIn , Instagram and YouTube . Neither the TSX Venture Exchange nor its Regulation Services Provider (as that term is defined in the policies of the TSX Venture Exchange) accepts responsibility for the adequacy or accuracy of this release. This document may contain certain \"Forward-Looking Statements\" within the meaning of the United States Private Securities Litigation Reform Act of 1995 and applicable Canadian securities laws. When used in this news release, the words \"anticipate\", \"believe\", \"estimate\", \"expect\", \"target, \"plan\" or \"planned\", \"possible\", \"potential\", \"forecast\", \"intend\", \"may\", \"schedule\" and similar words or expressions identify forward-looking statements or information. These forward-looking statements or information may relate to future prices of commodities including lithium and nickel, the accuracy of mineral or resource exploration activity, reserves or resources, regulatory or government requirements or approvals including approvals of title and mining rights or licenses and environmental, local community or indigenous community approvals, the reliability of third party information, continued access to mineral properties or infrastructure or water, changes in laws, rules and regulations including in the United States, Nevada or California or any other jurisdiction which may impact upon the Company or its properties or the commercial exploitation of those properties, currency risks including the exchange rate of USD$ for Cdn$ or other currencies, fluctuations in the market for lithium related products, changes in exploration costs and government royalties, export policies or taxes in the United States or any other jurisdiction and other factors or information. The Company's current plans, expectations, and intentions with respect to development of its business and of its Nevada properties may be impacted by economic uncertainties arising out of any pandemic or by the impact of current financial and other market conditions (including US government subsidies or incentives) on its ability to secure further financing or funding of its Nevada properties. Such statements represent the Company's current views with respect to future events and are necessarily based upon several assumptions and estimates that, while considered reasonable by the Company, are inherently subject to significant business, economic, competitive, political, environmental (including endangered species, habitat preservation and water related risks) and social risks, contingencies, and uncertainties. Many factors, both known and unknown, could cause results, performance, or achievements to be materially different from the results, performance or achievements that are or may be expressed or implied by such forward-looking statements. The Company does not intend, and does not assume any obligation, to update these forward-looking statements or information to reflect changes in assumptions or changes in circumstances or any other events affecting such statements and information other than as required by applicable laws, rules, and regulations. To view the source version of this press release, please visit https://www.newsfilecorp.com/release/190198",
    "primary_commodity": "Li"
  },
  "articleProject": {
    "gid": 3474,
    "project_name": "Nevada North",
    "location": "Nevada, United States"
  },
  "articleExchange": "TSXV",
  "articleCompanyId": 480,
  "articleTicker": "NILI",
  "articleCompanyName": "Surge Battery Metals Inc.",
  "allOtherCompanyProjects": [
    {
      "company_id": 480,
      "gid": 3474,
      "project_name": "Nevada North",
      "location": "Nevada, United States"
    },
    {
      "company_id": 480,
      "gid": 10242,
      "project_name": "Galt",
      "location": "Nevada, United States"
    }
  ],
  "allOtherCompanyNews": [
    {
      "id": 107356,
      "company_id": 480,
      "title": "Surge Battery Metals Announces Webinar on PEA Results",
      "link": null,
      "date": "2025-06-09T20:30:00.000Z",
      "hidden": false
    },
    {
      "id": 107341,
      "company_id": 480,
      "title": "Surge Delivers Preliminary Economic Assessment For High-Grade Nevada North Lithium Project; After-Tax NPV8% US$9.21 Billion and After-Tax IRR of 22.8% OPEX of US$5,097/tonne LCE",
      "link": null,
      "date": "2025-06-09T14:20:00.000Z",
      "hidden": false
    },
    {
      "id": -203849,
      "company_id": 480,
      "title": "Canadian Investment Regulatory Organization Trading Halt - NILI",
      "link": "https://contentapi.cision.com/api/v1.0/releases/20250609C7313",
      "date": "2025-06-09T13:54:00.000Z",
      "hidden": false
    },
    {
      "id": 105392,
      "company_id": 480,
      "title": "Surge Battery Grants Stock Options",
      "link": null,
      "date": "2025-05-21T20:31:00.000Z",
      "hidden": false
    },
    {
      "id": 100003,
      "company_id": 480,
      "title": "Surge Battery Announces New Director",
      "link": null,
      "date": "2025-04-16T12:00:00.000Z",
      "hidden": false
    },
    {
      "id": 99651,
      "company_id": 480,
      "title": "Surge Battery Metals Closes Financing",
      "link": null,
      "date": "2025-04-14T12:00:00.000Z",
      "hidden": false
    },
    {
      "id": 93071,
      "company_id": 480,
      "title": "Surge Battery Metals Provides Corporate Update and Announces Financing",
      "link": null,
      "date": "2025-03-31T12:00:00.000Z",
      "hidden": false
    },
    {
      "id": 92363,
      "company_id": 480,
      "title": "Surge Battery Metals: President Trump Signs Executive Order to Increase America's Mineral Production",
      "link": null,
      "date": "2025-03-25T12:00:00.000Z",
      "hidden": false
    },
    {
      "id": 90137,
      "company_id": 480,
      "title": "Surge Receives Positive Record of Decision on its Exploration Plan of Operations Permit at the Nevada North Lithium Project",
      "link": "https://golddiscovery.com/legacy/user/news_details/742404-nilica-surge-receives-positive-record-of-decision-on-its-exploration-plan-of-operations-permit-at-the-nevada-north-lithium-project",
      "date": "2025-03-05T14:51:00.000Z",
      "hidden": false
    },
    {
      "id": 82682,
      "company_id": 480,
      "title": "Surge's Nevada North Lithium Project Moves to the 30-Day National Environmental Policy Act (NEPA) Environmental Assessment Public Comment Period",
      "link": "https://www.newsfilecorp.com/release/234697/Surges-Nevada-North-Lithium-Project-Moves-to-the-30Day-National-Environmental-Policy-Act-NEPA-Environmental-Assessment-Public-Comment-Period",
      "date": "2024-12-20T17:06:00.000Z",
      "hidden": false
    }
  ]
}
