{
  "article": {
    "id": 69089,
    "link": "https://www.newsfilecorp.com/release/220698/Surge-Purchases-M3s-Texas-Spring-Property",
    "title": "Surge Purchases M3's Texas Spring Property",
    "description": "<img src=\"https://api.newsfilecorp.com/newsinfo/220698/367\" id=\"367\" width=\"2\" height=\"2\" style=\"width: 1px;  height: 1px;border: 0px solid;\" /><p>West Vancouver, British Columbia--(Newsfile Corp. - August 22, 2024) - Surge Battery Metals Inc. (TSXV: NILI) (OTCQX: NILIF) (FSE: DJ5) (the \"<b>Company</b>\" or \"<b>Surge</b>\") is pleased to announce that Surge and M3 Metals Corp. (\"M3M\") have entered into a property purchase and sale agreement (the \"Purchase Agreement\") whereby M3M, in consideration of the issuance to M3M of a total of 1,200,000 common shares of the Company, will sell to the Company all of its right, title and interest in and to the Texas Springs Properties (the \"Properties\") in the area of the Company's Nevada North Lithium Project.  </p><p>The Properties, which Surge and M3M each own fifty (50%) percent of, were the subject of a mineral property option agreement (the \"Option Agreement\") <a href=\"https://api.newsfilecorp.com/redirect/ar8pLteDR8\">dated effective July 26, 2023</a>. The Option Agreement, and all rights and obligations under it, has been terminated by the Purchase Agreement.  </p><p>Upon closing of the Purchase Agreement, Surge will own a one hundred (100%) percent right, title and interest in and to the Properties and M3M will execute quit claim deeds to the Properties which will be in registrable form for (and will be registered in) Elko County, Nevada. </p><p>More information concerning the Properties, including their location and number, can be found in Surge's continuous disclosure documents filed on SEDAR as well as in news releases of Surge, including its <a href=\"https://api.newsfilecorp.com/redirect/2EaBjIRDVr\">news release dated July 26, 2023</a>, and the <a href=\"https://api.newsfilecorp.com/redirect/MAwR8FK3J7\">technical report filed on April 28, 2024</a>. </p><p>The Purchase Agreement is subject to its acceptance for filing with the TSX Venture Exchange.  </p><p>The Company also wishes to announce that it has granted a total of 2,850,000 stock options, exercisable for a period of five years, at an exercise price of 40 cents a share to certain directors, officers, and consultants.</p><p><b>About Surge Battery Metals Inc. </b></p><p>Surge Battery Metals, a Canadian-based mineral exploration company, is at the forefront of securing the supply of domestic lithium through its active engagement in the Nevada North Lithium Project. The project focuses on exploring clean, high-grade lithium energy metals in Nevada, USA. Lithium is a crucial element for powering the electric vehicles of tomorrow. With a primary listing on the TSX Venture Exchange in Canada and the OTCQX Market in the US, Surge Battery Metals Inc. is strategically positioned as a key player in advancing lithium exploration, contributing significantly to the sustainable future of the electric vehicle industry. </p><p><b>About the Nevada North Lithium Project</b></p><p>The Company's <b>Nevada North Lithium Project, </b>located in the Granite Range southeast of Jackpot, Nevada 73 km north-northeast of Wells, Elko County, Nevada. The first two rounds of drilling, completed in 2022 and 2023, identified a strongly mineralized zone of lithium bearing clays occupying a strike length of more than 3,000 meters and a known width of up to 950 meters. Highly anomalous soil values and geophysical surveys suggest there is potential for the clay horizons to be much greater in extent. The Nevada North Lithium Project has a pit-constrained Inferred Resource containing an estimated 4.67Mt of Lithium Carbonate Equivalent (LCE) grading 2,839 ppm Li at a 1,250 ppm cutoff. The 2024 drilling program is complete and continued to intersect high-grade lithium mineralization and has extended drill-indicated mineralization 1,300 meters to the south from 2022 and 2023 holes. The 2024 drilling results will be incorporated into an updated and expanded resource estimate, which will be released mid to late September.</p><p><b>On behalf of the Board of Directors</b></p><p><i>\"Greg Reimer\"</i></p><p>Greg Reimer, <br />President &#38; CEO</p><div id=\"contactInfo\"><p><b>Contact Information</b></p><p>Email :  <a href=\"mailto:info@surgebatterymetals.com\">info@surgebatterymetals.com</a><br />Phone : 604-662-8184<br />Website: <a href=\"https://api.newsfilecorp.com/redirect/bVW0oIOJb3\">surgebatterymetals.com</a></p></div><p><i><b>Keep up-to-date with Surge Battery Metals on </b></i><a href=\"https://api.newsfilecorp.com/redirect/3jaLvUqrzq\"><i><b>Twitter</b></i></a><i><b>, </b></i><a href=\"https://api.newsfilecorp.com/redirect/NBgqyf4neQ\"><i><b>Facebook</b></i></a><i><b>, </b></i><a href=\"https://api.newsfilecorp.com/redirect/X3WVjhRKwa\"><i><b>LinkedIn</b></i></a><i><b>, </b></i><a href=\"https://api.newsfilecorp.com/redirect/DZQjRfMzNz\"><i><b>Instagram</b></i></a><i><b> and </b></i><a href=\"https://api.newsfilecorp.com/redirect/rvbketx8vw\"><i><b>YouTube</b></i></a><i><b>.</b></i></p><p><i><b>Neither the TSX Venture Exchange nor its Regulation Services Provider (as that term is defined in the policies of the TSX Venture Exchange) accepts responsibility for the adequacy or accuracy of this release.  </b></i></p><p>This document may contain certain \"Forward-Looking Statements\" within the meaning of the United States Private Securities Litigation Reform Act of 1995 and applicable Canadian securities laws. When used in this news release, the words \"anticipate\", \"believe\", \"estimate\", \"expect\", \"target, \"plan\" or \"planned\", \"possible\", \"potential\", \"forecast\", \"intend\", \"may\", \"schedule\" and similar words or expressions identify forward-looking statements or information. These forward-looking statements or information may relate to future prices of commodities including lithium and nickel, the accuracy of mineral or resource exploration activity, reserves or resources, regulatory or government requirements or approvals including approvals of title and mining rights or licenses and environmental, local community or indigenous community approvals, the reliability of third party information, continued access to mineral properties or infrastructure or water, changes in laws, rules and regulations including in the United States, Nevada or California or any other jurisdiction which may impact upon the Company or its properties or the commercial exploitation of those properties, currency risks including the exchange rate of USD$ for Cdn$ or other currencies, fluctuations in the market for lithium related products, changes in exploration costs and government royalties, export policies or taxes in the United States or any other jurisdiction and other factors or information. The Company's current plans, expectations, and intentions with respect to development of its business and of its Nevada properties may be impacted by economic uncertainties arising out of any pandemic or by the impact of current financial and other market conditions (including US government subsidies or incentives) on its ability to secure further financing or funding of its Nevada properties. Such statements represent the Company's current views with respect to future events and are necessarily based upon several assumptions and estimates that, while considered reasonable by the Company, are inherently subject to significant business, economic, competitive, political, environmental (including endangered species, habitat preservation and water related risks) and social risks, contingencies, and uncertainties. Many factors, both known and unknown, could cause results, performance, or achievements to be materially different from the results, performance or achievements that are or may be expressed or implied by such forward-looking statements. The Company does not intend, and does not assume any obligation, to update these forward-looking statements or information to reflect changes in assumptions or changes in circumstances or any other events affecting such statements and information other than as required by applicable laws, rules, and regulations.</p><p id=\"corporateNewsLogoContainer\"><img src=\"https://images.newsfilecorp.com/files/9838/220698_bff2180a64efb87f_logo.jpg\" alt=\"Corporate Logo\" id=\"corporateNewsLogo\" /></p><p id=\"corporateLinkBack\">To view the source version of this press release, please visit <a href=\"https://api.newsfilecorp.com/redirect/V7WNzt4POY\">https://www.newsfilecorp.com/release/220698</a></p>",
    "search_terms": "Nevada North,Surge Battery Metals Inc.,NILI",
    "master_gid": 3474,
    "date": "2024-08-22T12:00:00.000Z",
    "tags": "USA|Texas|||Project Acquisition",
    "image_id": null,
    "hidden": false,
    "company_id": 480,
    "provider": "newsfilecorp",
    "excerpt": "West Vancouver, British Columbia--(Newsfile Corp. - August 22, 2024) - Surge Battery Metals Inc. (TSXV: NILI) (OTCQX: NILIF) (FSE: DJ5) (the \"Company\" or \"Surge\") is pleased to announce that Surge and M3 Metals Corp. (\"M3M\") have entered into a property purchase and sale agreement (the \"Purchase Agreement\") whereby M3M, in",
    "is_regulatory": false,
    "refined_tags": null,
    "ftp_filename": null,
    "company_name": "Surge Battery Metals Inc.",
    "exchange": "TSXV",
    "root_ticker": "NILI",
    "project_name": "Nevada North",
    "gid": 3474,
    "location": "Nevada, United States",
    "plan_id": null,
    "description_text": "West Vancouver, British Columbia--(Newsfile Corp. - August 22, 2024) - Surge Battery Metals Inc. (TSXV: NILI) (OTCQX: NILIF) (FSE: DJ5) (the \" Company \" or \" Surge \") is pleased to announce that Surge and M3 Metals Corp. (\"M3M\") have entered into a property purchase and sale agreement (the \"Purchase Agreement\") whereby M3M, in consideration of the issuance to M3M of a total of 1,200,000 common shares of the Company, will sell to the Company all of its right, title and interest in and to the Texas Springs Properties (the \"Properties\") in the area of the Company's Nevada North Lithium Project. The Properties, which Surge and M3M each own fifty (50%) percent of, were the subject of a mineral property option agreement (the \"Option Agreement\") dated effective July 26, 2023 . The Option Agreement, and all rights and obligations under it, has been terminated by the Purchase Agreement. Upon closing of the Purchase Agreement, Surge will own a one hundred (100%) percent right, title and interest in and to the Properties and M3M will execute quit claim deeds to the Properties which will be in registrable form for (and will be registered in) Elko County, Nevada. More information concerning the Properties, including their location and number, can be found in Surge's continuous disclosure documents filed on SEDAR as well as in news releases of Surge, including its news release dated July 26, 2023 , and the technical report filed on April 28, 2024 . The Purchase Agreement is subject to its acceptance for filing with the TSX Venture Exchange. The Company also wishes to announce that it has granted a total of 2,850,000 stock options, exercisable for a period of five years, at an exercise price of 40 cents a share to certain directors, officers, and consultants. About Surge Battery Metals Inc. Surge Battery Metals, a Canadian-based mineral exploration company, is at the forefront of securing the supply of domestic lithium through its active engagement in the Nevada North Lithium Project. The project focuses on exploring clean, high-grade lithium energy metals in Nevada, USA. Lithium is a crucial element for powering the electric vehicles of tomorrow. With a primary listing on the TSX Venture Exchange in Canada and the OTCQX Market in the US, Surge Battery Metals Inc. is strategically positioned as a key player in advancing lithium exploration, contributing significantly to the sustainable future of the electric vehicle industry. About the Nevada North Lithium Project The Company's Nevada North Lithium Project, located in the Granite Range southeast of Jackpot, Nevada 73 km north-northeast of Wells, Elko County, Nevada. The first two rounds of drilling, completed in 2022 and 2023, identified a strongly mineralized zone of lithium bearing clays occupying a strike length of more than 3,000 meters and a known width of up to 950 meters. Highly anomalous soil values and geophysical surveys suggest there is potential for the clay horizons to be much greater in extent. The Nevada North Lithium Project has a pit-constrained Inferred Resource containing an estimated 4.67Mt of Lithium Carbonate Equivalent (LCE) grading 2,839 ppm Li at a 1,250 ppm cutoff. The 2024 drilling program is complete and continued to intersect high-grade lithium mineralization and has extended drill-indicated mineralization 1,300 meters to the south from 2022 and 2023 holes. The 2024 drilling results will be incorporated into an updated and expanded resource estimate, which will be released mid to late September. On behalf of the Board of Directors \"Greg Reimer\" Greg Reimer, President & CEO Contact Information Email : info@surgebatterymetals.com Phone : 604-662-8184 Website: surgebatterymetals.com Keep up-to-date with Surge Battery Metals on Twitter , Facebook , LinkedIn , Instagram and YouTube . Neither the TSX Venture Exchange nor its Regulation Services Provider (as that term is defined in the policies of the TSX Venture Exchange) accepts responsibility for the adequacy or accuracy of this release. This document may contain certain \"Forward-Looking Statements\" within the meaning of the United States Private Securities Litigation Reform Act of 1995 and applicable Canadian securities laws. When used in this news release, the words \"anticipate\", \"believe\", \"estimate\", \"expect\", \"target, \"plan\" or \"planned\", \"possible\", \"potential\", \"forecast\", \"intend\", \"may\", \"schedule\" and similar words or expressions identify forward-looking statements or information. These forward-looking statements or information may relate to future prices of commodities including lithium and nickel, the accuracy of mineral or resource exploration activity, reserves or resources, regulatory or government requirements or approvals including approvals of title and mining rights or licenses and environmental, local community or indigenous community approvals, the reliability of third party information, continued access to mineral properties or infrastructure or water, changes in laws, rules and regulations including in the United States, Nevada or California or any other jurisdiction which may impact upon the Company or its properties or the commercial exploitation of those properties, currency risks including the exchange rate of USD$ for Cdn$ or other currencies, fluctuations in the market for lithium related products, changes in exploration costs and government royalties, export policies or taxes in the United States or any other jurisdiction and other factors or information. The Company's current plans, expectations, and intentions with respect to development of its business and of its Nevada properties may be impacted by economic uncertainties arising out of any pandemic or by the impact of current financial and other market conditions (including US government subsidies or incentives) on its ability to secure further financing or funding of its Nevada properties. Such statements represent the Company's current views with respect to future events and are necessarily based upon several assumptions and estimates that, while considered reasonable by the Company, are inherently subject to significant business, economic, competitive, political, environmental (including endangered species, habitat preservation and water related risks) and social risks, contingencies, and uncertainties. Many factors, both known and unknown, could cause results, performance, or achievements to be materially different from the results, performance or achievements that are or may be expressed or implied by such forward-looking statements. The Company does not intend, and does not assume any obligation, to update these forward-looking statements or information to reflect changes in assumptions or changes in circumstances or any other events affecting such statements and information other than as required by applicable laws, rules, and regulations. To view the source version of this press release, please visit https://www.newsfilecorp.com/release/220698",
    "primary_commodity": "Li"
  },
  "articleProject": {
    "gid": 3474,
    "project_name": "Nevada North",
    "location": "Nevada, United States"
  },
  "articleExchange": "TSXV",
  "articleCompanyId": 480,
  "articleTicker": "NILI",
  "articleCompanyName": "Surge Battery Metals Inc.",
  "allOtherCompanyProjects": [
    {
      "company_id": 480,
      "gid": 3474,
      "project_name": "Nevada North",
      "location": "Nevada, United States"
    },
    {
      "company_id": 480,
      "gid": 10242,
      "project_name": "Galt",
      "location": "Nevada, United States"
    }
  ],
  "allOtherCompanyNews": [
    {
      "id": 107356,
      "company_id": 480,
      "title": "Surge Battery Metals Announces Webinar on PEA Results",
      "link": null,
      "date": "2025-06-09T20:30:00.000Z",
      "hidden": false
    },
    {
      "id": 107341,
      "company_id": 480,
      "title": "Surge Delivers Preliminary Economic Assessment For High-Grade Nevada North Lithium Project; After-Tax NPV8% US$9.21 Billion and After-Tax IRR of 22.8% OPEX of US$5,097/tonne LCE",
      "link": null,
      "date": "2025-06-09T14:20:00.000Z",
      "hidden": false
    },
    {
      "id": -203849,
      "company_id": 480,
      "title": "Canadian Investment Regulatory Organization Trading Halt - NILI",
      "link": "https://contentapi.cision.com/api/v1.0/releases/20250609C7313",
      "date": "2025-06-09T13:54:00.000Z",
      "hidden": false
    },
    {
      "id": 105392,
      "company_id": 480,
      "title": "Surge Battery Grants Stock Options",
      "link": null,
      "date": "2025-05-21T20:31:00.000Z",
      "hidden": false
    },
    {
      "id": 100003,
      "company_id": 480,
      "title": "Surge Battery Announces New Director",
      "link": null,
      "date": "2025-04-16T12:00:00.000Z",
      "hidden": false
    },
    {
      "id": 99651,
      "company_id": 480,
      "title": "Surge Battery Metals Closes Financing",
      "link": null,
      "date": "2025-04-14T12:00:00.000Z",
      "hidden": false
    },
    {
      "id": 93071,
      "company_id": 480,
      "title": "Surge Battery Metals Provides Corporate Update and Announces Financing",
      "link": null,
      "date": "2025-03-31T12:00:00.000Z",
      "hidden": false
    },
    {
      "id": 92363,
      "company_id": 480,
      "title": "Surge Battery Metals: President Trump Signs Executive Order to Increase America's Mineral Production",
      "link": null,
      "date": "2025-03-25T12:00:00.000Z",
      "hidden": false
    },
    {
      "id": 90137,
      "company_id": 480,
      "title": "Surge Receives Positive Record of Decision on its Exploration Plan of Operations Permit at the Nevada North Lithium Project",
      "link": "https://golddiscovery.com/legacy/user/news_details/742404-nilica-surge-receives-positive-record-of-decision-on-its-exploration-plan-of-operations-permit-at-the-nevada-north-lithium-project",
      "date": "2025-03-05T14:51:00.000Z",
      "hidden": false
    },
    {
      "id": 82682,
      "company_id": 480,
      "title": "Surge's Nevada North Lithium Project Moves to the 30-Day National Environmental Policy Act (NEPA) Environmental Assessment Public Comment Period",
      "link": "https://www.newsfilecorp.com/release/234697/Surges-Nevada-North-Lithium-Project-Moves-to-the-30Day-National-Environmental-Policy-Act-NEPA-Environmental-Assessment-Public-Comment-Period",
      "date": "2024-12-20T17:06:00.000Z",
      "hidden": false
    }
  ]
}
