{
  "article": {
    "id": 77178,
    "link": "https://www.newsfilecorp.com/release/228428/Surge-Announces-Extension-to-Property-Purchase-Agreement-Announced-on-August-22-2024-and-Sale-of-Nickel-Property",
    "title": "Surge Announces Extension to Property Purchase Agreement Announced on August 22, 2024 and Sale of Nickel Property",
    "description": "<img src=\"https://api.newsfilecorp.com/newsinfo/228428/367\" id=\"367\" width=\"2\" height=\"2\" style=\"width: 1px;  height: 1px;border: 0px solid;\" /><p>West Vancouver, British Columbia--(Newsfile Corp. - October 31, 2024) - Surge Battery Metals Inc.&#160;(TSXV: NILI) (OTCQX: NILIF) (FSE: DJ5C)  (the \"<b>Company</b>\" or \"<b>Surge</b>\") reports that on August 22, 2024, the Company announced that the Company and M3 Metals Corp. (\"M3M\") had entered into a property purchase and sale agreement (the \"Purchase Agreement\") whereby M3M, in consideration of the issuance to M3M of a total of 1,200,000 common shares of the Company, would sell to the Company all of its right, title and interest in and to the Texas Springs Properties (the \"Properties\") in the area of the Company's Nevada North Lithium Project.  The Properties, which the Company and M3M each own fifty (50%) percent of, were the subject of a mineral property option agreement (the \"Option Agreement\") dated effective July 26, 2023. The Option Agreement, and all rights and obligations under it, are terminated by the Purchase Agreement.</p><p>The Purchase Agreement contained a clause that the parties had to obtain regulatory approval, and close the transactions contemplated by the Purchase Agreement, by October 31, 2024.  </p><p>The parties have now entered into an amendment (the \"Amendment\") dated October 27, 2024 whereby the Purchase Agreement will terminate if closing of the Purchase Agreement has not occurred on or before June 30, 2025.  The extended closing date is due to the requirement that Surge obtain disinterested shareholder approval prior to closing.  Surge does not, at this time, have a date for the shareholder meeting at which approval will be sought. </p><p>The Purchase Agreement is considered a related party transaction under the policies of the TSX Venture Exchange by virtue of the parties having in common: (i) a person who is an officer (Corporate Secretary and CFO) and director of one party as well as an officer (Corporate Secretary) of the other party; and (ii) a person who is a director of one party and a 10% shareholder of the other party.   As a result, it is subject to MI 61-101's requirements.  The Company is relying on the exemptions in MI 61-101 from the requirements for a formal valuation (Sections 5.5(a) and (b)), the requirements for a meeting and information circular (Section 5.7(1)(a)) and the requirements for minority approval (Sections 5.7(1)(a) and (b)).   The Company wishes to hereby amend its news release of August 22, 2024 which should have contained the MI 61-101 disclosure above. </p><p>Surge further announces that it has entered into an agreement (the \"Nickel 100 Agreement\") with FPX Nickel Corp. (\"FPX\") dated effective October 10, 2024 whereby it has sold to FPX the Nickel 100, 101, 103 and 104 claims in Northern British Columbia.  Consideration for the sale to FPX is $50,000 payable in cash to Surge on closing. </p><p>Surge has also entered into an agreement (the \"Hard Nickel Agreement\") with FPX dated effective October 10, 2024, whereby it has sold to FPX the Hard Nickel Claim (the \"Hard Nickel Claim\") which is also in Northern British Columbia.  The Hard Nickel Agreement calls for FPX to oversee completion of certain reclamation and inspection activities on the Hard Nickel Claim which are estimated to cost up to approximately $9700 (the \"Outstanding Reclamation Costs\").  Consideration for the sale to FPX is approximately $185,000 which amount consists of $150,000 payable to Surge in cash and the return of a reclamation bond in the amount of $44,681.00 to Surge less the Outstanding Reclamation Costs. </p><p>The sale of these properties reflects Surge's commitment to focusing its efforts on its Nevada North Lithium Project in Elko County, Nevada. </p><p><b>About Surge Battery Metals Inc. </b></p><p>Surge Battery Metals, a Canadian-based mineral exploration company, is at the forefront of securing the supply of domestic lithium through its active engagement in the Nevada North Lithium Project. The project focuses on exploring clean, high-grade lithium energy metals in Nevada, USA, a crucial element for powering the electric vehicles of tomorrow. With a primary listing on the TSX Venture Exchange in Canada and the OTCQX Market in the US, Surge Battery Metals Inc. is strategically positioned as a key player in advancing lithium exploration, contributing significantly to the sustainable future of the electric vehicle industry. At Surge Battery Metals, we are not just exploring minerals; we are pioneering the path to a cleaner and more sustainable future, driving innovation in the lithium sector, and contributing to the evolution of the electric vehicle industry.</p><p><b>About the Nevada North Lithium Project</b></p><p>The Company owns the <b>Nevada North Lithium Project </b>located in the Granite Range southeast of Jackpot, Nevada about 73 km north-northeast of Wells, Elko County, Nevada. The first three rounds of drilling, completed in 2022, 2023, and 2024, identified a strongly mineralized zone of lithium bearing clays occupying a strike length of more than 4,300 meters and a known width of greater than 1500 meters. Highly anomalous soil values and geophysical surveys suggest there is potential for the clay horizons to be much greater in extent, while wide drill spacing allows for significant upside to occur during infill drilling. The Nevada North Lithium Project has a pit-constrained Inferred Resource containing an estimated 8.65 Mt of Lithium Carbonate Equivalent (LCE) grading 2,951 ppm Li at a 1,250 ppm cutoff.</p><p><i><b>Keep up-to-date with Surge Battery Metals on </b></i><a href=\"https://api.newsfilecorp.com/redirect/EyoJgH7r7N\"><i><b>Twitter</b></i></a><i><b>, </b></i><a href=\"https://api.newsfilecorp.com/redirect/x3aRNIgZg4\"><i><b>Facebook</b></i></a><i><b>, </b></i><a href=\"https://api.newsfilecorp.com/redirect/7Wr0jiG5Gm\"><i><b>LinkedIn</b></i></a><i><b>, </b></i><a href=\"https://api.newsfilecorp.com/redirect/eLyEzUomoX\"><i><b>Instagram </b></i></a><i><b>and </b></i><a href=\"https://api.newsfilecorp.com/redirect/85VWvFx8xP\"><i><b>YouTube</b></i></a><i><b>.</b></i></p><p><b>On behalf of the Board of Directors</b></p><p><i>\"Greg Reimer\"</i></p><p>Greg Reimer,<br />President &#38; CEO</p><p><b> Contact Information</b></p><div id=\"contactInfo\"><p>Email :  <a href=\"mailto:info@surgebatterymetals.com\">info@surgebatterymetals.com<br /></a>Phone : 604-662-8184<br />Website: <a href=\"https://api.newsfilecorp.com/redirect/yEaqXt5751\">surgebatterymetals.com</a></p></div><p><i><b>Neither the TSX Venture Exchange nor its Regulation Services Provider (as that term is defined in the policies of the TSX Venture Exchange) accepts responsibility for the adequacy or accuracy of this release.  </b></i></p><p>This document may contain certain \"Forward-Looking Statements\" within the meaning of the United States Private Securities Litigation Reform Act of 1995 and applicable Canadian securities laws. When used in this news release, the words \"anticipate\", \"believe\", \"estimate\", \"expect\", \"target, \"plan\" or \"planned\", \"possible\", \"potential\", \"forecast\", \"intend\", \"may\", \"schedule\" and similar words or expressions identify forward-looking statements or information. These forward-looking statements or information may relate to future prices of commodities including lithium and nickel, the accuracy of mineral or resource exploration activity, reserves or resources, regulatory or government requirements or approvals including approvals of title and mining rights or licenses and environmental, local community or indigenous community approvals, the reliability of third party information, continued access to mineral properties or infrastructure or water, changes in laws, rules and regulations including in the United States, Nevada or California or any other jurisdiction which may impact upon the Company or its properties or the commercial exploitation of those properties, currency risks including the exchange rate of USD$ for Cdn$ or other currencies, fluctuations in the market for lithium related products, changes in exploration costs and government royalties, export policies or taxes in the United States or any other jurisdiction and other factors or information. The Company's current plans, expectations, and intentions with respect to development of its business and of its Nevada properties may be impacted by economic uncertainties arising out of any pandemic or by the impact of current financial and other market conditions (including US government subsidies or incentives) on its ability to secure further financing or funding of its Nevada properties. Such statements represent the Company's current views with respect to future events and are necessarily based upon several assumptions and estimates that, while considered reasonable by the Company, are inherently subject to significant business, economic, competitive, political, environmental (including endangered species, habitat preservation and water related risks) and social risks, contingencies, and uncertainties. Many factors, both known and unknown, could cause results, performance, or achievements to be materially different from the results, performance or achievements that are or may be expressed or implied by such forward-looking statements. The Company does not intend, and does not assume any obligation, to update these forward-looking statements or information to reflect changes in assumptions or changes in circumstances or any other events affecting such statements and information other than as required by applicable laws, rules, and regulations.</p><p id=\"corporateNewsLogoContainer\"><img src=\"https://images.newsfilecorp.com/files/9838/228428_0be6db99546b6b79_logo.jpg\" id=\"corporateNewsLogo\" alt=\"Corporate Logo\" /></p><p id=\"corporateLinkBack\">To view the source version of this press release, please visit <a href=\"https://api.newsfilecorp.com/redirect/1pbmXfyYyJ\">https://www.newsfilecorp.com/release/228428</a></p>",
    "search_terms": "Nevada North,Surge Battery Metals Inc.,NILI",
    "master_gid": 3474,
    "date": "2024-10-31T12:00:00.000Z",
    "tags": "||||Project Acquisition",
    "image_id": null,
    "hidden": false,
    "company_id": 480,
    "provider": "newsfilecorp",
    "excerpt": "West Vancouver, British Columbia--(Newsfile Corp. - October 31, 2024) - Surge Battery Metals Inc.&#160;(TSXV: NILI) (OTCQX: NILIF) (FSE: DJ5C) (the \"Company\" or \"Surge\") reports that on August 22, 2024, the Company announced that the Company and M3 Metals Corp. (\"M3M\") had entered into a property purchase and sale agreement (the",
    "is_regulatory": false,
    "refined_tags": null,
    "ftp_filename": null,
    "company_name": "Surge Battery Metals Inc.",
    "exchange": "TSXV",
    "root_ticker": "NILI",
    "project_name": "Nevada North",
    "gid": 3474,
    "location": "Nevada, United States",
    "plan_id": null,
    "description_text": "West Vancouver, British Columbia--(Newsfile Corp. - October 31, 2024) - Surge Battery Metals Inc. (TSXV: NILI) (OTCQX: NILIF) (FSE: DJ5C)  (the \" Company \" or \" Surge \") reports that on August 22, 2024, the Company announced that the Company and M3 Metals Corp. (\"M3M\") had entered into a property purchase and sale agreement (the \"Purchase Agreement\") whereby M3M, in consideration of the issuance to M3M of a total of 1,200,000 common shares of the Company, would sell to the Company all of its right, title and interest in and to the Texas Springs Properties (the \"Properties\") in the area of the Company's Nevada North Lithium Project.  The Properties, which the Company and M3M each own fifty (50%) percent of, were the subject of a mineral property option agreement (the \"Option Agreement\") dated effective July 26, 2023. The Option Agreement, and all rights and obligations under it, are terminated by the Purchase Agreement. The Purchase Agreement contained a clause that the parties had to obtain regulatory approval, and close the transactions contemplated by the Purchase Agreement, by October 31, 2024. The parties have now entered into an amendment (the \"Amendment\") dated October 27, 2024 whereby the Purchase Agreement will terminate if closing of the Purchase Agreement has not occurred on or before June 30, 2025.  The extended closing date is due to the requirement that Surge obtain disinterested shareholder approval prior to closing.  Surge does not, at this time, have a date for the shareholder meeting at which approval will be sought. The Purchase Agreement is considered a related party transaction under the policies of the TSX Venture Exchange by virtue of the parties having in common: (i) a person who is an officer (Corporate Secretary and CFO) and director of one party as well as an officer (Corporate Secretary) of the other party; and (ii) a person who is a director of one party and a 10% shareholder of the other party.   As a result, it is subject to MI 61-101's requirements.  The Company is relying on the exemptions in MI 61-101 from the requirements for a formal valuation (Sections 5.5(a) and (b)), the requirements for a meeting and information circular (Section 5.7(1)(a)) and the requirements for minority approval (Sections 5.7(1)(a) and (b)).   The Company wishes to hereby amend its news release of August 22, 2024 which should have contained the MI 61-101 disclosure above. Surge further announces that it has entered into an agreement (the \"Nickel 100 Agreement\") with FPX Nickel Corp. (\"FPX\") dated effective October 10, 2024 whereby it has sold to FPX the Nickel 100, 101, 103 and 104 claims in Northern British Columbia.  Consideration for the sale to FPX is $50,000 payable in cash to Surge on closing. Surge has also entered into an agreement (the \"Hard Nickel Agreement\") with FPX dated effective October 10, 2024, whereby it has sold to FPX the Hard Nickel Claim (the \"Hard Nickel Claim\") which is also in Northern British Columbia.  The Hard Nickel Agreement calls for FPX to oversee completion of certain reclamation and inspection activities on the Hard Nickel Claim which are estimated to cost up to approximately $9700 (the \"Outstanding Reclamation Costs\").  Consideration for the sale to FPX is approximately $185,000 which amount consists of $150,000 payable to Surge in cash and the return of a reclamation bond in the amount of $44,681.00 to Surge less the Outstanding Reclamation Costs. The sale of these properties reflects Surge's commitment to focusing its efforts on its Nevada North Lithium Project in Elko County, Nevada. About Surge Battery Metals Inc. Surge Battery Metals, a Canadian-based mineral exploration company, is at the forefront of securing the supply of domestic lithium through its active engagement in the Nevada North Lithium Project. The project focuses on exploring clean, high-grade lithium energy metals in Nevada, USA, a crucial element for powering the electric vehicles of tomorrow. With a primary listing on the TSX Venture Exchange in Canada and the OTCQX Market in the US, Surge Battery Metals Inc. is strategically positioned as a key player in advancing lithium exploration, contributing significantly to the sustainable future of the electric vehicle industry. At Surge Battery Metals, we are not just exploring minerals; we are pioneering the path to a cleaner and more sustainable future, driving innovation in the lithium sector, and contributing to the evolution of the electric vehicle industry. About the Nevada North Lithium Project The Company owns the Nevada North Lithium Project located in the Granite Range southeast of Jackpot, Nevada about 73 km north-northeast of Wells, Elko County, Nevada. The first three rounds of drilling, completed in 2022, 2023, and 2024, identified a strongly mineralized zone of lithium bearing clays occupying a strike length of more than 4,300 meters and a known width of greater than 1500 meters. Highly anomalous soil values and geophysical surveys suggest there is potential for the clay horizons to be much greater in extent, while wide drill spacing allows for significant upside to occur during infill drilling. The Nevada North Lithium Project has a pit-constrained Inferred Resource containing an estimated 8.65 Mt of Lithium Carbonate Equivalent (LCE) grading 2,951 ppm Li at a 1,250 ppm cutoff. Keep up-to-date with Surge Battery Metals on Twitter , Facebook , LinkedIn , Instagram and YouTube . On behalf of the Board of Directors \"Greg Reimer\" Greg Reimer, President & CEO Contact Information Email : info@surgebatterymetals.com Phone : 604-662-8184 Website: surgebatterymetals.com Neither the TSX Venture Exchange nor its Regulation Services Provider (as that term is defined in the policies of the TSX Venture Exchange) accepts responsibility for the adequacy or accuracy of this release. This document may contain certain \"Forward-Looking Statements\" within the meaning of the United States Private Securities Litigation Reform Act of 1995 and applicable Canadian securities laws. When used in this news release, the words \"anticipate\", \"believe\", \"estimate\", \"expect\", \"target, \"plan\" or \"planned\", \"possible\", \"potential\", \"forecast\", \"intend\", \"may\", \"schedule\" and similar words or expressions identify forward-looking statements or information. These forward-looking statements or information may relate to future prices of commodities including lithium and nickel, the accuracy of mineral or resource exploration activity, reserves or resources, regulatory or government requirements or approvals including approvals of title and mining rights or licenses and environmental, local community or indigenous community approvals, the reliability of third party information, continued access to mineral properties or infrastructure or water, changes in laws, rules and regulations including in the United States, Nevada or California or any other jurisdiction which may impact upon the Company or its properties or the commercial exploitation of those properties, currency risks including the exchange rate of USD$ for Cdn$ or other currencies, fluctuations in the market for lithium related products, changes in exploration costs and government royalties, export policies or taxes in the United States or any other jurisdiction and other factors or information. The Company's current plans, expectations, and intentions with respect to development of its business and of its Nevada properties may be impacted by economic uncertainties arising out of any pandemic or by the impact of current financial and other market conditions (including US government subsidies or incentives) on its ability to secure further financing or funding of its Nevada properties. Such statements represent the Company's current views with respect to future events and are necessarily based upon several assumptions and estimates that, while considered reasonable by the Company, are inherently subject to significant business, economic, competitive, political, environmental (including endangered species, habitat preservation and water related risks) and social risks, contingencies, and uncertainties. Many factors, both known and unknown, could cause results, performance, or achievements to be materially different from the results, performance or achievements that are or may be expressed or implied by such forward-looking statements. The Company does not intend, and does not assume any obligation, to update these forward-looking statements or information to reflect changes in assumptions or changes in circumstances or any other events affecting such statements and information other than as required by applicable laws, rules, and regulations. To view the source version of this press release, please visit https://www.newsfilecorp.com/release/228428",
    "primary_commodity": "Li"
  },
  "articleProject": {
    "gid": 3474,
    "project_name": "Nevada North",
    "location": "Nevada, United States"
  },
  "articleExchange": "TSXV",
  "articleCompanyId": 480,
  "articleTicker": "NILI",
  "articleCompanyName": "Surge Battery Metals Inc.",
  "allOtherCompanyProjects": [
    {
      "company_id": 480,
      "gid": 3474,
      "project_name": "Nevada North",
      "location": "Nevada, United States"
    },
    {
      "company_id": 480,
      "gid": 10242,
      "project_name": "Galt",
      "location": "Nevada, United States"
    }
  ],
  "allOtherCompanyNews": [
    {
      "id": 107356,
      "company_id": 480,
      "title": "Surge Battery Metals Announces Webinar on PEA Results",
      "link": null,
      "date": "2025-06-09T20:30:00.000Z",
      "hidden": false
    },
    {
      "id": 107341,
      "company_id": 480,
      "title": "Surge Delivers Preliminary Economic Assessment For High-Grade Nevada North Lithium Project; After-Tax NPV8% US$9.21 Billion and After-Tax IRR of 22.8% OPEX of US$5,097/tonne LCE",
      "link": null,
      "date": "2025-06-09T14:20:00.000Z",
      "hidden": false
    },
    {
      "id": -203849,
      "company_id": 480,
      "title": "Canadian Investment Regulatory Organization Trading Halt - NILI",
      "link": "https://contentapi.cision.com/api/v1.0/releases/20250609C7313",
      "date": "2025-06-09T13:54:00.000Z",
      "hidden": false
    },
    {
      "id": 105392,
      "company_id": 480,
      "title": "Surge Battery Grants Stock Options",
      "link": null,
      "date": "2025-05-21T20:31:00.000Z",
      "hidden": false
    },
    {
      "id": 100003,
      "company_id": 480,
      "title": "Surge Battery Announces New Director",
      "link": null,
      "date": "2025-04-16T12:00:00.000Z",
      "hidden": false
    },
    {
      "id": 99651,
      "company_id": 480,
      "title": "Surge Battery Metals Closes Financing",
      "link": null,
      "date": "2025-04-14T12:00:00.000Z",
      "hidden": false
    },
    {
      "id": 93071,
      "company_id": 480,
      "title": "Surge Battery Metals Provides Corporate Update and Announces Financing",
      "link": null,
      "date": "2025-03-31T12:00:00.000Z",
      "hidden": false
    },
    {
      "id": 92363,
      "company_id": 480,
      "title": "Surge Battery Metals: President Trump Signs Executive Order to Increase America's Mineral Production",
      "link": null,
      "date": "2025-03-25T12:00:00.000Z",
      "hidden": false
    },
    {
      "id": 90137,
      "company_id": 480,
      "title": "Surge Receives Positive Record of Decision on its Exploration Plan of Operations Permit at the Nevada North Lithium Project",
      "link": "https://golddiscovery.com/legacy/user/news_details/742404-nilica-surge-receives-positive-record-of-decision-on-its-exploration-plan-of-operations-permit-at-the-nevada-north-lithium-project",
      "date": "2025-03-05T14:51:00.000Z",
      "hidden": false
    },
    {
      "id": 82682,
      "company_id": 480,
      "title": "Surge's Nevada North Lithium Project Moves to the 30-Day National Environmental Policy Act (NEPA) Environmental Assessment Public Comment Period",
      "link": "https://www.newsfilecorp.com/release/234697/Surges-Nevada-North-Lithium-Project-Moves-to-the-30Day-National-Environmental-Policy-Act-NEPA-Environmental-Assessment-Public-Comment-Period",
      "date": "2024-12-20T17:06:00.000Z",
      "hidden": false
    }
  ]
}
