{
  "article": {
    "id": 41759,
    "link": "https://www.newsfilecorp.com/release/182607/Hercules-Silver-Enters-into-Lease-Option-Agreement-for-CopperGold-Porphyry-Target-in-Hercules-Mining-District",
    "title": "Hercules Silver Enters into Lease Option Agreement for Copper-Gold Porphyry Target in Hercules Mining District",
    "description": "<img src=\"https://api.newsfilecorp.com/newsinfo/182607/367\" id=\"367\" width=\"2\" height=\"2\" style=\"width: 1px;  height: 1px;border: 0px solid;\" /><p>Toronto, Ontario--(Newsfile Corp. - October 2, 2023) - <b>Hercules Silver Corp.</b>&#160;(<b>TSXV: BIG</b>) (<b>OTCQB: BADEF</b>) (<b>FSE: 8Q7</b>)&#160;(\"<b>Hercules Silver</b>\" or the \"<b>Company</b>\")&#160;is pleased to announce it has entered into a lease option agreement (the \"<b>Agreement</b>\") between the Company, Anglo-Bomarc, U.S., Inc., a wholly owned subsidiary of the Company (the \"<b>Lessee</b>\") and local prospector Merrill Palmer (the \"<b>Lessor</b>\"), dated September 27, 2023, which grants Hercules Silver the option to acquire a 100% interest in the Mineral property, comprising eighty-seven (87) unpatented lode mining claims within the Mineral mining district (\"<b>Mineral</b>\" or the \"<b>Property</b>\") located on Bureau of Land Management (\"<b>BLM</b>\") administered lands, 14 miles southwest of the Company's flagship Hercules property in Washington County, Idaho.</p><p>Chris Paul, CEO and Director of the Company, noted: \"<i>We've entered into a lease option agreement to secure another key piece of ground in the Hercules mining district, which the Company believes shows strong potential to emerge into a significant copper porphyry belt. The Hercules Copper Belt, as it's referred to internally, represents a trend of underexplored copper porphyry targets with excellent discovery potential. Relative to Hercules, the Mineral Project appears to be the next best developed prospect in the district and adds another compelling copper-gold porphyry target to the portfolio. We are highly encouraged by Mineral's historical drilling, strong soil geochemistry and similar geological setting to the Hercules project.\"</i></p><p><b>About the Mineral Property:</b></p><p>The Mineral Property was staked by renowned prospector, Merrill Palmer, who previously staked and discovered the Palmer VMS Project in Alaska. Mr. Palmer resides in the nearby town of Oxbow, Oregon, and has been prospecting the Hercules and Mineral mining districts for the past 15 years, including staking of the Mineral Property in 2011.</p><p>The Mineral mining district was so-named after prospectors discovered rhyolite-hosted silver-copper-lead-zinc-bearing replacement mineralization in the area during the 1870s. A town site was established, and small-scale mining began in the 1880s and continued in earnest until the repeal of the Sherman Silver Purchase Act by U.S. President Cleveland in 1893, which caused a collapse in the silver price and decimated the silver mining industry. The mines and smelters at Mineral shut down at that time, and subsequent mining was very sporadic and conducted at a small scale through to 1950. The district has been essentially dormant ever since, apart from a few years of historical exploration during the late 1960s/early 1970s, but has never had a modern, systematic exploration approach applied to it. </p><p>Cyprus Mines Corporation (\"<b>Cyprus</b>\") acquired a position in the district in 1968, after reconnaissance work indicated the presence of two potential deposit types: rhyolite-hosted, replacement-style silver-copper-lead-zinc mineralization on the southern half of the Property (similar in nature to the near-surface mineralization style that occurs at Hercules) and porphyry copper-gold style mineralization, hosted in potassium-rich dioritic intrusive rocks which underlie the rhyolite and outcrop on the northern half of the Property. </p><p>Cyprus carried out exploration activities between April of 1968 and February of 1970, consisting of geological mapping, geochemical soil surveys, a 17 line-mile IP-resistivity geophysical survey, and a 40-hole program of reverse circulation, churn, and core drilling. Cyprus's exploration efforts were focused on near-surface silver mineralization, amenable to bulk mining methods. Although they intersected narrow, high-grade silver-bearing structures - including up to 7 meters grading 701 g/t Ag and 3.5% Cu in MDD-4<sup>[1],2</sup> a hole drilled between the historical Boone and Enterprise mines, on an inlying (adjacent) patented mining claim currently held by a 3<sup>rd</sup> party - they terminated the program without evaluating the copper-gold porphyry potential in the underlying and adjacent intrusive rocks which outcrop on the northern half of the Property. Merrill Palmer has provided the Company with significant exploration data from these historical exploration programs by Cyprus.</p><p>Cyprus's soil survey outlined a &#62;400 ppm Cu-in-soil anomaly over an approximate area of 1.5 km by 3 km, which overlies a broad zone of anomalous IP chargeability associated with the potassium-rich dioritic intrusions<sup>1</sup>. </p><p>Cyprus drilled just two holes into the copper porphyry target zone. These holes were drilled prior to Cyprus conducting their IP survey. A 2014 geophysical inversion of the IP data shows that the holes were both drilled at the northeast edge of a weaker portion of the anomaly, as shown in Figures 1-3. Regardless, holes MDD-1 and MDD-2 both intersected copper mineralization accompanied by distal alteration (propylitic) that typically surrounds the outer margin of a porphyry copper system. Gold and molybdenum were not assayed for at the time, however modern sampling indicates the presence of both metals within the porphyry target. MDD-2 assayed 266 m of 0.17% Cu from 5 m depth to the end of the hole at 271 m. Hole MDD-1 assayed 52 m of 0.13% Cu from 70 m to 122 m, and 151 m of 0.11% Cu from 151 m to end-of-hole at 302 m<sup>1,[2]</sup>. This grade of mineralization is consistent with distal propylitic alteration, which was historically logged by Cyprus throughout these holes. The main body of the chargeability anomaly, as outlined by the purple dashed lines on Figures 1-3, has not yet been tested.</p><p>In 2013, Newmont Corporation (\"<b>Newmont</b>\") carried out an evaluation of the Property and collected 41 select rock grab samples at mineralized showings and 213 soil samples on a regular 100m spaced grid that covers a portion of the porphyry target. The soil results revealed a strong copper-gold-molybdenum anomaly, with values ranging up to 6,370 ppm Cu, 206 ppb Au, and 65 ppm Mo, over 1.8 kilometers in length<sup>[3]</sup>. The soil anomaly is consistent with a porphyry copper target that remains open for expansion. Select rock grab samples returned up to 30.3 g/t Au, 852 ppm Mo and 5.9% Cu. Figures 1-3 present the anomalous geochemistry and IP chargeability associated with the porphyry copper-gold zone.</p><p>In 2014, Radius Gold Inc. (\"<b>Radius</b>\") leased the Property from Merrill Palmer and flew a large airborne magnetic and radiometric survey, carried out selective rock and soil sampling and carried out a modern inversion of the digitized historical IP geophysical data. Geophysical inversions provide machine interpreted 3D models of both resistivity and chargeability data. A depth slice of the 3D chargeability model is presented on Figures 1-3.</p><p>More recently, prospecting work undertaken by the Lessor, Merrill Palmer, has reported the existence of 0.1 to 1 m thick quartz-tourmaline veins within the intrusion that grade up to 20.1 g/t Au and 5% Cu to the southeast of the historical Jessie mine<sup>3</sup>. This zone has not been tested by drilling.</p><p style=\"text-align: center;\"><a rel=\"nofollow\" href=\"https://images.newsfilecorp.com/files/9425/182607_046a3cdda4dbba8a_002full.jpg\"><img src=\"https://images.newsfilecorp.com/files/9425/182607_046a3cdda4dbba8a_002.jpg\" style=\"border-width: 0px;\" alt=\"Cannot view this image? Visit: https://images.newsfilecorp.com/files/9425/182607_046a3cdda4dbba8a_002.jpg\" /></a><br /><br /><b>Figure 1: Copper in Newmont's 2013 soil samples and select grab samples</b><sup><b>3</b></sup><b>, IP chargeability depth slice, and historical drill collars with labels for MDD-1, MDD-2, and MDD-4. Note that the IP survey was carried out after the 1969 drill program and the &#62;1km central and ~1km eastern chargeability anomaly have not yet been tested. MDD-2 returned 266 m of 0.17% Cu (Au and Mo not assayed for) from 5 m depth in distal propylitic alteration</b><sup><b>1</b></sup></p><p style=\"text-align: center;\">To view an enhanced version of this graphic, please visit:<br /><a rel=\"nofollow\" href=\"https://images.newsfilecorp.com/files/9425/182607_046a3cdda4dbba8a_002full.jpg\">https://images.newsfilecorp.com/files/9425/182607_046a3cdda4dbba8a_002full.jpg</a></p><p style=\"text-align: center;\"><a rel=\"nofollow\" href=\"https://images.newsfilecorp.com/files/9425/182607_046a3cdda4dbba8a_003full.jpg\"><img src=\"https://images.newsfilecorp.com/files/9425/182607_046a3cdda4dbba8a_003.jpg\" style=\"border-width: 0px;\" alt=\"Cannot view this image? Visit: https://images.newsfilecorp.com/files/9425/182607_046a3cdda4dbba8a_003.jpg\" /></a><br /><br /><b>Figure 2: Gold in Newmont&#8217;s 2013 soil samples and select grab samples3, IP chargeability depth slice, and historical drill collars with labels for MDD-1, MDD-2, and MDD-4. Note that the IP survey was carried out after the 1969 drill program and the &#62;1km central and ~1km eastern chargeability anomaly have not yet been tested. MDD-2 returned 266 m of 0.17% Cu (Au and Mo not assayed for) from 5 m depth in distal propylitic alteration<sup>1</sup></b></p><p style=\"text-align: center;\">To view an enhanced version of this graphic, please visit:<br /><a rel=\"nofollow\" href=\"https://images.newsfilecorp.com/files/9425/182607_046a3cdda4dbba8a_003full.jpg\">https://images.newsfilecorp.com/files/9425/182607_046a3cdda4dbba8a_003full.jpg</a></p><p style=\"text-align: center;\"><a rel=\"nofollow\" href=\"https://images.newsfilecorp.com/files/9425/182607_046a3cdda4dbba8a_004full.jpg\"><img src=\"https://images.newsfilecorp.com/files/9425/182607_046a3cdda4dbba8a_004.jpg\" style=\"border-width: 0px;\" alt=\"Cannot view this image? Visit: https://images.newsfilecorp.com/files/9425/182607_046a3cdda4dbba8a_004.jpg\" /></a><br /><br /><b>Figure 3: Molybdenum in Newmont's 2013 soil samples and select grab samples</b><sup><b>3</b></sup><b>, IP chargeability depth slice, and historical drill collars with labels for MDD-1, MDD-2, and MDD-4. Note that the IP survey was carried out after the 1969 drill program and the &#62;1km central and ~1km eastern chargeability anomaly have not yet been tested. MDD-2 returned 266 m of 0.17% Cu (Au and Mo not assayed for) from 5 m depth in distal propylitic alteration</b><sup><b>1</b></sup></p><p style=\"text-align: center;\">To view an enhanced version of this graphic, please visit:<br /><a rel=\"nofollow\" href=\"https://images.newsfilecorp.com/files/9425/182607_046a3cdda4dbba8a_004full.jpg\">https://images.newsfilecorp.com/files/9425/182607_046a3cdda4dbba8a_004full.jpg</a></p><p>This news release contains information about adjacent properties on which the Company has no right to explore or mine. Readers are cautioned that mineral deposits on adjacent properties are not indicative of mineral deposits on the Company's properties. The reader is cautioned that rock grab samples are selective by nature and may not represent the true grade or style of mineralization across the Property and Hercules believes the work completed by historical operators was performed to a professional standard, but has not independently confirmed the results.</p><p><b>Terms of the Agreement:</b></p><p>Pursuant to the terms and subject to the conditions of the Agreement, the Company and/or the Lessee will be required to make lease payments in accordance with the following schedule:</p><table cellspacing=\"0\" cellpadding=\"0\" style=\"text-align: start; width: 100%; border-collapse: collapse;\" border=\"0\"><tbody><tr><td style=\"width: 33.3%; border-top: 1px solid #000000; border-left: 1px solid #000000; font-size: 10px;\"><b>Payment Date</b></td><td style=\"text-align: center; width: 33.3%; vertical-align: top; border-top: 1px solid #000000; font-size: 10px;\"><b>Cash Payments</b></td><td style=\"text-align: center; width: 33.3%; vertical-align: top; border-top: 1px solid #000000; border-right: 1px solid #000000; font-size: 10px;\"><b>Share Consideration</b></td></tr><tr><td style=\"width: 33.3%; border-left: 1px solid #000000; font-size: 10px;\">Within five business days of TSXV Approval</td><td style=\"text-align: center; width: 33.3%; vertical-align: top; font-size: 10px;\">US$100,000</td><td style=\"text-align: center; width: 33.3%; vertical-align: top; border-right: 1px solid #000000; font-size: 10px;\">$0</td></tr><tr><td style=\"width: 33.3%; border-left: 1px solid #000000; font-size: 10px;\">September 27, 2024</td><td style=\"text-align: center; width: 33.3%; vertical-align: top; font-size: 10px;\">US$60,000</td><td style=\"text-align: center; width: 33.3%; vertical-align: top; border-right: 1px solid #000000; font-size: 10px;\">US$60,000*</td></tr><tr><td style=\"width: 33.3%; border-left: 1px solid #000000; font-size: 10px;\">September 27, 2025</td><td style=\"text-align: center; width: 33.3%; vertical-align: top; font-size: 10px;\">US$70,000</td><td style=\"text-align: center; width: 33.3%; vertical-align: top; border-right: 1px solid #000000; font-size: 10px;\">US$70,000*</td></tr><tr><td style=\"width: 33.3%; border-left: 1px solid #000000; font-size: 10px;\">September 27, 2026</td><td style=\"text-align: center; width: 33.3%; vertical-align: top; font-size: 10px;\">US$80,000</td><td style=\"text-align: center; width: 33.3%; vertical-align: top; border-right: 1px solid #000000; font-size: 10px;\">US$80,000*</td></tr><tr><td style=\"width: 33.3%; border-left: 1px solid #000000; font-size: 10px;\">September 27 2027</td><td style=\"text-align: center; width: 33.3%; vertical-align: top; font-size: 10px;\">US$80,000</td><td style=\"text-align: center; width: 33.3%; vertical-align: top; border-right: 1px solid #000000; font-size: 10px;\">US$80,000*</td></tr><tr><td style=\"width: 33.3%; border-left: 1px solid #000000; font-size: 10px;\">September 27, 2028</td><td style=\"text-align: center; width: 33.3%; vertical-align: top; font-size: 10px;\">US$80,000</td><td style=\"text-align: center; width: 33.3%; vertical-align: top; border-right: 1px solid #000000; font-size: 10px;\">US$80,000*</td></tr><tr><td style=\"width: 33.3%; border-left: 1px solid #000000; font-size: 10px;\">September 27, 2029</td><td style=\"text-align: center; width: 33.3%; vertical-align: top; font-size: 10px;\">US$80,000</td><td style=\"text-align: center; width: 33.3%; vertical-align: top; border-right: 1px solid #000000; font-size: 10px;\">US$80,000*</td></tr><tr><td style=\"width: 33.3%; border-bottom: 1px solid #000000; border-left: 1px solid #000000; font-size: 10px;\">September 27, 2030</td><td style=\"text-align: center; width: 33.3%; vertical-align: top; border-bottom: 1px solid #000000; font-size: 10px;\">US$80,000</td><td style=\"text-align: center; width: 33.3%; vertical-align: top; border-bottom: 1px solid #000000; border-right: 1px solid #000000; font-size: 10px;\">US$80,000*</td></tr></tbody></table><p>&#160;<br /><span style=\"font-size: 11px;\">*The share consideration issuable pursuant to the Agreement will be based on the 10-day volume weighed average price (\"</span><b style=\"font-size: 11px;\">VWAP</b><span style=\"font-size: 11px;\">\") of the Company's common shares (\"</span><b style=\"font-size: 11px;\">Common Shares</b><span style=\"font-size: 11px;\">\") on the TSX Venture Exchange (the \"</span><b style=\"font-size: 11px;\">TSXV</b><span style=\"font-size: 11px;\">\") prior to the applicable payment date.</span></p><p>Upon execution of the Agreement, the Company shall also pay the annual maintenance fees for the claims. The Agreement provides the Lessee with certain rights, including but not limited to, the right to access, enter, occupy, improve, explore, use, market, sell and dispose mineral and mineral substances on or from the Property.</p><p>At any time prior to the eighth anniversary of the Agreement, the Lessee has the right to purchase the Property for an aggregate of US$3 million (the \"<b>Option</b>\"), comprised of US$1.5 million in cash and Common Shares equal to US$1.5 million at a deemed value per Common Share equal to the 10-day VWAP of the Common Shares on the TSXV on the day preceding the delivery of the Common Shares to Lessor pursuant to the Option. In the event that the Option is exercised, the Lessee will receive credit for all lease payments previously made pursuant to the Agreement, which will serve to reduce the cash and Common Share value owed upon potential exercise of the Option.</p><p>At the conclusion of the eight-year term, if Lessee elects not to purchase the Property pursuant to the Option, then Lessee has the sole and exclusive right and discretion to continue to lease the Property by providing the Lessor with: (i) annual lease payments of US$160,000 comprising of US$80,000 in cash and Common Shares valued at US$80,000, at a deemed price per Common Share equal to the 10-day VWAP of the Common Shares on the TSXV on the day preceding the anniversary of the Agreement; and a 2% net smelter return royalty from the sale of all minerals on the Property. </p><p>In the event that the Lessee pays an aggregate total of US$2,000,000 in royalties, then the Lessee may reduce the royalty rate to 1% upon payment of a one-time lump sum of US$1,000,000 to Lessor. Thereafter, Lessor shall receive a 1% net smelter return royalty for production on any or all unpatented claims within the Property. If Lessee does not elect to \"buy down\" the Royalty, then Lessor shall receive a 2% net smelter return royalty for production on any or all unpatented claims within the Property.</p><p>The Agreement remains subject to approval by the TSXV.</p><p><b>Qualified Person </b></p><p>The scientific and technical information in this news release has been reviewed and approved for disclosure by Christopher Longton BS, CPG, Hercules' Vice President, Exploration. Mr. Longton is a \"Qualified Person\" for Hercules Silver within the meaning of National Instrument 43-101 - Standards of Disclosure for Mineral Projects (\"<b>NI 43-101</b>\"). Hercules believes the work completed by historical operators was performed to a professional standard, but has not independently confirmed the results.</p><p><b>About Hercules Silver Corp.</b></p><p>Hercules Silver Corp. is a junior mining company focused on the exploration and development of the 100% owned Hercules Silver Project, northwest of Cambridge, Idaho.</p><p>The Hercules project is a disseminated silver-lead-zinc system with 28,000 meters of historical drilling across 3.5 kilometers of strike. The Company is well positioned for growth through the drill bit, having completed extensive surface exploration consisting of soil &#38; rock sampling, geological mapping, IP geophysics.</p><p>The Company's management team brings significant exploration experience through the discovery and development of numerous precious metals projects worldwide.</p><p><b>For further information please contact:</b></p><p>Chris Paul<br />CEO &#38; Director<br />Telephone +1 (604) 449-6819<br />Email: <a href=\"mailto:cpaul@herculessilver.com\">cpaul@herculessilver.com</a></p><p>This news release does not constitute an offer to sell or a solicitation of an offer to buy any of the securities in the United States. Any securities referred to herein have not and will not be registered under the United States Securities Act of 1933, as amended (the \"<b>U.S. Securities Act</b>\") or any state securities laws and may not be offered or sold within the United States or to U.S. Persons unless registered under the U.S. Securities Act and applicable state securities laws of an exemption from such registration is available.</p><p><b>Disclaimer for Forward-Looking Information</b></p><p>This news release contains certain information that may be deemed \"forward-looking information\" with respect to the Company within the meaning of applicable securities laws. Such forward-looking information involves known and unknown risks, uncertainties and other factors that may cause the Company's actual results, performance or achievements, or developments in the industry to differ materially from the anticipated results, performance or achievements expressed or implied by such forward-looking information. Forward-looking information includes statements that are not historical facts and are generally, but not always, identified by the words \"expects,\" \"plans,\" \"anticipates,\" \"believes,\" \"intends,\" \"estimates,\" \"projects,\" \"potential\" and similar expressions, or that events or conditions \"will,\" \"would,\" \"may,\" \"could\" or \"should\" occur. Forward-looking information contained in this press release may include, without limitation, the expectation that the Company will fulfil its obligations under the Agreement and make the required payments; exploration plans and expected exploration and drilling results at the Property, results of operations, and the expected financial performance of the Company. </p><p>Although the Company believes the forward-looking information contained in this news release is reasonable based on information available on the date hereof, by its nature, forward-looking information involves assumptions and known and unknown risks, uncertainties and other factors which may cause our actual results, level of activity, performance or achievements, or other future events, to be materially different from any future results, performance or achievements expressed or implied by such forward-looking information.</p><p>Examples of such assumptions, risks and uncertainties include, without limitation, assumptions, risks and uncertainties associated with general economic conditions; the Covid-19 pandemic; adverse industry events; the receipt of required regulatory approvals and the timing of such approvals; that the Company maintains good relationships with the communities in which it operates or proposes to operate, future legislative and regulatory developments in the mining sector; the Company's ability to access sufficient capital from internal and external sources, and/or inability to access sufficient capital on favorable terms; mining industry and markets in Canada and generally; the ability of the Company to implement its business strategies; competition; the risk that any of the assumptions prove not to be valid or reliable, which could result in delays, or cessation in planned work, risks associated with the interpretation of data, the geology, grade and continuity of mineral deposits, the possibility that results will not be consistent with the Company's expectations, as well as other assumptions risks and uncertainties applicable to mineral exploration and development activities and to the Company, including as set forth in the Company's public disclosure documents filed on the SEDAR website at <a href=\"https://api.newsfilecorp.com/redirect/NBA52F5aXr\">www.sedar.com</a>.</p><p><b>THE FORWARD-LOOKING INFORMATION CONTAINED IN THIS PRESS RELEASE REPRESENTS THE EXPECTATIONS OF HERCULES SILVER AS OF THE DATE OF THIS PRESS RELEASE AND, ACCORDINGLY, IS SUBJECT TO CHANGE AFTER SUCH DATE. READERS SHOULD NOT PLACE UNDUE IMPORTANCE ON FORWARD-LOOKING INFORMATION AND SHOULD NOT RELY UPON THIS INFORMATION AS OF ANY OTHER DATE. WHILE HERCULES SILVER MAY ELECT TO, IT DOES NOT UNDERTAKE TO UPDATE THIS INFORMATION AT ANY PARTICULAR TIME EXCEPT AS REQUIRED IN ACCORDANCE WITH APPLICABLE LAWS.</b></p><p><i>Neither the TSX Venture Exchange nor its Regulation Services Provider (as that term is defined in the policies of the TSX Venture Exchange) accepts responsibility for the adequacy or accuracy of this press release.</i></p><hr style=\"width: 33%; margin-left: 0px; border-top: 1px solid #000000;\" /><p><font style=\"font-size: 11px;\"><sup>[1]</sup> Jones, K., and Worthington, J.E., 1970, The Mineral Project: Current Status and Potential. For Cyprus Mines Corporation.</font></p><p><font style=\"font-size: 11px;\"><sup>[2]</sup> Worthington, J.E., 1969. Mineral District Final Report - Exploration. For Cyprus Mines Corporation.</font></p><p><font style=\"font-size: 11px;\">[3] Reid, D., 2014. Mineral Mining District, Idaho. Presentation, March 2014.</font></p><p id=\"corporateNewsLogoContainer\"><img src=\"https://images.newsfilecorp.com/files/9425/182607_046a3cdda4dbba8a_logo.jpg\" id=\"corporateNewsLogo\" alt=\"Corporate Logo\" /></p><p id=\"corporateLinkBack\">To view the source version of this press release, please visit <a href=\"https://api.newsfilecorp.com/redirect/X30RBCVL1r\">https://www.newsfilecorp.com/release/182607</a></p>",
    "search_terms": "Hercules,Hercules Metals Corp.,BIG",
    "master_gid": 2553,
    "date": "2023-10-02T12:00:00.000Z",
    "tags": "|||Silver|Project Acquisition",
    "image_id": null,
    "hidden": false,
    "company_id": 407,
    "provider": null,
    "excerpt": "Toronto, Ontario--(Newsfile Corp. - October 2, 2023) -Hercules Silver Corp.&#160;(TSXV: BIG) (OTCQB: BADEF) (FSE: 8Q7)&#160;(\"Hercules Silver\" or the \"Company\")&#160;is pleased to announce it has entered into a lease option agreement (the \"Agreement\") between the Company, Anglo-Bomarc, U.S., Inc., a wholly owned subsidiary of the Company (the \"Lessee\") and local prospector",
    "is_regulatory": false,
    "refined_tags": [
      "Project Acquisition"
    ],
    "ftp_filename": null,
    "company_name": "Hercules Metals Corp.",
    "exchange": "TSXV",
    "root_ticker": "BIG",
    "project_name": "Hercules",
    "gid": 2553,
    "location": "Idaho, United States",
    "plan_id": null,
    "description_text": "Toronto, Ontario--(Newsfile Corp. - October 2, 2023) - Hercules Silver Corp. ( TSXV: BIG ) ( OTCQB: BADEF ) ( FSE: 8Q7 ) (\" Hercules Silver \" or the \" Company \") is pleased to announce it has entered into a lease option agreement (the \" Agreement \") between the Company, Anglo-Bomarc, U.S., Inc., a wholly owned subsidiary of the Company (the \" Lessee \") and local prospector Merrill Palmer (the \" Lessor \"), dated September 27, 2023, which grants Hercules Silver the option to acquire a 100% interest in the Mineral property, comprising eighty-seven (87) unpatented lode mining claims within the Mineral mining district (\" Mineral \" or the \" Property \") located on Bureau of Land Management (\" BLM \") administered lands, 14 miles southwest of the Company's flagship Hercules property in Washington County, Idaho. Chris Paul, CEO and Director of the Company, noted: \" We've entered into a lease option agreement to secure another key piece of ground in the Hercules mining district, which the Company believes shows strong potential to emerge into a significant copper porphyry belt. The Hercules Copper Belt, as it's referred to internally, represents a trend of underexplored copper porphyry targets with excellent discovery potential. Relative to Hercules, the Mineral Project appears to be the next best developed prospect in the district and adds another compelling copper-gold porphyry target to the portfolio. We are highly encouraged by Mineral's historical drilling, strong soil geochemistry and similar geological setting to the Hercules project.\" About the Mineral Property: The Mineral Property was staked by renowned prospector, Merrill Palmer, who previously staked and discovered the Palmer VMS Project in Alaska. Mr. Palmer resides in the nearby town of Oxbow, Oregon, and has been prospecting the Hercules and Mineral mining districts for the past 15 years, including staking of the Mineral Property in 2011. The Mineral mining district was so-named after prospectors discovered rhyolite-hosted silver-copper-lead-zinc-bearing replacement mineralization in the area during the 1870s. A town site was established, and small-scale mining began in the 1880s and continued in earnest until the repeal of the Sherman Silver Purchase Act by U.S. President Cleveland in 1893, which caused a collapse in the silver price and decimated the silver mining industry. The mines and smelters at Mineral shut down at that time, and subsequent mining was very sporadic and conducted at a small scale through to 1950. The district has been essentially dormant ever since, apart from a few years of historical exploration during the late 1960s/early 1970s, but has never had a modern, systematic exploration approach applied to it. Cyprus Mines Corporation (\" Cyprus \") acquired a position in the district in 1968, after reconnaissance work indicated the presence of two potential deposit types: rhyolite-hosted, replacement-style silver-copper-lead-zinc mineralization on the southern half of the Property (similar in nature to the near-surface mineralization style that occurs at Hercules) and porphyry copper-gold style mineralization, hosted in potassium-rich dioritic intrusive rocks which underlie the rhyolite and outcrop on the northern half of the Property. Cyprus carried out exploration activities between April of 1968 and February of 1970, consisting of geological mapping, geochemical soil surveys, a 17 line-mile IP-resistivity geophysical survey, and a 40-hole program of reverse circulation, churn, and core drilling. Cyprus's exploration efforts were focused on near-surface silver mineralization, amenable to bulk mining methods. Although they intersected narrow, high-grade silver-bearing structures - including up to 7 meters grading 701 g/t Ag and 3.5% Cu in MDD-4 [1],2 a hole drilled between the historical Boone and Enterprise mines, on an inlying (adjacent) patented mining claim currently held by a 3 rd party - they terminated the program without evaluating the copper-gold porphyry potential in the underlying and adjacent intrusive rocks which outcrop on the northern half of the Property. Merrill Palmer has provided the Company with significant exploration data from these historical exploration programs by Cyprus. Cyprus's soil survey outlined a >400 ppm Cu-in-soil anomaly over an approximate area of 1.5 km by 3 km, which overlies a broad zone of anomalous IP chargeability associated with the potassium-rich dioritic intrusions 1 . Cyprus drilled just two holes into the copper porphyry target zone. These holes were drilled prior to Cyprus conducting their IP survey. A 2014 geophysical inversion of the IP data shows that the holes were both drilled at the northeast edge of a weaker portion of the anomaly, as shown in Figures 1-3. Regardless, holes MDD-1 and MDD-2 both intersected copper mineralization accompanied by distal alteration (propylitic) that typically surrounds the outer margin of a porphyry copper system. Gold and molybdenum were not assayed for at the time, however modern sampling indicates the presence of both metals within the porphyry target. MDD-2 assayed 266 m of 0.17% Cu from 5 m depth to the end of the hole at 271 m. Hole MDD-1 assayed 52 m of 0.13% Cu from 70 m to 122 m, and 151 m of 0.11% Cu from 151 m to end-of-hole at 302 m 1,[2] . This grade of mineralization is consistent with distal propylitic alteration, which was historically logged by Cyprus throughout these holes. The main body of the chargeability anomaly, as outlined by the purple dashed lines on Figures 1-3, has not yet been tested. In 2013, Newmont Corporation (\" Newmont \") carried out an evaluation of the Property and collected 41 select rock grab samples at mineralized showings and 213 soil samples on a regular 100m spaced grid that covers a portion of the porphyry target. The soil results revealed a strong copper-gold-molybdenum anomaly, with values ranging up to 6,370 ppm Cu, 206 ppb Au, and 65 ppm Mo, over 1.8 kilometers in length [3] . The soil anomaly is consistent with a porphyry copper target that remains open for expansion. Select rock grab samples returned up to 30.3 g/t Au, 852 ppm Mo and 5.9% Cu. Figures 1-3 present the anomalous geochemistry and IP chargeability associated with the porphyry copper-gold zone. In 2014, Radius Gold Inc. (\" Radius \") leased the Property from Merrill Palmer and flew a large airborne magnetic and radiometric survey, carried out selective rock and soil sampling and carried out a modern inversion of the digitized historical IP geophysical data. Geophysical inversions provide machine interpreted 3D models of both resistivity and chargeability data. A depth slice of the 3D chargeability model is presented on Figures 1-3. More recently, prospecting work undertaken by the Lessor, Merrill Palmer, has reported the existence of 0.1 to 1 m thick quartz-tourmaline veins within the intrusion that grade up to 20.1 g/t Au and 5% Cu to the southeast of the historical Jessie mine 3 . This zone has not been tested by drilling. Figure 1: Copper in Newmont's 2013 soil samples and select grab samples 3 , IP chargeability depth slice, and historical drill collars with labels for MDD-1, MDD-2, and MDD-4. Note that the IP survey was carried out after the 1969 drill program and the >1km central and ~1km eastern chargeability anomaly have not yet been tested. MDD-2 returned 266 m of 0.17% Cu (Au and Mo not assayed for) from 5 m depth in distal propylitic alteration 1 To view an enhanced version of this graphic, please visit: https://images.newsfilecorp.com/files/9425/182607_046a3cdda4dbba8a_002full.jpg Figure 2: Gold in Newmont’s 2013 soil samples and select grab samples3, IP chargeability depth slice, and historical drill collars with labels for MDD-1, MDD-2, and MDD-4. Note that the IP survey was carried out after the 1969 drill program and the >1km central and ~1km eastern chargeability anomaly have not yet been tested. MDD-2 returned 266 m of 0.17% Cu (Au and Mo not assayed for) from 5 m depth in distal propylitic alteration 1 To view an enhanced version of this graphic, please visit: https://images.newsfilecorp.com/files/9425/182607_046a3cdda4dbba8a_003full.jpg Figure 3: Molybdenum in Newmont's 2013 soil samples and select grab samples 3 , IP chargeability depth slice, and historical drill collars with labels for MDD-1, MDD-2, and MDD-4. Note that the IP survey was carried out after the 1969 drill program and the >1km central and ~1km eastern chargeability anomaly have not yet been tested. MDD-2 returned 266 m of 0.17% Cu (Au and Mo not assayed for) from 5 m depth in distal propylitic alteration 1 To view an enhanced version of this graphic, please visit: https://images.newsfilecorp.com/files/9425/182607_046a3cdda4dbba8a_004full.jpg This news release contains information about adjacent properties on which the Company has no right to explore or mine. Readers are cautioned that mineral deposits on adjacent properties are not indicative of mineral deposits on the Company's properties. The reader is cautioned that rock grab samples are selective by nature and may not represent the true grade or style of mineralization across the Property and Hercules believes the work completed by historical operators was performed to a professional standard, but has not independently confirmed the results. Terms of the Agreement: Pursuant to the terms and subject to the conditions of the Agreement, the Company and/or the Lessee will be required to make lease payments in accordance with the following schedule: Payment Date Cash Payments Share Consideration Within five business days of TSXV Approval US$100,000 $0 September 27, 2024 US$60,000 US$60,000* September 27, 2025 US$70,000 US$70,000* September 27, 2026 US$80,000 US$80,000* September 27 2027 US$80,000 US$80,000* September 27, 2028 US$80,000 US$80,000* September 27, 2029 US$80,000 US$80,000* September 27, 2030 US$80,000 US$80,000* *The share consideration issuable pursuant to the Agreement will be based on the 10-day volume weighed average price (\" VWAP \") of the Company's common shares (\" Common Shares \") on the TSX Venture Exchange (the \" TSXV \") prior to the applicable payment date. Upon execution of the Agreement, the Company shall also pay the annual maintenance fees for the claims. The Agreement provides the Lessee with certain rights, including but not limited to, the right to access, enter, occupy, improve, explore, use, market, sell and dispose mineral and mineral substances on or from the Property. At any time prior to the eighth anniversary of the Agreement, the Lessee has the right to purchase the Property for an aggregate of US$3 million (the \" Option \"), comprised of US$1.5 million in cash and Common Shares equal to US$1.5 million at a deemed value per Common Share equal to the 10-day VWAP of the Common Shares on the TSXV on the day preceding the delivery of the Common Shares to Lessor pursuant to the Option. In the event that the Option is exercised, the Lessee will receive credit for all lease payments previously made pursuant to the Agreement, which will serve to reduce the cash and Common Share value owed upon potential exercise of the Option. At the conclusion of the eight-year term, if Lessee elects not to purchase the Property pursuant to the Option, then Lessee has the sole and exclusive right and discretion to continue to lease the Property by providing the Lessor with: (i) annual lease payments of US$160,000 comprising of US$80,000 in cash and Common Shares valued at US$80,000, at a deemed price per Common Share equal to the 10-day VWAP of the Common Shares on the TSXV on the day preceding the anniversary of the Agreement; and a 2% net smelter return royalty from the sale of all minerals on the Property. In the event that the Lessee pays an aggregate total of US$2,000,000 in royalties, then the Lessee may reduce the royalty rate to 1% upon payment of a one-time lump sum of US$1,000,000 to Lessor. Thereafter, Lessor shall receive a 1% net smelter return royalty for production on any or all unpatented claims within the Property. If Lessee does not elect to \"buy down\" the Royalty, then Lessor shall receive a 2% net smelter return royalty for production on any or all unpatented claims within the Property. The Agreement remains subject to approval by the TSXV. Qualified Person The scientific and technical information in this news release has been reviewed and approved for disclosure by Christopher Longton BS, CPG, Hercules' Vice President, Exploration. Mr. Longton is a \"Qualified Person\" for Hercules Silver within the meaning of National Instrument 43-101 - Standards of Disclosure for Mineral Projects (\" NI 43-101 \"). Hercules believes the work completed by historical operators was performed to a professional standard, but has not independently confirmed the results. About Hercules Silver Corp. Hercules Silver Corp. is a junior mining company focused on the exploration and development of the 100% owned Hercules Silver Project, northwest of Cambridge, Idaho. The Hercules project is a disseminated silver-lead-zinc system with 28,000 meters of historical drilling across 3.5 kilometers of strike. The Company is well positioned for growth through the drill bit, having completed extensive surface exploration consisting of soil & rock sampling, geological mapping, IP geophysics. The Company's management team brings significant exploration experience through the discovery and development of numerous precious metals projects worldwide. For further information please contact: Chris Paul CEO & Director Telephone +1 (604) 449-6819 Email: cpaul@herculessilver.com This news release does not constitute an offer to sell or a solicitation of an offer to buy any of the securities in the United States. Any securities referred to herein have not and will not be registered under the United States Securities Act of 1933, as amended (the \" U.S. Securities Act \") or any state securities laws and may not be offered or sold within the United States or to U.S. Persons unless registered under the U.S. Securities Act and applicable state securities laws of an exemption from such registration is available. Disclaimer for Forward-Looking Information This news release contains certain information that may be deemed \"forward-looking information\" with respect to the Company within the meaning of applicable securities laws. Such forward-looking information involves known and unknown risks, uncertainties and other factors that may cause the Company's actual results, performance or achievements, or developments in the industry to differ materially from the anticipated results, performance or achievements expressed or implied by such forward-looking information. Forward-looking information includes statements that are not historical facts and are generally, but not always, identified by the words \"expects,\" \"plans,\" \"anticipates,\" \"believes,\" \"intends,\" \"estimates,\" \"projects,\" \"potential\" and similar expressions, or that events or conditions \"will,\" \"would,\" \"may,\" \"could\" or \"should\" occur. Forward-looking information contained in this press release may include, without limitation, the expectation that the Company will fulfil its obligations under the Agreement and make the required payments; exploration plans and expected exploration and drilling results at the Property, results of operations, and the expected financial performance of the Company. Although the Company believes the forward-looking information contained in this news release is reasonable based on information available on the date hereof, by its nature, forward-looking information involves assumptions and known and unknown risks, uncertainties and other factors which may cause our actual results, level of activity, performance or achievements, or other future events, to be materially different from any future results, performance or achievements expressed or implied by such forward-looking information. Examples of such assumptions, risks and uncertainties include, without limitation, assumptions, risks and uncertainties associated with general economic conditions; the Covid-19 pandemic; adverse industry events; the receipt of required regulatory approvals and the timing of such approvals; that the Company maintains good relationships with the communities in which it operates or proposes to operate, future legislative and regulatory developments in the mining sector; the Company's ability to access sufficient capital from internal and external sources, and/or inability to access sufficient capital on favorable terms; mining industry and markets in Canada and generally; the ability of the Company to implement its business strategies; competition; the risk that any of the assumptions prove not to be valid or reliable, which could result in delays, or cessation in planned work, risks associated with the interpretation of data, the geology, grade and continuity of mineral deposits, the possibility that results will not be consistent with the Company's expectations, as well as other assumptions risks and uncertainties applicable to mineral exploration and development activities and to the Company, including as set forth in the Company's public disclosure documents filed on the SEDAR website at www.sedar.com . THE FORWARD-LOOKING INFORMATION CONTAINED IN THIS PRESS RELEASE REPRESENTS THE EXPECTATIONS OF HERCULES SILVER AS OF THE DATE OF THIS PRESS RELEASE AND, ACCORDINGLY, IS SUBJECT TO CHANGE AFTER SUCH DATE. READERS SHOULD NOT PLACE UNDUE IMPORTANCE ON FORWARD-LOOKING INFORMATION AND SHOULD NOT RELY UPON THIS INFORMATION AS OF ANY OTHER DATE. WHILE HERCULES SILVER MAY ELECT TO, IT DOES NOT UNDERTAKE TO UPDATE THIS INFORMATION AT ANY PARTICULAR TIME EXCEPT AS REQUIRED IN ACCORDANCE WITH APPLICABLE LAWS. Neither the TSX Venture Exchange nor its Regulation Services Provider (as that term is defined in the policies of the TSX Venture Exchange) accepts responsibility for the adequacy or accuracy of this press release. [1] Jones, K., and Worthington, J.E., 1970, The Mineral Project: Current Status and Potential. For Cyprus Mines Corporation. [2] Worthington, J.E., 1969. Mineral District Final Report - Exploration. For Cyprus Mines Corporation. [3] Reid, D., 2014. Mineral Mining District, Idaho. Presentation, March 2014. To view the source version of this press release, please visit https://www.newsfilecorp.com/release/182607",
    "primary_commodity": "Cu"
  },
  "articleProject": {
    "gid": 2553,
    "project_name": "Hercules",
    "location": "Idaho, United States"
  },
  "articleExchange": "TSXV",
  "articleCompanyId": 407,
  "articleTicker": "BIG",
  "articleCompanyName": "Hercules Metals Corp.",
  "allOtherCompanyProjects": [
    {
      "company_id": 407,
      "gid": 677,
      "project_name": "Hot Springs",
      "location": "Nevada, USA"
    },
    {
      "company_id": 407,
      "gid": 2553,
      "project_name": "Hercules",
      "location": "Idaho, United States"
    }
  ],
  "allOtherCompanyNews": [
    {
      "id": 107664,
      "company_id": 407,
      "title": "Hercules Metals Announces Engagement of GDT Strategic Communications to Provide Investor Relations",
      "link": null,
      "date": "2025-06-11T11:45:00.000Z",
      "hidden": false
    },
    {
      "id": 105347,
      "company_id": 407,
      "title": "Hercules Metals Commences 2025 Drilling Program at the Hercules Project",
      "link": null,
      "date": "2025-05-21T11:00:00.000Z",
      "hidden": false
    },
    {
      "id": 103450,
      "company_id": 407,
      "title": "Independent Study Finds Evidence of Hypogene Enrichment at Hercules, Outlining Greater Scale and Grade Potential",
      "link": null,
      "date": "2025-05-05T11:00:00.000Z",
      "hidden": false
    },
    {
      "id": 100575,
      "company_id": 407,
      "title": "Hercules Metals Appoints Dillon Hume as Vice President, Exploration",
      "link": null,
      "date": "2025-04-23T11:00:00.000Z",
      "hidden": false
    },
    {
      "id": 100149,
      "company_id": 407,
      "title": "Hercules Targets Growth at Leviathan with Breakthrough 3D Model and 12,000-Metre Drill Campaign",
      "link": null,
      "date": "2025-04-17T11:00:00.000Z",
      "hidden": false
    },
    {
      "id": 89956,
      "company_id": 407,
      "title": "Hercules Metals Secures Mineral Lease Agreement with the State of Idaho",
      "link": "https://www.newsfilecorp.com/release/243227/Hercules-Metals-Secures-Mineral-Lease-Agreement-with-the-State-of-Idaho",
      "date": "2025-03-04T12:00:00.000Z",
      "hidden": false
    },
    {
      "id": 88580,
      "company_id": 407,
      "title": "Hercules Intersects 171m of 0.64% CuEq within 354m of 0.47% CuEq and Reveals Upcoming Drill Targets",
      "link": "https://www.newsfilecorp.com/release/241594/Hercules-Intersects-171m-of-0.64-CuEq-within-354m-of-0.47-CuEq-and-Reveals-Upcoming-Drill-Targets",
      "date": "2025-02-20T12:00:00.000Z",
      "hidden": false
    },
    {
      "id": 84105,
      "company_id": 407,
      "title": "Hercules Intersects 300m of 0.70% CuEq, including 138m of 1.01% CuEq, Starting 70m from Surface",
      "link": "https://www.newsfilecorp.com/release/237268/Hercules-Intersects-300m-of-0.70-CuEq-including-138m-of-1.01-CuEq-Starting-70m-from-Surface",
      "date": "2025-01-15T12:00:00.000Z",
      "hidden": false
    },
    {
      "id": 80731,
      "company_id": 407,
      "title": "Hercules Metals Achieves Strong Phase I Metallurgical Results with Recoveries of 90% Copper and Over 80% Silver",
      "link": "https://www.newsfilecorp.com/release/232239/Hercules-Metals-Achieves-Strong-Phase-I-Metallurgical-Results-with-Recoveries-of-90-Copper-and-Over-80-Silver",
      "date": "2024-12-03T12:00:00.000Z",
      "hidden": false
    },
    {
      "id": 79224,
      "company_id": 407,
      "title": "Hercules Intersects 338 Meters of 0.47% Cu with Mineralization Increasing at Depth and to the North",
      "link": "https://www.newsfilecorp.com/release/230546/Hercules-Intersects-338-Meters-of-0.47-Cu-with-Mineralization-Increasing-at-Depth-and-to-the-North",
      "date": "2024-11-19T12:00:00.000Z",
      "hidden": false
    }
  ]
}
