{
  "article": {
    "id": 89956,
    "link": "https://www.newsfilecorp.com/release/243227/Hercules-Metals-Secures-Mineral-Lease-Agreement-with-the-State-of-Idaho",
    "title": "Hercules Metals Secures Mineral Lease Agreement with the State of Idaho",
    "description": "<img src=\"https://api.newsfilecorp.com/newsinfo/243227/367\" id=\"367\" width=\"2\" height=\"2\" style=\"width: 1px;  height: 1px;border: 0px solid;\" /><p>Toronto, Ontario--(Newsfile Corp. - March 4, 2025) - <b>Hercules Metals Corp. (TSXV: BIG) (OTCQB: BADEF) (FSE: C0X)&#160;(\"Hercules\" or the \"Company\")&#160;</b>is pleased to announce that its U.S. subsidiary, Anglo-Bomarc, U.S., Inc. (the \"<b>Lessee\")</b> has entered into a twenty year mineral lease agreement with the Idaho Department of Lands (\"<b>IDL</b>\" or the \"<b>Lessor</b>\") to explore, develop and mine metallic minerals on approximately 7,669 acres of state-owned land adjacent to its Hercules Property in western Idaho (\"<b>Hercules</b>\" or the \"<b>Property</b>\") and 640 acres adjacent to its nearby Mineral property (collectively the \"<b>Lease Area</b>\"). This new addition increases the Company's land position in the district by over 46%, to a total of 24,276 acres at the Leviathan porphyry discovery and 2,243 acres at the Mineral property (Figures 1-5).</p><p>Chris Paul, CEO and Director of the Company, noted: \"This lease is consistent with our strategy of consolidating scale in the Hercules Porphyry Belt. As we advance the Leviathan discovery, our expanded land position provides us the ability to continue to explore, develop and mine, which aligns with Idaho's new Strategic Permitting, Efficiency, and Economic Development (SPEED) Act<sup>1</sup>, aimed at fast-tracking permitting and unlocking value in the states largely untapped mineral endowment.\"</p><p>The last cycle of exploration in the Hercules district lasted from 1965 through to 1984, consisting of shallow drilling below historical silver mines on the Hercules and Mineral properties. However, historical exploration never tested below areas with post-mineral cover due to the technological limitations of the time. As a result, the Lease Area, which is entirely covered with post-mineral basalt, went completely unexplored. </p><p>The Company's 2023 discovery of the Leviathan porphyry has revealed significant potential throughout the surrounding area. Follow-up drilling and surface mapping have since highlighted porphyry emplacement along a NW-SE trend which specifically increases the potential of the Lease Area. To test this, and fully appreciate the scope of the now consolidated target, the Company plans on activating powerful new geophysical technologies, aimed at unlocking the potential of these previously unexplored high-priority targets.</p><p>In addition to the copper porphyry discovered below the silver system in 2023, a recent wildcat hole drilled in the new Southern Flats Zone, HER-24-16, discovered an extension of the silver system immediately below post-mineral basalt. Since the epithermal silver system overlaps with and enriches the upper part of the porphyry, strong potential is indicated for the continuation of both systems below thin cover in the Southern Flats Zone. The post-mineral basalt was revealed to be just 40 meters thick in HER-24-16. </p><p style=\"text-align: center;\"><a rel=\"nofollow\" href=\"https://images.newsfilecorp.com/files/9425/243227_8e17517644f4c9b0_002full.jpg\"><img src=\"https://images.newsfilecorp.com/files/9425/243227_8e17517644f4c9b0_002.jpg\" style=\"border-width: 0px;\" alt=\"Cannot view this image? Visit: https://images.newsfilecorp.com/files/9425/243227_8e17517644f4c9b0_002.jpg\" /></a></p><p style=\"text-align: center;\"><b>Figure 1: New state mineral leases adjacent to Hercules property, showing porphyry targets and post-mineral cover.</b></p><p style=\"text-align: center;\">To view an enhanced version of this graphic, please visit:<br /><a rel=\"nofollow\" href=\"https://images.newsfilecorp.com/files/9425/243227_8e17517644f4c9b0_002full.jpg\">https://images.newsfilecorp.com/files/9425/243227_8e17517644f4c9b0_002full.jpg</a></p><p><b>Mineral Property</b></p><p>A section (640 acres) of state land adjacent to the southern boundary of the Company's Mineral property is included in the lease agreement (Figures 2-5). For additional information on the Mineral property, see news release dated <a href=\"https://api.newsfilecorp.com/redirect/gO1N7F3bPV\">October 2, 2023</a>.</p><p style=\"text-align: center;\"><a rel=\"nofollow\" href=\"https://images.newsfilecorp.com/files/9425/243227_8e17517644f4c9b0_003full.jpg\"><img src=\"https://images.newsfilecorp.com/files/9425/243227_8e17517644f4c9b0_003.jpg\" style=\"border-width: 0px;\" alt=\"Cannot view this image? Visit: https://images.newsfilecorp.com/files/9425/243227_8e17517644f4c9b0_003.jpg\" /></a></p><p style=\"text-align: center;\"><b>Figure 2: New state mineral lease adjacent to the Company's Mineral property, overlain with an airborne potassium (K) radiometrics survey. Warm colours indicate potassium enrichment, which at the Hercules property, is associated with the epithermal alteration and correlates strongly with silver. The linear highs may indicate important structural controls.</b></p><p style=\"text-align: center;\">To view an enhanced version of this graphic, please visit:<br /><a rel=\"nofollow\" href=\"https://images.newsfilecorp.com/files/9425/243227_8e17517644f4c9b0_003full.jpg\">https://images.newsfilecorp.com/files/9425/243227_8e17517644f4c9b0_003full.jpg</a></p><p style=\"text-align: center;\"><a rel=\"nofollow\" href=\"https://images.newsfilecorp.com/files/9425/243227_8e17517644f4c9b0_004full.jpg\"><img src=\"https://images.newsfilecorp.com/files/9425/243227_8e17517644f4c9b0_004.jpg\" style=\"border-width: 0px;\" alt=\"Cannot view this image? Visit: https://images.newsfilecorp.com/files/9425/243227_8e17517644f4c9b0_004.jpg\" /></a></p><p style=\"text-align: center;\"><b>Figure 3: Copper in soil and select rock grab samples</b><sup><b>2</b></sup><b>&#160;taken during a property evaluation by Newmont Corporation in 2013</b><sup><b>3</b></sup><b>.</b></p><p style=\"text-align: center;\">To view an enhanced version of this graphic, please visit:<br /><a rel=\"nofollow\" href=\"https://images.newsfilecorp.com/files/9425/243227_8e17517644f4c9b0_004full.jpg\">https://images.newsfilecorp.com/files/9425/243227_8e17517644f4c9b0_004full.jpg</a></p><p style=\"text-align: center;\"><a rel=\"nofollow\" href=\"https://images.newsfilecorp.com/files/9425/243227_8e17517644f4c9b0_005full.jpg\"><img src=\"https://images.newsfilecorp.com/files/9425/243227_8e17517644f4c9b0_005.jpg\" style=\"border-width: 0px;\" alt=\"Cannot view this image? Visit: https://images.newsfilecorp.com/files/9425/243227_8e17517644f4c9b0_005.jpg\" /></a></p><p style=\"text-align: center;\"><b>Figure 4: Gold in soil and select rock grab samples</b><sup><b>2</b></sup><b>&#160;taken during a property evaluation by Newmont Corporation in 2013</b><sup><b>3</b></sup><b>.</b></p><p style=\"text-align: center;\">To view an enhanced version of this graphic, please visit:<br /><a rel=\"nofollow\" href=\"https://images.newsfilecorp.com/files/9425/243227_8e17517644f4c9b0_005full.jpg\">https://images.newsfilecorp.com/files/9425/243227_8e17517644f4c9b0_005full.jpg</a></p><p style=\"text-align: center;\"><a rel=\"nofollow\" href=\"https://images.newsfilecorp.com/files/9425/243227_8e17517644f4c9b0_006full.jpg\"><img src=\"https://images.newsfilecorp.com/files/9425/243227_8e17517644f4c9b0_006.jpg\" style=\"border-width: 0px;\" alt=\"Cannot view this image? Visit: https://images.newsfilecorp.com/files/9425/243227_8e17517644f4c9b0_006.jpg\" /></a></p><p style=\"text-align: center;\"><b>Figure 5: Molybdenum in soil and select rock grab samples</b><sup><b>2</b></sup><b>&#160;taken during a property evaluation by Newmont Corporation in 2013</b><sup><b>3</b></sup><b>.</b></p><p style=\"text-align: center;\">To view an enhanced version of this graphic, please visit:<br /><a rel=\"nofollow\" href=\"https://images.newsfilecorp.com/files/9425/243227_8e17517644f4c9b0_006full.jpg\">https://images.newsfilecorp.com/files/9425/243227_8e17517644f4c9b0_006full.jpg</a></p><p><b>About the Idaho Department of Lands</b></p><p>The Idaho Department of Lands manages over 3.4 million acres of state endowment trust land, with a mandate to maximize revenue for the benefit of public schools and other institutions. Mineral leasing is a key component of this mission, contributing to Idaho's economic development and educational funding. </p><p><b>Commitment to Responsible Development</b></p><p>The Company is committed to adhering to all regulatory requirements and implementing best practices to ensure environmental stewardship and community engagement throughout the project.</p><p><b>Terms of the Lease</b></p><p>The lease has a primary term of 20 years, commencing on March 1, 2025, and expiring on February 28, 2045, with the potential to extend the lease beyond its initial term, subject to Idaho law and a negotiated extension agreement with the Lessor. </p><p>Under the terms of the lease, the Lessee will pay an annual rental fee of US$24,927, which will increase by 3% each year over the 20-year lease term. The Lessee will remit a 5% Net Smelter Return (NSR) royalty on any minerals produced from the leased area. To incentivize production, minimum annual royalty amounts are due each year, regardless of if the lease has reached production, starting at US$20,000 per year for the first five years of the agreement, increasing to US$30,000 in years 6-10, US$70,000 in years 11-15, and US$100,000 in years 16-20. If production occurs, the production royalty payments can be credited against the minimum annual royalty for that year. </p><p>These financial commitments underscore the Company's long-term investment in the project and its contribution to Idaho's critical minerals development.</p><p><b>Qualified Person </b></p><p>The scientific and technical information in this news release has been reviewed and approved for disclosure by Iain Campbell, P.Geo. Iain Campbell is an independent \"Qualified Person\" for Hercules Metals within the meaning of National Instrument 43-101 - <i>Standards of Disclosure for Mineral Projects</i>. </p><p><b>About Hercules Metals Corp.</b></p><p>Hercules Metals Corp. (TSXV: BIG) (OTCQB: BADEF) (FSE: C0X) is an exploration Company focused on developing Idaho's newest copper and silver district. </p><p>The 100% owned Hercules Project located northwest of Cambridge, hosts the newly discovered Leviathan porphyry copper system, one of the most important discoveries in the region to date. The Company is well positioned for growth through continued drilling, supported by extensive historical and current exploration and a strategic investment by Barrick Gold. </p><p>With the potential for significant scale, the Company's management and board of directors aims to build on its proven track record which includes the discovery and development of numerous precious metals projects worldwide. </p><div id=\"contactInfo\"><p><b>For further information please contact:</b></p><p>Nisha Hasan<br />Investor Relations<br />Telephone +1 (604) 425-1408<br />Email: <a href=\"mailto:nisha@herculesmetals.com\">nisha@herculesmetals.com</a><br /><br />Chris Paul<br />CEO &#38; Director<br />Telephone +1 (604) 670-5527<br />Email: <a href=\"mailto:chris@herculesmetals.com\">chris@herculesmetals.com</a></p></div><p>This news release does not constitute an offer to sell or a solicitation of an offer to buy any of the securities in the United States. Any securities referred to herein have not and will not be registered under the United States Securities Act of 1933, as amended (the \"<b>U.S. Securities Act</b>\") or any state securities laws and may not be offered or sold within the United States or to U.S. Persons unless registered under the U.S. Securities Act and applicable state securities laws of an exemption from such registration is available.</p><p><b>Disclaimer for Forward-Looking Information</b></p><p>This news release contains certain information that may be deemed \"forward-looking information\" with respect to the Company within the meaning of applicable securities laws. Such forward-looking information involves known and unknown risks, uncertainties and other factors that may cause the Company's actual results, performance or achievements, or developments in the industry to differ materially from the anticipated results, performance or achievements expressed or implied by such forward-looking information. Forward-looking information includes statements that are not historical facts and are generally, but not always, identified by the words \"expects,\" \"plans,\" \"anticipates,\" \"believes,\" \"intends,\" \"estimates,\" \"projects,\" \"potential\" and similar expressions, or that events or conditions \"will,\" \"would,\" \"may,\" \"could\" or \"should\" occur. Forward-looking information contained in this press release may include, without limitation, the expected execution of future exploration programs on the Property; assay results of future drill holes; results of operations, and the expected financial performance of the Company.</p><p>Although the Company believes the forward-looking information contained in this news release is reasonable based on information available on the date hereof, by its nature, forward-looking information involves assumptions and known and unknown risks, uncertainties and other factors which may cause our actual results, level of activity, performance or achievements, or other future events, to be materially different from any future results, performance or achievements expressed or implied by such forward-looking information.</p><p>Examples of such assumptions, risks and uncertainties include, without limitation, assumptions, risks and uncertainties associated with general economic conditions; the Covid-19 pandemic; adverse industry events; the receipt of required regulatory approvals and the timing of such approvals; that the Company maintains good relationships with the communities in which it operates or proposes to operate, future legislative and regulatory developments in the mining sector; the Company's ability to access sufficient capital from internal and external sources, and/or inability to access sufficient capital on favorable terms; mining industry and markets in Canada and generally; the ability of the Company to implement its business strategies; competition; the risk that any of the assumptions prove not to be valid or reliable, which could result in delays, or cessation in planned work, risks associated with the interpretation of data, the geology, grade and continuity of mineral deposits, the possibility that results will not be consistent with the Company's expectations, as well as other assumptions risks and uncertainties applicable to mineral exploration and development activities and to the Company, including as set forth in the Company's public disclosure documents filed on the SEDAR+ website at <a href=\"https://api.newsfilecorp.com/redirect/q8JGrsnrNa\">www.sedarplus.ca</a>.</p><p><b>THE FORWARD-LOOKING INFORMATION CONTAINED IN THIS PRESS RELEASE REPRESENTS THE EXPECTATIONS OF HERCULES METALS AS OF THE DATE OF THIS PRESS RELEASE AND, ACCORDINGLY, IS SUBJECT TO CHANGE AFTER SUCH DATE. READERS SHOULD NOT PLACE UNDUE IMPORTANCE ON FORWARD-LOOKING INFORMATION AND SHOULD NOT RELY UPON THIS INFORMATION AS OF ANY OTHER DATE. WHILE HERCULES METALS MAY ELECT TO, IT DOES NOT UNDERTAKE TO UPDATE THIS INFORMATION AT ANY PARTICULAR TIME EXCEPT AS REQUIRED IN ACCORDANCE WITH APPLICABLE LAWS.</b></p><p><i>Neither the TSX Venture Exchange nor its Regulation Services Provider (as that term is defined in the policies of the TSX Venture Exchange) accepts responsibility for the adequacy or accuracy of this press release.</i></p><hr style=\"width: 33%; margin-left: 0px; border-top: 1px solid #000000;\" /><p><font style=\"font-size: 11px;\"><sup>1</sup>&#160;<a href=\"https://api.newsfilecorp.com/redirect/nV4jNsANxY\">https://gov.idaho.gov/pressrelease/gov-little-signs-speed-act-to-further-streamline-state-permitting/</a><br /><sup>2</sup>&#160;The reader is cautioned that rock grab samples are selective by nature and may not represent the true grade or style of mineralization across the Property.<br /><sup>3</sup>&#160;Reid, D., 2014. Mineral Mining District, Idaho. Presentation, March 2014.</font></p><p id=\"corporateNewsLogoContainer\"><img src=\"https://images.newsfilecorp.com/files/9425/243227_8e17517644f4c9b0_logo.jpg\" id=\"corporateNewsLogo\" alt=\"Corporate Logo\" /></p><p id=\"corporateLinkBack\">To view the source version of this press release, please visit <a href=\"https://api.newsfilecorp.com/redirect/YYpkOFkZKb\">https://www.newsfilecorp.com/release/243227</a></p>",
    "search_terms": "Hercules,Hercules Metals Corp.,BIG",
    "master_gid": 2553,
    "date": "2025-03-04T12:00:00.000Z",
    "tags": "USA|Idaho|||Project Acquisition",
    "image_id": null,
    "hidden": false,
    "company_id": 407,
    "provider": "newsfilecorp",
    "excerpt": "Toronto, Ontario--(Newsfile Corp. - March 4, 2025) -Hercules Metals Corp. (TSXV: BIG) (OTCQB: BADEF) (FSE: C0X)&#160;(\"Hercules\" or the \"Company\")&#160;is pleased to announce that its U.S. subsidiary, Anglo-Bomarc, U.S., Inc. (the \"Lessee\")has entered into a twenty year mineral lease agreement with the Idaho Department of Lands (\"IDL\" or the \"Lessor\") to",
    "is_regulatory": false,
    "refined_tags": [],
    "ftp_filename": null,
    "company_name": "Hercules Metals Corp.",
    "exchange": "TSXV",
    "root_ticker": "BIG",
    "project_name": "Hercules",
    "gid": 2553,
    "location": "Idaho, United States",
    "plan_id": null,
    "description_text": "Toronto, Ontario--(Newsfile Corp. - March 4, 2025) - Hercules Metals Corp. (TSXV: BIG) (OTCQB: BADEF) (FSE: C0X) (\"Hercules\" or the \"Company\") is pleased to announce that its U.S. subsidiary, Anglo-Bomarc, U.S., Inc. (the \" Lessee\") has entered into a twenty year mineral lease agreement with the Idaho Department of Lands (\" IDL \" or the \" Lessor \") to explore, develop and mine metallic minerals on approximately 7,669 acres of state-owned land adjacent to its Hercules Property in western Idaho (\" Hercules \" or the \" Property \") and 640 acres adjacent to its nearby Mineral property (collectively the \" Lease Area \"). This new addition increases the Company's land position in the district by over 46%, to a total of 24,276 acres at the Leviathan porphyry discovery and 2,243 acres at the Mineral property (Figures 1-5). Chris Paul, CEO and Director of the Company, noted: \"This lease is consistent with our strategy of consolidating scale in the Hercules Porphyry Belt. As we advance the Leviathan discovery, our expanded land position provides us the ability to continue to explore, develop and mine, which aligns with Idaho's new Strategic Permitting, Efficiency, and Economic Development (SPEED) Act 1 , aimed at fast-tracking permitting and unlocking value in the states largely untapped mineral endowment.\" The last cycle of exploration in the Hercules district lasted from 1965 through to 1984, consisting of shallow drilling below historical silver mines on the Hercules and Mineral properties. However, historical exploration never tested below areas with post-mineral cover due to the technological limitations of the time. As a result, the Lease Area, which is entirely covered with post-mineral basalt, went completely unexplored. The Company's 2023 discovery of the Leviathan porphyry has revealed significant potential throughout the surrounding area. Follow-up drilling and surface mapping have since highlighted porphyry emplacement along a NW-SE trend which specifically increases the potential of the Lease Area. To test this, and fully appreciate the scope of the now consolidated target, the Company plans on activating powerful new geophysical technologies, aimed at unlocking the potential of these previously unexplored high-priority targets. In addition to the copper porphyry discovered below the silver system in 2023, a recent wildcat hole drilled in the new Southern Flats Zone, HER-24-16, discovered an extension of the silver system immediately below post-mineral basalt. Since the epithermal silver system overlaps with and enriches the upper part of the porphyry, strong potential is indicated for the continuation of both systems below thin cover in the Southern Flats Zone. The post-mineral basalt was revealed to be just 40 meters thick in HER-24-16. Figure 1: New state mineral leases adjacent to Hercules property, showing porphyry targets and post-mineral cover. To view an enhanced version of this graphic, please visit: https://images.newsfilecorp.com/files/9425/243227_8e17517644f4c9b0_002full.jpg Mineral Property A section (640 acres) of state land adjacent to the southern boundary of the Company's Mineral property is included in the lease agreement (Figures 2-5). For additional information on the Mineral property, see news release dated October 2, 2023 . Figure 2: New state mineral lease adjacent to the Company's Mineral property, overlain with an airborne potassium (K) radiometrics survey. Warm colours indicate potassium enrichment, which at the Hercules property, is associated with the epithermal alteration and correlates strongly with silver. The linear highs may indicate important structural controls. To view an enhanced version of this graphic, please visit: https://images.newsfilecorp.com/files/9425/243227_8e17517644f4c9b0_003full.jpg Figure 3: Copper in soil and select rock grab samples 2 taken during a property evaluation by Newmont Corporation in 2013 3 . To view an enhanced version of this graphic, please visit: https://images.newsfilecorp.com/files/9425/243227_8e17517644f4c9b0_004full.jpg Figure 4: Gold in soil and select rock grab samples 2 taken during a property evaluation by Newmont Corporation in 2013 3 . To view an enhanced version of this graphic, please visit: https://images.newsfilecorp.com/files/9425/243227_8e17517644f4c9b0_005full.jpg Figure 5: Molybdenum in soil and select rock grab samples 2 taken during a property evaluation by Newmont Corporation in 2013 3 . To view an enhanced version of this graphic, please visit: https://images.newsfilecorp.com/files/9425/243227_8e17517644f4c9b0_006full.jpg About the Idaho Department of Lands The Idaho Department of Lands manages over 3.4 million acres of state endowment trust land, with a mandate to maximize revenue for the benefit of public schools and other institutions. Mineral leasing is a key component of this mission, contributing to Idaho's economic development and educational funding. Commitment to Responsible Development The Company is committed to adhering to all regulatory requirements and implementing best practices to ensure environmental stewardship and community engagement throughout the project. Terms of the Lease The lease has a primary term of 20 years, commencing on March 1, 2025, and expiring on February 28, 2045, with the potential to extend the lease beyond its initial term, subject to Idaho law and a negotiated extension agreement with the Lessor. Under the terms of the lease, the Lessee will pay an annual rental fee of US$24,927, which will increase by 3% each year over the 20-year lease term. The Lessee will remit a 5% Net Smelter Return (NSR) royalty on any minerals produced from the leased area. To incentivize production, minimum annual royalty amounts are due each year, regardless of if the lease has reached production, starting at US$20,000 per year for the first five years of the agreement, increasing to US$30,000 in years 6-10, US$70,000 in years 11-15, and US$100,000 in years 16-20. If production occurs, the production royalty payments can be credited against the minimum annual royalty for that year. These financial commitments underscore the Company's long-term investment in the project and its contribution to Idaho's critical minerals development. Qualified Person The scientific and technical information in this news release has been reviewed and approved for disclosure by Iain Campbell, P.Geo. Iain Campbell is an independent \"Qualified Person\" for Hercules Metals within the meaning of National Instrument 43-101 - Standards of Disclosure for Mineral Projects . About Hercules Metals Corp. Hercules Metals Corp. (TSXV: BIG) (OTCQB: BADEF) (FSE: C0X) is an exploration Company focused on developing Idaho's newest copper and silver district. The 100% owned Hercules Project located northwest of Cambridge, hosts the newly discovered Leviathan porphyry copper system, one of the most important discoveries in the region to date. The Company is well positioned for growth through continued drilling, supported by extensive historical and current exploration and a strategic investment by Barrick Gold. With the potential for significant scale, the Company's management and board of directors aims to build on its proven track record which includes the discovery and development of numerous precious metals projects worldwide. For further information please contact: Nisha Hasan Investor Relations Telephone +1 (604) 425-1408 Email: nisha@herculesmetals.com Chris Paul CEO & Director Telephone +1 (604) 670-5527 Email: chris@herculesmetals.com This news release does not constitute an offer to sell or a solicitation of an offer to buy any of the securities in the United States. Any securities referred to herein have not and will not be registered under the United States Securities Act of 1933, as amended (the \" U.S. Securities Act \") or any state securities laws and may not be offered or sold within the United States or to U.S. Persons unless registered under the U.S. Securities Act and applicable state securities laws of an exemption from such registration is available. Disclaimer for Forward-Looking Information This news release contains certain information that may be deemed \"forward-looking information\" with respect to the Company within the meaning of applicable securities laws. Such forward-looking information involves known and unknown risks, uncertainties and other factors that may cause the Company's actual results, performance or achievements, or developments in the industry to differ materially from the anticipated results, performance or achievements expressed or implied by such forward-looking information. Forward-looking information includes statements that are not historical facts and are generally, but not always, identified by the words \"expects,\" \"plans,\" \"anticipates,\" \"believes,\" \"intends,\" \"estimates,\" \"projects,\" \"potential\" and similar expressions, or that events or conditions \"will,\" \"would,\" \"may,\" \"could\" or \"should\" occur. Forward-looking information contained in this press release may include, without limitation, the expected execution of future exploration programs on the Property; assay results of future drill holes; results of operations, and the expected financial performance of the Company. Although the Company believes the forward-looking information contained in this news release is reasonable based on information available on the date hereof, by its nature, forward-looking information involves assumptions and known and unknown risks, uncertainties and other factors which may cause our actual results, level of activity, performance or achievements, or other future events, to be materially different from any future results, performance or achievements expressed or implied by such forward-looking information. Examples of such assumptions, risks and uncertainties include, without limitation, assumptions, risks and uncertainties associated with general economic conditions; the Covid-19 pandemic; adverse industry events; the receipt of required regulatory approvals and the timing of such approvals; that the Company maintains good relationships with the communities in which it operates or proposes to operate, future legislative and regulatory developments in the mining sector; the Company's ability to access sufficient capital from internal and external sources, and/or inability to access sufficient capital on favorable terms; mining industry and markets in Canada and generally; the ability of the Company to implement its business strategies; competition; the risk that any of the assumptions prove not to be valid or reliable, which could result in delays, or cessation in planned work, risks associated with the interpretation of data, the geology, grade and continuity of mineral deposits, the possibility that results will not be consistent with the Company's expectations, as well as other assumptions risks and uncertainties applicable to mineral exploration and development activities and to the Company, including as set forth in the Company's public disclosure documents filed on the SEDAR+ website at www.sedarplus.ca . THE FORWARD-LOOKING INFORMATION CONTAINED IN THIS PRESS RELEASE REPRESENTS THE EXPECTATIONS OF HERCULES METALS AS OF THE DATE OF THIS PRESS RELEASE AND, ACCORDINGLY, IS SUBJECT TO CHANGE AFTER SUCH DATE. READERS SHOULD NOT PLACE UNDUE IMPORTANCE ON FORWARD-LOOKING INFORMATION AND SHOULD NOT RELY UPON THIS INFORMATION AS OF ANY OTHER DATE. WHILE HERCULES METALS MAY ELECT TO, IT DOES NOT UNDERTAKE TO UPDATE THIS INFORMATION AT ANY PARTICULAR TIME EXCEPT AS REQUIRED IN ACCORDANCE WITH APPLICABLE LAWS. Neither the TSX Venture Exchange nor its Regulation Services Provider (as that term is defined in the policies of the TSX Venture Exchange) accepts responsibility for the adequacy or accuracy of this press release. 1 https://gov.idaho.gov/pressrelease/gov-little-signs-speed-act-to-further-streamline-state-permitting/ 2 The reader is cautioned that rock grab samples are selective by nature and may not represent the true grade or style of mineralization across the Property. 3 Reid, D., 2014. Mineral Mining District, Idaho. Presentation, March 2014. To view the source version of this press release, please visit https://www.newsfilecorp.com/release/243227",
    "primary_commodity": "Cu"
  },
  "articleProject": {
    "gid": 2553,
    "project_name": "Hercules",
    "location": "Idaho, United States"
  },
  "articleExchange": "TSXV",
  "articleCompanyId": 407,
  "articleTicker": "BIG",
  "articleCompanyName": "Hercules Metals Corp.",
  "allOtherCompanyProjects": [
    {
      "company_id": 407,
      "gid": 677,
      "project_name": "Hot Springs",
      "location": "Nevada, USA"
    },
    {
      "company_id": 407,
      "gid": 2553,
      "project_name": "Hercules",
      "location": "Idaho, United States"
    }
  ],
  "allOtherCompanyNews": [
    {
      "id": 107664,
      "company_id": 407,
      "title": "Hercules Metals Announces Engagement of GDT Strategic Communications to Provide Investor Relations",
      "link": null,
      "date": "2025-06-11T11:45:00.000Z",
      "hidden": false
    },
    {
      "id": 105347,
      "company_id": 407,
      "title": "Hercules Metals Commences 2025 Drilling Program at the Hercules Project",
      "link": null,
      "date": "2025-05-21T11:00:00.000Z",
      "hidden": false
    },
    {
      "id": 103450,
      "company_id": 407,
      "title": "Independent Study Finds Evidence of Hypogene Enrichment at Hercules, Outlining Greater Scale and Grade Potential",
      "link": null,
      "date": "2025-05-05T11:00:00.000Z",
      "hidden": false
    },
    {
      "id": 100575,
      "company_id": 407,
      "title": "Hercules Metals Appoints Dillon Hume as Vice President, Exploration",
      "link": null,
      "date": "2025-04-23T11:00:00.000Z",
      "hidden": false
    },
    {
      "id": 100149,
      "company_id": 407,
      "title": "Hercules Targets Growth at Leviathan with Breakthrough 3D Model and 12,000-Metre Drill Campaign",
      "link": null,
      "date": "2025-04-17T11:00:00.000Z",
      "hidden": false
    },
    {
      "id": 89956,
      "company_id": 407,
      "title": "Hercules Metals Secures Mineral Lease Agreement with the State of Idaho",
      "link": "https://www.newsfilecorp.com/release/243227/Hercules-Metals-Secures-Mineral-Lease-Agreement-with-the-State-of-Idaho",
      "date": "2025-03-04T12:00:00.000Z",
      "hidden": false
    },
    {
      "id": 88580,
      "company_id": 407,
      "title": "Hercules Intersects 171m of 0.64% CuEq within 354m of 0.47% CuEq and Reveals Upcoming Drill Targets",
      "link": "https://www.newsfilecorp.com/release/241594/Hercules-Intersects-171m-of-0.64-CuEq-within-354m-of-0.47-CuEq-and-Reveals-Upcoming-Drill-Targets",
      "date": "2025-02-20T12:00:00.000Z",
      "hidden": false
    },
    {
      "id": 84105,
      "company_id": 407,
      "title": "Hercules Intersects 300m of 0.70% CuEq, including 138m of 1.01% CuEq, Starting 70m from Surface",
      "link": "https://www.newsfilecorp.com/release/237268/Hercules-Intersects-300m-of-0.70-CuEq-including-138m-of-1.01-CuEq-Starting-70m-from-Surface",
      "date": "2025-01-15T12:00:00.000Z",
      "hidden": false
    },
    {
      "id": 80731,
      "company_id": 407,
      "title": "Hercules Metals Achieves Strong Phase I Metallurgical Results with Recoveries of 90% Copper and Over 80% Silver",
      "link": "https://www.newsfilecorp.com/release/232239/Hercules-Metals-Achieves-Strong-Phase-I-Metallurgical-Results-with-Recoveries-of-90-Copper-and-Over-80-Silver",
      "date": "2024-12-03T12:00:00.000Z",
      "hidden": false
    },
    {
      "id": 79224,
      "company_id": 407,
      "title": "Hercules Intersects 338 Meters of 0.47% Cu with Mineralization Increasing at Depth and to the North",
      "link": "https://www.newsfilecorp.com/release/230546/Hercules-Intersects-338-Meters-of-0.47-Cu-with-Mineralization-Increasing-at-Depth-and-to-the-North",
      "date": "2024-11-19T12:00:00.000Z",
      "hidden": false
    }
  ]
}
