{
  "article": {
    "id": 82685,
    "link": "https://www.thenewswire.com/press-releases?id=1AXXFWJJe",
    "title": "Panther Minerals Clarifies Option Agreement for Huber Heights Property",
    "description": "<table style='width:fit-content; border: none;'><tr style='background: none;'><td colspan='10' style='padding: 0; margin: 0; border: none; background: none;' valign='bottom'><a target='_blank' href='https://www.lithuimlionmetals.com/'><img src=\"https://www.thenewswire.com/data/tnw/clients/logos/1A0vFDRlQ.png?t=1713554561\" alt=\"Panther Minerals Inc.\" /></a></td></tr><tr style='background: none;'><td style='padding: 0; margin: 0; border: none; background: none;'></td></tr></table>\n\n\n<p style='text-align:center; '>\n<a href='' target='_blank'></a>\n</p>\n\n\n\n \n\n<p style='text-align:justify; '>\n<span style='font-weight:bold; '>Vancouver, British Columbia - TheNewswire – December 20, 2024 - Panther Minerals Inc.</span><span style=''> (“</span><span style='font-weight:bold; '>Panther</span> <span style='font-weight:bold; '>Minerals</span><span style=''>” or the “</span><span style='font-weight:bold; '>Company</span><span style=''>”) (CSE:PURR) (OTC:GLIOF) (FWB:2BC) a North American mineral acquisition and exploration company, </span><span style=''>wishes to provide additional details regarding the Option Agreement (the “</span><span style='font-weight:bold; '>Agreement</span><span style=''>”) previously announced on December 19, 2024.</span>\n</p>\n\n\n\n<p style='text-align:justify; '>\n<span style=''>Panther Minerals entered into the Agreement with an arm’s length purchaser (the “</span><span style='font-weight:bold; '>Purchaser</span><span style=''>”) for the Huber Heights Property located in Nevada, USA. This agreement grants the Purchaser the exclusive right to acquire up to a 100% undivided interest in the property, subject to a 2% net smelter royalty (NSR).</span>\n</p>\n\n\n\n<p style='text-align:left; '>\n<span style='font-weight:bold; '>Key Terms of the Agreement:</span>\n</p>\n\n\r\n<ul>\r\n<li>\n<p style=''>\n<span style=''>The Purchaser has been granted an exclusive option to acquire a 100% interest in the Huber Heights Property over a two-year period.</span> \n</p>\n</li>\r\n</ul>\r\n \r\n<ul>\r\n<li>\n<p style=''>\n<span style=''>The Purchaser will make a cash payment of $150,000 CAD within 45 days of the Agreement’s execution.</span> \n</p>\n</li>\r\n</ul>\r\n \r\n<ul>\r\n<li>\n<p style=''>\n<span style=''>Panther Minerals retains a 2% NSR on production from the property, with the Purchaser holding an option to buy out the NSR for $1,000,000 CAD.</span> \n</p>\n</li>\r\n</ul>\r\n \r\n<ul>\r\n<li>\n<p style=''>\n<span style=''>During the option term, the Purchaser will maintain the property free of encumbrances and comply with all applicable laws and regulations during exploration and development activities.</span> \n</p>\n</li>\r\n</ul>\r\n\n\n<p style='text-align:justify; '>\n<span style='font-weight:bold; '>ON BEHALF OF THE BOARD OF DIRECTORS</span>\n</p>\n\n\n\n<p style='text-align:justify; '>\n<span style=''>Mr. Robert Birmingham, Chief Executive Officer</span>\n</p>\n\n\n\n<p style='text-align:justify; '>\n<span style=''>For more information please visit: </span><a href='http://www.pantherminerals.ca' target='_blank'><span style=''><span style=''>www.pantherminerals.ca</span></span></a><span style=''> or email </span><a href='mailto:info@pantherminerals.ca' target='_blank'><span style=''><span style=''>info@pantherminerals.ca</span></span></a><span style=''>. </span>\n</p>\n\n\n\n<p style='text-align:justify; '>\n<span style='font-style:italic; '>The CSE and Information Service Provider have not reviewed and does not accept responsibility for the accuracy or adequacy of this release.</span>\n</p>\n\n\n\n<p style='text-align:justify; '>\n<span style='font-weight:bold; '>Forward-Looking Statements</span>\n</p>\n\n\n\n<p style='text-align:justify; '>\n<span style='font-style:italic; '>This news release contains “forward-looking information” within the meaning of applicable Canadian securities legislation. Often, but not always, forward-looking information and information can be identified by the use of words such as “plans”, “expects” or “does not expect”, “is expected”, “estimates”, “intends”, “anticipates” or “does not anticipate”, or “believes”, or variations of such words and phrases or state that certain actions, events or results “may”, “could”, “would”, “might” or “will” be taken, occur or be achieved. Actual future results may differ materially. In particular, this news release contains forward-looking information relating to the Company and the Property. The forward-looking information reflects management's current expectations based on information currently available and are subject to a number of risks and uncertainties that may cause outcomes to differ materially from those discussed in the forward-looking information. Such risk factors may include, among others, but are not limited to: general economic conditions in Canada and globally; industry conditions, including governmental regulation and </span><span style='font-style:italic; '>environmental regulation; the availability of capital on acceptable terms; the need to obtain required approvals from regulatory authorities; stock market volatility; competition for, among other things, skilled personnel and supplies; incorrect assessments of the value of acquisitions; geological, technical, processing and transportation problems; changes in tax laws and incentive programs; failure to realize the anticipated benefits of acquisitions and dispositions; and the other factors. Although the Company believes that the assumptions and factors used in preparing the forward-looking information are reasonable, undue reliance should not be placed on such information and no assurance can be given that such events will occur in the disclosed time frames or at all. Factors that could cause actual results or events to differ materially from current expectations include: (i) adverse market conditions; and (ii) other factors beyond the control of the Company. New risk factors emerge from time to time, and it is impossible for the Company’s management to predict all risk factors, nor can the Company assess the impact of all factors on Company’s business or the extent to which any factor, or combination of factors, may cause actual results to differ from those contained in any forward-looking information. The forward-looking information included in this news release are made as of the date of this news release and the Company expressly disclaims any intention or obligation to update or revise any forward-looking information whether as a result of new information, future events or otherwise, except as required by applicable law. Additional information identifying risks and uncertainties that could affect financial results is contained in the Company’s filings with Canadian securities regulators, which are available on the Company’s profile at </span><a href='http://www.sedarplus.ca' target='_blank'><span style=''><span style='font-style:italic; '>www.sedarplus.ca</span></span></a><span style='font-style:italic; '>.</span>\n</p>\n\n\n\n<p>Copyright (c) 2024 TheNewswire - All rights reserved.</p>\n",
    "search_terms": "Huber Heights,Panther Minerals Inc.,PURR",
    "master_gid": 8969,
    "date": "2024-12-20T21:30:00.000Z",
    "tags": "USA|Nevada|||Project Acquisition",
    "image_id": null,
    "hidden": false,
    "company_id": 13,
    "provider": "thenewswire",
    "excerpt": "Vancouver, British Columbia - TheNewswire – December 20, 2024 - Panther Minerals Inc.(“PantherMinerals” or the “Company”) (CSE:PURR) (OTC:GLIOF) (FWB:2BC) a North American mineral acquisition and exploration company,wishes to provide additional details regarding the Option Agreement (the “Agreement”) previously announced on December 19, 2024.Panther Minerals entered into the Agreement with an",
    "is_regulatory": false,
    "refined_tags": [],
    "ftp_filename": null,
    "company_name": "Panther Minerals Inc.",
    "exchange": "CSE",
    "root_ticker": "PURR",
    "project_name": "Huber Heights",
    "gid": 8969,
    "location": null,
    "plan_id": null,
    "description_text": "Vancouver, British Columbia - TheNewswire – December 20, 2024 - Panther Minerals Inc. (“ Panther Minerals ” or the “ Company ”) (CSE:PURR) (OTC:GLIOF) (FWB:2BC) a North American mineral acquisition and exploration company, wishes to provide additional details regarding the Option Agreement (the “ Agreement ”) previously announced on December 19, 2024. Panther Minerals entered into the Agreement with an arm’s length purchaser (the “ Purchaser ”) for the Huber Heights Property located in Nevada, USA. This agreement grants the Purchaser the exclusive right to acquire up to a 100% undivided interest in the property, subject to a 2% net smelter royalty (NSR). Key Terms of the Agreement: The Purchaser has been granted an exclusive option to acquire a 100% interest in the Huber Heights Property over a two-year period. The Purchaser will make a cash payment of $150,000 CAD within 45 days of the Agreement’s execution. Panther Minerals retains a 2% NSR on production from the property, with the Purchaser holding an option to buy out the NSR for $1,000,000 CAD. During the option term, the Purchaser will maintain the property free of encumbrances and comply with all applicable laws and regulations during exploration and development activities. ON BEHALF OF THE BOARD OF DIRECTORS Mr. Robert Birmingham, Chief Executive Officer For more information please visit: www.pantherminerals.ca or email info@pantherminerals.ca . The CSE and Information Service Provider have not reviewed and does not accept responsibility for the accuracy or adequacy of this release. Forward-Looking Statements This news release contains “forward-looking information” within the meaning of applicable Canadian securities legislation. Often, but not always, forward-looking information and information can be identified by the use of words such as “plans”, “expects” or “does not expect”, “is expected”, “estimates”, “intends”, “anticipates” or “does not anticipate”, or “believes”, or variations of such words and phrases or state that certain actions, events or results “may”, “could”, “would”, “might” or “will” be taken, occur or be achieved. Actual future results may differ materially. In particular, this news release contains forward-looking information relating to the Company and the Property. The forward-looking information reflects management's current expectations based on information currently available and are subject to a number of risks and uncertainties that may cause outcomes to differ materially from those discussed in the forward-looking information. Such risk factors may include, among others, but are not limited to: general economic conditions in Canada and globally; industry conditions, including governmental regulation and environmental regulation; the availability of capital on acceptable terms; the need to obtain required approvals from regulatory authorities; stock market volatility; competition for, among other things, skilled personnel and supplies; incorrect assessments of the value of acquisitions; geological, technical, processing and transportation problems; changes in tax laws and incentive programs; failure to realize the anticipated benefits of acquisitions and dispositions; and the other factors. Although the Company believes that the assumptions and factors used in preparing the forward-looking information are reasonable, undue reliance should not be placed on such information and no assurance can be given that such events will occur in the disclosed time frames or at all. Factors that could cause actual results or events to differ materially from current expectations include: (i) adverse market conditions; and (ii) other factors beyond the control of the Company. New risk factors emerge from time to time, and it is impossible for the Company’s management to predict all risk factors, nor can the Company assess the impact of all factors on Company’s business or the extent to which any factor, or combination of factors, may cause actual results to differ from those contained in any forward-looking information. The forward-looking information included in this news release are made as of the date of this news release and the Company expressly disclaims any intention or obligation to update or revise any forward-looking information whether as a result of new information, future events or otherwise, except as required by applicable law. Additional information identifying risks and uncertainties that could affect financial results is contained in the Company’s filings with Canadian securities regulators, which are available on the Company’s profile at www.sedarplus.ca . Copyright (c) 2024 TheNewswire - All rights reserved.",
    "primary_commodity": "U"
  },
  "articleProject": {
    "gid": 8969,
    "project_name": "Huber Heights",
    "location": null
  },
  "articleExchange": "CSE",
  "articleCompanyId": 13,
  "articleTicker": "PURR",
  "articleCompanyName": "Panther Minerals Inc.",
  "allOtherCompanyProjects": [
    {
      "company_id": 13,
      "gid": 4069,
      "project_name": "MIA Li-3",
      "location": "Quebec, Canada"
    },
    {
      "company_id": 13,
      "gid": 9392,
      "project_name": "East Brouillan",
      "location": "Quebec, Canada"
    },
    {
      "company_id": 13,
      "gid": 8969,
      "project_name": "Huber Heights",
      "location": null
    },
    {
      "company_id": 13,
      "gid": 7960,
      "project_name": "Boulder Creek",
      "location": null
    }
  ],
  "allOtherCompanyNews": [
    {
      "id": -203826,
      "company_id": 13,
      "title": "Panther Minerals Closes Debt Settlement",
      "link": "https://www.thenewswire.com/press-releases?id=1k6WF4eDX",
      "date": "2025-06-07T00:30:00.000Z",
      "hidden": false
    },
    {
      "id": 106462,
      "company_id": 13,
      "title": "Panther Minerals Announces CEO Transition and Debt Settlement",
      "link": "https://www.thenewswire.com/press-releases?id=1L5PFGxJ0",
      "date": "2025-05-31T03:00:00.000Z",
      "hidden": false
    },
    {
      "id": 99514,
      "company_id": 13,
      "title": "Panther Minerals Announces Amendment To Boulder Creek  Option Agreement",
      "link": "https://www.thenewswire.com/press-releases?id=1A0vFxYKR",
      "date": "2025-04-11T22:30:00.000Z",
      "hidden": false
    },
    {
      "id": 99153,
      "company_id": 13,
      "title": "Panther Minerals Announces Director Appointment",
      "link": "https://www.thenewswire.com/press-releases?id=1k98FXp2X",
      "date": "2025-04-09T01:35:00.000Z",
      "hidden": false
    },
    {
      "id": 89725,
      "company_id": 13,
      "title": "Panther Minerals Announces Director Resignation",
      "link": "https://www.thenewswire.com/press-releases?id=1LYzF27Er",
      "date": "2025-02-28T23:30:00.000Z",
      "hidden": false
    },
    {
      "id": 85702,
      "company_id": 13,
      "title": "Panther Minerals Applauds Executive Order Concerning Alaskan Resource Development",
      "link": "https://www.thenewswire.com/press-releases?id=1ArbF3ZM9",
      "date": "2025-01-29T13:30:00.000Z",
      "hidden": false
    },
    {
      "id": 83143,
      "company_id": 13,
      "title": "Panther Minerals Closes  Quebec Flow-Through Private Placement ",
      "link": "https://www.thenewswire.com/press-releases?id=1kx7FaWme",
      "date": "2024-12-31T23:30:00.000Z",
      "hidden": false
    },
    {
      "id": 82912,
      "company_id": 13,
      "title": "Panther Minerals Announces Quebec Flow-Through Private Placement",
      "link": "https://www.thenewswire.com/press-releases?id=1AdyFDzPX",
      "date": "2024-12-24T01:05:00.000Z",
      "hidden": false
    },
    {
      "id": 82685,
      "company_id": 13,
      "title": "Panther Minerals Clarifies Option Agreement for Huber Heights Property",
      "link": "https://www.thenewswire.com/press-releases?id=1AXXFWJJe",
      "date": "2024-12-20T21:30:00.000Z",
      "hidden": false
    },
    {
      "id": 82619,
      "company_id": 13,
      "title": "Panther Minerals Expands Claim Portfolio into the Abitibi District of Quebec with the Acquisition of the East Brouillan Property",
      "link": "https://www.thenewswire.com/press-releases?id=1BOxFMmqE",
      "date": "2024-12-20T04:52:00.000Z",
      "hidden": false
    }
  ]
}
