{
  "article": {
    "id": 31712,
    "link": "https://www.accesswire.com/viewarticle.aspx?id=739924&lang=en",
    "title": "Faraday Copper Announces Acquisition of Mercer Ranch at Copper Creek Project in Arizona",
    "description": "<p><strong>VANCOUVER, BC / ACCESSWIRE / February 27, 2023 /</strong> Faraday Copper Corp. (\"Faraday\" or the \"Company\") (TSX:FDY) is pleased to announce the acquisition of a land package (the \"Mercer Ranch\") for US$10 million (the \"Acquisition\"), consisting of approximately 6,000 deeded acres within 32,000 acres of controlled ranch land (Figure 1). The acquisition aligns with the Company's strategy of land consolidation, advancing and de-risking the Copper Creek Project.</p><p>Paul Harbidge, President and CEO, commented \"The Mercer Ranch purchase is an important milestone at this early stage of advancing the Copper Creek Project that provides numerous benefits. The Mercers are supportive stakeholders and neighbours and will continue to operate the ranch for the foreseeable future.\"</p><p><strong><u>Acquisition of Mercer Ranch (Figure 1)</u></strong></p><ul><li>Approximately 6,000 deeded acres (private land) within approximately 32,000 acres of surface rights through active grazing leases</li><li>Acquisition cost: US$10 million<ul><li>US$250,000 non-refundable deposit paid in 2022</li><li>Closing subject to customary conditions and filings</li></ul></li><li>Strategic benefits<ul><li>Location for potential third-party solar power generation facility</li><li>Land offsets for areas impacted by mining activities</li><li>Additional infrastructure locations and flexibility</li><li>Secondary mine access corridor</li><li>Mineral and water rights</li></ul></li></ul><p><a href=\"https://pr.report/HVLqT1ws\"><strong>Figure 1: </strong>Land Overview - Copper Creek and Mercer Ranch</a></p><figure class=\"image image_resized\" style=\"width:695px;display:table;text-align:center;margin:0.9em auto;\"><a href=\"https://pr.report/T6C0gdvs\"><img src=\"https://www.accesswire.com/users/newswire/images/739924/image-1-2-3.png\" alt=\"Faraday Copper Corp., Monday, February 27, 2023, Press release picture\"></a></figure><div style=\"clear: both\"> </div><p><strong><u>About Faraday Copper</u></strong></p><p><a href=\"https://pr.report/297E-jRS\">Faraday Copper</a> is a Canadian exploration company focused on advancing its flagship copper project in Arizona, U.S. The <a href=\"https://pr.report/6ZEzDj3o\">Copper Creek project</a> is one of the largest undeveloped copper projects in North America with open pit and bulk underground mining potential. The Company is well-funded to deliver on its key milestones and benefits from a management team and board of directors with senior mining company experience and expertise. Faraday trades on the TSX under the symbol \"FDY\".</p><p><strong>For additional information please contact:</strong></p><p>Stacey Pavlova, CFA <br>Vice President, Investor Relations &amp; Communications<br>Faraday Copper Corp.<br>E-mail: <a href=\"mailto:info@faradaycopper.com\">info@faradaycopper.com</a> <br>Website: <a href=\"https://pr.report/H3veJYZn\">www.faradaycopper.com</a></p><p><i>To receive news releases by e-mail, please register using the Faraday website at </i><a href=\"https://pr.report/sVMuUc0g\"><i>www.faradaycopper.com</i></a><i>.</i></p><p><i><strong><u>Cautionary Note on Forward Looking Statements</u></strong></i></p><p><i>Some of the statements in this news release, other than statements of historical fact, are \"forward-looking statements\" and are based on the opinions and estimates of management as of the date such statements are made and are necessarily based on estimates and assumptions that are inherently subject to known and unknown risks, uncertainties and other factors that may cause actual results, level of activity, performance or achievements of Faraday to be materially different from those expressed or implied by such forward-looking statements. Such forward-looking statements and forward-looking information specifically include, but are not limited to, statements concerning the potential benefits of the Mercer Ranch acquisition and the expected use for the Mercer Ranch.</i></p><p><i>Although Faraday believes the expectations expressed in such forward-looking statements are based on reasonable assumptions, such statements should not be in any way construed as guarantees of future performance and actual results or developments may differ materially. Accordingly, readers should not place undue reliance on forward-looking statements or information.</i></p><p><i>Factors that could cause actual results to differ materially from those in forward-looking statements include without limitation: market prices for metals; the conclusions of detailed feasibility and technical analyses; lower than expected grades and quantities of resources; receipt of regulatory approval; receipt of shareholder approval; mining rates and recovery rates; significant capital requirements; price volatility in the spot and forward markets for commodities; fluctuations in rates of exchange; taxation; controls, regulations and political or economic developments in the countries in which Faraday does or may carry on business; the speculative nature of mineral exploration and development, competition; loss of key employees; rising costs of labour, supplies, fuel and equipment; actual results of current exploration or reclamation activities; accidents; labour disputes; defective title to mineral claims or property or contests over claims to mineral properties; unexpected delays and costs inherent to consulting and accommodating rights of Indigenous peoples and other groups; risks, uncertainties and unanticipated delays associated with obtaining and maintaining necessary licenses, permits and authorizations and complying with permitting requirements, including those associated with the Copper Creek property; and uncertainties with respect to any future acquisitions by Faraday. In addition, there are risks and hazards associated with the business of mineral exploration, development and mining, including environmental events and hazards, industrial accidents, unusual or unexpected formations, pressures, cave-ins, flooding and the risk of inadequate insurance or inability to obtain insurance to cover these risks as well as \"Risk Factors\" included in Faraday's disclosure documents filed on and available at </i><a href=\"https://pr.report/Pdf2GHYR\"><i>www.sedar.com</i></a><i>.</i></p><p><i>This press release does not constitute an offer to sell or a solicitation of an offer to buy any securities in any jurisdiction to any person to whom it is unlawful to make such an offer or solicitation in such jurisdiction. This press release is not, and under no circumstances is to be construed as, a prospectus, an offering memorandum, an advertisement or a public offering of securities in Faraday in Canada, the United States or any other jurisdiction. No securities commission or similar authority in Canada or in the United States has reviewed or in any way passed upon this press release, and any representation to the contrary is an offence.</i></p><p><strong>SOURCE: </strong>Faraday Copper Corp.</p><br><br>View source version on accesswire.com: <br><a href='https://www.accesswire.com/739924/Faraday-Copper-Announces-Acquisition-of-Mercer-Ranch-at-Copper-Creek-Project-in-Arizona'>https://www.accesswire.com/739924/Faraday-Copper-Announces-Acquisition-of-Mercer-Ranch-at-Copper-Creek-Project-in-Arizona</a><br><br>",
    "search_terms": "Copper Creek,Faraday Copper Corp.,FDY",
    "master_gid": 2844,
    "date": "2023-02-27T11:05:00.000Z",
    "tags": "|||Copper|Project Acquisition",
    "image_id": null,
    "hidden": false,
    "company_id": 1229,
    "provider": "accesswire",
    "excerpt": "VANCOUVER, BC / ACCESSWIRE / February 27, 2023 /Faraday Copper Corp. (\"Faraday\" or the \"Company\") (TSX:FDY) is pleased to announce the acquisition of a land package (the \"Mercer Ranch\") for US$10 million (the \"Acquisition\"), consisting of approximately 6,000 deeded acres within 32,000 acres of controlled ranch land (Figure 1). The",
    "is_regulatory": false,
    "refined_tags": [
      "Project Acquisition"
    ],
    "ftp_filename": null,
    "company_name": "Faraday Copper Corp.",
    "exchange": "TSX",
    "root_ticker": "FDY",
    "project_name": "Copper Creek",
    "gid": 2844,
    "location": "Arizona, United States",
    "plan_id": null,
    "description_text": "VANCOUVER, BC / ACCESSWIRE / February 27, 2023 / Faraday Copper Corp. (\"Faraday\" or the \"Company\") (TSX:FDY) is pleased to announce the acquisition of a land package (the \"Mercer Ranch\") for US$10 million (the \"Acquisition\"), consisting of approximately 6,000 deeded acres within 32,000 acres of controlled ranch land (Figure 1). The acquisition aligns with the Company's strategy of land consolidation, advancing and de-risking the Copper Creek Project. Paul Harbidge, President and CEO, commented \"The Mercer Ranch purchase is an important milestone at this early stage of advancing the Copper Creek Project that provides numerous benefits. The Mercers are supportive stakeholders and neighbours and will continue to operate the ranch for the foreseeable future.\" Acquisition of Mercer Ranch (Figure 1) Approximately 6,000 deeded acres (private land) within approximately 32,000 acres of surface rights through active grazing leases Acquisition cost: US$10 million US$250,000 non-refundable deposit paid in 2022 Closing subject to customary conditions and filings Strategic benefits Location for potential third-party solar power generation facility Land offsets for areas impacted by mining activities Additional infrastructure locations and flexibility Secondary mine access corridor Mineral and water rights Figure 1: Land Overview - Copper Creek and Mercer Ranch About Faraday Copper Faraday Copper is a Canadian exploration company focused on advancing its flagship copper project in Arizona, U.S. The Copper Creek project is one of the largest undeveloped copper projects in North America with open pit and bulk underground mining potential. The Company is well-funded to deliver on its key milestones and benefits from a management team and board of directors with senior mining company experience and expertise. Faraday trades on the TSX under the symbol \"FDY\". For additional information please contact: Stacey Pavlova, CFA Vice President, Investor Relations & Communications Faraday Copper Corp. E-mail: info@faradaycopper.com Website: www.faradaycopper.com To receive news releases by e-mail, please register using the Faraday website at www.faradaycopper.com . Cautionary Note on Forward Looking Statements Some of the statements in this news release, other than statements of historical fact, are \"forward-looking statements\" and are based on the opinions and estimates of management as of the date such statements are made and are necessarily based on estimates and assumptions that are inherently subject to known and unknown risks, uncertainties and other factors that may cause actual results, level of activity, performance or achievements of Faraday to be materially different from those expressed or implied by such forward-looking statements. Such forward-looking statements and forward-looking information specifically include, but are not limited to, statements concerning the potential benefits of the Mercer Ranch acquisition and the expected use for the Mercer Ranch. Although Faraday believes the expectations expressed in such forward-looking statements are based on reasonable assumptions, such statements should not be in any way construed as guarantees of future performance and actual results or developments may differ materially. Accordingly, readers should not place undue reliance on forward-looking statements or information. Factors that could cause actual results to differ materially from those in forward-looking statements include without limitation: market prices for metals; the conclusions of detailed feasibility and technical analyses; lower than expected grades and quantities of resources; receipt of regulatory approval; receipt of shareholder approval; mining rates and recovery rates; significant capital requirements; price volatility in the spot and forward markets for commodities; fluctuations in rates of exchange; taxation; controls, regulations and political or economic developments in the countries in which Faraday does or may carry on business; the speculative nature of mineral exploration and development, competition; loss of key employees; rising costs of labour, supplies, fuel and equipment; actual results of current exploration or reclamation activities; accidents; labour disputes; defective title to mineral claims or property or contests over claims to mineral properties; unexpected delays and costs inherent to consulting and accommodating rights of Indigenous peoples and other groups; risks, uncertainties and unanticipated delays associated with obtaining and maintaining necessary licenses, permits and authorizations and complying with permitting requirements, including those associated with the Copper Creek property; and uncertainties with respect to any future acquisitions by Faraday. In addition, there are risks and hazards associated with the business of mineral exploration, development and mining, including environmental events and hazards, industrial accidents, unusual or unexpected formations, pressures, cave-ins, flooding and the risk of inadequate insurance or inability to obtain insurance to cover these risks as well as \"Risk Factors\" included in Faraday's disclosure documents filed on and available at www.sedar.com . This press release does not constitute an offer to sell or a solicitation of an offer to buy any securities in any jurisdiction to any person to whom it is unlawful to make such an offer or solicitation in such jurisdiction. This press release is not, and under no circumstances is to be construed as, a prospectus, an offering memorandum, an advertisement or a public offering of securities in Faraday in Canada, the United States or any other jurisdiction. No securities commission or similar authority in Canada or in the United States has reviewed or in any way passed upon this press release, and any representation to the contrary is an offence. SOURCE: Faraday Copper Corp. View source version on accesswire.com: https://www.accesswire.com/739924/Faraday-Copper-Announces-Acquisition-of-Mercer-Ranch-at-Copper-Creek-Project-in-Arizona",
    "primary_commodity": "Cu"
  },
  "articleProject": {
    "gid": 2844,
    "project_name": "Copper Creek",
    "location": "Arizona, United States"
  },
  "articleExchange": "TSX",
  "articleCompanyId": 1229,
  "articleTicker": "FDY",
  "articleCompanyName": "Faraday Copper Corp.",
  "allOtherCompanyProjects": [
    {
      "company_id": 1229,
      "gid": 2845,
      "project_name": "Contact Copper",
      "location": "Nevada, United States"
    },
    {
      "company_id": 1229,
      "gid": 2844,
      "project_name": "Copper Creek",
      "location": "Arizona, United States"
    }
  ],
  "allOtherCompanyNews": [
    {
      "id": 104759,
      "company_id": 1229,
      "title": "Faraday Copper Intersects Near-Surface Supergene Copper Mineralization at the Globe and Copper Giant Breccias, Including 10.08 Metres at 3.62% Copper and 38.90 Metres at 0.51% Copper",
      "link": null,
      "date": "2025-05-15T11:05:00.000Z",
      "hidden": false
    },
    {
      "id": 104374,
      "company_id": 1229,
      "title": "Faraday Copper Reports First Quarter 2025 Financial Results",
      "link": null,
      "date": "2025-05-12T21:30:00.000Z",
      "hidden": false
    },
    {
      "id": 103629,
      "company_id": 1229,
      "title": "Faraday Copper Discovers Blind Winchester Breccia, Expands Near-Surface Mineralization in the American Eagle Area and Provides Copper Creek Project Update",
      "link": null,
      "date": "2025-05-06T11:15:00.000Z",
      "hidden": false
    },
    {
      "id": 91805,
      "company_id": 1229,
      "title": "Faraday Copper Intersects 56.57 Metres at 0.59% Copper at Boomerang and 18.49 m at 0.98% Copper at Banjo",
      "link": null,
      "date": "2025-03-19T11:05:00.000Z",
      "hidden": false
    },
    {
      "id": 90827,
      "company_id": 1229,
      "title": "Faraday Copper Reports 2024 Financial Results",
      "link": "https://golddiscovery.com/legacy/user/news_details/743403-fdyca-faraday-copper-reports-2024-financial-results",
      "date": "2025-03-11T21:35:00.000Z",
      "hidden": false
    },
    {
      "id": 88590,
      "company_id": 1229,
      "title": "Faraday Copper Announces Positive Metallurgical Results and Confirms High Copper Recovery Through Coarse Grind and Flotation",
      "link": "https://www.accessnewswire.com/newsroom/en/metals-and-mining/faraday-copper-announces-positive-metallurgical-results-and-confirms-high-copper-r-988221",
      "date": "2025-02-20T12:05:00.000Z",
      "hidden": false
    },
    {
      "id": 85930,
      "company_id": 1229,
      "title": "Faraday Copper Intersects 47.95 metres at 0.74% Copper within 304.40 metres at 0.35% Copper in the American Eagle Area",
      "link": "https://www.accessnewswire.com/newsroom/en/metals-and-mining/faraday-copper-intersects-4795-metres-at-074-copper-within-30440-metres-at-035-cop-975775",
      "date": "2025-01-30T12:05:00.000Z",
      "hidden": false
    },
    {
      "id": 83488,
      "company_id": 1229,
      "title": "Faraday Copper Intersects 40.06 Metres at 0.78% Copper Within 109.42 Metres at 0.41% Copper at the Boomerang Breccia and Expands Near-Surface Mineralization at the Prada Breccia",
      "link": "https://www.accesswire.com/965045/faraday-copper-intersects-4006-metres-at-078-copper-within-10942-metres-at-041-copper-at-the-boomerang-breccia-and-expands-near-surface-mineralization-at-the-prada-breccia",
      "date": "2025-01-08T12:05:00.000Z",
      "hidden": false
    },
    {
      "id": 79220,
      "company_id": 1229,
      "title": "Faraday Copper Intersects 23.25 Metres at 1.58% Copper Within 57.73 Metres at 0.85% Copper in the Rum Area",
      "link": "https://www.accesswire.com/944121/faraday-copper-intersects-2325-metres-at-158-copper-within-5773-metres-at-085-copper-in-the-rum-area",
      "date": "2024-11-19T11:30:00.000Z",
      "hidden": false
    },
    {
      "id": 77772,
      "company_id": 1229,
      "title": "Faraday Copper Reports Third Quarter 2024 Financial Results",
      "link": "https://www.accesswire.com/938887/faraday-copper-reports-third-quarter-2024-financial-results",
      "date": "2024-11-04T22:30:00.000Z",
      "hidden": false
    }
  ]
}
