{
  "article": {
    "id": 35480,
    "link": "https://www.newsfilecorp.com/release/166640/Lode-Acquires-Rights-to-Additional-US-Gold-Projects",
    "title": "Lode Acquires Rights to Additional US Gold Projects",
    "description": "<img src=\"https://api.newsfilecorp.com/newsinfo/166640/367\" id=\"367\" width=\"2\" height=\"2\" style=\"width: 1px;  height: 1px;border: 0px solid;\" /><p>Vancouver, British Columbia--(Newsfile Corp. - May 18, 2023) - <b>Lode Metals Corp. (CSE: LODE)</b> (the \"<b>Company</b>\") has completed its previously announced transaction involving the assignment (the \"<b>Assignment</b>\") to Elkhorn Gold Exploration LLC (\"<b>Elkhorn</b>\"), a wholly-owned subsidiary of the Company, of all rights to the contractual arrangements (collectively, the \"<b>Option Agreements</b>\") to acquire the Iron Butte Project, located in Lander County, Nevada and the Hope Butte Project, located in Malheur County, Oregon.</p><p>The Assignment was completed pursuant to the terms of a definitive assignment and assumption agreement (the \"<b>Definitive Agreement</b>\"), dated May 9, 2023, entered into with Federal Gold Corp. and Angold Resources (US) Ltd. (collectively, the \"<b>Subsidiaries</b>\"), each wholly-owned subsidiaries of Angold Resources Ltd. (TSXV: AAU) (\"<b>Angold</b>\").  In consideration for the Assignment, the Company has issued 10,000,000 common shares (the \"<b>Consideration Shares</b>\") to Angold, and has assumed all obligations of the Subsidiaries with respect to the Option Agreements.  Through Elkhorn, Lode now holds the rights to acquire the Iron Butte Project, and the Hope Butte Project, pursuant to the Option Agreements, in consideration for completing a series of cash payments and share issuances.</p><p>The Company is at arms-length from Angold, and the Subsidiaries, and no finders' fees or commissions were paid in connection with completion of the Assignment.  The Consideration Shares are subject to an escrow arrangement until May 18, 2024, during which time they may not be traded.  In addition to the escrow arrangement, the Consideration Shares are subject to a statutory hold period until September 19, 2023 in accordance with applicable securities laws.</p><p><b>About Lode Metals Corp.</b></p><p>Lode Metals is a gold exploration company focused on applying modern exploration techniques integrated with current geological models to the previous producing, high-grade Cracker Creek property located in northeastern Oregon, United States. The Cracker Creek property consolidates the contiguous, high-grade, past-producing Columbia, Eureka, Excelsior and North Pole Mines, collectively the most prolific gold producers in Oregon between 1891 and 1934.</p><p>For further information contact:</p><p>Jon Bey<br />President &#38; Chief Executive Officer<br />Lode Metals Corp.<br />Email: <a href=\"mailto:info@lodemetals.com\">info@lodemetals.com</a><br /><a href=\"https://api.newsfilecorp.com/redirect/3enKXhGENN\">www.lodemetals.com</a></p><p>Neither the Canadian Securities Exchange nor its Regulation Services Provider (as that term is defined in the policies of the Canadian Securities Exchange) accepts responsibility for the adequacy or accuracy of this news release. The Canadian Securities Exchange has neither approved nor disapproved the contents of this news release.</p><p><b>FORWARD-LOOKING STATEMENTS</b>:</p><p><i>Certain information in this news release may contain forward-looking statements that&#160;</i><i>involve substantial known and unknown risks and uncertainties. Forward-looking&#160;</i><i>statements are often identified by terms such as \"will\", \"may\", \"should\", \"anticipate\",&#160;</i><i>\"expects\" and similar expressions. All statements other than statements of historical fact&#160;</i><i>included in this news release are forward-looking statements that involve risks and&#160;</i><i>uncertainties. There can be no assurance that such statements will prove to be accurate&#160;</i><i>and actual results and future events could differ materially from those anticipated in such&#160;</i><i>statements. Important factors that could cause actual results to differ materially from the&#160;</i><i>Company's expectations are detailed from time to time in the filings made by the&#160;</i><i>Company with securities regulations. The reader is cautioned that assumptions used in&#160;</i><i>the preparation of any forward-looking information may prove to be incorrect. Events or&#160;</i><i>circumstances may cause actual results to differ materially from those predicted, as a&#160;</i><i>result of numerous known and unknown risks, uncertainties, and other factors, many of&#160;</i><i>which are beyond the control of the Company. The reader is cautioned not to place undue reliance on any forward-looking information. Such information, although considered reasonable by management at the time of preparation, may prove to be incorrect and actual results may differ materially from those anticipated. Forward-looking statements contained in this news release are expressly qualified by this cautionary statement. The forward-looking statements contained in this news release are made as of the date of this news release and the Company disclaims any intention or obligation to update or revise such information, except as required by applicable law.</i></p><p id=\"corporateNewsLogoContainer\"><img src=\"https://images.newsfilecorp.com/files/8716/166640_b7c69cbf0496caa3_logo.jpg\" id=\"corporateNewsLogo\" alt=\"Corporate Logo\" /></p><p id=\"corporateLinkBack\">To view the source version of this press release, please visit <a href=\"https://api.newsfilecorp.com/redirect/NNk3VfaNW0\">https://www.newsfilecorp.com/release/166640</a></p>",
    "search_terms": "Iron Butte,Minas Metals Ltd.,LODE",
    "master_gid": 3619,
    "date": "2023-05-18T17:00:00.000Z",
    "tags": "USA|Nevada||Gold|Project Acquisition",
    "image_id": null,
    "hidden": false,
    "company_id": 1955,
    "provider": null,
    "excerpt": "Vancouver, British Columbia--(Newsfile Corp. - May 18, 2023) -Lode Metals Corp. (CSE: LODE)(the \"Company\") has completed its previously announced transaction involving the assignment (the \"Assignment\") to Elkhorn Gold Exploration LLC (\"Elkhorn\"), a wholly-owned subsidiary of the Company, of all rights to the contractual arrangements (collectively, the \"Option Agreements\") to acquire",
    "is_regulatory": false,
    "refined_tags": [
      "Project Acquisition"
    ],
    "ftp_filename": null,
    "company_name": "Minas Metals Ltd.",
    "exchange": "CSE",
    "root_ticker": "MINA",
    "project_name": "Iron Butte",
    "gid": 3619,
    "location": "Nevada, United States",
    "plan_id": null,
    "description_text": "Vancouver, British Columbia--(Newsfile Corp. - May 18, 2023) - Lode Metals Corp. (CSE: LODE) (the \" Company \") has completed its previously announced transaction involving the assignment (the \" Assignment \") to Elkhorn Gold Exploration LLC (\" Elkhorn \"), a wholly-owned subsidiary of the Company, of all rights to the contractual arrangements (collectively, the \" Option Agreements \") to acquire the Iron Butte Project, located in Lander County, Nevada and the Hope Butte Project, located in Malheur County, Oregon. The Assignment was completed pursuant to the terms of a definitive assignment and assumption agreement (the \" Definitive Agreement \"), dated May 9, 2023, entered into with Federal Gold Corp. and Angold Resources (US) Ltd. (collectively, the \" Subsidiaries \"), each wholly-owned subsidiaries of Angold Resources Ltd. (TSXV: AAU) (\" Angold \").  In consideration for the Assignment, the Company has issued 10,000,000 common shares (the \" Consideration Shares \") to Angold, and has assumed all obligations of the Subsidiaries with respect to the Option Agreements.  Through Elkhorn, Lode now holds the rights to acquire the Iron Butte Project, and the Hope Butte Project, pursuant to the Option Agreements, in consideration for completing a series of cash payments and share issuances. The Company is at arms-length from Angold, and the Subsidiaries, and no finders' fees or commissions were paid in connection with completion of the Assignment.  The Consideration Shares are subject to an escrow arrangement until May 18, 2024, during which time they may not be traded.  In addition to the escrow arrangement, the Consideration Shares are subject to a statutory hold period until September 19, 2023 in accordance with applicable securities laws. About Lode Metals Corp. Lode Metals is a gold exploration company focused on applying modern exploration techniques integrated with current geological models to the previous producing, high-grade Cracker Creek property located in northeastern Oregon, United States. The Cracker Creek property consolidates the contiguous, high-grade, past-producing Columbia, Eureka, Excelsior and North Pole Mines, collectively the most prolific gold producers in Oregon between 1891 and 1934. For further information contact: Jon Bey President & Chief Executive Officer Lode Metals Corp. Email: info@lodemetals.com www.lodemetals.com Neither the Canadian Securities Exchange nor its Regulation Services Provider (as that term is defined in the policies of the Canadian Securities Exchange) accepts responsibility for the adequacy or accuracy of this news release. The Canadian Securities Exchange has neither approved nor disapproved the contents of this news release. FORWARD-LOOKING STATEMENTS : Certain information in this news release may contain forward-looking statements that involve substantial known and unknown risks and uncertainties. Forward-looking statements are often identified by terms such as \"will\", \"may\", \"should\", \"anticipate\", \"expects\" and similar expressions. All statements other than statements of historical fact included in this news release are forward-looking statements that involve risks and uncertainties. There can be no assurance that such statements will prove to be accurate and actual results and future events could differ materially from those anticipated in such statements. Important factors that could cause actual results to differ materially from the Company's expectations are detailed from time to time in the filings made by the Company with securities regulations. The reader is cautioned that assumptions used in the preparation of any forward-looking information may prove to be incorrect. Events or circumstances may cause actual results to differ materially from those predicted, as a result of numerous known and unknown risks, uncertainties, and other factors, many of which are beyond the control of the Company. The reader is cautioned not to place undue reliance on any forward-looking information. Such information, although considered reasonable by management at the time of preparation, may prove to be incorrect and actual results may differ materially from those anticipated. Forward-looking statements contained in this news release are expressly qualified by this cautionary statement. The forward-looking statements contained in this news release are made as of the date of this news release and the Company disclaims any intention or obligation to update or revise such information, except as required by applicable law. To view the source version of this press release, please visit https://www.newsfilecorp.com/release/166640",
    "primary_commodity": "Au"
  },
  "articleProject": {
    "gid": 3619,
    "project_name": "Iron Butte",
    "location": "Nevada, United States"
  },
  "articleExchange": "CSE",
  "articleCompanyId": 1955,
  "articleTicker": "MINA",
  "articleCompanyName": "Minas Metals Ltd.",
  "allOtherCompanyProjects": [
    {
      "company_id": 1955,
      "gid": 5265,
      "project_name": "Comenco",
      "location": "Minas Gerais, Brazil"
    },
    {
      "company_id": 1955,
      "gid": 3613,
      "project_name": "Cracker Creek",
      "location": "Oregon, United States"
    }
  ],
  "allOtherCompanyNews": [
    {
      "id": 91254,
      "company_id": 1955,
      "title": "Minas Metals Announces Appointment of Chief Executive Officer and Chief Financial Officer and Changes to Board of Directors and Award Grants",
      "link": null,
      "date": "2025-03-13T23:11:00.000Z",
      "hidden": false
    },
    {
      "id": -165928,
      "company_id": 1955,
      "title": "Minas Metals Announces Asset Purchase Agreements",
      "link": "https://www.newsfilecorp.com/release/238289/Minas-Metals-Announces-Asset-Purchase-Agreements",
      "date": "2025-01-27T23:58:00.000Z",
      "hidden": false
    },
    {
      "id": -165721,
      "company_id": 1955,
      "title": "Canadian Investment Regulatory Organization Trading Halt - MINA",
      "link": "https://contentapi.cision.com/api/v1.0/releases/20250124C3078",
      "date": "2025-01-24T14:45:00.000Z",
      "hidden": false
    },
    {
      "id": -194029,
      "company_id": 1955,
      "title": "MINAS METALS CLOSES $600,000 NON-BROKERED PRIVATE PLACEMENT",
      "link": "https://app.quotemedia.com/data/downloadFiling?webmasterId=104408&ref=6781b9347dac9769167515d1&type=PDFC&formType=002-002-001089-003001&formDescription=News+release&dateFiled=2025-01-10",
      "date": "2025-01-10T16:20:04.000Z",
      "hidden": false
    },
    {
      "id": -194030,
      "company_id": 1955,
      "title": "Minas Metals Announces $600,000 Non-Brokered Private Placement",
      "link": "https://app.quotemedia.com/data/downloadFiling?webmasterId=104408&ref=676f275fb5155764cf3dbc26&type=PDFC&formType=002-002-001089-003001&formDescription=News+release&dateFiled=2024-12-27",
      "date": "2024-12-27T14:17:03.000Z",
      "hidden": false
    },
    {
      "id": -194031,
      "company_id": 1955,
      "title": "MINAS METALS ANNOUNCES CONSOLIDATION AND DEBT SETTLEMENT",
      "link": "https://app.quotemedia.com/data/downloadFiling?webmasterId=104408&ref=676f063a4ece28296d3d8fe1&type=PDFC&formType=002-002-001089-003001&formDescription=News+release&dateFiled=2024-12-27",
      "date": "2024-12-27T11:55:38.000Z",
      "hidden": false
    },
    {
      "id": -194032,
      "company_id": 1955,
      "title": "MINAS METALS ANNOUNCES COMPLETION OF DEBT SETTLEMENT",
      "link": "https://app.quotemedia.com/data/downloadFiling?webmasterId=104408&ref=67660df24903370be93c8555&type=PDFC&formType=002-002-001089-003001&formDescription=News+release&dateFiled=2024-12-20",
      "date": "2024-12-20T16:38:10.000Z",
      "hidden": false
    },
    {
      "id": -194033,
      "company_id": 1955,
      "title": "MINAS METALS ANNOUNCES CONSOLIDATION AND DEBT SETTLEMENT",
      "link": "https://app.quotemedia.com/data/downloadFiling?webmasterId=104408&ref=67608e47d0e996353c13f9a1&type=PDFC&formType=002-002-001089-003001&formDescription=News+release&dateFiled=2024-12-16",
      "date": "2024-12-16T12:32:07.000Z",
      "hidden": false
    },
    {
      "id": -73755,
      "company_id": 1955,
      "title": "Canadian Investment Regulatory Organization Trading Halt - MINA",
      "link": "https://contentapi.cision.com/api/v1.0/releases/20240606C1998",
      "date": "2024-06-06T12:27:00.000Z",
      "hidden": false
    },
    {
      "id": -63909,
      "company_id": 1955,
      "title": "Lode Metals Announces Exploration Program (Aracuai, Brazil) and Corporate Re-Branding",
      "link": "https://www.newsfilecorp.com/release/183986/Lode-Metals-Announces-Exploration-Program-Aracuai-Brazil-and-Corporate-ReBranding",
      "date": "2023-10-16T13:00:00.000Z",
      "hidden": false
    }
  ]
}
