{
  "article": {
    "id": 43079,
    "link": "https://www.thenewswire.com/press-releases?id=1Av7Fg4K0",
    "title": "Nuclear Fuels Announces Kaycee Uranium Project Expanded to 42+ Square Miles",
    "description": "<table style='width:fit-content; border: none;'><tr style='background: none;'><td colspan='10' style='padding: 0; margin: 0; border: none; background: none;' valign='bottom'><a target='_blank' href='https://nuclearfuels.energy/'><img src=\"https://www.thenewswire.com/data/tnw/clients/logos/1BNMFGqyK.png?t=1676484884\" alt=\"Nuclear Fuels Inc.\" /></a></td></tr><tr style='background: none;'><td style='width: 34px; padding: 0; margin: 0; border: none; background: none;' valign='bottom'><a target='_blank' href='https://thenewswire.com/api/apps/tnw/r?i=1BNMFGqyK&amp;m=fac'><img src=\"https://www.thenewswire.com/data/tnw/img/fac.png\" /></a></td><td style='width: 34px; padding: 0; margin: 0; border: none; background: none;' valign='bottom'><a target='_blank' href='https://thenewswire.com/api/apps/tnw/r?i=1BNMFGqyK&amp;m=twi'><img src=\"https://www.thenewswire.com/data/tnw/img/twi.png\" /></a></td><td style='width: 34px; padding: 0; margin: 0; border: none; background: none;' valign='bottom'><a target='_blank' href='https://thenewswire.com/api/apps/tnw/r?i=1BNMFGqyK&amp;m=lin'><img src=\"https://www.thenewswire.com/data/tnw/img/lin.png\" /></a></td><td style='width: 34px; padding: 0; margin: 0; border: none; background: none;' valign='bottom'><a target='_blank' href='https://thenewswire.com/api/apps/tnw/r?i=1BNMFGqyK&amp;m=ins'><img src=\"https://www.thenewswire.com/data/tnw/img/ins.png\" /></a></td><td style='padding: 0; margin: 0; border: none; background: none;'></td></tr></table> \n<p style='text-align:justify; '>\n<span style='font-weight:bold; '>Vancouver, British Columbia – </span><span style='font-weight:bold; '>TheNewswire -</span><span style='font-weight:bold; '> October 26, 2023 – Nuclear Fuels Inc. (CSE:NF) (“Nuclear Fuels” or the “Company”) </span><span style=''>announced today that Nuclear Fuels has expanded its Kaycee Uranium Project (“the Kaycee Project”) by over 25%.  Newly acquired historic drill hole data led to the increase of its property holdings by more than 7 miles along trend. The Kaycee Project, in Wyoming’s prolific Powder River Basin (“PRB”) now extends more than 33-miles along trend with over 110 miles of identified roll fronts and consists of more than 42 square miles of mineral rights. As announced on </span><a href='https://nuclearfuels.energy/nuclear-fuels-announces-extensive-drill-program-at-the-kayceeuranium-project-wyoming/' target='_blank'><span style=''><span style=''>October 23, 2023</span></span></a><span style=''> an aggressive drill program has commenced with a rotary drill on-site for the first phase of its fully-funded 200 hole rotary drill program. The drill program is focused on validating historic uranium drill intersections and expanding known mineralization at depth, along trend, and on other high priority targets on the Kaycee Project. </span>\n</p>\n\n<p style='text-align:justify; '>\n<span style='font-weight:bold; '>Kaycee Project Highlights: </span>\n</p>\n\r\n<ul>\r\n<li>\n<p style='text-align:justify; '>\n<span style=''>Now the largest In-Situ Recovery uranium (“ISR”) exploration project in the State of Wyoming’s Powder River Basin;</span> \n</p>\n</li><li>\n<p style='text-align:justify; '>\n<span style=''>Initially identified from proprietary historic data which now includes over 3,800 historic drill holes in addition to the newly acquired 150 logs;</span> \n</p>\n</li><li>\n<p style='text-align:justify; '>\n<span style=''>Historic drilling has confirmed uranium mineralization in all three historically productive sandstones within the PRB, occurring over more than 1000’ of vertical section; </span> \n</p>\n</li><li>\n<p style='text-align:justify; '>\n<span style=''>Over 3,800 historic drill holes will guide exploration on 110+ miles of mapped roll front mineralization;</span> \n</p>\n</li><li>\n<p style='text-align:justify; '>\n<span style=''>Only 9 discrete zones of mineralization had been drilled off in the early 1980’s before reduced uranium prices stopped exploration work. Nuclear Fuels has these 9 core mineralized zones to expand on, as well as 110+ miles of roll front to define new deposits.  </span> \n</p>\n</li>\r\n</ul>\r\n\n<p style='text-align:justify; '>\n<span style=''>To view the Kaycee Project maps please visit:  </span><a href='https://bit.ly/40hYJIw' target='_blank'><span style=''><span style=''>https://bit.ly/40hYJIw</span></span></a>\n</p>\n\n<p style='text-align:justify; '>\n<span style=''>William M. Sheriff, Chairman of Nuclear Fuels stated, “Exclusive access to proprietary historic databases provide Nuclear Fuels with a clear competitive advantage for property acquisition. With this advantage we have identified the Kaycee Project as our priority project. Michael Collins, our Chief Executive Officer, and I are excited at the opportunity presented with drilling at the Kaycee Project this Fall to validate and expand upon the previous 1980’s drill program.  The overall property has remained virtually untested since the last uranium exploration boom in what is a premier ISR production region of Wyoming.   </span>\n</p>\n\n<p style='text-align:justify; '>\n<span style='font-weight:bold; '>Kaycee Uranium Project, Wyoming</span>\n</p>\n\n<p style='text-align:justify; '>\n<span style=''>The Kaycee Project in Wyoming’s Powder River Basin (“PRB”) is Nuclear Fuel’s priority project consisting of over 42 square miles of mineral rights over a 33-mile mineralized trend and 110 miles of identified roll fronts. The Kaycee Project is believed to be the only project in the PRB where all three known historically productive sandstone formations (Wasatch, Fort Union, and Lance) are mineralized and potentially amenable to ISR extraction. The Kaycee Project, under Nuclear Fuels, represents the first time since the early 1980’s that the entire district is controlled by one company.   </span>\n</p>\n\n<p style='text-align:justify; '>\n<span style=''>Nuclear Fuels acquired the Kaycee Project from enCore Energy Corp., which retains a back-in right for 51% of the project by paying 2.5X the exploration costs and carrying the Kaycee project to production (costs recoverable from production) upon Nuclear Fuels establishing a minimum 15 million pound U</span><span style=''>3</span><span style=''>O</span><span style=''>8</span><span style=''> 43-101 compliant resource. </span>\n</p>\n\n<p style='text-align:justify; '>\n<span style=''>Wyoming is a proven and prolific uranium producer with a pro-energy government and established regulatory regime for the permitting and extraction of uranium through ISR technology.  As Wyoming is one of the few “Agreement States” where the federal government and the Nuclear Regulatory Commission have ceded regulatory authority to the state government, permitting and advancing uranium projects is more efficient and streamlined as compared to most other states. Wyoming, with over 250 million pounds of historic production, ranks as the state with the second most uranium production to date; most of which has been through the ISR method since 1990; predominantly from the PRB.  </span>\n</p>\n\n<p style='text-align:justify; '>\n<span style=''>The technical content of this news release has been reviewed and approved by Mark Travis, CPG., a contractor to the Company, and a Qualified Person as defined in National Instrument 43-101.</span>\n</p>\n\n<p style='text-align:justify; '>\n<span style='font-weight:bold; '>About Nuclear Fuels Inc.</span>\n</p>\n\n<p style='text-align:justify; '>\n<span style=''>Nuclear Fuels Inc. (CSE:NF) is committed to aggressive exploration of district-scale In-Situ Recovery (“ISR”) uranium projects in proven and prolific jurisdictions. Focused on its priority Kaycee Project, located in Wyoming’s Powder River Basin, our goal is to advance the project onto a path to production.  enCore Energy Corp. maintains the right to back-in to 51% ownership by paying the Company 2.5X its exploration expenditures and carrying the project to production (recoverable from production).   With existing historic resources through a 33-mile trend, 110+ miles of mapped roll-fronts and 3,800 drill holes, Nuclear Fuels has secured the district under one company’s control for the first time since the early 1980’s. Nuclear Fuels also provides a unique model for development of our other uranium projects and has established a pipeline of future opportunities in known uranium jurisdictions. Our industry leaders work to build America’s uranium resources and provide a domestic fuel for nuclear energy; always on, always available. </span><span style=''>ISR technology extracts uranium in a non-invasive process through the use of groundwater and oxygen, coupled with a proven ion exchange process, to recover the uranium.</span>\n</p>\n\n<p style='text-align:justify; '>\n<a href='' target='_blank'></a><span style='font-weight:bold; '>For</span> <span style='font-weight:bold; '>further</span> <span style='font-weight:bold; '>information:</span>\n</p>\n\n<p style='text-align:justify; '>\n<a href='' target='_blank'></a><span style=''>Michael Collins, Chief Executive Officer </span>\n</p>\n\n<p style='text-align:justify; '>\n<a href='' target='_blank'></a><span style=''>P: 778-763-4670</span>\n</p>\n\n<p style='text-align:justify; '>\n<a href='' target='_blank'></a><span style=''>E: </span><a href='mailto:info@nuclearfuels.energy' target='_blank'><span style=''><span style=''>info@nuclearfuels.energy</span></span></a>   \n</p>\n\n<p style='text-align:justify; '>\n<a href='' target='_blank'></a><span style=''>W: </span><a href='http://www.nuclearfuels.energy' target='_blank'><span style=''><span style=''>www.nuclearfuels.energy</span></span></a> \n</p>\n\n<p style='text-align:justify; '>\n<span style='font-style:italic; '>The Canadian Securities Exchange has not reviewed this press release and does not accept responsibility for the adequacy or accuracy of this news release.</span>\n</p>\n\n<p style='text-align:justify; '>\n<span style='font-style:italic; '>Certain information in this news release constitutes forward-looking statements under applicable securities laws. Any statements that are contained in this news release that are not statements of historical fact may be deemed to be forward-looking statements. Forward-looking statements are often identified by terms such as “may”, “should”, “anticipate”, “expect”, “potential”, “believe”, “intend” or the negative of these terms and similar expressions. Forward-looking statements in this news release include, but are not limited to, statements relating to planned exploration programs and the results of additional exploration work in seeking to establish mineral resources as defined in NI43-101 on any of our properties. Forward-looking statements necessarily involve known and unknown </span><span style='font-style:italic; '>risks, including, without limitation, risks associated with the completing planned exploration programs and the results of those programs; the ability to access additional capital to fund planned and future operations; regulatory risks including exploration permitting; risks associated with title to our mineral projects; the ability of the company to implement its business strategies; and other risks including risks contained in documents available for review at </span><a href='http://www.sedar.com' target='_blank'><span style=''><span style='font-style:italic; '>www.sedar.com</span></span></a><span style='font-style:italic; '> under the Company’s profile. Readers are cautioned not to place undue reliance on forward-looking statements as there can be no assurance that the plans, intentions or expectations upon which they are placed will occur. Such information, although considered reasonable by management at the time of preparation, may prove to be incorrect and actual results may differ materially from those anticipated. Forward-looking statements contained in this news release are expressly qualified by this cautionary statement.</span>\n</p>\n\n\n<p>Copyright (c) 2023 TheNewswire - All rights reserved.</p>\n",
    "search_terms": "Kaycee,Nuclear Fuels Inc.,NF",
    "master_gid": 5506,
    "date": "2023-10-26T11:00:00.000Z",
    "tags": "|||Uranium|Project Acquisition",
    "image_id": null,
    "hidden": false,
    "company_id": 2582,
    "provider": null,
    "excerpt": " Vancouver, British Columbia –TheNewswire -October 26, 2023 – Nuclear Fuels Inc. (CSE:NF) (“Nuclear Fuels” or the “Company”)announced today that Nuclear Fuels has expanded its Kaycee Uranium Project (“the Kaycee Project”) by over 25%.  Newly acquired historic drill hole data led to the increase of its property holdings by more than",
    "is_regulatory": false,
    "refined_tags": [
      "Project Acquisition"
    ],
    "ftp_filename": null,
    "company_name": "Nuclear Fuels Inc.",
    "exchange": "CSE",
    "root_ticker": "NF",
    "project_name": "Kaycee",
    "gid": 5506,
    "location": "Wyoming, United States",
    "plan_id": null,
    "description_text": "Vancouver, British Columbia – TheNewswire - October 26, 2023 – Nuclear Fuels Inc. (CSE:NF) (“Nuclear Fuels” or the “Company”) announced today that Nuclear Fuels has expanded its Kaycee Uranium Project (“the Kaycee Project”) by over 25%.  Newly acquired historic drill hole data led to the increase of its property holdings by more than 7 miles along trend. The Kaycee Project, in Wyoming’s prolific Powder River Basin (“PRB”) now extends more than 33-miles along trend with over 110 miles of identified roll fronts and consists of more than 42 square miles of mineral rights. As announced on October 23, 2023 an aggressive drill program has commenced with a rotary drill on-site for the first phase of its fully-funded 200 hole rotary drill program. The drill program is focused on validating historic uranium drill intersections and expanding known mineralization at depth, along trend, and on other high priority targets on the Kaycee Project. Kaycee Project Highlights: Now the largest In-Situ Recovery uranium (“ISR”) exploration project in the State of Wyoming’s Powder River Basin; Initially identified from proprietary historic data which now includes over 3,800 historic drill holes in addition to the newly acquired 150 logs; Historic drilling has confirmed uranium mineralization in all three historically productive sandstones within the PRB, occurring over more than 1000’ of vertical section; Over 3,800 historic drill holes will guide exploration on 110+ miles of mapped roll front mineralization; Only 9 discrete zones of mineralization had been drilled off in the early 1980’s before reduced uranium prices stopped exploration work. Nuclear Fuels has these 9 core mineralized zones to expand on, as well as 110+ miles of roll front to define new deposits. To view the Kaycee Project maps please visit: https://bit.ly/40hYJIw William M. Sheriff, Chairman of Nuclear Fuels stated, “Exclusive access to proprietary historic databases provide Nuclear Fuels with a clear competitive advantage for property acquisition. With this advantage we have identified the Kaycee Project as our priority project. Michael Collins, our Chief Executive Officer, and I are excited at the opportunity presented with drilling at the Kaycee Project this Fall to validate and expand upon the previous 1980’s drill program.  The overall property has remained virtually untested since the last uranium exploration boom in what is a premier ISR production region of Wyoming. Kaycee Uranium Project, Wyoming The Kaycee Project in Wyoming’s Powder River Basin (“PRB”) is Nuclear Fuel’s priority project consisting of over 42 square miles of mineral rights over a 33-mile mineralized trend and 110 miles of identified roll fronts. The Kaycee Project is believed to be the only project in the PRB where all three known historically productive sandstone formations (Wasatch, Fort Union, and Lance) are mineralized and potentially amenable to ISR extraction. The Kaycee Project, under Nuclear Fuels, represents the first time since the early 1980’s that the entire district is controlled by one company. Nuclear Fuels acquired the Kaycee Project from enCore Energy Corp., which retains a back-in right for 51% of the project by paying 2.5X the exploration costs and carrying the Kaycee project to production (costs recoverable from production) upon Nuclear Fuels establishing a minimum 15 million pound U 3 O 8 43-101 compliant resource. Wyoming is a proven and prolific uranium producer with a pro-energy government and established regulatory regime for the permitting and extraction of uranium through ISR technology.  As Wyoming is one of the few “Agreement States” where the federal government and the Nuclear Regulatory Commission have ceded regulatory authority to the state government, permitting and advancing uranium projects is more efficient and streamlined as compared to most other states. Wyoming, with over 250 million pounds of historic production, ranks as the state with the second most uranium production to date; most of which has been through the ISR method since 1990; predominantly from the PRB. The technical content of this news release has been reviewed and approved by Mark Travis, CPG., a contractor to the Company, and a Qualified Person as defined in National Instrument 43-101. About Nuclear Fuels Inc. Nuclear Fuels Inc. (CSE:NF) is committed to aggressive exploration of district-scale In-Situ Recovery (“ISR”) uranium projects in proven and prolific jurisdictions. Focused on its priority Kaycee Project, located in Wyoming’s Powder River Basin, our goal is to advance the project onto a path to production.  enCore Energy Corp. maintains the right to back-in to 51% ownership by paying the Company 2.5X its exploration expenditures and carrying the project to production (recoverable from production).   With existing historic resources through a 33-mile trend, 110+ miles of mapped roll-fronts and 3,800 drill holes, Nuclear Fuels has secured the district under one company’s control for the first time since the early 1980’s. Nuclear Fuels also provides a unique model for development of our other uranium projects and has established a pipeline of future opportunities in known uranium jurisdictions. Our industry leaders work to build America’s uranium resources and provide a domestic fuel for nuclear energy; always on, always available. ISR technology extracts uranium in a non-invasive process through the use of groundwater and oxygen, coupled with a proven ion exchange process, to recover the uranium. For further information: Michael Collins, Chief Executive Officer P: 778-763-4670 E: info@nuclearfuels.energy W: www.nuclearfuels.energy The Canadian Securities Exchange has not reviewed this press release and does not accept responsibility for the adequacy or accuracy of this news release. Certain information in this news release constitutes forward-looking statements under applicable securities laws. Any statements that are contained in this news release that are not statements of historical fact may be deemed to be forward-looking statements. Forward-looking statements are often identified by terms such as “may”, “should”, “anticipate”, “expect”, “potential”, “believe”, “intend” or the negative of these terms and similar expressions. Forward-looking statements in this news release include, but are not limited to, statements relating to planned exploration programs and the results of additional exploration work in seeking to establish mineral resources as defined in NI43-101 on any of our properties. Forward-looking statements necessarily involve known and unknown risks, including, without limitation, risks associated with the completing planned exploration programs and the results of those programs; the ability to access additional capital to fund planned and future operations; regulatory risks including exploration permitting; risks associated with title to our mineral projects; the ability of the company to implement its business strategies; and other risks including risks contained in documents available for review at www.sedar.com under the Company’s profile. Readers are cautioned not to place undue reliance on forward-looking statements as there can be no assurance that the plans, intentions or expectations upon which they are placed will occur. Such information, although considered reasonable by management at the time of preparation, may prove to be incorrect and actual results may differ materially from those anticipated. Forward-looking statements contained in this news release are expressly qualified by this cautionary statement. Copyright (c) 2023 TheNewswire - All rights reserved.",
    "primary_commodity": "U"
  },
  "articleProject": {
    "gid": 5506,
    "project_name": "Kaycee",
    "location": "Wyoming, United States"
  },
  "articleExchange": "CSE",
  "articleCompanyId": 2582,
  "articleTicker": "NF",
  "articleCompanyName": "Nuclear Fuels Inc.",
  "allOtherCompanyProjects": [
    {
      "company_id": 2582,
      "gid": 9951,
      "project_name": "TenSleep",
      "location": "Wyoming, United States"
    },
    {
      "company_id": 2582,
      "gid": 6317,
      "project_name": "Lisbon Valley",
      "location": "Utah, United States"
    },
    {
      "company_id": 2582,
      "gid": 5509,
      "project_name": "Bootheel",
      "location": "Wyoming, United States"
    },
    {
      "company_id": 2582,
      "gid": 5686,
      "project_name": "Bobcat",
      "location": "Wyoming, United States"
    },
    {
      "company_id": 2582,
      "gid": 5506,
      "project_name": "Kaycee",
      "location": "Wyoming, United States"
    },
    {
      "company_id": 2582,
      "gid": 5507,
      "project_name": "Moonshine",
      "location": "Arizona, United States"
    },
    {
      "company_id": 2582,
      "gid": 5508,
      "project_name": "LAB",
      "location": "Newfoundland and Labrador, Canada"
    }
  ],
  "allOtherCompanyNews": [
    {
      "id": 107640,
      "company_id": 2582,
      "title": "Nuclear Fuels Commences 2025 Kaycee Uranium Project Drill Program",
      "link": "https://contentapi.cision.com/api/v1.0/releases/20250611C2680",
      "date": "2025-06-11T11:00:00.000Z",
      "hidden": false
    },
    {
      "id": 107061,
      "company_id": 2582,
      "title": "Premier American Uranium to Acquire Nuclear Fuels, Creating One of America's Largest Pure-Play Uranium Explorers",
      "link": null,
      "date": "2025-06-05T11:00:00.000Z",
      "hidden": false
    },
    {
      "id": 91926,
      "company_id": 2582,
      "title": "Nuclear Fuels Mourns the Passing of Independent Director Eugene Spiering",
      "link": "https://contentapi.cision.com/api/v1.0/releases/20250320C9059",
      "date": "2025-03-20T11:00:00.000Z",
      "hidden": false
    },
    {
      "id": 90128,
      "company_id": 2582,
      "title": "Nuclear Fuels Acquires TenSleep Uranium Project with Athabasca Basin-Style Mineralization in Wyoming's Powder River Basin",
      "link": "https://contentapi.cision.com/api/v1.0/releases/20250303C4965",
      "date": "2025-03-03T12:00:00.000Z",
      "hidden": false
    },
    {
      "id": 85637,
      "company_id": 2582,
      "title": "Nuclear Fuels Announces the Discovery of New Mineralized Zones at the Kaycee Uranium Project",
      "link": "https://contentapi.cision.com/api/v1.0/releases/20250129VA06855",
      "date": "2025-01-29T12:00:00.000Z",
      "hidden": false
    },
    {
      "id": 79461,
      "company_id": 2582,
      "title": "NUCLEAR FUELS ANNOUNCES COMPLETION OF $13.9 MILLION BOUGHT DEAL OFFERING AND NON-BROKERED PRIVATE PLACEMENT WITH ENCORE ENERGY CORP AND STRATEGIC INVESTORS",
      "link": "https://contentapi.cision.com/api/v1.0/releases/20241120C5319",
      "date": "2024-11-20T13:49:00.000Z",
      "hidden": false
    },
    {
      "id": 103054,
      "company_id": 2582,
      "title": "Nuclear Fuels Inc. to Attend the 50th Annual New Orleans Investment Conference",
      "link": "https://app.quotemedia.com/data/downloadFiling?webmasterId=104408&ref=673cde727e8ceb72807b1f21&type=PDFC&formType=002-002-001089-003001&formDescription=News+release&dateFiled=2024-11-19",
      "date": "2024-11-19T10:52:34.000Z",
      "hidden": false
    },
    {
      "id": 77757,
      "company_id": 2582,
      "title": "NUCLEAR FUELS ANNOUNCES ADDITIONAL NON-BROKERED PRIVATE PLACEMENT WITH ENCORE ENERGY CORP AND STRATEGIC INVESTORS",
      "link": "https://contentapi.cision.com/api/v1.0/releases/20241105C9500",
      "date": "2024-11-05T12:00:00.000Z",
      "hidden": false
    },
    {
      "id": -151110,
      "company_id": 2582,
      "title": "Canadian Investment Regulatory Organization Trading Halt - NF",
      "link": "https://contentapi.cision.com/api/v1.0/releases/20241030C7158",
      "date": "2024-10-30T20:20:00.000Z",
      "hidden": false
    },
    {
      "id": -151109,
      "company_id": 2582,
      "title": "Canadian Investment Regulatory Organization Trade Resumption - NF",
      "link": "https://contentapi.cision.com/api/v1.0/releases/20241030C8120",
      "date": "2024-10-30T20:20:00.000Z",
      "hidden": false
    }
  ]
}
