{
  "article": {
    "id": 48041,
    "link": "https://www.thenewswire.com/press-releases?id=1BQPFY00X",
    "title": "Emergent Metals Expands its New York Canyon Project",
    "description": "<table style='width:fit-content; border: none;'><tr style='background: none;'><td colspan='10' style='padding: 0; margin: 0; border: none; background: none;' valign='bottom'><a target='_blank' href='https://emergentmetals.com/'><img src=\"https://www.thenewswire.com/data/tnw/clients/logos/Be9FWYaB.png?t=1700764758\" alt=\"Emergent Metals Corp.\" /></a></td></tr><tr style='background: none;'><td style='width: 34px; padding: 0; margin: 0; border: none; background: none;' valign='bottom'><a target='_blank' href='https://thenewswire.com/api/apps/tnw/r?i=Be9FWYaB&amp;m=fac'><img src=\"https://www.thenewswire.com/data/tnw/img/fac.png\" /></a></td><td style='width: 34px; padding: 0; margin: 0; border: none; background: none;' valign='bottom'><a target='_blank' href='https://thenewswire.com/api/apps/tnw/r?i=Be9FWYaB&amp;m=twi'><img src=\"https://www.thenewswire.com/data/tnw/img/twi.png\" /></a></td><td style='width: 34px; padding: 0; margin: 0; border: none; background: none;' valign='bottom'><a target='_blank' href='https://thenewswire.com/api/apps/tnw/r?i=Be9FWYaB&amp;m=lin'><img src=\"https://www.thenewswire.com/data/tnw/img/lin.png\" /></a></td><td style='padding: 0; margin: 0; border: none; background: none;'></td></tr></table>\n<p style=''>\n\n<p style='text-align:justify; '>\n<span style='font-weight:bold; '>Vancouver, British Columbia – </span><span style='font-weight:bold; '>TheNewswire - </span><span style='font-weight:bold; '>January 29, 2024 -- Emergent Metals Corp. (&quot;Emergent&quot; or the “Company”) (TSXV:EMR)</span><span style=''> announces that it has expanded its New York Canyon Property (“New York Canyon” or the “Property” in Nevada by acquiring 634 unpatented lode claims from Kennecott Exploration Company (“KEX”).  The Property now consists of 21 patented claims and 786 unpatented mining claims totaling about 16,000 acres (6,500 hectares).  Located about 30 miles (48 kilometers) east of Hawthorne, New York Canyon hosts copper skarn and porphyry exploration targets including Longshot Ridge, Copper Queen, Champion, and Emma.</span>\n</p>\n\n<p style='text-align:justify; '>\n<span style=''>As  part of the transaction, Emergent is acquiring 266 claims (the “Option Claims”) that were staked by KEX as part of an Earn-in with Option  to Joint Venture Agreement (the “Agreement”) between Emergent and KEX.  This Agreement was terminated in June 2023 by KEX after spending over US$6.7 million in exploration on the Property.  KEX is transferring these claims to Emergent as part of that Agreement.</span>\n</p>\n\n<p style='text-align:justify; '>\n<span style=''>In addition, Emergent is acquiring 368 claims (the “Additional Claims”) that were staked by KEX outside the area of influence of the Agreement.  Emergent will grant KEX a 1.0% Net Smelter Royalty (“NSR”) on the Additional Claims.  Most of these claims surround the Emma exploration target, identified by KEX as part of their 2022 exploration program (see press release dated January 26, 2023).  The northern boundary of New York Canyon is adjacent to and abutting Lahontan Gold Corporation’s (TSXV:LG) (“Lahontan”) Santa Fe Project, a past producing gold mine, being explored and advanced towards production by Lahontan.</span>\n</p>\n\n<p style='text-align:justify; '>\n<span style=''>Emergent will reimburse KEX for 2023/2024 Bureau of Land Management and Mineral County claim maintenance fees paid by KEX in September 2023 for both the Option and Additional claims no later than thirty (30) days after closing of the transaction.  </span>\n</p>\n\n<p style='text-align:justify; '>\n<span style=''>David Watkinson, President and CEO of Emergent stated, “Emergent has consolidated a major land position at the New York Canyon Property, hosting multiple copper exploration targets with a very low acquisition cost.  The Property has seen over US$6.8 million in recent exploration expenditures completed by KEX, as well as exploration completed by other past owners going back to the 1970’s. Emergent’s exploration database now includes approximately 139,000 feet (42,400 meters)t of historic drilling, 19,000 feet (5,800 meters) of recent drilling by KEX, surface mapping, alteration mapping, surface rock chip and soil sampling, and geophysics. Emergent has begun the process of searching for a new partner to advance the Property. ”   </span>\n</p>\n\n<p style='text-align:justify; '>\n<span style='font-weight:bold; '>About Emergent</span>\n</p>\n\n<p style='text-align:justify; '>\n<span style=''>Emergent is a gold and base metal exploration company focused on Nevada and Quebec. The Company’s strategy is to look for quality acquisitions, add value to these assets through exploration, and monetize them through sale, joint ventures, option, royalty, and other transactions to create value for our shareholders (an acquisition and divestiture business model). </span>\n</p>\n\n<p style='text-align:justify; '>\n<span style=''>In Nevada, Emergent’s Golden Arrow Property is an advanced stage property with a well-defined measured and indicated gold and silver resource.  The New York Canyon Property is a copper skarn, copper porphyry, and gold exploration property south of and abutting the past producing Santa Fe Gold Mine. The Mindora Property (aka West Santa Fe Property) is a gold, silver, and base metal property located twelve miles from the Santa Fe Gold Mine and optioned to Lahontan Gold Corporation (TSXV:LG). Buckskin Rawhide East is a gold and silver property leased to Rawhide Mining LLC, operators of the Rawhide Mine. Emergent also owns the Buckskin Rawhide West and Koegel Rawhide properties, two early-stage gold and silver projects located near Rawhide Mine.</span>\n</p>\n\n<p style='text-align:justify; '>\n<span style=''>In Quebec, the Casa South Property is a large gold exploration property adjacent to and south of Hecla Mining Corporation’s (NYSE:HL) operating Casa Berardi Mine with multiple exploration targets identified. The Trecesson Property, located about 50 km north of the Val d’Or mining camp, has three gold exploration targets with multiple high-grade (&gt;10 g/t) gold intercepts from historic and recent drilling.  Also in Quebec, Emergent has a 1% NSR in the Troilus North Property, part of the feasibility stage Troilus Mine Property being explored by Troilus Gold.  Emergent also has a 1% NSR in the East-West Property, owned by O3 Mining and part of their feasibility stage Marban Alliance Property.</span>\n</p>\n\n<p style='text-align:justify; '>\n<span style=''>Note that the location of Emergent’s properties adjacent to producing or past producing mines does not guarantee exploration success at Emergent’s properties or that mineral resources or reserves will be delineated. For more information on the Company, investors should review the Company’s website at </span><a href='http://www.emergentmetals.com' target='_blank'><span style=''><span style=''>www.emergentmetals.com</span></span></a><span style=''> or view the Company’s filings available at </span><a href='http://www.sedarplus.ca' target='_blank'><span style=''><span style=''>www.sedarplus.ca</span></span></a><span style=''>.</span>\n</p>\n\n<p style='text-align:center; '>\n<span style='font-weight:bold; '>On behalf of the Board of Directors</span>\n</p>\n\n<p style='text-align:center; '>\n<span style='font-weight:bold; '>David G. Watkinson, P.Eng.</span><span style=''><br />\nPresident &amp; CEO<br />\n<br />\nFor further information please contact:</span>\n</p>\n\n<p style='text-align:center; '>\n<span style=''>David G. Watkinson, P.Eng.<br />\nTel: 530-271-0679 Ext 101<br />\nEmail: </span><a href='mailto:info@emergentmetals.com' target='_blank'><span style=''><span style=''>info@emergentmetals.com</span></span></a>\n</p>\n \n<p style='text-align:justify; '>\n<span style='font-weight:bold; '>Neither TSX Venture Exchange nor its Regulation Services Provider (as the term is defined in the policies of the TSX Venture Exchange) accepts responsibility for the adequacy or accuracy of this release.</span>\n</p>\n \n<p style='text-align:justify; '>\n<span style='font-style:italic; font-weight:bold; '>Cautionary Note on Forward-Looking Statements</span>\n</p>\n \n<p style='text-align:justify; '>\n<span style=''>Certain information contained in this news release constitutes “forward-looking information” or “forward-looking statements” (collectively, “forward-looking information”). Without limiting the foregoing, such forward-looking information includes statements regarding the process and completion of the Offering, the use of proceeds of the Offering and any statements regarding the Company’s business plans, expectations and objectives. In this news release, words such as “may”, “would”, “could”, “will”, “likely”, “believe”, “expect”, “anticipate”, “intend”, “plan”, “estimate” and similar words and the negative form thereof are used to identify forward-looking information. Forward­ looking information should not be read as guarantees of future performance or results, and will not necessarily be accurate indications of whether, or the times at or by which, such future performance will be achieved. Forward-looking information is based on information available at the time and/or the Company management’s good­ faith belief with respect to future events and is subject to known or unknown risks, uncertainties, assumptions and other unpredictable factors, many of which are beyond the Company’s control. For additional information with respect to these and other factors and assumptions underlying the forward-looking information made in this news release, see the Company’s most recent Management’s Discussion and Analysis and financial statements and other documents filed by the Company with the Canadian securities commissions and the discussion of risk factors set out therein. Such documents are available at www.sedar.com under the Company’s profile and on the Company’s website at www.emergentmetals.com. The forward-looking information set forth herein reflects the Company’s expectations as at the date of this news release and is subject to change after such date. The Company disclaims any intention or obligation to update or revise any forward-looking information, whether as a result of new information, future events or otherwise, other than as required by law.</span>\n</p>\n\n</p>\n\n\n<p>Copyright (c) 2024 TheNewswire - All rights reserved.</p>\n",
    "search_terms": "New York Canyon,Emergent Metals Corp.,EMR",
    "master_gid": 3963,
    "date": "2024-01-29T14:30:00.000Z",
    "tags": "USA|Nevada,New York|||Project Acquisition",
    "image_id": null,
    "hidden": false,
    "company_id": 2286,
    "provider": null,
    "excerpt": "Vancouver, British Columbia –TheNewswire -January 29, 2024 -- Emergent Metals Corp. (&quot;Emergent&quot; or the “Company”) (TSXV:EMR)announces that it has expanded its New York Canyon Property (“New York Canyon” or the “Property” in Nevada by acquiring 634 unpatented lode claims from Kennecott Exploration Company (“KEX”).  The Property now consists of 21",
    "is_regulatory": false,
    "refined_tags": [
      "Project Acquisition"
    ],
    "ftp_filename": null,
    "company_name": "Ivanhoe Electric Inc.",
    "exchange": "TSXV",
    "root_ticker": "EMR",
    "project_name": "New York Canyon",
    "gid": 3963,
    "location": "Nevada, United States",
    "plan_id": null,
    "description_text": "Vancouver, British Columbia – TheNewswire - January 29, 2024 -- Emergent Metals Corp. (\"Emergent\" or the “Company”) (TSXV:EMR) announces that it has expanded its New York Canyon Property (“New York Canyon” or the “Property” in Nevada by acquiring 634 unpatented lode claims from Kennecott Exploration Company (“KEX”).  The Property now consists of 21 patented claims and 786 unpatented mining claims totaling about 16,000 acres (6,500 hectares).  Located about 30 miles (48 kilometers) east of Hawthorne, New York Canyon hosts copper skarn and porphyry exploration targets including Longshot Ridge, Copper Queen, Champion, and Emma. As  part of the transaction, Emergent is acquiring 266 claims (the “Option Claims”) that were staked by KEX as part of an Earn-in with Option  to Joint Venture Agreement (the “Agreement”) between Emergent and KEX.  This Agreement was terminated in June 2023 by KEX after spending over US$6.7 million in exploration on the Property.  KEX is transferring these claims to Emergent as part of that Agreement. In addition, Emergent is acquiring 368 claims (the “Additional Claims”) that were staked by KEX outside the area of influence of the Agreement.  Emergent will grant KEX a 1.0% Net Smelter Royalty (“NSR”) on the Additional Claims.  Most of these claims surround the Emma exploration target, identified by KEX as part of their 2022 exploration program (see press release dated January 26, 2023).  The northern boundary of New York Canyon is adjacent to and abutting Lahontan Gold Corporation’s (TSXV:LG) (“Lahontan”) Santa Fe Project, a past producing gold mine, being explored and advanced towards production by Lahontan. Emergent will reimburse KEX for 2023/2024 Bureau of Land Management and Mineral County claim maintenance fees paid by KEX in September 2023 for both the Option and Additional claims no later than thirty (30) days after closing of the transaction. David Watkinson, President and CEO of Emergent stated, “Emergent has consolidated a major land position at the New York Canyon Property, hosting multiple copper exploration targets with a very low acquisition cost.  The Property has seen over US$6.8 million in recent exploration expenditures completed by KEX, as well as exploration completed by other past owners going back to the 1970’s. Emergent’s exploration database now includes approximately 139,000 feet (42,400 meters)t of historic drilling, 19,000 feet (5,800 meters) of recent drilling by KEX, surface mapping, alteration mapping, surface rock chip and soil sampling, and geophysics. Emergent has begun the process of searching for a new partner to advance the Property. ” About Emergent Emergent is a gold and base metal exploration company focused on Nevada and Quebec. The Company’s strategy is to look for quality acquisitions, add value to these assets through exploration, and monetize them through sale, joint ventures, option, royalty, and other transactions to create value for our shareholders (an acquisition and divestiture business model). In Nevada, Emergent’s Golden Arrow Property is an advanced stage property with a well-defined measured and indicated gold and silver resource.  The New York Canyon Property is a copper skarn, copper porphyry, and gold exploration property south of and abutting the past producing Santa Fe Gold Mine. The Mindora Property (aka West Santa Fe Property) is a gold, silver, and base metal property located twelve miles from the Santa Fe Gold Mine and optioned to Lahontan Gold Corporation (TSXV:LG). Buckskin Rawhide East is a gold and silver property leased to Rawhide Mining LLC, operators of the Rawhide Mine. Emergent also owns the Buckskin Rawhide West and Koegel Rawhide properties, two early-stage gold and silver projects located near Rawhide Mine. In Quebec, the Casa South Property is a large gold exploration property adjacent to and south of Hecla Mining Corporation’s (NYSE:HL) operating Casa Berardi Mine with multiple exploration targets identified. The Trecesson Property, located about 50 km north of the Val d’Or mining camp, has three gold exploration targets with multiple high-grade (>10 g/t) gold intercepts from historic and recent drilling.  Also in Quebec, Emergent has a 1% NSR in the Troilus North Property, part of the feasibility stage Troilus Mine Property being explored by Troilus Gold.  Emergent also has a 1% NSR in the East-West Property, owned by O3 Mining and part of their feasibility stage Marban Alliance Property. Note that the location of Emergent’s properties adjacent to producing or past producing mines does not guarantee exploration success at Emergent’s properties or that mineral resources or reserves will be delineated. For more information on the Company, investors should review the Company’s website at www.emergentmetals.com or view the Company’s filings available at www.sedarplus.ca . On behalf of the Board of Directors David G. Watkinson, P.Eng. President & CEO For further information please contact: David G. Watkinson, P.Eng. Tel: 530-271-0679 Ext 101 Email: info@emergentmetals.com Neither TSX Venture Exchange nor its Regulation Services Provider (as the term is defined in the policies of the TSX Venture Exchange) accepts responsibility for the adequacy or accuracy of this release. Cautionary Note on Forward-Looking Statements Certain information contained in this news release constitutes “forward-looking information” or “forward-looking statements” (collectively, “forward-looking information”). Without limiting the foregoing, such forward-looking information includes statements regarding the process and completion of the Offering, the use of proceeds of the Offering and any statements regarding the Company’s business plans, expectations and objectives. In this news release, words such as “may”, “would”, “could”, “will”, “likely”, “believe”, “expect”, “anticipate”, “intend”, “plan”, “estimate” and similar words and the negative form thereof are used to identify forward-looking information. Forward­ looking information should not be read as guarantees of future performance or results, and will not necessarily be accurate indications of whether, or the times at or by which, such future performance will be achieved. Forward-looking information is based on information available at the time and/or the Company management’s good­ faith belief with respect to future events and is subject to known or unknown risks, uncertainties, assumptions and other unpredictable factors, many of which are beyond the Company’s control. For additional information with respect to these and other factors and assumptions underlying the forward-looking information made in this news release, see the Company’s most recent Management’s Discussion and Analysis and financial statements and other documents filed by the Company with the Canadian securities commissions and the discussion of risk factors set out therein. Such documents are available at www.sedar.com under the Company’s profile and on the Company’s website at www.emergentmetals.com. The forward-looking information set forth herein reflects the Company’s expectations as at the date of this news release and is subject to change after such date. The Company disclaims any intention or obligation to update or revise any forward-looking information, whether as a result of new information, future events or otherwise, other than as required by law. Copyright (c) 2024 TheNewswire - All rights reserved.",
    "primary_commodity": "Cu"
  },
  "articleProject": {
    "gid": 3963,
    "project_name": "New York Canyon",
    "location": "Nevada, United States"
  },
  "articleExchange": "TSXV",
  "articleCompanyId": 2286,
  "articleTicker": "EMR",
  "articleCompanyName": "Emergent Metals Corp.",
  "allOtherCompanyProjects": [
    {
      "company_id": 2286,
      "gid": 3963,
      "project_name": "New York Canyon",
      "location": "Nevada, United States"
    },
    {
      "company_id": 2286,
      "gid": 3976,
      "project_name": "Trecesson",
      "location": "Quebec, Canada"
    },
    {
      "company_id": 2286,
      "gid": 5596,
      "project_name": "Casa South",
      "location": "Quebec, Canada"
    }
  ],
  "allOtherCompanyNews": [
    {
      "id": 84170,
      "company_id": 2286,
      "title": "Emergent Metals Corp. Provides An Update  On Its East-West Property Royalty, Quebec",
      "link": "https://www.thenewswire.com/press-releases?id=1AG9F2jQ1",
      "date": "2025-01-15T13:50:00.000Z",
      "hidden": false
    },
    {
      "id": 84015,
      "company_id": 2286,
      "title": "Emergent Metals Corp. Provides an Update on its Troilus North Property Royalty, Quebec",
      "link": "https://www.thenewswire.com/press-releases?id=1AMqFaxXq",
      "date": "2025-01-14T13:50:00.000Z",
      "hidden": false
    },
    {
      "id": 79420,
      "company_id": 2286,
      "title": "Emergent Closes Second and Final Tranche of Private Placement",
      "link": "https://www.thenewswire.com/press-releases?id=1BglFW867",
      "date": "2024-11-19T21:35:00.000Z",
      "hidden": false
    },
    {
      "id": 78941,
      "company_id": 2286,
      "title": "Emergent Closes First Tranche of Private Placement Prepares to Close Second Tranche",
      "link": "https://www.thenewswire.com/press-releases?id=1LaPFvV9X",
      "date": "2024-11-14T21:55:00.000Z",
      "hidden": false
    },
    {
      "id": 72299,
      "company_id": 2286,
      "title": "Emergent Extends Private Placement Offering",
      "link": "https://www.thenewswire.com/press-releases?id=1AqRFn4R3",
      "date": "2024-09-24T00:05:00.000Z",
      "hidden": false
    },
    {
      "id": 68824,
      "company_id": 2286,
      "title": "Emergent Announces Private Placement",
      "link": "https://www.thenewswire.com/press-releases?id=1LaPFveGz",
      "date": "2024-08-19T20:10:00.000Z",
      "hidden": false
    },
    {
      "id": -110850,
      "company_id": 2286,
      "title": "Emergent Metals Corp. Announces AGM Voting Results",
      "link": "https://www.thenewswire.com/press-releases?id=1AD4Fl8Gb",
      "date": "2024-06-28T21:00:00.000Z",
      "hidden": false
    },
    {
      "id": 53963,
      "company_id": 2286,
      "title": "Emergent Announces Change of Transfer Agent",
      "link": "https://www.thenewswire.com/press-releases?id=1kZaFx9R2",
      "date": "2024-05-15T20:00:00.000Z",
      "hidden": false
    },
    {
      "id": 49931,
      "company_id": 2286,
      "title": "Emergent Metals Options  New York Canyon Property in Nevada to Ivanhoe Electric",
      "link": "https://www.thenewswire.com/press-releases?id=1k3wF0oR3",
      "date": "2024-03-01T14:30:00.000Z",
      "hidden": false
    },
    {
      "id": 49270,
      "company_id": 2286,
      "title": "Emergent Metals Further Expands its New York Canyon Project",
      "link": "https://www.thenewswire.com/press-releases?id=1k49Fno3N",
      "date": "2024-02-21T18:05:00.000Z",
      "hidden": false
    }
  ]
}