{
  "article": {
    "id": 47568,
    "link": "https://www.globenewswire.com/news-release/2024/01/19/2812216/0/en/NevGold-Announces-100-Acquisition-of-Nutmeg-Mountain-After-Final-Share-Issuance-Payment-To-GoldMining.html",
    "title": "NevGold Announces 100% Acquisition of Nutmeg Mountain After Final Share Issuance Payment To GoldMining",
    "description": "<p align=\"justify\">Vancouver, British Columbia, Jan.  19, 2024  (GLOBE NEWSWIRE) -- NevGold Corp. (“<strong>NevGold</strong>” or the “<strong>Company</strong>”) <strong>(TSXV:NAU) (OTCQX:NAUFF) (Frankfurt:5E50</strong>) announces the issuance (the “<strong>Share</strong> <strong>Issuance Payment</strong>”) of 10,000,000 NevGold common shares to GoldMining Inc. (TSX:GOLD, NYSE:GLDG) (“<strong>GoldMining</strong>”) pursuant to the Nutmeg Mountain Option Agreement dated June 13, 2022 (see June 14, 2022 News Release). The total Share Issuance Payment of 10,000,000 shares equates to $3.0 million issued at $0.30 per share representing the 30-day VWAP share price as of market close on December 18, 2023.<br /></p>  <p align=\"justify\"><strong>NevGold has now exercised the option under the Nutmeg Mountain Option Agreement to acquire 100% of the Nutmeg Mountain Gold Project in Washington County, Idaho</strong> (the “<strong>Project</strong>”, “<strong>Nutmeg Mountain</strong>”, see Figure 1). NevGold announced a Mineral Resource Estimate (“<strong>MRE</strong>”) at the Project on August 17, 2023 (<a href=\"https://www.globenewswire.com/Tracker?data=Qy1kgcqOnHarrhtWhK43TyCgqk51c-8AhN9Z5Sp4OJ4ce88ACYHEPzNH5LMWVcBHXOapl1Jkf5WFKyX3UWc5badGboGBRCYYgOpoYe8qc-IjN5wbUG8107uUfDyTl7Vrh1KKZVL_6miwgb8VP1RgIAsMY1WgC2FnPFVpbUY2WHgudMBn4mfM2zVDvJgrHdd2usVCgo05X2NbsiKSCAru7BKCpT-sXXrGeqIgikJPkDnPo2b_hy-iIJikCyFjqvng\" rel=\"nofollow\" target=\"_blank\" title=\"News Release Link\">News Release Link</a>) of 1,007,000 Indicated ounces of gold (51.7 Mt @ 0.61 g/t Au), and 275,000 Inferred ounces of gold (17.9 Mt @ 0.48 g/t Au) (see Note 1).</p>  <p align=\"justify\"><strong>NevGold CEO, Brandon Bonifacio, comments: </strong><em>“Completing the acquisition of 100% of Nutmeg Mountain from GoldMining is a monumental milestone for the Company. We have diligently advanced our efforts since closing the transaction on Nutmeg Mountain in August-2022. After less than 12 months of working on the project we released our initial Mineral Resource Estimate in August-2023, where we delivered an open-pit, oxide, heap-leachable gold Indicated Mineral Resource of 1.01Mozs and Inferred Mineral Resource of 275kozs. We will continue to focus our future efforts on drilling the many high priority drill targets both on the private ground and fully permitted Bureau of Land Management (“BLM”) unpatented claims to unlock further value at the Project. We are fortunate to now own 100% of one of the very few open-pit, oxide, heap-leach gold projects of scale and grade with mineralization starting at surface in the Western USA. Nutmeg Mountain’s location in Western Idaho (Washington County) also offers many benefits as it is a premier mining jurisdiction with excellent infrastructure in place, which will allow for rapid project advancement.”</em></p>  <p align=\"justify\">The Share Issuance Payment is subject to the final approval of the TSX Venture Exchange (the “<strong>Exchange</strong>”). The securities issued to GoldMining are subject to a four-month hold period ending on May 19, 2024 in accordance with applicable securities laws and the policies of the Exchange.</p>  <p align=\"justify\">GoldMining, a shareholder owning over 20% of the outstanding common shares, was issued 10,000,000 shares through the Share Issuance Payment. Prior to the closing of the Share Issuance Payment, GoldMining held, and had control and direction over, 16,670,250 common shares and 1,488,100 warrants of the Company exercisable into 1,488,100 common shares, representing approximately 20.6% of the Company’s outstanding common shares on an undiluted basis and approximately 22.1% on a partially-diluted basis assuming the exercise of the warrants held by GoldMining. On completion of the Share Issuance Payment, GoldMining holds, and has control and direction over, 26,670,250 common shares and 1,488,100 warrants, representing approximately 29.4% of the Company’s outstanding common shares on an undiluted basis and approximately 30.5% on a partially-diluted basis assuming the exercise of the warrants held by GoldMining.</p>  <p align=\"center\"><img alt=\"\" data-mce-src=\"/api/ImageRender/DownloadFile?resourceId=43b19a1b-85b7-4c7e-8fc1-b89bed3da229&amp;size=3\" height=\"378.2px\" name=\"GNW_RichHtml_IMG\" src=\"https://ml.globenewswire.com/Resource/Download/43b19a1b-85b7-4c7e-8fc1-b89bed3da229/image1.JPG\" width=\"442.83px\" /></p>  <p align=\"center\"><em>Figure 1 – Nutmeg Mountain District Map </em><a href=\"https://www.globenewswire.com/Tracker?data=Kbf7XE0XgV1THp5f3GCdoPyJyuEmX36FirHnYmOzwqfUxOk9kHSFLNsEm_fmvQMaacscpEsPlEWbsg6M3tEzphJkaa6Rm8FBPr2tqjKe_gh1sSUws4oz4gSmcIobyb_NN7dDvaqRvUOOU6s19GM6zlQvU0X1X1gxetWr2VojHTU=\" rel=\"nofollow\" target=\"_blank\" title=\"\"><em>To view image please click here</em></a></p>  <p align=\"justify\"><strong><u>Note 1: Nutmeg Mountain – 2023 Mineral Resource Estimate</u></strong><br />Details of the MRE are provided in a technical report entitled “<em>Technical Report on the Nutmeg Gold Property</em>” with an effective date of June 22, 2023, prepared in accordance with National Instrument 43-101 (“<strong>NI 43-101</strong>”) standards, which is filed under the Company’s SEDAR+ profile.</p> <table align=\"center\" style=\"border-top: solid black 1pt ; border-right: solid black 1pt ; border-bottom: solid black 1pt ; border-left: solid black 1pt ; border-collapse: collapse; width:100%; border-collapse:collapse ;\"><tr><td style=\"border-top: solid black 1pt ; border-right: solid black 1pt ; border-bottom: solid black 1pt ; border-left: solid black 1pt ; text-align: center ;  vertical-align: middle; vertical-align: middle ; \"><strong>Classification</strong></td><td style=\"border-top: solid black 1pt ; border-right: solid black 1pt ; border-bottom: solid black 1pt ; border-left: solid black 1pt ; text-align: center ;  vertical-align: middle; vertical-align: middle ; \"><strong>Cutoff Grade (g/t)</strong></td><td style=\"border-top: solid black 1pt ; border-right: solid black 1pt ; border-bottom: solid black 1pt ; border-left: solid black 1pt ; text-align: center ;  vertical-align: middle; vertical-align: middle ; \"><strong>Tonnes</strong></td><td style=\"border-top: solid black 1pt ; border-right: solid black 1pt ; border-bottom: solid black 1pt ; border-left: solid black 1pt ; text-align: center ;  vertical-align: middle; vertical-align: middle ; \"><strong>Gold Grade (g/t)</strong></td><td style=\"border-top: solid black 1pt ; border-right: solid black 1pt ; border-bottom: solid black 1pt ; border-left: solid black 1pt ; text-align: center ;  vertical-align: middle; vertical-align: middle ; \"><strong>Ounces Gold</strong></td></tr><tr><td style=\"border-top: solid black 1pt ; border-right: solid black 1pt ; border-bottom: solid black 1pt ; border-left: solid black 1pt ; text-align: center ;  vertical-align: middle; vertical-align: middle ; \">Indicated</td><td style=\"border-top: solid black 1pt ; border-right: solid black 1pt ; border-bottom: solid black 1pt ; border-left: solid black 1pt ; text-align: center ;  vertical-align: middle; vertical-align: middle ; \">0.30</td><td style=\"border-top: solid black 1pt ; border-right: solid black 1pt ; border-bottom: solid black 1pt ; border-left: solid black 1pt ; text-align: center ;  vertical-align: middle; vertical-align: middle ; \">51,660,000</td><td style=\"border-top: solid black 1pt ; border-right: solid black 1pt ; border-bottom: solid black 1pt ; border-left: solid black 1pt ; text-align: center ;  vertical-align: middle; vertical-align: middle ; \"><strong>0.61</strong></td><td style=\"border-top: solid black 1pt ; border-right: solid black 1pt ; border-bottom: solid black 1pt ; border-left: solid black 1pt ; text-align: right ;  vertical-align: middle; vertical-align: middle ; \"><strong>1,006,000</strong></td></tr><tr><td style=\"border-top: solid black 1pt ; border-right: solid black 1pt ; border-bottom: solid black 1pt ; border-left: solid black 1pt ; text-align: center ;  vertical-align: middle; vertical-align: middle ; \">Inferred</td><td style=\"border-top: solid black 1pt ; border-right: solid black 1pt ; border-bottom: solid black 1pt ; border-left: solid black 1pt ; text-align: center ;  vertical-align: middle; vertical-align: middle ; \">0.30</td><td style=\"border-top: solid black 1pt ; border-right: solid black 1pt ; border-bottom: solid black 1pt ; border-left: solid black 1pt ; text-align: center ;  vertical-align: middle; vertical-align: middle ; \">17,860,000</td><td style=\"border-top: solid black 1pt ; border-right: solid black 1pt ; border-bottom: solid black 1pt ; border-left: solid black 1pt ; text-align: center ;  vertical-align: middle; vertical-align: middle ; \"><strong>0.48</strong></td><td style=\"border-top: solid black 1pt ; border-right: solid black 1pt ; border-bottom: solid black 1pt ; border-left: solid black 1pt ; text-align: right ;  vertical-align: middle; vertical-align: middle ; \"><strong>275,000</strong></td></tr></table> <p align=\"left\">Notes:</p>  <ol style=\"list-style-type:decimal;\"><li style=\"text-align:justify;\">Effective date of this mineral resource estimate is June 22, 2023.</li><li style=\"text-align:justify;\">All mineral resources have been estimated in accordance with Canadian Institute of Mining, Metallurgy and Petroleum definitions, as required under NI 43-101. The Mineral Resource Statement was prepared by Greg Mosher, P. Geo (Global Mineral Resource Services, “<strong>GMRS</strong>”) in accordance with NI 43-101.</li><li style=\"text-align:justify;\">Mineral Resources reported demonstrate a reasonable prospect of eventual economic extraction, as required under NI 43-101. Mineral Resources are not Mineral Reserves and do not have demonstrated economic viability. There is no certainty that all or any part of the estimated Mineral Resources will be converted into Mineral Reserves. The potential development of the Mineral Resources may be materially affected by environmental, permitting, legal, marketing, and other relevant issues.</li><li style=\"text-align:justify;\">Mineral Resources are reported at a cut-off grade of 0.30 g/t Au for an open-pit mining scenario. Cut-off grades are based on a price of US$1750/oz gold, and a number of operating cost and recovery assumptions, including a reasonable contingency factor. Metallurgical recoveries of 80% were used. Densities based on lithology were assigned.</li><li style=\"text-align:justify;\">Ounce (troy) = metric tonnes x grade / 31.10348. All numbers have been rounded to reflect the relative accuracy of the estimate.</li><li style=\"text-align:justify;\">The quantity and grade of reported Inferred Mineral Resources are uncertain in nature and there has not been sufficient work to define these Inferred Mineral Resources as Indicated or Measured Mineral Resources. It is reasonably expected that many of the Inferred Mineral Resources could be upgraded to Indicated Mineral Resources with continued exploration, however, there is no assurance that further exploration will result in all or any part of the Inferred Mineral Resources being converted into Indicated Mineral Resources.</li><li style=\"text-align:justify;\">Tonnages and ounces in the tables are rounded to the nearest thousand and hundred, respectively. Numbers may not total due to rounding.<br /><br /></li></ol>  <p align=\"left\"><strong>ON BEHALF OF THE BOARD</strong></p>  <p align=\"left\"><strong><em>“Signed”</em></strong></p>  <p align=\"left\"><strong>Brandon Bonifacio, President &amp; CEO </strong></p>  <p align=\"left\">For further information, please contact Brandon Bonifacio at bbonifacio@nev-gold.com, call 604-337-4997, or visit our website at <a href=\"https://www.globenewswire.com/Tracker?data=atFTCERntVeASBr5IjUB9Rab4LI1JUJnBtRKzrCypuImkkP0FZL--LYiHCq_U_IlWFidiH7c-xyG9mjh3NWJxQ==\" rel=\"nofollow\" target=\"_blank\" title=\"www.nev-gold.com\">www.nev-gold.com</a>.</p>  <p align=\"left\"><strong><u>About the Company</u></strong><br />NevGold is an exploration and development company targeting large-scale mineral systems in the proven districts of Nevada and Idaho. NevGold owns a 100% interest in the Limousine Butte and Cedar Wash gold projects in Nevada and the Nutmeg Mountain gold project in Idaho.</p>  <p align=\"justify\"><strong>Neither the TSX Venture Exchange nor its Regulation Services Provider (as that term is defined in the policies of the TSX Venture Exchange) accepts responsibility for the adequacy or accuracy of this release.</strong></p>  <p align=\"center\"><strong><em>Cautionary Note Regarding Forward Looking Statements</em></strong></p>  <p align=\"justify\"><em>This news release contains forward-looking statements that are based on the Company’s current expectations and estimates. Forward-looking statements are frequently characterized by words such as “plan”, “expect”, “project”, “intend”, “believe”, “anticipate”, “estimate”, “suggest”, “indicate” and other similar words or statements that certain events or conditions “may” or “will” occur. Forward-looking statements include, but are not limited to, the final approval of the Exchange to the Share Issuance Payment and further exploration and development work on the Nutmeg Mountain project, estimates of mineral resources, and the potential upgrade of inferred mineral resources to indicated mineral resources. Such forward-looking statements involve known and unknown risks, uncertainties and other factors that could cause actual events or results to differ materially from estimated or anticipated events or results implied or expressed in such forward-looking statements. Such risks include, but are not limited to, general economic, market and business conditions, and the ability to obtain all necessary regulatory approvals. There is some risk that the forward-looking statements will not prove to be accurate, that the management’s assumptions may not be correct or that actual results may differ materially from such forward-looking statements. Accordingly, readers should not place undue reliance on the forward-looking statements. Any forward-looking statement speaks only as of the date on which it is made and, except as may be required by applicable securities laws, the Company disclaims any intent or obligation to update any forward-looking statement, whether as a result of new information, future </em><em>events or results or otherwise. Forward-looking statements are not guarantees of future performance and accordingly undue reliance should not be put on such statements due to the inherent uncertainty therein.</em></p>  <p />  <br /><img src='https://ml.globenewswire.com/media/NmFhMWY4NjctN2Q1My00N2EwLWJjOTktM2JkYWVlZTRiYjQwLTUwMDAyNDM2Nw==/tiny/NevGold-Corp-.png' referrerpolicy='no-referrer-when-downgrade' />",
    "search_terms": "Nutmeg Mountain,Nevgold Corp.,NAU",
    "master_gid": 4229,
    "date": "2024-01-19T11:30:00.000Z",
    "tags": "|||Gold|Project Acquisition",
    "image_id": null,
    "hidden": false,
    "company_id": 23,
    "provider": null,
    "excerpt": "Vancouver, British Columbia, Jan.  19, 2024  (GLOBE NEWSWIRE) -- NevGold Corp. (“NevGold” or the “Company”)(TSXV:NAU) (OTCQX:NAUFF) (Frankfurt:5E50) announces the issuance (the “ShareIssuance Payment”) of 10,000,000 NevGold common shares to GoldMining Inc. (TSX:GOLD, NYSE:GLDG) (“GoldMining”) pursuant to the Nutmeg Mountain Option Agreement dated June 13, 2022 (see June 14,",
    "is_regulatory": false,
    "refined_tags": [
      "Project Acquisition"
    ],
    "ftp_filename": null,
    "company_name": "Nevgold Corp.",
    "exchange": "TSXV",
    "root_ticker": "NAU",
    "project_name": "Nutmeg Mountain",
    "gid": 4229,
    "location": "Idaho, United States",
    "plan_id": null,
    "description_text": "Vancouver, British Columbia, Jan.  19, 2024  (GLOBE NEWSWIRE) -- NevGold Corp. (“ NevGold ” or the “ Company ”) (TSXV:NAU) (OTCQX:NAUFF) (Frankfurt:5E50 ) announces the issuance (the “ Share Issuance Payment ”) of 10,000,000 NevGold common shares to GoldMining Inc. (TSX:GOLD, NYSE:GLDG) (“ GoldMining ”) pursuant to the Nutmeg Mountain Option Agreement dated June 13, 2022 (see June 14, 2022 News Release). The total Share Issuance Payment of 10,000,000 shares equates to $3.0 million issued at $0.30 per share representing the 30-day VWAP share price as of market close on December 18, 2023. NevGold has now exercised the option under the Nutmeg Mountain Option Agreement to acquire 100% of the Nutmeg Mountain Gold Project in Washington County, Idaho (the “ Project ”, “ Nutmeg Mountain ”, see Figure 1). NevGold announced a Mineral Resource Estimate (“ MRE ”) at the Project on August 17, 2023 ( News Release Link ) of 1,007,000 Indicated ounces of gold (51.7 Mt @ 0.61 g/t Au), and 275,000 Inferred ounces of gold (17.9 Mt @ 0.48 g/t Au) (see Note 1). NevGold CEO, Brandon Bonifacio, comments: “Completing the acquisition of 100% of Nutmeg Mountain from GoldMining is a monumental milestone for the Company. We have diligently advanced our efforts since closing the transaction on Nutmeg Mountain in August-2022. After less than 12 months of working on the project we released our initial Mineral Resource Estimate in August-2023, where we delivered an open-pit, oxide, heap-leachable gold Indicated Mineral Resource of 1.01Mozs and Inferred Mineral Resource of 275kozs. We will continue to focus our future efforts on drilling the many high priority drill targets both on the private ground and fully permitted Bureau of Land Management (“BLM”) unpatented claims to unlock further value at the Project. We are fortunate to now own 100% of one of the very few open-pit, oxide, heap-leach gold projects of scale and grade with mineralization starting at surface in the Western USA. Nutmeg Mountain’s location in Western Idaho (Washington County) also offers many benefits as it is a premier mining jurisdiction with excellent infrastructure in place, which will allow for rapid project advancement.” The Share Issuance Payment is subject to the final approval of the TSX Venture Exchange (the “ Exchange ”). The securities issued to GoldMining are subject to a four-month hold period ending on May 19, 2024 in accordance with applicable securities laws and the policies of the Exchange. GoldMining, a shareholder owning over 20% of the outstanding common shares, was issued 10,000,000 shares through the Share Issuance Payment. Prior to the closing of the Share Issuance Payment, GoldMining held, and had control and direction over, 16,670,250 common shares and 1,488,100 warrants of the Company exercisable into 1,488,100 common shares, representing approximately 20.6% of the Company’s outstanding common shares on an undiluted basis and approximately 22.1% on a partially-diluted basis assuming the exercise of the warrants held by GoldMining. On completion of the Share Issuance Payment, GoldMining holds, and has control and direction over, 26,670,250 common shares and 1,488,100 warrants, representing approximately 29.4% of the Company’s outstanding common shares on an undiluted basis and approximately 30.5% on a partially-diluted basis assuming the exercise of the warrants held by GoldMining. Figure 1 – Nutmeg Mountain District Map To view image please click here Note 1: Nutmeg Mountain – 2023 Mineral Resource Estimate Details of the MRE are provided in a technical report entitled “ Technical Report on the Nutmeg Gold Property ” with an effective date of June 22, 2023, prepared in accordance with National Instrument 43-101 (“ NI 43-101 ”) standards, which is filed under the Company’s SEDAR+ profile. Classification Cutoff Grade (g/t) Tonnes Gold Grade (g/t) Ounces Gold Indicated 0.30 51,660,000 0.61 1,006,000 Inferred 0.30 17,860,000 0.48 275,000 Notes: Effective date of this mineral resource estimate is June 22, 2023. All mineral resources have been estimated in accordance with Canadian Institute of Mining, Metallurgy and Petroleum definitions, as required under NI 43-101. The Mineral Resource Statement was prepared by Greg Mosher, P. Geo (Global Mineral Resource Services, “ GMRS ”) in accordance with NI 43-101. Mineral Resources reported demonstrate a reasonable prospect of eventual economic extraction, as required under NI 43-101. Mineral Resources are not Mineral Reserves and do not have demonstrated economic viability. There is no certainty that all or any part of the estimated Mineral Resources will be converted into Mineral Reserves. The potential development of the Mineral Resources may be materially affected by environmental, permitting, legal, marketing, and other relevant issues. Mineral Resources are reported at a cut-off grade of 0.30 g/t Au for an open-pit mining scenario. Cut-off grades are based on a price of US$1750/oz gold, and a number of operating cost and recovery assumptions, including a reasonable contingency factor. Metallurgical recoveries of 80% were used. Densities based on lithology were assigned. Ounce (troy) = metric tonnes x grade / 31.10348. All numbers have been rounded to reflect the relative accuracy of the estimate. The quantity and grade of reported Inferred Mineral Resources are uncertain in nature and there has not been sufficient work to define these Inferred Mineral Resources as Indicated or Measured Mineral Resources. It is reasonably expected that many of the Inferred Mineral Resources could be upgraded to Indicated Mineral Resources with continued exploration, however, there is no assurance that further exploration will result in all or any part of the Inferred Mineral Resources being converted into Indicated Mineral Resources. Tonnages and ounces in the tables are rounded to the nearest thousand and hundred, respectively. Numbers may not total due to rounding. ON BEHALF OF THE BOARD “Signed” Brandon Bonifacio, President & CEO For further information, please contact Brandon Bonifacio at bbonifacio@nev-gold.com, call 604-337-4997, or visit our website at www.nev-gold.com . About the Company NevGold is an exploration and development company targeting large-scale mineral systems in the proven districts of Nevada and Idaho. NevGold owns a 100% interest in the Limousine Butte and Cedar Wash gold projects in Nevada and the Nutmeg Mountain gold project in Idaho. Neither the TSX Venture Exchange nor its Regulation Services Provider (as that term is defined in the policies of the TSX Venture Exchange) accepts responsibility for the adequacy or accuracy of this release. Cautionary Note Regarding Forward Looking Statements This news release contains forward-looking statements that are based on the Company’s current expectations and estimates. Forward-looking statements are frequently characterized by words such as “plan”, “expect”, “project”, “intend”, “believe”, “anticipate”, “estimate”, “suggest”, “indicate” and other similar words or statements that certain events or conditions “may” or “will” occur. Forward-looking statements include, but are not limited to, the final approval of the Exchange to the Share Issuance Payment and further exploration and development work on the Nutmeg Mountain project, estimates of mineral resources, and the potential upgrade of inferred mineral resources to indicated mineral resources. Such forward-looking statements involve known and unknown risks, uncertainties and other factors that could cause actual events or results to differ materially from estimated or anticipated events or results implied or expressed in such forward-looking statements. Such risks include, but are not limited to, general economic, market and business conditions, and the ability to obtain all necessary regulatory approvals. There is some risk that the forward-looking statements will not prove to be accurate, that the management’s assumptions may not be correct or that actual results may differ materially from such forward-looking statements. Accordingly, readers should not place undue reliance on the forward-looking statements. Any forward-looking statement speaks only as of the date on which it is made and, except as may be required by applicable securities laws, the Company disclaims any intent or obligation to update any forward-looking statement, whether as a result of new information, future events or results or otherwise. Forward-looking statements are not guarantees of future performance and accordingly undue reliance should not be put on such statements due to the inherent uncertainty therein.",
    "primary_commodity": "Au"
  },
  "articleProject": {
    "gid": 4229,
    "project_name": "Nutmeg Mountain",
    "location": "Idaho, United States"
  },
  "articleExchange": "TSXV",
  "articleCompanyId": 23,
  "articleTicker": "NAU",
  "articleCompanyName": "Nevgold Corp.",
  "allOtherCompanyProjects": [
    {
      "company_id": 23,
      "gid": 3013,
      "project_name": "Limousine Butte",
      "location": "Nevada, United States"
    },
    {
      "company_id": 23,
      "gid": 385,
      "project_name": "Ptarmigan",
      "location": "British Columbia, Canada"
    },
    {
      "company_id": 23,
      "gid": 4229,
      "project_name": "Nutmeg Mountain",
      "location": "Idaho, United States"
    },
    {
      "company_id": 23,
      "gid": 4695,
      "project_name": "Cedar Wash",
      "location": "Nevada, United States"
    },
    {
      "company_id": 23,
      "gid": 6637,
      "project_name": "Zeus",
      "location": "Idaho, United States"
    }
  ],
  "allOtherCompanyNews": [
    {
      "id": 107781,
      "company_id": 23,
      "title": "NevGold Extends Oxide Gold-Antimony Mineralization Over 1.7 Kilometers at Cadillac Valley Target: 2.28 g/t AuEq Over 30.5 Meters (1.29 g/t Au And 0.22% Antimony) Within 1.61 g/t AuEq Over 61.0 Meters (1.08 g/t Au And 0.12% Antimony)",
      "link": null,
      "date": "2025-06-12T10:00:00.000Z",
      "hidden": false
    },
    {
      "id": 106989,
      "company_id": 23,
      "title": "NevGold Adds More Significant Oxide Gold-Antimony Results:  7.04 g/t AuEq Over 15.2 Meters (6.37 g/t Au And 0.15% Antimony) Within 4.14 g/t AuEq Over 29.0 Meters (3.56 g/t Au And 0.13% Antimony), and Expands Gold-Antimony Mineralization Over 400 Meters Along Strike at the Limousine Butte Project, Nevada",
      "link": null,
      "date": "2025-06-04T21:36:35.000Z",
      "hidden": false
    },
    {
      "id": 106825,
      "company_id": 23,
      "title": "NevGold Adds More Significant Oxide Gold-Antimony Results: 1.47 g/t AuEq Over 74.7 Meters (0.23% Antimony And 0.45 g/t Au), Including 3.59 g/t AuEq Over 18.2 Meters (0.60% Antimony And 0.92 g/t Au), and Also Including 4.61 g/t AuEq Over 6.0 Meters (0.96% Antimony And 0.31 g/t Au) at the Limousine Butte Project, Nevada ",
      "link": null,
      "date": "2025-06-03T20:15:00.000Z",
      "hidden": false
    },
    {
      "id": 106286,
      "company_id": 23,
      "title": "NevGold Announces Closing of Upsized C$6.0M Brokered Private Placement Financing",
      "link": null,
      "date": "2025-05-29T18:49:18.000Z",
      "hidden": false
    },
    {
      "id": 105901,
      "company_id": 23,
      "title": "NevGold Announces Upsize to C$6M Brokered Private Placement Financing",
      "link": null,
      "date": "2025-05-27T12:00:30.000Z",
      "hidden": false
    },
    {
      "id": 105498,
      "company_id": 23,
      "title": "NevGold Announces Upsize to C$5.5M Brokered Private Placement Financing",
      "link": null,
      "date": "2025-05-22T12:00:19.000Z",
      "hidden": false
    },
    {
      "id": 104810,
      "company_id": 23,
      "title": "NevGold Announces C$5M Brokered Private Placement Financing",
      "link": null,
      "date": "2025-05-15T12:52:25.000Z",
      "hidden": false
    },
    {
      "id": 104478,
      "company_id": 23,
      "title": "NEVGOLD ADDS MORE SIGNIFICANT OXIDE GOLD-ANTIMONY RESULTS:  2.19 G/T AUEQ OVER 64.0 METERS (0.72 G/T AU AND 0.33% ANTIMONY), INCLUDING 4.17 G/T AUEQ OVER 24.1 METERS (1.47 G/T AU AND 0.60% ANTIMONY), AND ALSO INCLUDING 10.86 G/T AUEQ OVER 4.50 METERS (1.43 G/T AU AND 2.10% ANTIMONY) AT THE LIMOUSINE BUTTE PROJECT, NEVADA",
      "link": null,
      "date": "2025-05-13T12:00:00.000Z",
      "hidden": false
    },
    {
      "id": 100824,
      "company_id": 23,
      "title": "NevGold Discovers More Significant Oxide Gold-Antimony Results:  2.11 g/t AuEq Over 67.1 Meters (1.30 g/t Au And 0.18% Antimony), Including 4.29 g/t AuEq Over 30.5 Meters (2.79 g/t Au And 0.33% Antimony), and Also Including 7.12 g/t AuEq Over 16.8 Meters (5.05 g/t Au And 0.46% Antimony) at the Limousine Butte Project, Nevada",
      "link": null,
      "date": "2025-04-24T12:00:00.000Z",
      "hidden": false
    },
    {
      "id": 103042,
      "company_id": 23,
      "title": "NEVGOLD DISCOVERS MORE SIGNIFICANT OXIDE GOLD-ANTIMONY RESULTS AT THE LIMOUSINE BUTTE PROJECT, NEVADA",
      "link": "https://app.quotemedia.com/data/downloadFiling?webmasterId=104408&ref=680a28662b557f7b15251b91&type=PDFC&formType=002-002-001089-003001&formDescription=News+release&dateFiled=2025-04-24",
      "date": "2025-04-24T05:02:46.000Z",
      "hidden": false
    }
  ]
}
