{
  "article": {
    "id": 91413,
    "link": null,
    "title": "Fairchild Gold Corp Announces Successful Completion of Transaction with Koba Resources Ltd.",
    "description": "<p>Vancouver, British Columbia--(Newsfile Corp. - March 14, 2025) - Fairchild Gold Corp (<b>TSXV: FAIR</b>) (\"<b>Fairchild</b>\" or the \"<b>Company</b>\") is pleased to announce that its previously announced transaction disclosed on February 11, 2025, with Koba Resources Ltd. (\"<b>Koba</b>\"), has successfully completed on March 12, 2025.</p><p><u><b>Strategic Acquisition Completed</b></u></p><p>Having secured all necessary approvals and with all conditions satisfied, the Company's transaction with Koba has been completed.  Fairchild has begun the process of integrating the extensive database received through this acquisition, which includes thousands of rock and soil samples as well as geophysical surveys.</p><p>\"This is a significant acquisition for Fairchild,\" said Luis Martins, Chief Executive Officer of Fairchild Gold Corp. \"The completion of this transaction represents an important milestone in our growth strategy and positions us as the dominant claim holder in the historic Goodsprings mining district.  The acquired database which covers most of our enlarged and consolidated claim package will allow the company to collapse the timeframe it originally anticipated would be required prior to drilling.\"</p><p><u><b>Expanded Land Position</b></u></p><p>With the completion of this transaction, Fairchild's Copper Chief Project now covers a total of 300+ claims, spanning approximately 6150 acres in the Goodsprings mining district of Nevada. This substantial land package consolidates a significant portion of this historically productive region.</p><p><a href=\"https://api.newsfilecorp.com/redirect/1p4YDSVYwe\">See FIGURE#1: Map of Fairchild Gold's Koba Acquisition</a></p><p><u><b>DATA PACKAGE</b></u></p><p>Fairchild Gold received a substantial package of historical geological, geochemical, and geophysical data from Koba Resources that were summarized in an analyst's publicly disclosed report by Ian Spence of Peloton Capital Pty Ltd. dated June 7, 2022.  These data were originally acquired from work conducted by Koba's predecessor company New World Resources, starting in 2019. This work was conducted by geologists and geophysicists who were qualified persons as defined by Instrument NI 43-101, and Fairchild Gold is confident that this historical work and these historical data and descriptive maps and interpretive summaries are of high quality and are an accurate representation of the work conducted by Koba and New World Resources.</p><p><b>Historic Goodsprings Data Highlights: </b></p><ul><li><p><b>1361 Rock samples </b>and<b> 2653 Soil samples </b></p></li><li><p><b>Copper Assays</b>: up to <i><b>25% Copper</b></i> in multiple locations. Confirming <i><b>Copperside Mine</b></i> anomaly. (Sample PS0014) Top 25 sample average <i><b>13.7 %</b></i></p></li><li><p><i><b>Gold Assays:</b></i> Up to <i><b>151 g/t</b></i> (sample 2645) Top 25 sample average <i><b>18.11 ppm</b></i></p></li><li><p><i><b>Silver Assays:</b></i> Up to <i>1565 g/t</i> (sample 212) Top 25 sample average <i><b>651.2 ppm</b></i></p></li><li><p><i><b>Cobalt Assays:</b></i> Up to <i>5.9 %</i> (sample PS0004)</p></li><li><p><i><b>Lead Assays:</b></i> Up to <i>40%</i> (Sample RLGS-6)</p></li><li><p><i><b>Zinc Assays:</b></i> Up to <i>30%</i> (Sample 9378)</p></li><li><p><i><b>Antimony Assays:</b></i> Up to <i>9104.4 g/t</i> (Sample GS09RW-45)</p></li></ul><p><b>IP/Mag surveys</b>:</p><p><a href=\"https://api.newsfilecorp.com/redirect/AMpQOSwj4b\">See Figure 2: ZONGE IP Survey (~2019)</a></p><p>These data will be carefully analysed and, in some cases, reprocessed, giving a much more robust basis for preparation of the next exploration steps. Updates will be coming soon.</p><p><u><b>Next Phases of Exploration</b></u></p><ol style=\"list-style-type: upper-roman;\"><li><i>Comprehensive review and integration of the newly acquired database</i></li><li><i>Detailed geological mapping and innovative geophysical surveys to rank numerous high-priority targets already identified</i></li><li><i>Targeted drill program</i></li></ol><p><i>\"We are extremely excited about the potential of the Copper Chief Project and the broader Goodsprings district, The historical production in this area only scratched the surface. Modern exploration techniques, combined with our large, consolidated land position and comprehensive database, give us a unique opportunity to unlock substantial value for our shareholders.\" -Luis Martins (CEO).</i></p><p><b>The Company believes the Goodsprings district has the potential to host a large-scale, district-wide mineral system with multiple deposit types, including:</b></p><ul><li><p><i>High-grade copper-lead-zinc carbonate replacement deposits</i></p></li><li><p><i>Structurally controlled precious and PGE metal veins</i></p></li><li><p><i>Potential for porphyry copper-gold-related mineralization </i></p></li></ul><p>Fairchild's strategic position in this historically productive yet underexplored district represents a compelling opportunity to make significant discoveries using modern exploration techniques.</p><p><u><b>Annual General and Special Meeting Results</b></u></p><p>The Company is also pleased to announce the voting results of its annual general and special meeting (the \"<b>Meeting</b>\") of its shareholders (\"<b>Shareholders</b>\") held on February 26, 2025. Shareholders holding 17,071,085 shares or 23.15% of the outstanding shares of the Company were represented in person or by proxy at the Meeting. The Shareholders received the financial statements for the years ended August 31, 2024, August 31, 2023, August 31, 2022 and August 31, 2021 together with the auditor's Reports. As nominated by the Company's management information circular dated January 23, 2025, the shareholders elected Luis Martins, Robert Rosner, Geoffrey Baker, and Diane Mann as directors of the Company for the ensuing year. </p><p>The shareholders also voted to appoint Manning Elliott LLP as auditors of the Company to hold office until the close of the next annual general meeting and approved the Company's new equity incentive plan (the \"<b>Incentive Plan</b>\"). The Incentive Plan is a 10% rolling plan in respect of options and a 10% fixed plan in respect of restricted share units. </p><p>Finally, the shareholders approved the resolution to amend the Company's name to \"Fairchild Copper &#38; Gold Corp.\" as authorized by the board of directors of the Company, acceptable to the TSX Venture Exchange and applicable regulatory authorities.</p><p><u><b>QP statement</b></u></p><p>Richard R. Redfern, MS, CPG No. 10717, and Consulting Geologist for Fairchild, is the qualified person as defined by National Instrument 43-101 who has examined the Copper Chief property on the ground numerous times since 2003 and reviewed the geological information available from private and public sources related to the property and is responsible for approving the technical contents of this press release.  </p><p><u><b>About Fairchild Gold Corp</b></u></p><p>Fairchild Gold Corp is a mineral exploration company focused on acquiring, exploring, and developing high-quality mineral properties in mining-friendly jurisdictions. The Company's flagship Copper Chief Project is in the historic Goodsprings mining district in Nevada, USA.</p><div id=\"contactInfo\"><p>For more information, please contact:</p><p>Luis Martins<br />Director and Chief Executive Officer<br />Fairchild Gold Corp.<br />(866) 497-0284<br /><a href=\"mailto:info@fairchildgold.com\"><b>info@fairchildgold.com</b></a></p><p><b>or visit us @</b><br /><a href=\"https://api.newsfilecorp.com/redirect/ZAJ7rUxNbY\"><b>www.fairchildgold.com</b></a></p></div><p><u><b>Forward-Looking Statements</b></u></p><p>This press release contains forward-looking statements and forward-looking information (collectively, \"forward-looking statements\") within the meaning of applicable securities laws. Any statements that are contained in this press release that are not statements of historical fact may be deemed to be forward-looking statements. Forward-looking statements are often identified by terms such as \"may\", \"should\", \"anticipate\", \"will\", \"estimates\", \"believes\", \"intends\", \"expects\" and similar expressions which are intended to identify forward-looking statements. More particularly and without limitation, this press release contains forward-looking statements concerning the exploration and development potential of the Copper Chief Project. Forward-looking statements are inherently uncertain, and the actual performance may be affected by a number of material factors, assumptions and expectations, many of which are beyond the control of the Company. Readers are cautioned that assumptions used in the preparation of any forward-looking statements may prove to be incorrect. Events or circumstances may cause actual results to differ materially from those predicted as a result of numerous known and unknown risks, uncertainties and other factors, many of which are beyond the control of the Company. Readers are further cautioned not to place undue reliance on any forward-looking statements, as such information, although considered reasonable by management at the time of preparation, may prove to be incorrect and actual results may differ materially from those anticipated.</p><p>Neither the TSX Venture Exchange nor its Regulation Services Provider (as that term is defined in the policies of the TSX Venture Exchange) accepts responsibility for the adequacy or accuracy of this release.</p><p style=\"text-align: center;\">NOT FOR DISTRIBUTION TO UNITED STATES NEWS WIRE SERVICES OR FOR DISSEMINATION IN THE UNITED STATES.</p><p id=\"corporateNewsLogoContainer\"><img src=\"https://images.newsfilecorp.com/files/10593/244592_52efe127f45fa84f_logo.jpg\" id=\"corporateNewsLogo\" alt=\"Corporate Logo\" /></p><p id=\"corporateLinkBack\">To view the source version of this press release, please visit <a href=\"https://api.newsfilecorp.com/redirect/arL0GUwyX8\">https://www.newsfilecorp.com/release/244592</a></p><p><img src=\"https://api.newsfilecorp.com/newsinfo/244592/401\" alt=\"\" /></p>",
    "search_terms": "Goodsprings,Fairchild Gold Corp.,FAIR",
    "master_gid": 9807,
    "date": "2025-03-14T16:43:00.000Z",
    "tags": "USA|Nevada||Copper,Gold|Project Acquisition",
    "image_id": null,
    "hidden": false,
    "company_id": 1303,
    "provider": "newsfilecorp",
    "excerpt": "Vancouver, British Columbia--(Newsfile Corp. - March 14, 2025) - Fairchild Gold Corp (TSXV: FAIR) (\"Fairchild\" or the \"Company\") is pleased to announce that its previously announced transaction disclosed on February 11, 2025, with Koba Resources Ltd. (\"Koba\"), has successfully completed on March 12, 2025. Strategic Acquisition Completed Having secured all necessary approvals and with all conditions satisfied, the Company's transaction with Koba has been completed. Fairchild has begun the process of integrating the extensive database received through this acquisition, which includes thousands of rock and soil samples as well as geophysical surveys. \"This is a significant acquisition for Fairchild,\" said",
    "is_regulatory": false,
    "refined_tags": [
      "Exploration Update",
      "Geophysical Survey"
    ],
    "ftp_filename": "NEWSFILE-244592-401",
    "company_name": "Fairchild Gold Corp.",
    "exchange": "TSXV",
    "root_ticker": "FAIR",
    "project_name": "Goodsprings",
    "gid": 9807,
    "location": "Nevada, United States",
    "plan_id": null,
    "description_text": "Vancouver, British Columbia--(Newsfile Corp. - March 14, 2025) - Fairchild Gold Corp ( TSXV: FAIR ) (\" Fairchild \" or the \" Company \") is pleased to announce that its previously announced transaction disclosed on February 11, 2025, with Koba Resources Ltd. (\" Koba \"), has successfully completed on March 12, 2025. Strategic Acquisition Completed Having secured all necessary approvals and with all conditions satisfied, the Company's transaction with Koba has been completed.  Fairchild has begun the process of integrating the extensive database received through this acquisition, which includes thousands of rock and soil samples as well as geophysical surveys. \"This is a significant acquisition for Fairchild,\" said Luis Martins, Chief Executive Officer of Fairchild Gold Corp. \"The completion of this transaction represents an important milestone in our growth strategy and positions us as the dominant claim holder in the historic Goodsprings mining district.  The acquired database which covers most of our enlarged and consolidated claim package will allow the company to collapse the timeframe it originally anticipated would be required prior to drilling.\" Expanded Land Position With the completion of this transaction, Fairchild's Copper Chief Project now covers a total of 300+ claims, spanning approximately 6150 acres in the Goodsprings mining district of Nevada. This substantial land package consolidates a significant portion of this historically productive region. See FIGURE#1: Map of Fairchild Gold's Koba Acquisition DATA PACKAGE Fairchild Gold received a substantial package of historical geological, geochemical, and geophysical data from Koba Resources that were summarized in an analyst's publicly disclosed report by Ian Spence of Peloton Capital Pty Ltd. dated June 7, 2022.  These data were originally acquired from work conducted by Koba's predecessor company New World Resources, starting in 2019. This work was conducted by geologists and geophysicists who were qualified persons as defined by Instrument NI 43-101, and Fairchild Gold is confident that this historical work and these historical data and descriptive maps and interpretive summaries are of high quality and are an accurate representation of the work conducted by Koba and New World Resources. Historic Goodsprings Data Highlights: 1361 Rock samples and 2653 Soil samples Copper Assays : up to 25% Copper in multiple locations. Confirming Copperside Mine anomaly. (Sample PS0014) Top 25 sample average 13.7 % Gold Assays: Up to 151 g/t (sample 2645) Top 25 sample average 18.11 ppm Silver Assays: Up to 1565 g/t (sample 212) Top 25 sample average 651.2 ppm Cobalt Assays: Up to 5.9 % (sample PS0004) Lead Assays: Up to 40% (Sample RLGS-6) Zinc Assays: Up to 30% (Sample 9378) Antimony Assays: Up to 9104.4 g/t (Sample GS09RW-45) IP/Mag surveys : See Figure 2: ZONGE IP Survey (~2019) These data will be carefully analysed and, in some cases, reprocessed, giving a much more robust basis for preparation of the next exploration steps. Updates will be coming soon. Next Phases of Exploration Comprehensive review and integration of the newly acquired database Detailed geological mapping and innovative geophysical surveys to rank numerous high-priority targets already identified Targeted drill program \"We are extremely excited about the potential of the Copper Chief Project and the broader Goodsprings district, The historical production in this area only scratched the surface. Modern exploration techniques, combined with our large, consolidated land position and comprehensive database, give us a unique opportunity to unlock substantial value for our shareholders.\" -Luis Martins (CEO). The Company believes the Goodsprings district has the potential to host a large-scale, district-wide mineral system with multiple deposit types, including: High-grade copper-lead-zinc carbonate replacement deposits Structurally controlled precious and PGE metal veins Potential for porphyry copper-gold-related mineralization Fairchild's strategic position in this historically productive yet underexplored district represents a compelling opportunity to make significant discoveries using modern exploration techniques. Annual General and Special Meeting Results The Company is also pleased to announce the voting results of its annual general and special meeting (the \" Meeting \") of its shareholders (\" Shareholders \") held on February 26, 2025. Shareholders holding 17,071,085 shares or 23.15% of the outstanding shares of the Company were represented in person or by proxy at the Meeting. The Shareholders received the financial statements for the years ended August 31, 2024, August 31, 2023, August 31, 2022 and August 31, 2021 together with the auditor's Reports. As nominated by the Company's management information circular dated January 23, 2025, the shareholders elected Luis Martins, Robert Rosner, Geoffrey Baker, and Diane Mann as directors of the Company for the ensuing year. The shareholders also voted to appoint Manning Elliott LLP as auditors of the Company to hold office until the close of the next annual general meeting and approved the Company's new equity incentive plan (the \" Incentive Plan \"). The Incentive Plan is a 10% rolling plan in respect of options and a 10% fixed plan in respect of restricted share units. Finally, the shareholders approved the resolution to amend the Company's name to \"Fairchild Copper & Gold Corp.\" as authorized by the board of directors of the Company, acceptable to the TSX Venture Exchange and applicable regulatory authorities. QP statement Richard R. Redfern, MS, CPG No. 10717, and Consulting Geologist for Fairchild, is the qualified person as defined by National Instrument 43-101 who has examined the Copper Chief property on the ground numerous times since 2003 and reviewed the geological information available from private and public sources related to the property and is responsible for approving the technical contents of this press release. About Fairchild Gold Corp Fairchild Gold Corp is a mineral exploration company focused on acquiring, exploring, and developing high-quality mineral properties in mining-friendly jurisdictions. The Company's flagship Copper Chief Project is in the historic Goodsprings mining district in Nevada, USA. For more information, please contact: Luis Martins Director and Chief Executive Officer Fairchild Gold Corp. (866) 497-0284 info@fairchildgold.com or visit us @ www.fairchildgold.com Forward-Looking Statements This press release contains forward-looking statements and forward-looking information (collectively, \"forward-looking statements\") within the meaning of applicable securities laws. Any statements that are contained in this press release that are not statements of historical fact may be deemed to be forward-looking statements. Forward-looking statements are often identified by terms such as \"may\", \"should\", \"anticipate\", \"will\", \"estimates\", \"believes\", \"intends\", \"expects\" and similar expressions which are intended to identify forward-looking statements. More particularly and without limitation, this press release contains forward-looking statements concerning the exploration and development potential of the Copper Chief Project. Forward-looking statements are inherently uncertain, and the actual performance may be affected by a number of material factors, assumptions and expectations, many of which are beyond the control of the Company. Readers are cautioned that assumptions used in the preparation of any forward-looking statements may prove to be incorrect. Events or circumstances may cause actual results to differ materially from those predicted as a result of numerous known and unknown risks, uncertainties and other factors, many of which are beyond the control of the Company. Readers are further cautioned not to place undue reliance on any forward-looking statements, as such information, although considered reasonable by management at the time of preparation, may prove to be incorrect and actual results may differ materially from those anticipated. Neither the TSX Venture Exchange nor its Regulation Services Provider (as that term is defined in the policies of the TSX Venture Exchange) accepts responsibility for the adequacy or accuracy of this release. NOT FOR DISTRIBUTION TO UNITED STATES NEWS WIRE SERVICES OR FOR DISSEMINATION IN THE UNITED STATES. To view the source version of this press release, please visit https://www.newsfilecorp.com/release/244592",
    "primary_commodity": "Cu"
  },
  "articleProject": {
    "gid": 9807,
    "project_name": "Goodsprings",
    "location": "Nevada, United States"
  },
  "articleExchange": "TSXV",
  "articleCompanyId": 1303,
  "articleTicker": "FAIR",
  "articleCompanyName": "Fairchild Gold Corp.",
  "allOtherCompanyProjects": [
    {
      "company_id": 1303,
      "gid": 3964,
      "project_name": "Fairchild Lake",
      "location": "Ontario, Canada"
    },
    {
      "company_id": 1303,
      "gid": 7642,
      "project_name": "Nevada Titan",
      "location": null
    },
    {
      "company_id": 1303,
      "gid": 9807,
      "project_name": "Goodsprings",
      "location": "Nevada, United States"
    }
  ],
  "allOtherCompanyNews": [
    {
      "id": 107263,
      "company_id": 1303,
      "title": "Fairchild Gold Announces Closing of the Second Tranche of Its Previously Announced Private Placement",
      "link": null,
      "date": "2025-06-06T21:25:00.000Z",
      "hidden": false
    },
    {
      "id": 106119,
      "company_id": 1303,
      "title": "Fairchild Announces Upsizing of Its Private Placement",
      "link": null,
      "date": "2025-05-28T21:40:00.000Z",
      "hidden": false
    },
    {
      "id": 105387,
      "company_id": 1303,
      "title": "Fairchild Gold Corp. Discovers New Highly Mineralised Zones at It's Nevada Titan Property in Goodsprings, Nevada",
      "link": null,
      "date": "2025-05-21T16:30:00.000Z",
      "hidden": false
    },
    {
      "id": 100692,
      "company_id": 1303,
      "title": "Fairchild Gold Announces Closing of a Private Placement and Provides Corporate Update",
      "link": null,
      "date": "2025-04-23T21:00:00.000Z",
      "hidden": false
    },
    {
      "id": 93119,
      "company_id": 1303,
      "title": "Fairchild Gold Corp. Announces the Appointment of Jill Kelley as Chair of Its Newly Constituted Strategic Advisory Board",
      "link": null,
      "date": "2025-03-31T12:53:00.000Z",
      "hidden": false
    },
    {
      "id": 92730,
      "company_id": 1303,
      "title": "Fairchild Gold Corp Announces Board Changes",
      "link": null,
      "date": "2025-03-27T13:33:00.000Z",
      "hidden": false
    },
    {
      "id": 91413,
      "company_id": 1303,
      "title": "Fairchild Gold Corp Announces Successful Completion of Transaction with Koba Resources Ltd.",
      "link": null,
      "date": "2025-03-14T16:43:00.000Z",
      "hidden": false
    },
    {
      "id": 87458,
      "company_id": 1303,
      "title": "Fairchild Gold Acquires 72 Claims From Koba Resources Adjacent to Its Copper Chief Property at Goodsprings, Nevada",
      "link": "https://www.accessnewswire.com/newsroom/en/metals-and-mining/fairchild-gold-acquires-72-claims-from-koba-resources-adjacent-to-its-copper-chief-983268",
      "date": "2025-02-11T14:10:00.000Z",
      "hidden": false
    },
    {
      "id": 84757,
      "company_id": 1303,
      "title": "Fairchild Gold Reports Anomalous Geochemical Results of up to 8.90% Cu Sampled from Outcrop at Its Copper Chief Property Near Las Vegas, Nevada",
      "link": "https://www.accessnewswire.com/newsroom/en/metals-and-mining/fairchild-gold-reports-anomalous-geochemical-results-of-up-to-890-cu-sampled-from-outcrop-at-its-copper-chief-property-near-las-vegas-nevada-971280",
      "date": "2025-01-21T13:50:00.000Z",
      "hidden": false
    },
    {
      "id": 83319,
      "company_id": 1303,
      "title": "Fairchild Gold Corp. Advances Exploration at its Copper Chief Property and confirms Porphyry Rock outcropping on site",
      "link": "https://www.thenewswire.com/press-releases?id=1LYzF25jX",
      "date": "2025-01-06T17:30:00.000Z",
      "hidden": false
    }
  ]
}
