{
  "article": {
    "id": 43383,
    "link": "https://www.thenewswire.com/press-releases?id=1BjjFNEN6",
    "title": "Headwater Gold Consolidates Spring Peak Land Position Through Private Land Agreements and Additional Claim Staking",
    "description": "<table style='width:fit-content; border: none;'><tr style='background: none;'><td colspan='10' style='padding: 0; margin: 0; border: none; background: none;' valign='bottom'><a target='_blank' href='https://headwatergold.com/'><img src=\"https://www.thenewswire.com/data/tnw/clients/logos/1kx7F1jbP.png?t=1622049454\" alt=\"Headwater Gold Inc.\" /></a></td></tr><tr style='background: none;'><td style='width: 34px; padding: 0; margin: 0; border: none; background: none;' valign='bottom'><a target='_blank' href='https://thenewswire.com/api/apps/tnw/r?i=1kx7F1jbP&amp;m=twi'><img src=\"https://www.thenewswire.com/data/tnw/img/twi.png\" /></a></td><td style='width: 34px; padding: 0; margin: 0; border: none; background: none;' valign='bottom'><a target='_blank' href='https://thenewswire.com/api/apps/tnw/r?i=1kx7F1jbP&amp;m=lin'><img src=\"https://www.thenewswire.com/data/tnw/img/lin.png\" /></a></td><td style='width: 34px; padding: 0; margin: 0; border: none; background: none;' valign='bottom'><a target='_blank' href='https://thenewswire.com/api/apps/tnw/r?i=1kx7F1jbP&amp;m=you'><img src=\"https://www.thenewswire.com/data/tnw/img/you.png\" /></a></td><td style='padding: 0; margin: 0; border: none; background: none;'></td></tr></table>\n<p style='text-align:justify; '>\n<a href='' target='_blank'></a><a href='' target='_blank'></a><span style='font-weight:bold; '>Vancouver, British Columbia - </span><span style='font-weight:bold; '>TheNewswire -</span><span style='font-weight:bold; '> November 1, 2023 -</span> <span style=''>Headwater Gold Inc. (CSE: HWG) (OTCQB: HWAUF) (the &quot;Company&quot; or &quot;Headwater&quot;) is </span><span style=''>pleased to announce it has signed agreements with a private landowner and staked additional claims to consolidate and expand the land position of the Spring Peak project (the “Project”) in Nevada.</span>\n</p>\n\n<p style='text-align:justify; '>\n<span style='font-weight:bold; '>Highlights:</span>\n</p>\n\r\n<ul>\r\n<li>\n<p style='text-align:justify; '>\n<span style=''>Headwater has signed two lease agreements with options to purchase two packages of private lands within the Spring Peak project. </span> \n</p>\n</li><li>\n<p style='text-align:justify; '>\n<span style=''>Several drill targets have been identified on the newly acquired lands, scheduled to be tested in 2024.</span> \n</p>\n</li><li>\n<p style='text-align:justify; '>\n<span style=''>Headwater has staked an additional 179 unpatented mining claims in 2023, expanding the land package to the east and north over several newly identified target areas.</span> \n</p>\n</li><li>\n<p style='text-align:justify; '>\n<span style=''>The combined land consolidation represents an 87% increase in the property position and secures 880 acres of surface rights which may be utilized for potential long-term project infrastructure.</span> \n</p>\n</li><li>\n<p style='text-align:justify; '>\n<span style=''>The Company has also completed 32 line-km of controlled-source audio-frequency magnetotellurics (CSAMT) resistivity geophysics, a soil survey consisting of 615 additional soil samples and an airborne hyperspectral survey which collectively identify multiple new target areas.</span> \n</p>\n</li>\r\n</ul>\r\n \n<p style='text-align:justify; '>\n<span style=''>Caleb Stroup, the President and CEO of the Company, states: </span><span style='font-style:italic; '>“The expansion and consolidation of the Spring Peak land position is an important milestone in the development of the Project.  We now have mineral rights and access to explore the full extent of the alteration cell exposed at Spring Peak.  Our geological understanding of the Project continues to evolve as we collect more surface data and complete additional exploration drilling.  The scale of the epithermal cell at Spring Peak continues to impress our geologists.  We believe the potential for mineralization extends well beyond the Opal Ridge and Disco Zone areas which have been our focus thus far and we are excited to continue to develop and test targets throughout the property.  Surface alteration and geophysical targets continue to the east onto our newly staked claims and to the west onto private lands now under option.  The surface rights associated with the private land option agreements also provide significant optionality, particularly in the long term, as permitting of infrastructure on private lands is generally a streamlined alternative to permitting on federally administered lands.”</span>\n</p>\n\n<p style='text-align:justify; '>\n<span style='text-align:center; '><a href='https://thenewswire.com/data/tnw/clients/img/d3e2d577899c8d572d192442a99f575c.png' target='_blank'><img src=\"https://thenewswire.com/data/tnw/clients/img/d3e2d577899c8d572d192442a99f575c_.png\" /></a><br />\nClick Image To View Full Size</span>\n</p>\n \n<p style='text-align:justify; '>\n<span style='font-style:italic; '>Figure 1.  Spring Peak land position showing newly leased private lands and recent claim staking.  </span>\n</p>\n\n<p style='text-align:left; '>\n<span style='font-weight:bold; '><span style=''>Spring Peak Land Consolidation:</span></span>\n</p>\n\n<p style='text-align:justify; '>\n<span style=''>Following ongoing exploration success at the Spring Peak project (see Headwater news release dated October 31, 2023) Headwater has significantly expanded the Company’s land position through claim staking and two agreements with a private landowner (Figure 1).  The private land agreements consolidate all inlier land positions and allow Headwater to explore the western extension of the surface alteration and establish a potential location for future infrastructure on private land.  Access to a water well located on the private land also provides a cost-effective </span><span style=''>source for drill water to support continued exploration drilling.  The agreements are with a private landowner and cover two classes of lands: 1) lands with privately owned surface rights and federally administered mineral rights (appropriated by Headwater through claim staking); and 2) lands with private mineral rights and private surface rights. </span>\n</p>\n\n<p style='text-align:justify; '>\n<span style=''>Recent claim staking to the east and north has now also secured mineral rights over the eastern projection of several target structures, including the Bear Fault trend which hosts the Disco Zone discovery.  These structures are obscured by shallow post-mineral volcanic cover to the east but preliminary modelling of newly acquired CSAMT geophysics supports the interpretation that these structures continue and are covered by generally less than 100 metres of cover.   </span>\n</p>\n\n<p style='text-align:justify; '>\n<span style=''>The expanded land position is subject to the existing earn-in agreement at Spring Peak with Newcrest. </span>\n</p>\n\n<p style='text-align:justify; '>\n<span style='font-weight:bold; '><span style=''>Terms of Private Land Agreements:</span></span>\n</p>\n\n<p style='text-align:justify; '>\n<span style=''>Headwater has entered into a mining lease with an arm’s length private company covering 240 acres of private land in the Spring Peak project area.  By making an initial cash payment of US$10,000 on signing and escalating annual payments over the 30-year term, beginning at $10,000 on the first anniversary of the agreement, Headwater is granted exclusive surface and mineral right and retains an option to purchase the land for US$1,000,000, indexed to inflation, and exercisable at any time during the term of agreement subject to a 5% NSR royalty, half of which can be purchased at any time for US$500,000 and the remaining half for US$1,000,000 before commencement of commercial production on the property.</span>\n</p>\n\n<p style='text-align:justify; '>\n<span style=''>The Company has also entered into a surface lease with the same private company on 640 acres of contiguous private surface land in the Spring Peak project area where Headwater holds existing mineral rights it acquired through claim staking.  By making an initial cash payment of US$10,000 on signing and escalating annual payments over the 30-year term, beginning at $5,000 on the first anniversary of the agreement, Headwater is granted exclusive surface rights and retains an option to purchase the land for US$1,600,000 indexed to inflation and exercisable at any time prior to the tenth anniversary of the agreement.</span>\n</p>\n\n<p style='text-align:justify; '>\n<span style='font-weight:bold; '><span style=''>Property-Wide Exploration:</span></span>\n</p>\n\n<p style='text-align:justify; '>\n<span style='font-style:italic; '>Airborne Hyperspectral Survey:</span>\n</p>\n\n<p style='text-align:justify; '>\n<span style=''>Hyperspectral imagery was acquired over approximately 100 km</span><span style='vertical-align:super; '>2</span><span style=''> in the Project area using a fixed-wing aircraft with a shortwave infra-red and longwave infra-red hyperspectral camera. Airborne hyperspectral surveys are a commonly employed technique for mineral exploration and particularly applicable in low-sulfidation epithermal systems.  This class of imagery allows for airborne mapping of alteration minerals to determine the footprint of epithermal alteration and track subtle variations in alteration mineralogy which can be important vectors for identifying feeder zones prospective for high-grade vein mineralization. </span>\n</p>\n\n<p style='text-align:justify; '>\n<span style=''>The survey conducted at Spring Peak has identified epithermal alteration minerals over most of the exposed pre-mineral bedrock on the property in an approximately 5 kilometres long and 1.5 kilometres wide corridor (Figure 2).  Several northeast trending (Disco Zone parallel) alteration anomalies were detected as well as two distinct kaolinite-alunite altered rhyolite dome complexes, referred to as Aurora Dome and Alunite Canyon.  Reconnaissance mapping and prospecting is currently underway following up on these and other target areas. </span>\n</p>\n\n<p style='text-align:justify; '>\n<span style='text-align:center; '><a href='https://thenewswire.com/data/tnw/clients/img/968935e249f5b3d99dc5a0bd053a471e.png' target='_blank'><img src=\"https://thenewswire.com/data/tnw/clients/img/968935e249f5b3d99dc5a0bd053a471e_.png\" /></a><br />\nClick Image To View Full Size</span>\n</p>\n \n<p style='text-align:justify; '>\n<span style='font-style:italic; '>Figure 2.  Top) Simplified geologic map of Project area showing alteration mineralogy from hyperspectral data and newly generated hyperspectral target areas.  Bottom) Simplified geologic map showing illite </span><span style='font-style:italic; '>crystallinity, select rock chip samples, and target areas.  High crystallinity (warmer colors) generally corresponds to higher temperature clay minerals and more intense alteration.</span>\n</p>\n\n<p style='text-align:justify; '>\n<span style='font-style:italic; '>CSAMT Geophysics and Soil Survey:</span>\n</p>\n\n<p style='text-align:justify; '>\n<span style=''>The Company has also completed a 32 line-kilometre CSAMT geophysical survey extending the coverage east and west from the footprint of historic surveys (Figure 3).  CSAMT resistivity geophysics has proven to be a very useful tool in targeting high-grade mineralization at the Spring Peak project.  Existing CSAMT resistivity profiles along the length of the Disco Zone target played a critical role in Headwater’s initial discovery, showing a consistent resistivity break along the Bear Fault which is now recognized as the primary control on high-grade mineralization.  Other similar resistivity breaks exist on the property and the newly acquired survey was designed to add definition to these features and track them both east and west.  Shallow post-mineral cover persists over much of the eastern project area.  Preliminary CSAMT results appear to track multiple structures under cover and also indicate that the depth of cover is less than 100 metres.  Final inversion modeling of the CSAMT data is underway.</span>\n</p>\n\n<p style='text-align:justify; '>\n<span style='text-align:center; '><a href='https://thenewswire.com/data/tnw/clients/img/06681c6d28bbc70d388807d73519ebe3.png' target='_blank'><img src=\"https://thenewswire.com/data/tnw/clients/img/06681c6d28bbc70d388807d73519ebe3_.png\" /></a><br />\nClick Image To View Full Size</span>\n</p>\n \n<p style='text-align:justify; '>\n<span style='font-style:italic; '>Figure 3.  Simplified geologic map of Project area showing the location of newly acquired and historic CSAMT lines. </span>\n</p>\n\n<p style='text-align:justify; '>\n<span style=''>A soil survey consisting of 615 soil samples was also conducted with samples collected along the CSAMT lines at 25 metre to 50 metre spacing.  Historical soil data was limited to the central portion of the claim block and this expanded survey now covers the bulk of the exposed pre-</span><span style=''>mineral bedrock in the Project area.  The combined soil dataset and the newly acquired CSAMT and hyperspectral surveys are currently being integrated into a property wide targeting model which will be used to prioritize new targets for testing in 2024.   </span>\n</p>\n\n<p style='text-align:justify; '>\n<span style='font-weight:bold; '>About the Spring Peak Project:</span>\n</p>\n\n<p style='text-align:justify; '>\n<span style=''>The Spring Peak project is located in the Aurora Mining District of west-central Nevada, approximately 50 km southwest of the town of Hawthorne.  The Project adjoins Hecla Mining Company’s (NYSE: HL) past-producing Aurora Mine complex, where existing infrastructure includes a 350 ton per day mill, several production water wells and high-voltage three-phase power.</span> \n</p>\n\n<p style='text-align:justify; '>\n<span style=''>Headwater holds an option to acquire a 100% undivided interest in the Spring Peak project from Orogen Royalties (TSXV: OGN), subject to retained royalties on a portion of the Project and subject to Newcrest Mining Limited’s option to acquire up to 75% of the Project following certain expenditures and preparation of a Pre-Feasibility Study within a designated timeframe.</span>\n</p>\n\n<p style='text-align:justify; '>\n<span style='font-weight:bold; '>About Headwater Gold:</span> \n</p>\n\n<p style='text-align:justify; '>\n<span style=''>Headwater Gold Inc. (CSE: HWG, OTCQB: HWAUF) is a technically-driven mineral exploration company focused on the exploration and discovery of high-grade precious metal deposits in the Western USA.  Headwater is aggressively exploring one of the most well-endowed and mining-friendly jurisdictions in the world with a goal of making world-class precious metal discoveries.  Headwater has a large portfolio of epithermal vein exploration projects and a technical team of experienced geologists with diverse capital markets, junior and major mining company backgrounds.  The Company is systematically drill testing several projects in Nevada, Idaho, and Oregon; and in August 2022 and May 2023 announced significant transactions with Newcrest Mining Limited where Newcrest acquired a 9.9% strategic equity interest in the Company and entered into earn-in agreements on several of Headwater’s projects.</span>\n</p>\n\n<p style='text-align:justify; '>\n<span style=''>For more information, please visit the Company's website at </span><a href='http://www.headwatergold.com' target='_blank'><span style=''>www.headwatergold.com</span></a><span style=''>.</span>\n</p>\n\n<p style='text-align:justify; '>\n<span style='font-weight:bold; '>On Behalf of the Board of Directors</span>\n</p>\n\n<p style='text-align:justify; '>\n<span style=''>Caleb Stroup</span>\n</p>\n\n<p style='text-align:justify; '>\n<span style=''>President and CEO</span>\n</p>\n\n<p style='text-align:justify; '>\n<span style=''>+1 (775) 409-3197</span>\n</p>\n\n<p style='text-align:justify; '>\n<a href='mailto:cstroup@headwatergold.com' target='_blank'><span style=''>cstroup@headwatergold.com</span></a>\n</p>\n\n<p style='text-align:justify; '>\n<span style=''>For further information, please contact:</span>\n</p>\n\n<p style='text-align:justify; '>\n<span style=''>Brennan Zerb</span>\n</p>\n\n<p style='text-align:justify; '>\n<span style=''>Investor Relations Manager</span>\n</p>\n\n<p style='text-align:justify; '>\n<span style=''>+1 (778) 867-5016 </span>\n</p>\n\n<p style='text-align:justify; '>\n<a href='mailto:bzerb@headwatergold.com' target='_blank'><span style=''>bzerb@headwatergold.com</span></a>\n</p>\n\n<p style='text-align:justify; '>\n<span style='font-weight:bold; '>Qualified Person: </span>\n</p>\n\n<p style='text-align:justify; '>\n<span style=''>The technical information contained in this news release has been reviewed and approved by Scott Close, P.Geo (158157), a “Qualified Person” (“QP”) as defined in National Instrument 43-101 – Standards of Disclosure for Mineral Projects.</span>\n</p>\n\n<p style='text-align:justify; '>\n<span style='font-weight:bold; '>Forward-Looking Statements:</span>\n</p>\n\n<p style='text-align:justify; '>\n<span style='font-style:italic; '>This news release includes certain forward-looking statements and forward-looking information (collectively, “forward-looking statements”) within the meaning of applicable Canadian securities legislation. All statements, other than statements of historical fact, included herein including, without limitation, statements regarding future capital expenditures, exploration activities and the specifications, targets, results, analyses, interpretations, benefits, costs and timing of them, Newcrest’s anticipated funding of the earn-in projects and the timing thereof, and the anticipated business plans and timing of future activities of the Company, are forward-looking statements. Although the Company believes that such statements are reasonable, it can give no assurance that such expectations will prove to be correct. Often, but not always, forward looking information can be identified by words such as “pro forma”, “plans”, “expects”, “may”, “should”, “budget”, “scheduled”, “estimates”, “forecasts”, “intends”, “anticipates”, “believes”, “potential” or variations of such words including negative variations thereof, and phrases that refer to certain actions, events or results that may, could, would, might or will occur or be taken or achieved. Forward-looking statements involve known and unknown risks, uncertainties and other factors which may cause the actual results, performance or achievements of the Company to differ materially from any future results, performance or achievements expressed or implied by the forward-looking statements. Such risks and other factors include, among others, risks related to the anticipated business plans and timing of future activities of the Company, including the Company’s exploration plans and the proposed expenditures for exploration work thereon, the ability of the Company to obtain sufficient financing to fund its business activities and plans, the risk that Newcrest will not elect to obtain any additional interest in the earn-in projects in excess of the minimum commitment, the ability of the Company to obtain the required permits, changes in laws, regulations and policies affecting mining operations, the Company’s limited operating history, currency fluctuations, title disputes or claims, environmental issues and liabilities, as well as those factors discussed under the heading “Risk Factors” in the Company’s prospectus dated May 26, 2021 and other filings of the Company with the Canadian Securities Authorities, copies of which can be found under the Company’s profile on the SEDAR website at www.sedar.com. In addition, on May 14, 2023 Newcrest and Newmont Corporation (“Newmont”) entered into a binding scheme implementation deed in relation to a proposal for Newmont to acquire 100% of the issued shares in Newcrest by way of an Australian scheme of arrangement. The proposed merger received shareholder and regulatory approval and has an implementation date of November 6, 2023. There is no certainty that the new combined entity will commit to the contemplated exploration activities approved by Newcrest beyond the minimum project commitments.  </span>\n</p>\n\n<p style='text-align:justify; '>\n<span style='font-style:italic; '>Readers are cautioned not to place undue reliance on forward-looking statements. The Company undertakes no obligation to update any of the forward-looking statements, except as otherwise required by law.</span>\n</p>\n\n\n<p>Copyright (c) 2023 TheNewswire - All rights reserved.</p>\n",
    "search_terms": "Spring Peak,Headwater Gold Inc.,HWG",
    "master_gid": 1080,
    "date": "2023-11-01T10:30:00.000Z",
    "tags": "USA|Nevada||Gold|Project Acquisition",
    "image_id": null,
    "hidden": false,
    "company_id": 424,
    "provider": null,
    "excerpt": "Vancouver, British Columbia -TheNewswire -November 1, 2023 -Headwater Gold Inc. (CSE: HWG) (OTCQB: HWAUF) (the &quot;Company&quot; or &quot;Headwater&quot;) ispleased to announce it has signed agreements with a private landowner and staked additional claims to consolidate and expand the land position of the Spring Peak project (the “Project”) in Nevada.Highlights:Headwater has",
    "is_regulatory": false,
    "refined_tags": [
      "Project Acquisition"
    ],
    "ftp_filename": null,
    "company_name": "Headwater Gold Inc.",
    "exchange": "CSE",
    "root_ticker": "HWG",
    "project_name": "Spring Peak",
    "gid": 1080,
    "location": "Nevada, United States",
    "plan_id": "companytier2",
    "description_text": "Vancouver, British Columbia - TheNewswire - November 1, 2023 - Headwater Gold Inc. (CSE: HWG) (OTCQB: HWAUF) (the \"Company\" or \"Headwater\") is pleased to announce it has signed agreements with a private landowner and staked additional claims to consolidate and expand the land position of the Spring Peak project (the “Project”) in Nevada. Highlights: Headwater has signed two lease agreements with options to purchase two packages of private lands within the Spring Peak project. Several drill targets have been identified on the newly acquired lands, scheduled to be tested in 2024. Headwater has staked an additional 179 unpatented mining claims in 2023, expanding the land package to the east and north over several newly identified target areas. The combined land consolidation represents an 87% increase in the property position and secures 880 acres of surface rights which may be utilized for potential long-term project infrastructure. The Company has also completed 32 line-km of controlled-source audio-frequency magnetotellurics (CSAMT) resistivity geophysics, a soil survey consisting of 615 additional soil samples and an airborne hyperspectral survey which collectively identify multiple new target areas. Caleb Stroup, the President and CEO of the Company, states: “The expansion and consolidation of the Spring Peak land position is an important milestone in the development of the Project.  We now have mineral rights and access to explore the full extent of the alteration cell exposed at Spring Peak.  Our geological understanding of the Project continues to evolve as we collect more surface data and complete additional exploration drilling.  The scale of the epithermal cell at Spring Peak continues to impress our geologists.  We believe the potential for mineralization extends well beyond the Opal Ridge and Disco Zone areas which have been our focus thus far and we are excited to continue to develop and test targets throughout the property.  Surface alteration and geophysical targets continue to the east onto our newly staked claims and to the west onto private lands now under option.  The surface rights associated with the private land option agreements also provide significant optionality, particularly in the long term, as permitting of infrastructure on private lands is generally a streamlined alternative to permitting on federally administered lands.” Click Image To View Full Size Figure 1.  Spring Peak land position showing newly leased private lands and recent claim staking. Spring Peak Land Consolidation: Following ongoing exploration success at the Spring Peak project (see Headwater news release dated October 31, 2023) Headwater has significantly expanded the Company’s land position through claim staking and two agreements with a private landowner (Figure 1).  The private land agreements consolidate all inlier land positions and allow Headwater to explore the western extension of the surface alteration and establish a potential location for future infrastructure on private land.  Access to a water well located on the private land also provides a cost-effective source for drill water to support continued exploration drilling.  The agreements are with a private landowner and cover two classes of lands: 1) lands with privately owned surface rights and federally administered mineral rights (appropriated by Headwater through claim staking); and 2) lands with private mineral rights and private surface rights. Recent claim staking to the east and north has now also secured mineral rights over the eastern projection of several target structures, including the Bear Fault trend which hosts the Disco Zone discovery.  These structures are obscured by shallow post-mineral volcanic cover to the east but preliminary modelling of newly acquired CSAMT geophysics supports the interpretation that these structures continue and are covered by generally less than 100 metres of cover. The expanded land position is subject to the existing earn-in agreement at Spring Peak with Newcrest. Terms of Private Land Agreements: Headwater has entered into a mining lease with an arm’s length private company covering 240 acres of private land in the Spring Peak project area.  By making an initial cash payment of US$10,000 on signing and escalating annual payments over the 30-year term, beginning at $10,000 on the first anniversary of the agreement, Headwater is granted exclusive surface and mineral right and retains an option to purchase the land for US$1,000,000, indexed to inflation, and exercisable at any time during the term of agreement subject to a 5% NSR royalty, half of which can be purchased at any time for US$500,000 and the remaining half for US$1,000,000 before commencement of commercial production on the property. The Company has also entered into a surface lease with the same private company on 640 acres of contiguous private surface land in the Spring Peak project area where Headwater holds existing mineral rights it acquired through claim staking.  By making an initial cash payment of US$10,000 on signing and escalating annual payments over the 30-year term, beginning at $5,000 on the first anniversary of the agreement, Headwater is granted exclusive surface rights and retains an option to purchase the land for US$1,600,000 indexed to inflation and exercisable at any time prior to the tenth anniversary of the agreement. Property-Wide Exploration: Airborne Hyperspectral Survey: Hyperspectral imagery was acquired over approximately 100 km 2 in the Project area using a fixed-wing aircraft with a shortwave infra-red and longwave infra-red hyperspectral camera. Airborne hyperspectral surveys are a commonly employed technique for mineral exploration and particularly applicable in low-sulfidation epithermal systems.  This class of imagery allows for airborne mapping of alteration minerals to determine the footprint of epithermal alteration and track subtle variations in alteration mineralogy which can be important vectors for identifying feeder zones prospective for high-grade vein mineralization. The survey conducted at Spring Peak has identified epithermal alteration minerals over most of the exposed pre-mineral bedrock on the property in an approximately 5 kilometres long and 1.5 kilometres wide corridor (Figure 2).  Several northeast trending (Disco Zone parallel) alteration anomalies were detected as well as two distinct kaolinite-alunite altered rhyolite dome complexes, referred to as Aurora Dome and Alunite Canyon.  Reconnaissance mapping and prospecting is currently underway following up on these and other target areas. Click Image To View Full Size Figure 2.  Top) Simplified geologic map of Project area showing alteration mineralogy from hyperspectral data and newly generated hyperspectral target areas.  Bottom) Simplified geologic map showing illite crystallinity, select rock chip samples, and target areas.  High crystallinity (warmer colors) generally corresponds to higher temperature clay minerals and more intense alteration. CSAMT Geophysics and Soil Survey: The Company has also completed a 32 line-kilometre CSAMT geophysical survey extending the coverage east and west from the footprint of historic surveys (Figure 3).  CSAMT resistivity geophysics has proven to be a very useful tool in targeting high-grade mineralization at the Spring Peak project.  Existing CSAMT resistivity profiles along the length of the Disco Zone target played a critical role in Headwater’s initial discovery, showing a consistent resistivity break along the Bear Fault which is now recognized as the primary control on high-grade mineralization.  Other similar resistivity breaks exist on the property and the newly acquired survey was designed to add definition to these features and track them both east and west.  Shallow post-mineral cover persists over much of the eastern project area.  Preliminary CSAMT results appear to track multiple structures under cover and also indicate that the depth of cover is less than 100 metres.  Final inversion modeling of the CSAMT data is underway. Click Image To View Full Size Figure 3.  Simplified geologic map of Project area showing the location of newly acquired and historic CSAMT lines. A soil survey consisting of 615 soil samples was also conducted with samples collected along the CSAMT lines at 25 metre to 50 metre spacing.  Historical soil data was limited to the central portion of the claim block and this expanded survey now covers the bulk of the exposed pre- mineral bedrock in the Project area.  The combined soil dataset and the newly acquired CSAMT and hyperspectral surveys are currently being integrated into a property wide targeting model which will be used to prioritize new targets for testing in 2024. About the Spring Peak Project: The Spring Peak project is located in the Aurora Mining District of west-central Nevada, approximately 50 km southwest of the town of Hawthorne.  The Project adjoins Hecla Mining Company’s (NYSE: HL) past-producing Aurora Mine complex, where existing infrastructure includes a 350 ton per day mill, several production water wells and high-voltage three-phase power. Headwater holds an option to acquire a 100% undivided interest in the Spring Peak project from Orogen Royalties (TSXV: OGN), subject to retained royalties on a portion of the Project and subject to Newcrest Mining Limited’s option to acquire up to 75% of the Project following certain expenditures and preparation of a Pre-Feasibility Study within a designated timeframe. About Headwater Gold: Headwater Gold Inc. (CSE: HWG, OTCQB: HWAUF) is a technically-driven mineral exploration company focused on the exploration and discovery of high-grade precious metal deposits in the Western USA.  Headwater is aggressively exploring one of the most well-endowed and mining-friendly jurisdictions in the world with a goal of making world-class precious metal discoveries.  Headwater has a large portfolio of epithermal vein exploration projects and a technical team of experienced geologists with diverse capital markets, junior and major mining company backgrounds.  The Company is systematically drill testing several projects in Nevada, Idaho, and Oregon; and in August 2022 and May 2023 announced significant transactions with Newcrest Mining Limited where Newcrest acquired a 9.9% strategic equity interest in the Company and entered into earn-in agreements on several of Headwater’s projects. For more information, please visit the Company's website at www.headwatergold.com . On Behalf of the Board of Directors Caleb Stroup President and CEO +1 (775) 409-3197 cstroup@headwatergold.com For further information, please contact: Brennan Zerb Investor Relations Manager +1 (778) 867-5016 bzerb@headwatergold.com Qualified Person: The technical information contained in this news release has been reviewed and approved by Scott Close, P.Geo (158157), a “Qualified Person” (“QP”) as defined in National Instrument 43-101 – Standards of Disclosure for Mineral Projects. Forward-Looking Statements: This news release includes certain forward-looking statements and forward-looking information (collectively, “forward-looking statements”) within the meaning of applicable Canadian securities legislation. All statements, other than statements of historical fact, included herein including, without limitation, statements regarding future capital expenditures, exploration activities and the specifications, targets, results, analyses, interpretations, benefits, costs and timing of them, Newcrest’s anticipated funding of the earn-in projects and the timing thereof, and the anticipated business plans and timing of future activities of the Company, are forward-looking statements. Although the Company believes that such statements are reasonable, it can give no assurance that such expectations will prove to be correct. Often, but not always, forward looking information can be identified by words such as “pro forma”, “plans”, “expects”, “may”, “should”, “budget”, “scheduled”, “estimates”, “forecasts”, “intends”, “anticipates”, “believes”, “potential” or variations of such words including negative variations thereof, and phrases that refer to certain actions, events or results that may, could, would, might or will occur or be taken or achieved. Forward-looking statements involve known and unknown risks, uncertainties and other factors which may cause the actual results, performance or achievements of the Company to differ materially from any future results, performance or achievements expressed or implied by the forward-looking statements. Such risks and other factors include, among others, risks related to the anticipated business plans and timing of future activities of the Company, including the Company’s exploration plans and the proposed expenditures for exploration work thereon, the ability of the Company to obtain sufficient financing to fund its business activities and plans, the risk that Newcrest will not elect to obtain any additional interest in the earn-in projects in excess of the minimum commitment, the ability of the Company to obtain the required permits, changes in laws, regulations and policies affecting mining operations, the Company’s limited operating history, currency fluctuations, title disputes or claims, environmental issues and liabilities, as well as those factors discussed under the heading “Risk Factors” in the Company’s prospectus dated May 26, 2021 and other filings of the Company with the Canadian Securities Authorities, copies of which can be found under the Company’s profile on the SEDAR website at www.sedar.com. In addition, on May 14, 2023 Newcrest and Newmont Corporation (“Newmont”) entered into a binding scheme implementation deed in relation to a proposal for Newmont to acquire 100% of the issued shares in Newcrest by way of an Australian scheme of arrangement. The proposed merger received shareholder and regulatory approval and has an implementation date of November 6, 2023. There is no certainty that the new combined entity will commit to the contemplated exploration activities approved by Newcrest beyond the minimum project commitments. Readers are cautioned not to place undue reliance on forward-looking statements. The Company undertakes no obligation to update any of the forward-looking statements, except as otherwise required by law. Copyright (c) 2023 TheNewswire - All rights reserved.",
    "primary_commodity": "Au"
  },
  "articleProject": {
    "gid": 1080,
    "project_name": "Spring Peak",
    "location": "Nevada, United States"
  },
  "articleExchange": "CSE",
  "articleCompanyId": 424,
  "articleTicker": "HWG",
  "articleCompanyName": "Headwater Gold Inc.",
  "allOtherCompanyProjects": [
    {
      "company_id": 424,
      "gid": 3743,
      "project_name": "Agate Point",
      "location": "Nevada, United States"
    },
    {
      "company_id": 424,
      "gid": 9937,
      "project_name": "Jake Creek",
      "location": "Nevada, United States"
    },
    {
      "company_id": 424,
      "gid": 4124,
      "project_name": "Katey",
      "location": "Oregon, United States"
    },
    {
      "company_id": 424,
      "gid": 4685,
      "project_name": "Mahogany",
      "location": "Oregon, United States"
    },
    {
      "company_id": 424,
      "gid": 4208,
      "project_name": "Lodestar",
      "location": "Nevada, United States"
    },
    {
      "company_id": 424,
      "gid": 5505,
      "project_name": "Crane Creek",
      "location": "Idaho, United States"
    },
    {
      "company_id": 424,
      "gid": 5511,
      "project_name": "TJ",
      "location": "Nevada, United States"
    },
    {
      "company_id": 424,
      "gid": 1080,
      "project_name": "Spring Peak",
      "location": "Nevada, United States"
    },
    {
      "company_id": 424,
      "gid": 3942,
      "project_name": "Midas North",
      "location": "Nevada, United States"
    },
    {
      "company_id": 424,
      "gid": 8426,
      "project_name": "Rock Creek",
      "location": null
    },
    {
      "company_id": 424,
      "gid": 10231,
      "project_name": "Whiskey",
      "location": "Nevada, United States"
    }
  ],
  "allOtherCompanyNews": [
    {
      "id": 106022,
      "company_id": 424,
      "title": "Headwater Gold Identifies Outcropping High-Grade Veins at its New Doug Target on the Spring Peak Property, Nevada",
      "link": "https://www.thenewswire.com/press-releases?id=1LaPFo9Mp",
      "date": "2025-05-28T10:30:00.000Z",
      "hidden": false
    },
    {
      "id": 104147,
      "company_id": 424,
      "title": "Headwater Gold Grants Stock Options",
      "link": "https://www.thenewswire.com/press-releases?id=1kogFwPmd",
      "date": "2025-05-09T10:30:00.000Z",
      "hidden": false
    },
    {
      "id": 99340,
      "company_id": 424,
      "title": "Headwater Gold Acquires the Whiskey Project in Nevada and Reports 19.2 g/t Au in Rock Samples at Surface",
      "link": "https://www.thenewswire.com/press-releases?id=1BQPFN9mG",
      "date": "2025-04-10T10:30:00.000Z",
      "hidden": false
    },
    {
      "id": 89826,
      "company_id": 424,
      "title": "Headwater Gold Expands Northern Nevada Portfolio with Acquisition of the Jake Creek Epithermal Gold System",
      "link": "https://www.thenewswire.com/press-releases?id=1k98F16NY",
      "date": "2025-03-03T11:30:00.000Z",
      "hidden": false
    },
    {
      "id": 89396,
      "company_id": 424,
      "title": "Headwater Gold Intercepts 3.55 g/t Au over 7.62 m in New Target Area at Spring Peak Project, Nevada",
      "link": "https://www.thenewswire.com/press-releases?id=1k98F1d72",
      "date": "2025-02-27T11:30:00.000Z",
      "hidden": false
    },
    {
      "id": 84279,
      "company_id": 424,
      "title": "Headwater Gold Announces Results from Initial Drilling at TJ Project, Nevada",
      "link": "https://www.thenewswire.com/press-releases?id=1Bb4F9doP",
      "date": "2025-01-16T11:30:00.000Z",
      "hidden": false
    },
    {
      "id": 82609,
      "company_id": 424,
      "title": "Headwater Gold Announces Completion of First Pass Drilling at the TJ Project, Nevada",
      "link": "https://www.thenewswire.com/press-releases?id=1Av7Fv592",
      "date": "2024-12-20T11:30:00.000Z",
      "hidden": false
    },
    {
      "id": 77138,
      "company_id": 424,
      "title": "Headwater Commences Drilling on TJ Project and Provides Update on Spring Peak and Lodestar Projects, Nevada",
      "link": "https://www.thenewswire.com/press-releases?id=1A0vFvN2j",
      "date": "2024-10-31T10:30:00.000Z",
      "hidden": false
    },
    {
      "id": 73882,
      "company_id": 424,
      "title": "Headwater Announces Drilling Plans for the TJ Project, Nevada",
      "link": "https://www.thenewswire.com/press-releases?id=1k49F8wz1",
      "date": "2024-10-07T10:30:00.000Z",
      "hidden": false
    },
    {
      "id": 71608,
      "company_id": 424,
      "title": "Headwater Completes Strategic Investment by Centerra Gold",
      "link": "https://www.thenewswire.com/press-releases?id=1k3wFwwlO",
      "date": "2024-09-17T10:30:00.000Z",
      "hidden": false
    }
  ]
}
