{
  "article": {
    "id": 63361,
    "link": "https://www.thenewswire.com/press-releases?id=1BNMFJ8j8",
    "title": "Headwater Gold Significantly Expands Land Position at Spring Peak and Lodestar Projects and Commences District-Scale Exploration Program",
    "description": "<table style='width:fit-content; border: none;'><tr style='background: none;'><td colspan='10' style='padding: 0; margin: 0; border: none; background: none;' valign='bottom'><a target='_blank' href='https://headwatergold.com/'><img src=\"https://www.thenewswire.com/data/tnw/clients/logos/1kx7F1jbP.png?t=1622049454\" alt=\"Headwater Gold Inc.\" /></a></td></tr><tr style='background: none;'><td style='width: 34px; padding: 0; margin: 0; border: none; background: none;' valign='bottom'><a target='_blank' href='https://thenewswire.com/api/apps/tnw/r?i=1kx7F1jbP&amp;m=twi'><img src=\"https://www.thenewswire.com/data/tnw/img/twi.png\" /></a></td><td style='width: 34px; padding: 0; margin: 0; border: none; background: none;' valign='bottom'><a target='_blank' href='https://thenewswire.com/api/apps/tnw/r?i=1kx7F1jbP&amp;m=lin'><img src=\"https://www.thenewswire.com/data/tnw/img/lin.png\" /></a></td><td style='width: 34px; padding: 0; margin: 0; border: none; background: none;' valign='bottom'><a target='_blank' href='https://thenewswire.com/api/apps/tnw/r?i=1kx7F1jbP&amp;m=you'><img src=\"https://www.thenewswire.com/data/tnw/img/you.png\" /></a></td><td style='padding: 0; margin: 0; border: none; background: none;'></td></tr></table>\n<p style='text-align:justify; '>\n<span style='font-weight:bold; '>Vancouver, British Columbia - </span><span style='font-weight:bold; '>TheNewswire - </span><span style='font-weight:bold; '> June 25, 2024</span><span style=''>: Headwater Gold Inc. (CSE: HWG) (OTCQB: HWAUF) (the &quot;Company&quot; or &quot;Headwater&quot;) is pleased to announce significant expansions of its Spring Peak and Lodestar projects in Nevada, and the initiation of a comprehensive district-scale exploration program.  The land expansion and regional exploration programs are being funded through earn-in agreements (the “Earn-In Agreements” or “Agreements”) with Newmont Corporation (“Newmont”) (NYSE: NEM, TSX: NGT, ASX: NEM, PNGX: NEM) announced on August 16, 2022 and May 9, 2023.  </span>\n</p>\n\n<p style='text-align:justify; '>\n<span style='font-weight:bold; '>Highlights:</span>\n</p>\n\r\n<ul>\r\n<li>\n<p style='text-align:justify; '>\n<span style='font-weight:bold; '>97% Land Position Expansion</span><span style=''>: Headwater has staked 583 new claims, expanding its combined Spring Peak and Lodestar land positions by 97%. This now secures approximately 15 km of strike extent along the Aurora trend which historically produced nearly 4 million ounces of gold.</span> \n</p>\n</li><li>\n<p style='text-align:justify; '>\n<span style='font-weight:bold; '>District-Scale Exploration Program</span><span style=''>: A comprehensive exploration program is underway in the district including gravity geophysics, CSAMT geophysics, helicopter magnetics and radiometrics, stream sediment sampling, rock sampling, and soil sampling utilizing Newmont’s Deep Sensing Geochemistry (DSG) methodology.</span> \n</p>\n</li><li>\n<p style='text-align:justify; '>\n<span style='font-weight:bold; '>Drilling Program Scheduled</span><span style=''>:  A multi-rig drill program at Spring Peak, totaling up to approximately 7,000 metres over 20 to 25 holes, is scheduled to begin in the first half of July 2024.  The primary objective of the drill program will be to test for extensions of mineralization along the Bear Fault corridor, which hosts high-grade mineralization at the Disco Zone discovery.</span> \n</p>\n</li><li>\n<p style='text-align:justify; '>\n<span style='font-weight:bold; '>New Doug Target Zone</span><span style=''>: Subcropping mineralized epithermal veins have been identified at the new Doug target area. Vein textures in the area are characteristic of the shallow portions of an epithermal vein system. Initial rock samples have yielded gold values up to 2.05 g/t Au, with additional follow-up sampling underway. </span> \n</p>\n</li>\r\n</ul>\r\n\n<p style='text-align:justify; '>\n<span style=''>Caleb Stroup, President and CEO of the Company, states: </span><span style='font-style:italic; '>“We are thrilled with the strategic expansion of our land position, which we believe significantly increases our potential for discovering a Tier-One high-grade gold deposit along the prolific Aurora trend. The commencement of our district-scale exploration program, together with the identification of the new Doug target, underscores our commitment to aggressive and systematic exploration in the district. We are particularly excited about our ongoing application of advanced geophysical and geochemical techniques, including Newmont’s Deep Sensing Geochemistry to explore areas with thin post-mineral cover.  We believe these tools will play a critical role in our efforts to unlock the full potential of this high-grade district.”</span>\n</p>\n \n<p style='text-align:justify; '>\n<span style='font-weight:bold; '>The Aurora Trend and Headwater’s Claim Expansion:</span><span style=''> The Aurora trend is a highly mineralized belt extending from Bodie, California, through the Aurora Mining District in Nevada, and up to the Borealis project area (Figure 1). Historically, this trend has seen significant high-grade gold and silver production. The Aurora district alone has recorded past production of 1.9 million ounces of gold and 25 million ounces of silver (Vikre and others, 2015). Recorded production from the Bodie district was 1.5 million ounces of gold and 7.3 million ounces of silver between 1859 and 1955 at an average grade of 33 grams per ton gold (Long and others, 1998). Despite the rich endowment of the district, the area has seen relatively limited modern exploration, especially outside of the immediate areas surrounding the historic mines. Thin post-mineral cover has hindered previous surface exploration efforts, but the recognition of exposed mineralized bedrock in the Doug area demonstrates the potential exploration opportunities under cover in the district.</span>\n</p>\n\n<p style='text-align:left; '>\n<span style='text-align:center; '><img src=\"https://www.thenewswire.com/data/tnw/clients/img/9d4700d1e0c1f3d166e1dbe7af6a00e8_.png\" /></span>\n</p>\n \n<p style='font-style:italic; text-align:justify; '>\n<span style=''>Figure 1:  Map of the expanded Spring Peak and Lodestar land positions within the Aurora trend. </span><span style='vertical-align:super; '>[1]</span><span style=''>Vikre and others (2015); </span><span style='vertical-align:super; '>[2]</span><span style=''>Borealis Mine 43-101 dated February 16, 2024; </span><span style='vertical-align:super; '>[3]</span><span style=''>Long and others (1998).</span>\n</p>\n\n<p style='text-align:justify; '>\n<span style=''>Recognition of this opportunity coupled with recent sampling and geophysical programs led the Company to complete a large claim staking campaign along the northeastern margin of the preexisting land package in 2024 (Figure 1).  The addition of 583 new claims in this area, split between the Company’s Spring Peak (~7,835 hectares) and Lodestar (~1,620 hectares) projects, makes Headwater the largest land holder in the district.</span>\n</p>\n\n<p style='text-align:left; '>\n<span style='text-align:center; '><img src=\"https://www.thenewswire.com/data/tnw/clients/img/65a0d791d23de8d880f684c029a0b396_.png\" /></span>\n</p>\n \n<p style='font-style:italic; text-align:justify; '>\n<span style=''>Figure 2:  Simplified geologic map of Doug target area showing the historically mined Ann veins and select results from Headwater’s initial rock chip sampling program.</span>\n</p>\n\n<p style='text-align:justify; '>\n<span style='font-weight:bold; '>Doug Target and Bear Fault Corridor:</span><span style=''> The newly identified Doug target occurs in an exposed window of altered andesite, granite, and epithermal vein subcrop, in an area measuring approximately 250 m by 750 m (Figure 1). The Doug target is located along the northern trend of the Bear Fault approximately 9 km from the Disco Zone where the fault hosts high-grade epithermal veins discovered by Headwater in 2022. Headwater geologists interpret this fault as an important control on mineralization in the region. The greater Doug area is largely covered by thin young basalt flows, but newly discovered vein exposures at Doug may represent the extension of the historically mined Ann veins immediately to the southwest within Hecla’s Aurora Project (Figure 2). Initial rock sampling at Doug has returned gold values up to 2.05 g/t Au. </span><a href='' target='_blank'></a><span style=''>Vein textures in the area are characteristic of the shallow, high-level portions of an epithermal vein system</span><span style=''>, including fine-grained chalcedonic banded veins (Figure 3) and vein sediments.  The Doug area has seen little to no historic exploration, making it a high-priority target for follow-up exploration.</span>\n</p>\n\n<p style='text-align:left; '>\n<span style='text-align:center; '><img src=\"https://www.thenewswire.com/data/tnw/clients/img/04695028480677992df5fee71bbf9c42_.png\" /></span>\n</p>\n \n<p style='font-style:italic; text-align:justify; '>\n<span style=''>Figure 3:  Examples of typical vein textures present in the Doug target area. A) chalcedonic banded vein with quartz-after-calcite boiling textures and iron oxides B) chalcedonic vein with vein sediment infill.</span>\n</p>\n\n<p style='text-align:justify; '>\n<span style='font-weight:bold; '>District-Scale Exploration Program:</span>\n</p>\n\n<p style='text-align:justify; '>\n<span style=''>Geophysics:</span><span style=''> The 2024 Spring Peak and Lodestar exploration programs include gravity, CSAMT, and helicopter magnetics and radiometrics. These methods will help map subsurface structures at a district and prospect scale and identify potential mineralized zones. Gravity and CSAMT surveys are particularly useful for detecting changes in density and resistivity, respectively, which can aid in detecting the presence of large structures and potential mineralized bodies at depth and beneath shallow post-mineral cover.</span>\n</p>\n\n<p style='text-align:justify; '>\n<span style=''>Surface Geochemistry:</span><span style=''> Headwater is also employing a comprehensive surface geochemistry program over a large portion of the newly expanded land package, including stream sediment sampling, rock sampling, and soil sampling. The soil sampling will utilize Newmont’s Deep Sensing Geochemistry (DSG) methodology. DSG is a proprietary technique developed by Newmont to detect ultra-low concentrations of gold and associated metals through challenging surface conditions, such as unmineralized cover or complex geochemical environments. This </span><span style=''>method has been successful in identifying blind mineralization at depths of over 500 metres and has been designed to provide a competitive advantage in deep cover exploration when compared to traditional surface geochemistry.​</span>\n</p>\n\n<p style='text-align:justify; '>\n<span style='font-weight:bold; '>About the Spring Peak Project:</span><span style=''> The Spring Peak project is located in the Aurora Mining District in the Walker Lane belt, west-central Nevada, approximately 50 km southwest of the town of Hawthorne. The project adjoins Hecla Mining Company’s past-producing Aurora Mine complex, where existing infrastructure includes a 350 ton per day mill, several production water wells, and high-voltage three-phase power. Recent drilling at the Disco Zone has confirmed the presence of high-grade gold mineralization, including significant intersections such as 15.92 g/t Au over 2.38 m and 10.43 g/t Au over 2.01 m within a broader zone of 2.73 g/t Au over 34.72 m. A multi-rig drill program totaling up to approximately 7,000 metres over 20 to 25 holes is scheduled to begin in summer 2024. The primary objective of the drill program will be to test for extensions of mineralization along the Bear Fault corridor, which hosts high-grade mineralization at the Disco Zone discovery. Additionally, multiple new targets across the broader land package will be tested with initial scout drilling, including targets on newly acquired private lands which have no prior drilling. Headwater holds an option to acquire a 100% undivided interest in the Spring Peak project from Orogen Royalties (TSXV: OGN), subject to retained royalties and subject to Newmont’s option to acquire up to 75% of the project following certain expenditures and preparation of a Pre-Feasibility Study within a designated time frame.</span>\n</p>\n\n<p style='text-align:justify; '>\n<span style='font-weight:bold; '>About the Lodestar Project:</span><span style=''> Located approximately 10 km north of the Spring Peak project, the Lodestar project also adjoins Hecla’s past-producing Aurora Mine complex (Figure 1). The strategic expansion through new claim staking enhances the exploration potential of the Lodestar project, building on the success of ongoing exploration efforts. A multi-rig drill program totaling up to approximately 3,500 metres over 10 to 15 holes is currently scheduled to begin in the fall of 2024 pending the receipt of a drill permit which has been submitted to the United States Forest Service. The primary objective of the drill program will be to test for high-grade precious metal deposits in steeply dipping feeder structures under the Zodiac sinter target. Additional scout drill holes are planned to test under-cover geophysical targets adjacent to the Zodiac target, beneath a thin veneer of post-mineral basalt. Headwater holds an option to acquire a 100% undivided interest in the Lodestar project from a private vendor, subject to retained royalties and Newmont’s option to acquire up to 75% of the project following certain expenditures and preparation of a Pre-Feasibility Study within a designated time frame.</span><a href='' target='_blank'></a>\n</p>\n\n<p style='text-align:justify; '>\n<span style='font-weight:bold; '>About Headwater Gold:</span> \n</p>\n\n<p style='text-align:justify; '>\n<span style=''>Headwater Gold Inc. (CSE: HWG, OTCQB: HWAUF) is a technically-driven mineral exploration company focused on the exploration and discovery of high-grade precious metal deposits in the Western USA.  Headwater is aggressively exploring one of the most well-endowed and mining-friendly jurisdictions in the world with a goal of making world-class precious metal discoveries.  Headwater has a large portfolio of epithermal vein exploration projects and a technical team of experienced geologists with diverse capital markets, junior and major mining company backgrounds.  </span><a href='' target='_blank'></a><span style=''>The Company is systematically drill testing several projects in Nevada and in August 2022 and May 2023 announced significant transactions with Newmont where it acquired a 9.9% strategic equity interest in the Company and entered into earn-in agreements on several of Headwater’s projects.</span>\n</p>\n\n<p style='text-align:justify; '>\n<span style=''>Headwater is part of the NewQuest Capital Group which is a discovery-driven investment enterprise that builds value through the incubation and financing of mineral projects and companies.  Further information about NewQuest can be found on the company website at </span><a href='http://www.nqcapitalgroup.com' target='_blank'><span style=''>www.nqcapitalgroup.com</span></a><span style=''>.</span>\n</p>\n\n<p style='text-align:justify; '>\n<span style=''>For more information, please visit the Company's website at </span><a href='http://www.headwatergold.com' target='_blank'><span style=''>www.headwatergold.com</span></a><span style=''>.</span>\n</p>\n\n<p style='text-align:justify; '>\n<span style='font-weight:bold; '>On Behalf of the Board of Directors</span>\n</p>\n\n<p style='text-align:justify; '>\n<span style=''>Caleb Stroup</span>\n</p>\n\n<p style='text-align:justify; '>\n<span style=''>President and CEO</span>\n</p>\n\n<p style='text-align:justify; '>\n<span style=''>+1 (775) 409-3197</span>\n</p>\n\n<p style='text-align:justify; '>\n<a href='mailto:cstroup@headwatergold.com' target='_blank'><span style=''>cstroup@headwatergold.com</span></a>\n</p>\n\n<p style='text-align:justify; '>\n<span style=''>For further information, please contact:</span>\n</p>\n\n<p style='text-align:justify; '>\n<span style=''>Brennan Zerb</span>\n</p>\n\n<p style='text-align:justify; '>\n<span style=''>Investor Relations Manager</span>\n</p>\n\n<p style='text-align:justify; '>\n<span style=''>+1 (778) 867-5016 </span>\n</p>\n\n<p style='text-align:justify; '>\n<a href='mailto:bzerb@headwatergold.com' target='_blank'><span style=''>bzerb@headwatergold.com</span></a>\n</p>\n\n<p style='text-align:justify; '>\n<span style='font-weight:bold; '>References:</span>\n</p>\n \n<p style='text-align:justify; '>\n<span style='vertical-align:super; '>1</span><span style=''>Vikre, P.G., John, D.A., du Bray, E.A., and Fleck, R.J., 2015, Gold-silver mining districts, alteration zones, and paleolandforms in the Miocene Bodie Hills volcanic field, California and Nevada: U.S. Geological Survey Scientific Investigations Report 2015–5012, 160 p.</span>\n</p>\n\n<p style='text-align:justify; '>\n<span style='vertical-align:super; '>2</span><span style=''>Borealis Mining Company Limited, 2024, NI 43-101 Technical Report, Project Status Report Borealis Mine Nevada USA: Prepared by Douglas Reid. Effective Date: October 10, 2023; Report Date: February 16, 2024.</span>\n</p>\n\n<p style='text-align:justify; '>\n<span style='vertical-align:super; '>3</span><span style=''>Long, K.R., DeYoung, J.H., and Ludington, S.D., 1998, Database of significant deposits of gold, silver, copper, lead, and zinc in the United States: U.S. Geological Survey Open-File Report 98-206 A, B, 33 p.</span>\n</p>\n \n<p style='text-align:justify; '>\n<span style='font-weight:bold; '>Qualified Person: </span>\n</p>\n\n<p style='text-align:justify; '>\n<span style=''>The technical information contained in this news release has been reviewed and approved by Scott Close, P.Geo (158157), a “Qualified Person” (“QP”) as defined in National Instrument 43-101 – Standards of Disclosure for Mineral Projects.</span>\n</p>\n\n<p style='text-align:justify; '>\n<span style='font-weight:bold; '>Forward-Looking Statements:</span>\n</p>\n\n<p style='text-align:justify; '>\n<span style='font-style:italic; '>This news release includes certain forward-looking statements and forward-looking information (collectively, “forward-looking statements”) within the meaning of applicable Canadian securities legislation. All statements, other than statements of historical fact, included herein including, without limitation, statements regarding future capital expenditures, exploration activities and the specifications, targets, results, analyses, interpretations, benefits, costs and timing of them, Newmont’s anticipated funding of the earn-in projects and the timing thereof, and the anticipated business plans and timing of future activities of the Company, are forward-looking statements. Although the Company believes that such statements are reasonable, it can give no assurance that such expectations will prove to be correct. Often, but not always, forward looking information can be identified by words such as “pro forma”, “plans”, “expects”, “may”, “should”, “budget”, “scheduled”, “estimates”, “forecasts”, “intends”, “anticipates”, “believes”, “potential” or variations of such words including negative variations thereof, and phrases that refer to certain actions, events or results that may, could, would, might or will occur or be taken or achieved. Forward-looking statements involve known and unknown risks, uncertainties and other factors which may cause the actual results, performance or achievements of the Company to differ materially from any future results, performance or achievements expressed or implied by the forward-looking statements. Such risks and other factors include, among others, risks related to the anticipated business plans and timing of future activities of the Company, including the Company’s exploration plans and the proposed expenditures for exploration work thereon, the ability of the Company to obtain sufficient financing to fund its business activities and plans, the risk that Newmont will not elect to obtain any additional interest in the earn-in projects in excess of the minimum commitment, the ability of the Company to obtain the required permits, changes in laws, regulations and policies affecting mining operations, the Company’s limited operating history, currency fluctuations, title disputes or claims, environmental issues and liabilities, as well as those factors discussed under the heading “Risk Factors” in the Company’s prospectus dated May 26, 2021 and other filings of the Company with the Canadian </span><span style='font-style:italic; '>Securities Authorities, copies of which can be found under the Company’s profile on the SEDAR website at www.sedar.com. </span>\n</p>\n\n<p style='text-align:justify; '>\n<span style='font-style:italic; '>Readers are cautioned not to place undue reliance on forward-looking statements. The Company undertakes no obligation to update any of the forward-looking statements, except as otherwise required by law.</span>\n</p>\n\n\n<p>Copyright (c) 2024 TheNewswire - All rights reserved.</p>\n",
    "search_terms": "Spring Peak,Headwater Gold Inc.,HWG",
    "master_gid": 1080,
    "date": "2024-06-25T10:30:00.000Z",
    "tags": "USA|Nevada||Gold|Exploration update,Geophysics Program,Planned Drilling,Project Acquisition",
    "image_id": null,
    "hidden": false,
    "company_id": 424,
    "provider": "thenewswire",
    "excerpt": "Vancouver, British Columbia -TheNewswire -June 25, 2024: Headwater Gold Inc. (CSE: HWG) (OTCQB: HWAUF) (the &quot;Company&quot; or &quot;Headwater&quot;) is pleased to announce significant expansions of its Spring Peak and Lodestar projects in Nevada, and the initiation of a comprehensive district-scale exploration program.  The land expansion and regional exploration programs are",
    "is_regulatory": false,
    "refined_tags": [],
    "ftp_filename": null,
    "company_name": "Headwater Gold Inc.",
    "exchange": "CSE",
    "root_ticker": "HWG",
    "project_name": "Spring Peak",
    "gid": 1080,
    "location": "Nevada, United States",
    "plan_id": "companytier2",
    "description_text": "Vancouver, British Columbia - TheNewswire - June 25, 2024 : Headwater Gold Inc. (CSE: HWG) (OTCQB: HWAUF) (the \"Company\" or \"Headwater\") is pleased to announce significant expansions of its Spring Peak and Lodestar projects in Nevada, and the initiation of a comprehensive district-scale exploration program.  The land expansion and regional exploration programs are being funded through earn-in agreements (the “Earn-In Agreements” or “Agreements”) with Newmont Corporation (“Newmont”) (NYSE: NEM, TSX: NGT, ASX: NEM, PNGX: NEM) announced on August 16, 2022 and May 9, 2023. Highlights: 97% Land Position Expansion : Headwater has staked 583 new claims, expanding its combined Spring Peak and Lodestar land positions by 97%. This now secures approximately 15 km of strike extent along the Aurora trend which historically produced nearly 4 million ounces of gold. District-Scale Exploration Program : A comprehensive exploration program is underway in the district including gravity geophysics, CSAMT geophysics, helicopter magnetics and radiometrics, stream sediment sampling, rock sampling, and soil sampling utilizing Newmont’s Deep Sensing Geochemistry (DSG) methodology. Drilling Program Scheduled :  A multi-rig drill program at Spring Peak, totaling up to approximately 7,000 metres over 20 to 25 holes, is scheduled to begin in the first half of July 2024.  The primary objective of the drill program will be to test for extensions of mineralization along the Bear Fault corridor, which hosts high-grade mineralization at the Disco Zone discovery. New Doug Target Zone : Subcropping mineralized epithermal veins have been identified at the new Doug target area. Vein textures in the area are characteristic of the shallow portions of an epithermal vein system. Initial rock samples have yielded gold values up to 2.05 g/t Au, with additional follow-up sampling underway. Caleb Stroup, President and CEO of the Company, states: “We are thrilled with the strategic expansion of our land position, which we believe significantly increases our potential for discovering a Tier-One high-grade gold deposit along the prolific Aurora trend. The commencement of our district-scale exploration program, together with the identification of the new Doug target, underscores our commitment to aggressive and systematic exploration in the district. We are particularly excited about our ongoing application of advanced geophysical and geochemical techniques, including Newmont’s Deep Sensing Geochemistry to explore areas with thin post-mineral cover.  We believe these tools will play a critical role in our efforts to unlock the full potential of this high-grade district.” The Aurora Trend and Headwater’s Claim Expansion: The Aurora trend is a highly mineralized belt extending from Bodie, California, through the Aurora Mining District in Nevada, and up to the Borealis project area (Figure 1). Historically, this trend has seen significant high-grade gold and silver production. The Aurora district alone has recorded past production of 1.9 million ounces of gold and 25 million ounces of silver (Vikre and others, 2015). Recorded production from the Bodie district was 1.5 million ounces of gold and 7.3 million ounces of silver between 1859 and 1955 at an average grade of 33 grams per ton gold (Long and others, 1998). Despite the rich endowment of the district, the area has seen relatively limited modern exploration, especially outside of the immediate areas surrounding the historic mines. Thin post-mineral cover has hindered previous surface exploration efforts, but the recognition of exposed mineralized bedrock in the Doug area demonstrates the potential exploration opportunities under cover in the district. Figure 1:  Map of the expanded Spring Peak and Lodestar land positions within the Aurora trend. [1] Vikre and others (2015); [2] Borealis Mine 43-101 dated February 16, 2024; [3] Long and others (1998). Recognition of this opportunity coupled with recent sampling and geophysical programs led the Company to complete a large claim staking campaign along the northeastern margin of the preexisting land package in 2024 (Figure 1).  The addition of 583 new claims in this area, split between the Company’s Spring Peak (~7,835 hectares) and Lodestar (~1,620 hectares) projects, makes Headwater the largest land holder in the district. Figure 2:  Simplified geologic map of Doug target area showing the historically mined Ann veins and select results from Headwater’s initial rock chip sampling program. Doug Target and Bear Fault Corridor: The newly identified Doug target occurs in an exposed window of altered andesite, granite, and epithermal vein subcrop, in an area measuring approximately 250 m by 750 m (Figure 1). The Doug target is located along the northern trend of the Bear Fault approximately 9 km from the Disco Zone where the fault hosts high-grade epithermal veins discovered by Headwater in 2022. Headwater geologists interpret this fault as an important control on mineralization in the region. The greater Doug area is largely covered by thin young basalt flows, but newly discovered vein exposures at Doug may represent the extension of the historically mined Ann veins immediately to the southwest within Hecla’s Aurora Project (Figure 2). Initial rock sampling at Doug has returned gold values up to 2.05 g/t Au. Vein textures in the area are characteristic of the shallow, high-level portions of an epithermal vein system , including fine-grained chalcedonic banded veins (Figure 3) and vein sediments.  The Doug area has seen little to no historic exploration, making it a high-priority target for follow-up exploration. Figure 3:  Examples of typical vein textures present in the Doug target area. A) chalcedonic banded vein with quartz-after-calcite boiling textures and iron oxides B) chalcedonic vein with vein sediment infill. District-Scale Exploration Program: Geophysics: The 2024 Spring Peak and Lodestar exploration programs include gravity, CSAMT, and helicopter magnetics and radiometrics. These methods will help map subsurface structures at a district and prospect scale and identify potential mineralized zones. Gravity and CSAMT surveys are particularly useful for detecting changes in density and resistivity, respectively, which can aid in detecting the presence of large structures and potential mineralized bodies at depth and beneath shallow post-mineral cover. Surface Geochemistry: Headwater is also employing a comprehensive surface geochemistry program over a large portion of the newly expanded land package, including stream sediment sampling, rock sampling, and soil sampling. The soil sampling will utilize Newmont’s Deep Sensing Geochemistry (DSG) methodology. DSG is a proprietary technique developed by Newmont to detect ultra-low concentrations of gold and associated metals through challenging surface conditions, such as unmineralized cover or complex geochemical environments. This method has been successful in identifying blind mineralization at depths of over 500 metres and has been designed to provide a competitive advantage in deep cover exploration when compared to traditional surface geochemistry.​ About the Spring Peak Project: The Spring Peak project is located in the Aurora Mining District in the Walker Lane belt, west-central Nevada, approximately 50 km southwest of the town of Hawthorne. The project adjoins Hecla Mining Company’s past-producing Aurora Mine complex, where existing infrastructure includes a 350 ton per day mill, several production water wells, and high-voltage three-phase power. Recent drilling at the Disco Zone has confirmed the presence of high-grade gold mineralization, including significant intersections such as 15.92 g/t Au over 2.38 m and 10.43 g/t Au over 2.01 m within a broader zone of 2.73 g/t Au over 34.72 m. A multi-rig drill program totaling up to approximately 7,000 metres over 20 to 25 holes is scheduled to begin in summer 2024. The primary objective of the drill program will be to test for extensions of mineralization along the Bear Fault corridor, which hosts high-grade mineralization at the Disco Zone discovery. Additionally, multiple new targets across the broader land package will be tested with initial scout drilling, including targets on newly acquired private lands which have no prior drilling. Headwater holds an option to acquire a 100% undivided interest in the Spring Peak project from Orogen Royalties (TSXV: OGN), subject to retained royalties and subject to Newmont’s option to acquire up to 75% of the project following certain expenditures and preparation of a Pre-Feasibility Study within a designated time frame. About the Lodestar Project: Located approximately 10 km north of the Spring Peak project, the Lodestar project also adjoins Hecla’s past-producing Aurora Mine complex (Figure 1). The strategic expansion through new claim staking enhances the exploration potential of the Lodestar project, building on the success of ongoing exploration efforts. A multi-rig drill program totaling up to approximately 3,500 metres over 10 to 15 holes is currently scheduled to begin in the fall of 2024 pending the receipt of a drill permit which has been submitted to the United States Forest Service. The primary objective of the drill program will be to test for high-grade precious metal deposits in steeply dipping feeder structures under the Zodiac sinter target. Additional scout drill holes are planned to test under-cover geophysical targets adjacent to the Zodiac target, beneath a thin veneer of post-mineral basalt. Headwater holds an option to acquire a 100% undivided interest in the Lodestar project from a private vendor, subject to retained royalties and Newmont’s option to acquire up to 75% of the project following certain expenditures and preparation of a Pre-Feasibility Study within a designated time frame. About Headwater Gold: Headwater Gold Inc. (CSE: HWG, OTCQB: HWAUF) is a technically-driven mineral exploration company focused on the exploration and discovery of high-grade precious metal deposits in the Western USA.  Headwater is aggressively exploring one of the most well-endowed and mining-friendly jurisdictions in the world with a goal of making world-class precious metal discoveries.  Headwater has a large portfolio of epithermal vein exploration projects and a technical team of experienced geologists with diverse capital markets, junior and major mining company backgrounds. The Company is systematically drill testing several projects in Nevada and in August 2022 and May 2023 announced significant transactions with Newmont where it acquired a 9.9% strategic equity interest in the Company and entered into earn-in agreements on several of Headwater’s projects. Headwater is part of the NewQuest Capital Group which is a discovery-driven investment enterprise that builds value through the incubation and financing of mineral projects and companies.  Further information about NewQuest can be found on the company website at www.nqcapitalgroup.com . For more information, please visit the Company's website at www.headwatergold.com . On Behalf of the Board of Directors Caleb Stroup President and CEO +1 (775) 409-3197 cstroup@headwatergold.com For further information, please contact: Brennan Zerb Investor Relations Manager +1 (778) 867-5016 bzerb@headwatergold.com References: 1 Vikre, P.G., John, D.A., du Bray, E.A., and Fleck, R.J., 2015, Gold-silver mining districts, alteration zones, and paleolandforms in the Miocene Bodie Hills volcanic field, California and Nevada: U.S. Geological Survey Scientific Investigations Report 2015–5012, 160 p. 2 Borealis Mining Company Limited, 2024, NI 43-101 Technical Report, Project Status Report Borealis Mine Nevada USA: Prepared by Douglas Reid. Effective Date: October 10, 2023; Report Date: February 16, 2024. 3 Long, K.R., DeYoung, J.H., and Ludington, S.D., 1998, Database of significant deposits of gold, silver, copper, lead, and zinc in the United States: U.S. Geological Survey Open-File Report 98-206 A, B, 33 p. Qualified Person: The technical information contained in this news release has been reviewed and approved by Scott Close, P.Geo (158157), a “Qualified Person” (“QP”) as defined in National Instrument 43-101 – Standards of Disclosure for Mineral Projects. Forward-Looking Statements: This news release includes certain forward-looking statements and forward-looking information (collectively, “forward-looking statements”) within the meaning of applicable Canadian securities legislation. All statements, other than statements of historical fact, included herein including, without limitation, statements regarding future capital expenditures, exploration activities and the specifications, targets, results, analyses, interpretations, benefits, costs and timing of them, Newmont’s anticipated funding of the earn-in projects and the timing thereof, and the anticipated business plans and timing of future activities of the Company, are forward-looking statements. Although the Company believes that such statements are reasonable, it can give no assurance that such expectations will prove to be correct. Often, but not always, forward looking information can be identified by words such as “pro forma”, “plans”, “expects”, “may”, “should”, “budget”, “scheduled”, “estimates”, “forecasts”, “intends”, “anticipates”, “believes”, “potential” or variations of such words including negative variations thereof, and phrases that refer to certain actions, events or results that may, could, would, might or will occur or be taken or achieved. Forward-looking statements involve known and unknown risks, uncertainties and other factors which may cause the actual results, performance or achievements of the Company to differ materially from any future results, performance or achievements expressed or implied by the forward-looking statements. Such risks and other factors include, among others, risks related to the anticipated business plans and timing of future activities of the Company, including the Company’s exploration plans and the proposed expenditures for exploration work thereon, the ability of the Company to obtain sufficient financing to fund its business activities and plans, the risk that Newmont will not elect to obtain any additional interest in the earn-in projects in excess of the minimum commitment, the ability of the Company to obtain the required permits, changes in laws, regulations and policies affecting mining operations, the Company’s limited operating history, currency fluctuations, title disputes or claims, environmental issues and liabilities, as well as those factors discussed under the heading “Risk Factors” in the Company’s prospectus dated May 26, 2021 and other filings of the Company with the Canadian Securities Authorities, copies of which can be found under the Company’s profile on the SEDAR website at www.sedar.com. Readers are cautioned not to place undue reliance on forward-looking statements. The Company undertakes no obligation to update any of the forward-looking statements, except as otherwise required by law. Copyright (c) 2024 TheNewswire - All rights reserved.",
    "primary_commodity": "Au"
  },
  "articleProject": {
    "gid": 1080,
    "project_name": "Spring Peak",
    "location": "Nevada, United States"
  },
  "articleExchange": "CSE",
  "articleCompanyId": 424,
  "articleTicker": "HWG",
  "articleCompanyName": "Headwater Gold Inc.",
  "allOtherCompanyProjects": [
    {
      "company_id": 424,
      "gid": 3743,
      "project_name": "Agate Point",
      "location": "Nevada, United States"
    },
    {
      "company_id": 424,
      "gid": 9937,
      "project_name": "Jake Creek",
      "location": "Nevada, United States"
    },
    {
      "company_id": 424,
      "gid": 4124,
      "project_name": "Katey",
      "location": "Oregon, United States"
    },
    {
      "company_id": 424,
      "gid": 4685,
      "project_name": "Mahogany",
      "location": "Oregon, United States"
    },
    {
      "company_id": 424,
      "gid": 4208,
      "project_name": "Lodestar",
      "location": "Nevada, United States"
    },
    {
      "company_id": 424,
      "gid": 5505,
      "project_name": "Crane Creek",
      "location": "Idaho, United States"
    },
    {
      "company_id": 424,
      "gid": 5511,
      "project_name": "TJ",
      "location": "Nevada, United States"
    },
    {
      "company_id": 424,
      "gid": 1080,
      "project_name": "Spring Peak",
      "location": "Nevada, United States"
    },
    {
      "company_id": 424,
      "gid": 3942,
      "project_name": "Midas North",
      "location": "Nevada, United States"
    },
    {
      "company_id": 424,
      "gid": 8426,
      "project_name": "Rock Creek",
      "location": null
    },
    {
      "company_id": 424,
      "gid": 10231,
      "project_name": "Whiskey",
      "location": "Nevada, United States"
    }
  ],
  "allOtherCompanyNews": [
    {
      "id": 106022,
      "company_id": 424,
      "title": "Headwater Gold Identifies Outcropping High-Grade Veins at its New Doug Target on the Spring Peak Property, Nevada",
      "link": "https://www.thenewswire.com/press-releases?id=1LaPFo9Mp",
      "date": "2025-05-28T10:30:00.000Z",
      "hidden": false
    },
    {
      "id": 104147,
      "company_id": 424,
      "title": "Headwater Gold Grants Stock Options",
      "link": "https://www.thenewswire.com/press-releases?id=1kogFwPmd",
      "date": "2025-05-09T10:30:00.000Z",
      "hidden": false
    },
    {
      "id": 99340,
      "company_id": 424,
      "title": "Headwater Gold Acquires the Whiskey Project in Nevada and Reports 19.2 g/t Au in Rock Samples at Surface",
      "link": "https://www.thenewswire.com/press-releases?id=1BQPFN9mG",
      "date": "2025-04-10T10:30:00.000Z",
      "hidden": false
    },
    {
      "id": 89826,
      "company_id": 424,
      "title": "Headwater Gold Expands Northern Nevada Portfolio with Acquisition of the Jake Creek Epithermal Gold System",
      "link": "https://www.thenewswire.com/press-releases?id=1k98F16NY",
      "date": "2025-03-03T11:30:00.000Z",
      "hidden": false
    },
    {
      "id": 89396,
      "company_id": 424,
      "title": "Headwater Gold Intercepts 3.55 g/t Au over 7.62 m in New Target Area at Spring Peak Project, Nevada",
      "link": "https://www.thenewswire.com/press-releases?id=1k98F1d72",
      "date": "2025-02-27T11:30:00.000Z",
      "hidden": false
    },
    {
      "id": 84279,
      "company_id": 424,
      "title": "Headwater Gold Announces Results from Initial Drilling at TJ Project, Nevada",
      "link": "https://www.thenewswire.com/press-releases?id=1Bb4F9doP",
      "date": "2025-01-16T11:30:00.000Z",
      "hidden": false
    },
    {
      "id": 82609,
      "company_id": 424,
      "title": "Headwater Gold Announces Completion of First Pass Drilling at the TJ Project, Nevada",
      "link": "https://www.thenewswire.com/press-releases?id=1Av7Fv592",
      "date": "2024-12-20T11:30:00.000Z",
      "hidden": false
    },
    {
      "id": 77138,
      "company_id": 424,
      "title": "Headwater Commences Drilling on TJ Project and Provides Update on Spring Peak and Lodestar Projects, Nevada",
      "link": "https://www.thenewswire.com/press-releases?id=1A0vFvN2j",
      "date": "2024-10-31T10:30:00.000Z",
      "hidden": false
    },
    {
      "id": 73882,
      "company_id": 424,
      "title": "Headwater Announces Drilling Plans for the TJ Project, Nevada",
      "link": "https://www.thenewswire.com/press-releases?id=1k49F8wz1",
      "date": "2024-10-07T10:30:00.000Z",
      "hidden": false
    },
    {
      "id": 71608,
      "company_id": 424,
      "title": "Headwater Completes Strategic Investment by Centerra Gold",
      "link": "https://www.thenewswire.com/press-releases?id=1k3wFwwlO",
      "date": "2024-09-17T10:30:00.000Z",
      "hidden": false
    }
  ]
}
