{
  "article": {
    "id": 34435,
    "link": "https://www.globenewswire.com/news-release/2023/04/28/2657383/0/en/MAX-Power-Acquires-Lithium-Exploration-Permits-Willcox-Playa-Southeastern-Arizona-USA.html",
    "title": "MAX Power Acquires Lithium Exploration Permits, Willcox Playa, Southeastern Arizona, USA",
    "description": "<p align=\"justify\">VANCOUVER, British Columbia, April  28, 2023  (GLOBE NEWSWIRE) -- MAX Power Mining Corp. (<strong>CSE: MAXX</strong>) (<strong>OTC: MAXXF</strong>) (“<strong>MAX Power</strong>” or the “<strong>Company</strong>”) is pleased to announce its strategic entry into the American lithium sector with the acquisition of a district scale opportunity targeting lithium-rich brines and/or claystones in the ~50 sq. mile Willcox Playa in Cochise County, Arizona, approximately 200 miles southeast of Phoenix.<br /></p>  <p align=\"justify\"><strong>Highlights:</strong></p>  <ul type=\"disc\"><li style=\"text-align:justify;\">The U.S. Geological Survey (USGS), after completing some limited drilling at the Willcox Playa in the 1970’s, historically referenced this area as one of the most prospective locations for lithium in the Western United States, similar in its potential to Clayton Valley, Nevada, and the lithium brine and claystone deposits that have been identified there;</li><li style=\"text-align:justify;\">Decades of U.S. Air Force activity in the Willcox Playa has ended, with MAX benefiting from first-mover advantage and securing three well-situated blocks totaling 3,754 acres mostly leased from the state of Arizona (refer to Figure 1);</li><li style=\"text-align:justify;\">The area is surrounded by excellent infrastructure including rail, roads and services in the nearby town of Willcox.<br /></li></ul>  <p align=\"justify\">Mr. Rav Mlait, CEO of MAX Power, commented: “This strategic move into the United States is another way of differentiating MAX in the growing lithium space in combination with our initiative in northern Quebec where we are the forefront of a highly targeted drive to discover entirely new high-grade lithium camps.”</p>  <p align=\"justify\">Mr. Mlait added, “With an American division and a Canadian division, our view is that we will be able to grow our shareholder base exponentially in 2023 while delivering brisk year-round news flow. Each division will have its own niches in the lithium space, allowing MAX to appeal to very specific audiences in North America, and in each case, this includes quality exploration opportunities that provide potential high impact discovery leverage for investors. In addition, this structure provides for the potential of various strategic corporate options to further build shareholder value including a spinout of certain assets if the opportunity arises.”</p>  <p align=\"justify\"><strong><u>Lithium Potential at Willcox Playa Appears Comparable to Clayton Valley, Nevada</u></strong></p>  <p align=\"justify\">The Willcox Playa was identified by the USGS in their professional publication paper of 1976 (#1005) titled: <strong><em>“Lithium Resources and Requirements by the Year 2000” </em></strong><em>(the “</em><strong><em>USGS Report</em></strong><em>”),</em> and was referenced as one of the most prospective locations for undiscovered lithium brines and most similarly like the currently exploited brine field in Clayton Valley, home to Albermarle’s Silver Peak Brine Operation.</p>  <p align=\"center\"><strong>Willcox Playa Location Map</strong></p>  <p align=\"center\"><img alt=\"Figure 1- Map showing the locations of key lithium targets in the southwestern USA as defined by the USGS\" data-mce-src=\"/api/ImageRender/DownloadFile?resourceId=4d5c0907-fa12-4740-9a98-f1c931ac4063&amp;size=3\" height=\"498\" name=\"GNW_RichHtml_External_IMG\" src=\"https://ml.globenewswire.com/Resource/Download/4d5c0907-fa12-4740-9a98-f1c931ac4063\" width=\"600\" /></p>  <p align=\"center\"><em>Figure 1: Map showing the locations of key lithium targets in the southwestern USA as defined by the USGS.</em></p>  <p align=\"justify\"><strong><u>Historical Lithium Exploration at Willcox Playa</u></strong></p>  <p align=\"justify\">The USGS Report used the following five exploration methods at the Willcox Playa, Clayton Valley, and Searles Lake, California, to explore for lithium in clays and brines (Smith &amp; Mabey): seismic, gravity, magnetic, resistivity and electromagnetic. The USGS Report considers the Willcox Playa as having an elevated potential for lithium concentration in brines and conducted the following surveying activities: airborne magnetic survey (Dempsey et. al., 1963), gravity survey (1966), electromagnetic and resistivity survey (1976). This Report pre-dates NI 43-101 and should be treated as historical as it was not written by a Qualified Person (“<strong>QP</strong>”) as defined by NI 43-101.</p>  <p align=\"justify\">Airborne electromagnetic prospecting by the USGS identified a 22 sq. mile high electrical conductivity anomaly at the Willcox Playa. The USGS interpreted this anomaly to be caused by a subsurface brine field hosted in sediments beneath the dry Willcox Playa surface. The combination of a gravity survey showing a closed gravity low coincident with the zone of high electrical conductivity reinforces the concept that an accumulation of brine could be present beneath the Willcox Playa. This is reinforced by there being no obvious hydrological outlet that would allow the accumulated brines to escape the Willcox Playa. High evaporation rates relative to precipitation in this desert environment suggests the brine could have become increasingly concentrated over time. This work pre-dates NI 43-101 and should be treated as historical as it was not supervised by a QP.</p>  <p align=\"justify\"><strong><u>Historical Drilling at Willcox Playa</u></strong></p>  <p align=\"justify\">The USGS drilled a reverse circulation drill hole approximately 8 km northwest of MAX’s southern claims in 1978. This drill hole (USGS W-1) had a total depth of 315.5 metres. Samples were collected from the surface to total depth. Seven (7) stratigraphic intervals with a combined thickness of 23 metres exceeded 500 ppm lithium in clays as shown in table 1 (below). It must be noted that this drill hole is deemed historical as it was not supervised by a Qualified Person as defined by NI 43-101.</p>  <p align=\"center\"><strong>Table 1: Highlights of Lithium in Clays from USGS W-1 Drill Hole*</strong></p>  <p align=\"center\"><img alt=\"Table 1: Highlights of Lithium in Clays from USGS W-1 Drill Hole*\" data-mce-src=\"/api/ImageRender/DownloadFile?resourceId=9be19355-a388-47b4-873b-8c80c7941185&amp;size=3\" height=\"274\" name=\"GNW_RichHtml_External_IMG\" src=\"https://ml.globenewswire.com/Resource/Download/9be19355-a388-47b4-873b-8c80c7941185\" width=\"600\" /><br /></p>  <p align=\"justify\">*Historical drilling, not supervised by a Qualified Person as defined by National Instrument 43-101. Drilling was located 8 km northwest of MAX’s southern claims.</p>  <p align=\"justify\">The Willcox Playa has a colourful history and was once part of the Willcox Air Force Range (the “Range”). The Range was acquired by Davis-Monahan Field in 1943 for bombing and air-to-ground gunnery training. After World War II, the Range was used for bombing practice. The Willcox Playa is no longer used for bombing or gunnery training. Approximately 29,000 acres of the Willcox Playa is under Department of Defence (\"DoD\") (and of those, 23,000 acres under the purview of the U.S. Army Electronic Testing) and not available for staking (1)(2). MAX has acquired the most prospective available ground in the Playa, located in the south and east, governed by the State of Arizona and BLM.</p>  <p><strong><u>Proposed Source Rocks and Model for Lithium Concentration at the Willcox Playa</u></strong></p>  <p align=\"justify\">A proposed model for source rocks for the lithium concentrated at the Willcox Playa are the felsic volcanics in the Three Sisters Buttes to the southeast. The source rocks could also come from the northwest of the Playa as they are very similar to the Three Sisters Buttes. These felsic volcanic rocks are composed of the Apache Leap Tuff which is an ash-flow sheet. It consists of nonwelded light-gray tuff at base that grades up to densely welded black vitrophyre that is in turn overlain by densely welded tuff with a cryptocrystalline groundmass. The colour changes upward from light brown through red to very light gray at top. Pumice fragments are noted at the top. The tuffs are 2,000 feet thick at the type section but generally they average around 500 feet in thickness. These tuffs are pyroclastic and range from middle Miocene to Oligocene in age (20 to 30 Ma). Near the Willcox Playa, these tuffs are present as thick felsic volcanic sequences forming prominent cliffs and range fronts in the Chiricahua Mountains. Refer to Figure 2 (below) which outlines the proposed hydrological flow lines from the source rocks to the Willcox Playa.</p>  <p align=\"center\"><img alt=\"Figure 2-Property Location and Lithium Concentration Hypothesis - Max Power Mining\" data-mce-src=\"/api/ImageRender/DownloadFile?resourceId=2cfc37de-3c4d-4daf-9095-3bfcc3a3f548&amp;size=3\" data-mce-style=\"display: block; margin-left: auto; margin-right: auto;\" height=\"409\" name=\"GNW_RichHtml_External_IMG\" src=\"https://ml.globenewswire.com/Resource/Download/2cfc37de-3c4d-4daf-9095-3bfcc3a3f548\" style=\"display:block; margin-left:auto; margin-right:auto;\" width=\"600\" /><em>Figure 2: Property Location and Lithium Concentration Hypothesis</em></p>  <p><strong><u>Acquisition Terms For Block 1, Block 2, Block 3 Claims</u></strong></p>  <p align=\"justify\">The Company entered into a purchase and sale agreement (“<strong>Agreement</strong>”) for 100% of three (3) mineral exploration permits (state land) from Ares Strategic Mining Inc. (the “<strong>Vendor</strong>”) for consideration of 500,000 common shares (the “<strong>Consideration Shares</strong>”) of the Company and $40,000 cash. Furthermore, the Agreement stipulates that the Vendor will not sell more than 250,000 of its Consideration Shares within six months from the closing date. In relation to the acquisition of Block 1 (three mineral exploration permits totalling 1,435 acres), the Company has paid a finder’s fee of 500,000 common shares to an arm's length party, and in relation to Block 2 and 3 the Company has paid a finder’s fee of 1,500,000 common shares to a separate arm's length party for their contributions in securing three mineral exploration permits (state land) in the eastern Playa and 82 Bureau of Land Management claims (totalling 2,320 acres) in the southern and northwestern part of the Willcox Playa. All common shares issued in connection with the Agreement and finder fees are subject to a four-month hold period under applicable Canadian securities laws. All terms are subject to the approval of the Canadian Securities Exchange (“<strong>CSE</strong>”).</p>  <p align=\"justify\"><strong><u>Qualified Person</u></strong></p>  <p align=\"justify\">The technical information in this news release has been reviewed and approved by Thomas Clarke, P.Geo., Pr.Sci.Nat, and Director for MAX Power Mining Corp. Mr. Clarke is the Qualified Person responsible for the scientific and technical information contained herein under National Instrument 43-101 standards.</p>  <p align=\"justify\">(1) Source: https://projects.propublica.org/</p>  <p align=\"justify\">(2) Source: https://www.atec.army.mil/epg/about.html</p>  <p><strong><u>About MAX Power</u></strong></p>  <p align=\"justify\">MAX Power is a dynamic exploration stage resource company targeting domestic lithium resources to advance North America’s renewable energy prospects.</p>  <p align=\"justify\"><strong>Contact: </strong><a href=\"https://www.globenewswire.com/Tracker?data=M6I5m1XBlirqcPnV6mK3DcJE6crnC1eBoixz9HqfWvzHvgXs2L-j1QjavNlBWH-ynMH7bOgT2WVUor8LoNM_V1vr2Q58YB4ZSeix8cGrLMY=\" rel=\"nofollow\" target=\"_blank\" title=\"\"><em>info@maxpowermining.com</em></a></p>  <p align=\"justify\"><em>MarketSmart Communications at 877-261-4466.</em></p>  <p align=\"justify\"><strong><u>Forward-Looking Statement Cautions</u></strong></p>  <p align=\"justify\"><em>This press release contains certain “forward-looking statements” within the meaning of Canadian securities legislation, relating to exploration, drilling, mineralization and historical results on the Property; the interpretation of drilling and assay results, the results of any future drilling program, mineralization and the discovery mineralization (if any); plans for future exploration and drilling and the timing of same; the merits of the Willcox Playa Property;</em> the <em>potential for lithium within the Willcox Playa region; ability to access Property; ability to extract resources from the Property, commentary as it related to the opportune timing to explore lithium exploration and any anticipated increasing demand for lithium; any results and updates thereto as it relates to the USGS report; </em><em>the Company’s concentration hypothesis; closing of the transaction; </em><em>future press releases by the Company; and funding of any future drilling program. Although the Company believes that such statements are reasonable, it can give no assurance that such expectations will prove to be correct. Forward-looking statements are statements that are not historical facts; they are generally, but not always, identified by the words \"expects,\" \"plans,\" \"anticipates,\" \"believes,\" “interpreted,” \"intends,\" \"estimates,\" \"projects,\" \"aims,\" “suggests,” “often,” “target,” “future,” “likely,” “pending,” \"potential,\" \"goal,\" \"objective,\" \"prospective,\" “possibly,” “preliminary”, and similar expressions, or that events or conditions \"will,\" \"would,\" \"may,\" \"can,\" \"could\" or \"should\" occur, or are those statements, which, by their nature, refer to future events. The Company cautions that forward-looking statements are based on the beliefs, estimates and opinions of the Company's management on the date the statements are made, and they involve a number of risks and uncertainties. Consequently, there can be no assurances that such statements will prove to be accurate and actual results and future events could differ materially from those anticipated in such statements. Except to the extent required by applicable securities laws and the policies of the CSE, the Company undertakes no obligation to update these forward-looking statements if management's beliefs, estimates or opinions, or other factors, should change. Factors that could cause future results to differ materially from those anticipated in these forward-looking statements include risks associated with possible accidents and other risks associated with mineral exploration operations, the risk that the Company will encounter unanticipated geological factors, risks associated with the interpretation of assay results and the drilling program, the possibility that the Company may not be able to secure permitting and other governmental clearances necessary to carry out the Company's exploration plans, the risk that the Company will not be able to raise sufficient funds to carry out its business plans, and the risk of political uncertainties and regulatory or legal changes that might interfere with the Company's business and prospects. The reader is urged to refer to the Company's Management’s Discussion and Analysis, publicly available through the Canadian Securities Administrators' System for Electronic Document Analysis and Retrieval (SEDAR) at </em><a href=\"https://www.globenewswire.com/Tracker?data=qOj_EBQrSmCqC3d4De9miVb3NPL8JCzC4j8s-YXekJ1kRFdhNMZowqBZvYG8csSmHm7Vfp8o3gSCuAhDfs0j97OGxGD4rB3qL2SEq5x1t-YwAzwCDQ6lWC8AJfa3zQyiQpGT8-9Lc8xG_KnQNdVOAIt0CN6gV5EaZ-ZUL8jAKzGSbhJYqoITO_WTOKxnh4kxahC6ag9YTqayTNn22B2rwL8dm9MiRogj-O7l8oPO2poGgJupYm-FNTQJosEDyKmnUvTWpOLAnj8aSIdunbxvfm-9artFba7OQUvTeeVP-0pEFuYfcPQXbbHWQ9enAuvb\" rel=\"nofollow\" target=\"_blank\" title=\"\"><em>www.sedar.com</em></a><em> for a more complete discussion of such risk factors and their potential effects.</em></p>  <p>Photos accompanying this announcement are available at <br /><img src=\"https://ml.globenewswire.com/Resource/Download/4d5c0907-fa12-4740-9a98-f1c931ac4063?size=original\" alt=\"\"/><a href=\"https://www.globenewswire.com/Tracker?data=L-EgrnKfl0YphWggM7dgRDT2pG5KHTZXGSEEc1vPnKRORaywrJoBpp2yL9Q2mmEF9uJBmJ4jYNYQZD8As0ig6RuCcBcLznxsBbZHHJ8vO5w6wu5dtPT47pOuK2LeWnriAuD8Hz7DOSioTGR4jk39Lg==\" rel=\"nofollow\" target=\"_blank\" title=\"\"><br /></a><img src=\"https://ml.globenewswire.com/Resource/Download/9be19355-a388-47b4-873b-8c80c7941185?size=original\" alt=\"\"/><a href=\"https://www.globenewswire.com/Tracker?data=g2NYzI9dKWMmc4u4O4nmniVcbE4aRVxeUphKqoVN54wA82sPSmk6iSMH3NPOZn0QZ2UJW8tPjKQ_AYWRQ9rRINrWt0E_XJa6GAmrEDcuenUqMJvZHHFSuHh3y1vd0iCl-PWEHJUFe_EnxBUuqPolRQ==\" rel=\"nofollow\" target=\"_blank\" title=\"\"><br /></a><img src=\"https://ml.globenewswire.com/Resource/Download/2cfc37de-3c4d-4daf-9095-3bfcc3a3f548?size=original\" alt=\"\"/></p>  <br /><img src='https://ml.globenewswire.com/media/NWY4MWY2MTctZTg4Zi00M2NmLTgyNTktMGQ0ZWY2Nzg2ZjFjLTEyNTY1MDU=/tiny/Max-Power-Mining-Corp.png' referrerpolicy='no-referrer-when-downgrade' />",
    "search_terms": "Willcox Playa,Max Power Mining Corp.,MAXX",
    "master_gid": 4554,
    "date": "2023-04-28T12:00:00.000Z",
    "tags": "USA|Arizona||Lithium|Project Acquisition",
    "image_id": null,
    "hidden": false,
    "company_id": 1959,
    "provider": null,
    "excerpt": "VANCOUVER, British Columbia, April  28, 2023  (GLOBE NEWSWIRE) -- MAX Power Mining Corp. (CSE: MAXX) (OTC: MAXXF) (“MAX Power” or the “Company”) is pleased to announce its strategic entry into the American lithium sector with the acquisition of a district scale opportunity targeting lithium-rich brines and/or claystones in",
    "is_regulatory": false,
    "refined_tags": [
      "Project Acquisition"
    ],
    "ftp_filename": null,
    "company_name": "Max Power Mining Corp.",
    "exchange": "CSE",
    "root_ticker": "MAXX",
    "project_name": "Willcox Playa",
    "gid": 4554,
    "location": "Arizona, United States",
    "plan_id": null,
    "description_text": "VANCOUVER, British Columbia, April  28, 2023  (GLOBE NEWSWIRE) -- MAX Power Mining Corp. ( CSE: MAXX ) ( OTC: MAXXF ) (“ MAX Power ” or the “ Company ”) is pleased to announce its strategic entry into the American lithium sector with the acquisition of a district scale opportunity targeting lithium-rich brines and/or claystones in the ~50 sq. mile Willcox Playa in Cochise County, Arizona, approximately 200 miles southeast of Phoenix. Highlights: The U.S. Geological Survey (USGS), after completing some limited drilling at the Willcox Playa in the 1970’s, historically referenced this area as one of the most prospective locations for lithium in the Western United States, similar in its potential to Clayton Valley, Nevada, and the lithium brine and claystone deposits that have been identified there; Decades of U.S. Air Force activity in the Willcox Playa has ended, with MAX benefiting from first-mover advantage and securing three well-situated blocks totaling 3,754 acres mostly leased from the state of Arizona (refer to Figure 1); The area is surrounded by excellent infrastructure including rail, roads and services in the nearby town of Willcox. Mr. Rav Mlait, CEO of MAX Power, commented: “This strategic move into the United States is another way of differentiating MAX in the growing lithium space in combination with our initiative in northern Quebec where we are the forefront of a highly targeted drive to discover entirely new high-grade lithium camps.” Mr. Mlait added, “With an American division and a Canadian division, our view is that we will be able to grow our shareholder base exponentially in 2023 while delivering brisk year-round news flow. Each division will have its own niches in the lithium space, allowing MAX to appeal to very specific audiences in North America, and in each case, this includes quality exploration opportunities that provide potential high impact discovery leverage for investors. In addition, this structure provides for the potential of various strategic corporate options to further build shareholder value including a spinout of certain assets if the opportunity arises.” Lithium Potential at Willcox Playa Appears Comparable to Clayton Valley, Nevada The Willcox Playa was identified by the USGS in their professional publication paper of 1976 (#1005) titled: “Lithium Resources and Requirements by the Year 2000” (the “ USGS Report ”), and was referenced as one of the most prospective locations for undiscovered lithium brines and most similarly like the currently exploited brine field in Clayton Valley, home to Albermarle’s Silver Peak Brine Operation. Willcox Playa Location Map Figure 1: Map showing the locations of key lithium targets in the southwestern USA as defined by the USGS. Historical Lithium Exploration at Willcox Playa The USGS Report used the following five exploration methods at the Willcox Playa, Clayton Valley, and Searles Lake, California, to explore for lithium in clays and brines (Smith & Mabey): seismic, gravity, magnetic, resistivity and electromagnetic. The USGS Report considers the Willcox Playa as having an elevated potential for lithium concentration in brines and conducted the following surveying activities: airborne magnetic survey (Dempsey et. al., 1963), gravity survey (1966), electromagnetic and resistivity survey (1976). This Report pre-dates NI 43-101 and should be treated as historical as it was not written by a Qualified Person (“ QP ”) as defined by NI 43-101. Airborne electromagnetic prospecting by the USGS identified a 22 sq. mile high electrical conductivity anomaly at the Willcox Playa. The USGS interpreted this anomaly to be caused by a subsurface brine field hosted in sediments beneath the dry Willcox Playa surface. The combination of a gravity survey showing a closed gravity low coincident with the zone of high electrical conductivity reinforces the concept that an accumulation of brine could be present beneath the Willcox Playa. This is reinforced by there being no obvious hydrological outlet that would allow the accumulated brines to escape the Willcox Playa. High evaporation rates relative to precipitation in this desert environment suggests the brine could have become increasingly concentrated over time. This work pre-dates NI 43-101 and should be treated as historical as it was not supervised by a QP. Historical Drilling at Willcox Playa The USGS drilled a reverse circulation drill hole approximately 8 km northwest of MAX’s southern claims in 1978. This drill hole (USGS W-1) had a total depth of 315.5 metres. Samples were collected from the surface to total depth. Seven (7) stratigraphic intervals with a combined thickness of 23 metres exceeded 500 ppm lithium in clays as shown in table 1 (below). It must be noted that this drill hole is deemed historical as it was not supervised by a Qualified Person as defined by NI 43-101. Table 1: Highlights of Lithium in Clays from USGS W-1 Drill Hole* *Historical drilling, not supervised by a Qualified Person as defined by National Instrument 43-101. Drilling was located 8 km northwest of MAX’s southern claims. The Willcox Playa has a colourful history and was once part of the Willcox Air Force Range (the “Range”). The Range was acquired by Davis-Monahan Field in 1943 for bombing and air-to-ground gunnery training. After World War II, the Range was used for bombing practice. The Willcox Playa is no longer used for bombing or gunnery training. Approximately 29,000 acres of the Willcox Playa is under Department of Defence (\"DoD\") (and of those, 23,000 acres under the purview of the U.S. Army Electronic Testing) and not available for staking (1)(2). MAX has acquired the most prospective available ground in the Playa, located in the south and east, governed by the State of Arizona and BLM. Proposed Source Rocks and Model for Lithium Concentration at the Willcox Playa A proposed model for source rocks for the lithium concentrated at the Willcox Playa are the felsic volcanics in the Three Sisters Buttes to the southeast. The source rocks could also come from the northwest of the Playa as they are very similar to the Three Sisters Buttes. These felsic volcanic rocks are composed of the Apache Leap Tuff which is an ash-flow sheet. It consists of nonwelded light-gray tuff at base that grades up to densely welded black vitrophyre that is in turn overlain by densely welded tuff with a cryptocrystalline groundmass. The colour changes upward from light brown through red to very light gray at top. Pumice fragments are noted at the top. The tuffs are 2,000 feet thick at the type section but generally they average around 500 feet in thickness. These tuffs are pyroclastic and range from middle Miocene to Oligocene in age (20 to 30 Ma). Near the Willcox Playa, these tuffs are present as thick felsic volcanic sequences forming prominent cliffs and range fronts in the Chiricahua Mountains. Refer to Figure 2 (below) which outlines the proposed hydrological flow lines from the source rocks to the Willcox Playa. Figure 2: Property Location and Lithium Concentration Hypothesis Acquisition Terms For Block 1, Block 2, Block 3 Claims The Company entered into a purchase and sale agreement (“ Agreement ”) for 100% of three (3) mineral exploration permits (state land) from Ares Strategic Mining Inc. (the “ Vendor ”) for consideration of 500,000 common shares (the “ Consideration Shares ”) of the Company and $40,000 cash. Furthermore, the Agreement stipulates that the Vendor will not sell more than 250,000 of its Consideration Shares within six months from the closing date. In relation to the acquisition of Block 1 (three mineral exploration permits totalling 1,435 acres), the Company has paid a finder’s fee of 500,000 common shares to an arm's length party, and in relation to Block 2 and 3 the Company has paid a finder’s fee of 1,500,000 common shares to a separate arm's length party for their contributions in securing three mineral exploration permits (state land) in the eastern Playa and 82 Bureau of Land Management claims (totalling 2,320 acres) in the southern and northwestern part of the Willcox Playa. All common shares issued in connection with the Agreement and finder fees are subject to a four-month hold period under applicable Canadian securities laws. All terms are subject to the approval of the Canadian Securities Exchange (“ CSE ”). Qualified Person The technical information in this news release has been reviewed and approved by Thomas Clarke, P.Geo., Pr.Sci.Nat, and Director for MAX Power Mining Corp. Mr. Clarke is the Qualified Person responsible for the scientific and technical information contained herein under National Instrument 43-101 standards. (1) Source: https://projects.propublica.org/ (2) Source: https://www.atec.army.mil/epg/about.html About MAX Power MAX Power is a dynamic exploration stage resource company targeting domestic lithium resources to advance North America’s renewable energy prospects. Contact: info@maxpowermining.com MarketSmart Communications at 877-261-4466. Forward-Looking Statement Cautions This press release contains certain “forward-looking statements” within the meaning of Canadian securities legislation, relating to exploration, drilling, mineralization and historical results on the Property; the interpretation of drilling and assay results, the results of any future drilling program, mineralization and the discovery mineralization (if any); plans for future exploration and drilling and the timing of same; the merits of the Willcox Playa Property; the potential for lithium within the Willcox Playa region; ability to access Property; ability to extract resources from the Property, commentary as it related to the opportune timing to explore lithium exploration and any anticipated increasing demand for lithium; any results and updates thereto as it relates to the USGS report; the Company’s concentration hypothesis; closing of the transaction; future press releases by the Company; and funding of any future drilling program. Although the Company believes that such statements are reasonable, it can give no assurance that such expectations will prove to be correct. Forward-looking statements are statements that are not historical facts; they are generally, but not always, identified by the words \"expects,\" \"plans,\" \"anticipates,\" \"believes,\" “interpreted,” \"intends,\" \"estimates,\" \"projects,\" \"aims,\" “suggests,” “often,” “target,” “future,” “likely,” “pending,” \"potential,\" \"goal,\" \"objective,\" \"prospective,\" “possibly,” “preliminary”, and similar expressions, or that events or conditions \"will,\" \"would,\" \"may,\" \"can,\" \"could\" or \"should\" occur, or are those statements, which, by their nature, refer to future events. The Company cautions that forward-looking statements are based on the beliefs, estimates and opinions of the Company's management on the date the statements are made, and they involve a number of risks and uncertainties. Consequently, there can be no assurances that such statements will prove to be accurate and actual results and future events could differ materially from those anticipated in such statements. Except to the extent required by applicable securities laws and the policies of the CSE, the Company undertakes no obligation to update these forward-looking statements if management's beliefs, estimates or opinions, or other factors, should change. Factors that could cause future results to differ materially from those anticipated in these forward-looking statements include risks associated with possible accidents and other risks associated with mineral exploration operations, the risk that the Company will encounter unanticipated geological factors, risks associated with the interpretation of assay results and the drilling program, the possibility that the Company may not be able to secure permitting and other governmental clearances necessary to carry out the Company's exploration plans, the risk that the Company will not be able to raise sufficient funds to carry out its business plans, and the risk of political uncertainties and regulatory or legal changes that might interfere with the Company's business and prospects. The reader is urged to refer to the Company's Management’s Discussion and Analysis, publicly available through the Canadian Securities Administrators' System for Electronic Document Analysis and Retrieval (SEDAR) at www.sedar.com for a more complete discussion of such risk factors and their potential effects. Photos accompanying this announcement are available at",
    "primary_commodity": "Li"
  },
  "articleProject": {
    "gid": 4554,
    "project_name": "Willcox Playa",
    "location": "Arizona, United States"
  },
  "articleExchange": "CSE",
  "articleCompanyId": 1959,
  "articleTicker": "MAXX",
  "articleCompanyName": "Max Power Mining Corp.",
  "allOtherCompanyProjects": [
    {
      "company_id": 1959,
      "gid": 5138,
      "project_name": "Raglan South",
      "location": "Quebec, Canada"
    },
    {
      "company_id": 1959,
      "gid": 4554,
      "project_name": "Willcox Playa",
      "location": "Arizona, United States"
    },
    {
      "company_id": 1959,
      "gid": 4540,
      "project_name": "Raglan West",
      "location": "Quebec, Canada"
    },
    {
      "company_id": 1959,
      "gid": 3954,
      "project_name": "Corvette North",
      "location": "Quebec, Canada"
    },
    {
      "company_id": 1959,
      "gid": 3955,
      "project_name": "Corvette South",
      "location": "Quebec, Canada"
    },
    {
      "company_id": 1959,
      "gid": 5060,
      "project_name": "Spark",
      "location": "Quebec, Canada"
    },
    {
      "company_id": 1959,
      "gid": 9453,
      "project_name": "Rider",
      "location": "Saskatchewan, Canada"
    }
  ],
  "allOtherCompanyNews": [
    {
      "id": -203605,
      "company_id": 1959,
      "title": "MAX Power Announces Appointment of Ryan Cheung as CFO",
      "link": "https://www.thenewswire.com/press-releases?id=1kogFwG12",
      "date": "2025-06-05T16:30:00.000Z",
      "hidden": false
    },
    {
      "id": 90984,
      "company_id": 1959,
      "title": "MAX Power Retains New Corporate Secretary",
      "link": null,
      "date": "2025-03-13T12:00:00.000Z",
      "hidden": false
    },
    {
      "id": 90342,
      "company_id": 1959,
      "title": "MAX Power Expands Geological and Engineering Team for Natural Hydrogen in Saskatchewan",
      "link": "https://www.thenewswire.com/press-releases?id=1kZaFXwa5",
      "date": "2025-03-07T14:00:00.000Z",
      "hidden": false
    },
    {
      "id": 89279,
      "company_id": 1959,
      "title": "MAX Power Director Thomas Clarke Resigns",
      "link": "https://www.globenewswire.com/news-release/2025/02/25/3032304/0/en/MAX-Power-Director-Thomas-Clarke-Resigns.html",
      "date": "2025-02-25T17:02:00.000Z",
      "hidden": false
    },
    {
      "id": 89014,
      "company_id": 1959,
      "title": "MAX Power Adds London-Based Natural Hydrogen Expert to Team",
      "link": "https://www.globenewswire.com/news-release/2025/02/24/3031296/0/en/MAX-Power-Adds-London-Based-Natural-Hydrogen-Expert-to-Team.html",
      "date": "2025-02-24T15:45:00.000Z",
      "hidden": false
    },
    {
      "id": 88770,
      "company_id": 1959,
      "title": "MAX Power Adds New Board Member",
      "link": "https://www.globenewswire.com/news-release/2025/02/21/3030421/0/en/MAX-Power-Adds-New-Board-Member.html",
      "date": "2025-02-21T13:00:00.000Z",
      "hidden": false
    },
    {
      "id": 88389,
      "company_id": 1959,
      "title": "MAX Power Retains CLC For Investor Relations",
      "link": "https://www.globenewswire.com/news-release/2025/02/19/3028719/0/en/MAX-Power-Retains-CLC-For-Investor-Relations.html",
      "date": "2025-02-19T13:00:00.000Z",
      "hidden": false
    },
    {
      "id": 87605,
      "company_id": 1959,
      "title": "Former Cameco Chairman Neil McMillan Joins MAX Power Board of Directors",
      "link": "https://www.globenewswire.com/news-release/2025/02/12/3025010/0/en/Former-Cameco-Chairman-Neil-McMillan-Joins-MAX-Power-Board-of-Directors.html",
      "date": "2025-02-12T13:00:00.000Z",
      "hidden": false
    },
    {
      "id": 82932,
      "company_id": 1959,
      "title": "MAX Power Identifies Multiple Natural Hydrogen “Fairways” In Saskatchewan, Gears Up For Drilling",
      "link": "https://www.globenewswire.com/news-release/2024/12/24/3001687/0/en/MAX-Power-Identifies-Multiple-Natural-Hydrogen-Fairways-In-Saskatchewan-Gears-Up-For-Drilling.html",
      "date": "2024-12-24T13:00:00.000Z",
      "hidden": false
    },
    {
      "id": 82933,
      "company_id": 1959,
      "title": "MAX Power Closes $1.2 Million Private Placement",
      "link": "https://www.globenewswire.com/news-release/2024/12/02/2990198/0/en/MAX-Power-Closes-1-2-Million-Private-Placement.html",
      "date": "2024-12-02T22:35:00.000Z",
      "hidden": false
    }
  ]
}
