{
  "article": {
    "id": 70682,
    "link": "https://www.newsfilecorp.com/release/222635/Cuprite-LLC-Acquires-Ground-Adjacent-and-Internal-to-StrikePoint-Golds-Cuprite-Gold-Project-Walker-Lane-Nevada",
    "title": "Cuprite LLC Acquires Ground Adjacent and Internal to StrikePoint Gold's Cuprite Gold Project, Walker Lane, Nevada",
    "description": "<img src=\"https://api.newsfilecorp.com/newsinfo/222635/367\" id=\"367\" width=\"2\" height=\"2\" style=\"width: 1px;  height: 1px;border: 0px solid;\" /><p>Vancouver, British Columbia--(Newsfile Corp. - September 9, 2024) - StrikePoint Gold Inc. (TSXV: SKP) (OTCQB: STKXF) (\"StrikePoint\" or the \"Company\") is pleased to provide an update the wholly owned Cuprite Gold Project.</p><p>Cuprite LLC acquired by staking approximately 152 claims immediately to the West of the Company's Cuprite Gold Project.   This claim block ties onto the Company's land package.  </p><p>StrikePoint believes that Cuprite LLC is controlled by the Electrum Group a New York-based registered investment adviser.  Electrum makes strategic investments principally in high-quality precious metals assets and opportunities and manages Client assets on a discretionary basis, valued at <a href=\"https://api.newsfilecorp.com/redirect/PL0xJHLnKk\">~$1.7 Billion as of December 31, 2023</a>.  Further information about the Electrum Group can be found  <a href=\"https://api.newsfilecorp.com/redirect/wWQYJTy51M\">here</a>.</p><p> In addition, the Company has recently become aware that that a third party, potentially associated with the Electrum Group, has leased the 54 claims that are internal to the Cuprite Gold Project. </p><p>\"The recent activity validates our excitement about the Cuprite Gold Project\" said CEO Michael G. Allen. \"Our drill results show that the Cuprite Project hosts a large-scale mineralized system, and others are moving into this emerging gold district in Nevada where StrikePoint has a strong land position.\"</p><p style=\"text-align: center;\"><a rel=\"nofollow\" href=\"https://images.newsfilecorp.com/files/5044/222635_e09f5b73543c79bb_002full.jpg\"><img src=\"https://images.newsfilecorp.com/files/5044/222635_e09f5b73543c79bb_002.jpg\" style=\"border-width: 0px;\" alt=\"Cannot view this image? Visit: https://images.newsfilecorp.com/files/5044/222635_e09f5b73543c79bb_002.jpg\" /></a></p><p style=\"text-align: center;\"><a href=\"https://api.newsfilecorp.com/redirect/gOg87CVLye\">Figure 1: Cuprite Gold District Land Position</a></p><p style=\"text-align: center;\">To view an enhanced version of this graphic, please visit:<br /><a rel=\"nofollow\" href=\"https://images.newsfilecorp.com/files/5044/222635_e09f5b73543c79bb_002full.jpg\">https://images.newsfilecorp.com/files/5044/222635_e09f5b73543c79bb_002full.jpg</a></p><p>StrikePoint Golds inaugural drill program at Cuprite project was the first drilling on the project since staking was allowed on the property.  This inaugural drill program cut gold mineralization in four of five holes.  Further details can be found in the Company's <a href=\"https://api.newsfilecorp.com/redirect/pEVJDC0vqV\">June 4, 2024</a> news release.</p><p><u><b>Lithogeochemistry and Clay Alteration Studies</b></u></p><p>The Company recently completed detailed lithogeochemical and preliminary clay alteration studies on reverse circulation chips from our recent drill campaign.  The detailed analysis confirmed the presence of a series of East-West structures forming a down dropped graben, as well as other northeast trending structures.  The clay alteration suggests that these structures have become conduits for mineralizing fluids.  The Company is in the process of reviewing all data prior to the next phase of drilling.  </p><p>Neither TSX Venture Exchange nor its Regulation Services Provider (as that term is defined in the policies of the TSX Venture Exchange) accepts responsibility for the adequacy or accuracy of this release</p><p><u><b>Qualified Person Statement</b></u></p><p>All technical data, as disclosed in this press release, has been verified by Michael G. Allen, P. Geo, President and CEO of the Company. Mr. Allen is a qualified person as defined under the terms of National Instrument 43-101.</p><p><u><b>About StrikePoint</b></u></p><p>StrikePoint Gold is a multi asset gold exploration company focused on building precious metals resources in Canada and the Western United States.</p><p>The Cuprite Gold Project consists of approximately 574 unpatented claims covering approximately 44-square kilometers, located 15-kilometers south of Goldfield Nevada, and 85-kilometers northwest of Beatty. The Cuprite Gold Project is easily accessible by Highway 95 on the western margin of the property.  </p><p>Approximately one hours drive from Reno the Company owns the Hercules Gold Project covering approximately 100 square kilometers with numerous drilled gold showings.  Hercules is a low-sulphidation - epithermal gold target.  </p><p>Both the Cuprite Gold Project and the Hercules Gold Project are located in the Walker Lane Gold Trend, which hosts AngloGold's exciting Silicon Gold and Merlin discoveries and Kinross's Tier - 1 Round Mountain Mine.</p><p>In addition, the Company controls two advanced-stage exploration assets in British Columbia's Golden Triangle: the past-producing high-grade silver Porter-Idaho Project and the high-grade gold Willoughby Project.</p><p><b>ON BEHALF OF THE BOARD OF DIRECTORS OF STRIKEPOINT GOLD INC.</b></p><div id=\"contactInfo\"><p><i>\"Michael G. Allen\"</i></p><p>Michael G. Allen<br />President, Chief Executive Officer &#38; Director</p><p><b>For more information, please contact:</b></p><p>StrikePoint Gold Inc.<br />Knox Henderson, Investor Relations<br />T: (604) 551-2360<br />E:&#8239;<a href=\"mailto:kh@strikepointgold.com\">kh@strikepointgold.com</a><br />W:&#8239;<a href=\"https://api.newsfilecorp.com/redirect/YYj4Of1DPo\">www.strikepointgold.com</a></p></div><p id=\"corporateNewsLogoContainer\"><img src=\"https://images.newsfilecorp.com/files/5044/222635_e09f5b73543c79bb_logo.jpg\" id=\"corporateNewsLogo\" alt=\"Corporate Logo\" /></p><p id=\"corporateLinkBack\">To view the source version of this press release, please visit <a href=\"https://api.newsfilecorp.com/redirect/0VAGLi4e02\">https://www.newsfilecorp.com/release/222635</a></p>",
    "search_terms": "Cuprite,Strikepoint Gold Inc.,SKP",
    "master_gid": 3941,
    "date": "2024-09-09T11:30:00.000Z",
    "tags": "USA|New York||Gold|Project Acquisition",
    "image_id": null,
    "hidden": false,
    "company_id": 286,
    "provider": "newsfilecorp",
    "excerpt": "Vancouver, British Columbia--(Newsfile Corp. - September 9, 2024) - StrikePoint Gold Inc. (TSXV: SKP) (OTCQB: STKXF) (\"StrikePoint\" or the \"Company\") is pleased to provide an update the wholly owned Cuprite Gold Project.Cuprite LLC acquired by staking approximately 152 claims immediately to the West of the Company's Cuprite Gold Project. This",
    "is_regulatory": false,
    "refined_tags": [],
    "ftp_filename": null,
    "company_name": "Strikepoint Gold Inc.",
    "exchange": "TSXV",
    "root_ticker": "SKP",
    "project_name": "Cuprite",
    "gid": 3941,
    "location": "Nevada, United States",
    "plan_id": null,
    "description_text": "Vancouver, British Columbia--(Newsfile Corp. - September 9, 2024) - StrikePoint Gold Inc. (TSXV: SKP) (OTCQB: STKXF) (\"StrikePoint\" or the \"Company\") is pleased to provide an update the wholly owned Cuprite Gold Project. Cuprite LLC acquired by staking approximately 152 claims immediately to the West of the Company's Cuprite Gold Project.   This claim block ties onto the Company's land package. StrikePoint believes that Cuprite LLC is controlled by the Electrum Group a New York-based registered investment adviser.  Electrum makes strategic investments principally in high-quality precious metals assets and opportunities and manages Client assets on a discretionary basis, valued at ~$1.7 Billion as of December 31, 2023 .  Further information about the Electrum Group can be found here . In addition, the Company has recently become aware that that a third party, potentially associated with the Electrum Group, has leased the 54 claims that are internal to the Cuprite Gold Project. \"The recent activity validates our excitement about the Cuprite Gold Project\" said CEO Michael G. Allen. \"Our drill results show that the Cuprite Project hosts a large-scale mineralized system, and others are moving into this emerging gold district in Nevada where StrikePoint has a strong land position.\" Figure 1: Cuprite Gold District Land Position To view an enhanced version of this graphic, please visit: https://images.newsfilecorp.com/files/5044/222635_e09f5b73543c79bb_002full.jpg StrikePoint Golds inaugural drill program at Cuprite project was the first drilling on the project since staking was allowed on the property.  This inaugural drill program cut gold mineralization in four of five holes.  Further details can be found in the Company's June 4, 2024 news release. Lithogeochemistry and Clay Alteration Studies The Company recently completed detailed lithogeochemical and preliminary clay alteration studies on reverse circulation chips from our recent drill campaign.  The detailed analysis confirmed the presence of a series of East-West structures forming a down dropped graben, as well as other northeast trending structures.  The clay alteration suggests that these structures have become conduits for mineralizing fluids.  The Company is in the process of reviewing all data prior to the next phase of drilling. Neither TSX Venture Exchange nor its Regulation Services Provider (as that term is defined in the policies of the TSX Venture Exchange) accepts responsibility for the adequacy or accuracy of this release Qualified Person Statement All technical data, as disclosed in this press release, has been verified by Michael G. Allen, P. Geo, President and CEO of the Company. Mr. Allen is a qualified person as defined under the terms of National Instrument 43-101. About StrikePoint StrikePoint Gold is a multi asset gold exploration company focused on building precious metals resources in Canada and the Western United States. The Cuprite Gold Project consists of approximately 574 unpatented claims covering approximately 44-square kilometers, located 15-kilometers south of Goldfield Nevada, and 85-kilometers northwest of Beatty. The Cuprite Gold Project is easily accessible by Highway 95 on the western margin of the property. Approximately one hours drive from Reno the Company owns the Hercules Gold Project covering approximately 100 square kilometers with numerous drilled gold showings.  Hercules is a low-sulphidation - epithermal gold target. Both the Cuprite Gold Project and the Hercules Gold Project are located in the Walker Lane Gold Trend, which hosts AngloGold's exciting Silicon Gold and Merlin discoveries and Kinross's Tier - 1 Round Mountain Mine. In addition, the Company controls two advanced-stage exploration assets in British Columbia's Golden Triangle: the past-producing high-grade silver Porter-Idaho Project and the high-grade gold Willoughby Project. ON BEHALF OF THE BOARD OF DIRECTORS OF STRIKEPOINT GOLD INC. \"Michael G. Allen\" Michael G. Allen President, Chief Executive Officer & Director For more information, please contact: StrikePoint Gold Inc. Knox Henderson, Investor Relations T: (604) 551-2360 E: kh@strikepointgold.com W: www.strikepointgold.com To view the source version of this press release, please visit https://www.newsfilecorp.com/release/222635",
    "primary_commodity": "Au"
  },
  "articleProject": {
    "gid": 3941,
    "project_name": "Cuprite",
    "location": "Nevada, United States"
  },
  "articleExchange": "TSXV",
  "articleCompanyId": 286,
  "articleTicker": "SKP",
  "articleCompanyName": "Strikepoint Gold Inc.",
  "allOtherCompanyProjects": [
    {
      "company_id": 286,
      "gid": 3941,
      "project_name": "Cuprite",
      "location": "Nevada, United States"
    },
    {
      "company_id": 286,
      "gid": 898,
      "project_name": "Arm",
      "location": "Yukon, Canada"
    },
    {
      "company_id": 286,
      "gid": 860,
      "project_name": "Kilo",
      "location": "Yukon, Canada"
    },
    {
      "company_id": 286,
      "gid": 699,
      "project_name": "Mayo",
      "location": "Yukon, Canada"
    },
    {
      "company_id": 286,
      "gid": 546,
      "project_name": "Porter Silver",
      "location": "British Columbia, Canada"
    },
    {
      "company_id": 286,
      "gid": 795,
      "project_name": "Olympus",
      "location": "Yukon, Canada"
    },
    {
      "company_id": 286,
      "gid": 548,
      "project_name": "Willoughby",
      "location": "British Columbia, Canada"
    }
  ],
  "allOtherCompanyNews": [
    {
      "id": -201882,
      "company_id": 286,
      "title": "StrikePoint Completes Sale of Porter Idaho Project to Dolly Varden Silver",
      "link": null,
      "date": "2025-05-23T13:00:00.000Z",
      "hidden": false
    },
    {
      "id": 104808,
      "company_id": 286,
      "title": "StrikePoint to Present at the Precious Metals & Critical Metals Hybrid Investor Conference on May 22nd",
      "link": null,
      "date": "2025-05-15T12:35:00.000Z",
      "hidden": false
    },
    {
      "id": 104033,
      "company_id": 286,
      "title": "StrikePoint Signs Definitive Agreement to Sell BC Property to Dolly Varden Silver",
      "link": null,
      "date": "2025-05-08T12:00:00.000Z",
      "hidden": false
    },
    {
      "id": 103459,
      "company_id": 286,
      "title": "StrikePoint Drills Broad Zones of Near Surface Oxide Gold at the Hercules Gold Project, Nevada",
      "link": null,
      "date": "2025-05-05T11:30:00.000Z",
      "hidden": false
    },
    {
      "id": 101839,
      "company_id": 286,
      "title": "StrikePoint Drills Near-Surface High Grade Oxide Gold at the Hercules Gold Project, Nevada, 32.04 Meters of 0.54 g/t Au and 4.62 g/t Ag Starting at Surface, Including 4.57 Meters of 1.14 g/t Au and 10.53 g/t Ag and an Additional 6.10m of 1.50 g/t Au and 11.75 g/t Ag",
      "link": null,
      "date": "2025-04-28T11:30:00.000Z",
      "hidden": false
    },
    {
      "id": 100233,
      "company_id": 286,
      "title": "StrikePoint Files NI 43-101 Technical Report Outlining Exploration Target of Between 819,000 and 1,018,000 oz Au on the Hercules Gold Project in Nevada's Walker Lane, Completes Drill Program",
      "link": null,
      "date": "2025-04-17T21:12:00.000Z",
      "hidden": false
    },
    {
      "id": 90440,
      "company_id": 286,
      "title": "StrikePoint Commences Drilling at Hercules Gold Project, With Current Exploration Target of 1 Moz of Oxide Gold in Nevada's Walker Lane",
      "link": "https://www.newsfilecorp.com/release/243917/StrikePoint-Commences-Drilling-at-Hercules-Gold-Project-With-Current-Exploration-Target-of-1-Moz-of-Oxide-Gold-in-Nevadas-Walker-Lane",
      "date": "2025-03-10T11:00:00.000Z",
      "hidden": false
    },
    {
      "id": 89817,
      "company_id": 286,
      "title": "StrikePoint Reports Exploration Target on Hercules Gold Project of Between 819,000 and 1,018,000 Ounces Au Grading Between 0.48 and 0.63 g/t Au",
      "link": "https://www.newsfilecorp.com/release/243009/StrikePoint-Reports-Exploration-Target-on-Hercules-Gold-Project-of-Between-819000-and-1018000-Ounces-Au-Grading-Between-0.48-and-0.63-gt-Au",
      "date": "2025-03-03T12:30:00.000Z",
      "hidden": false
    },
    {
      "id": -160026,
      "company_id": 286,
      "title": "StrikePoint Announces AGM Results, Provides Corporate Update",
      "link": "https://www.newsfilecorp.com/release/233424/StrikePoint-Announces-AGM-Results-Provides-Corporate-Update",
      "date": "2024-12-11T21:29:00.000Z",
      "hidden": false
    },
    {
      "id": 80208,
      "company_id": 286,
      "title": "StrikePoint Closes Upsized Second and Final Tranche of Private Placement",
      "link": "https://www.newsfilecorp.com/release/231677/StrikePoint-Closes-Upsized-Second-and-Final-Tranche-of-Private-Placement",
      "date": "2024-11-27T21:05:00.000Z",
      "hidden": false
    }
  ]
}
