{
  "article": {
    "id": 89691,
    "link": "https://www.newsfilecorp.com/release/242926/Star-Gold-and-Romios-Gold-Announce-Letter-of-Intent-Regarding-Top-Tier-Nevada-GoldSilverCopper-Projects-The-Scossa-Mine-and-Kinkaid-Properties",
    "title": "Star Gold and Romios Gold Announce Letter of Intent Regarding Top Tier Nevada Gold/Silver/Copper Projects - The Scossa Mine and Kinkaid Properties",
    "description": "<img src=\"https://api.newsfilecorp.com/newsinfo/242926/367\" id=\"367\" width=\"2\" height=\"2\" style=\"width: 1px;  height: 1px;border: 0px solid;\" /><p>Coeur d'Alene, Idaho and Toronto, Ontario--(Newsfile Corp. - February 28, 2025) - <b>Star Gold Corp. (OTCQB: SRGZ) (\"Star Gold\") and Romios Gold Resources Inc. (TSXV: RG) (OTC Pink: RMIOF) (FSE: D4R) (\"Romios Gold\") </b>are pleased to announce their intent to enter into a share purchase agreement (the \"Share Purchase Agreement\") \") to acquire all issued and outstanding shares of Romios' wholly owned affiliate Romios Gold Nevada Inc. which includes all the rights and interests in the Scossa Mine Property (the \"Scossa Property\"), and Kinkaid Property (the \"Kinkaid Property\").</p><p>\"Romios has been focussed on identifying the right partner to move these exceptional projects forward, and I believe that partnering with Star Gold is going to produce significant benefits for Romios' shareholders as we take on a large ownership in Star Gold and work towards building value at all three projects,\" said Stephen Burega, CEO and President of Romios. \"This strategic partnership will allow for the creation of a multi-facetted Nevada story with a clear focus towards near-term production.\"</p><p>\"We are very excited to complete this strategic acquisition of the Scossa and Kinkaid properties,\" said Lindsay Gorrill, Chairman of Star Gold. \"Scossa and Kinkaid complement our existing near-term production Longstreet property as we build a portfolio of high-quality projects in Nevada.\"</p><p><b>General Terms of Transaction:</b></p><ul style=\"list-style-type: disc;\"><li>Star Gold will reorganize and complete a share roll-back of the current issued and outstanding capital of the Purchaser, on a 10-1 basis, such that the total number of shares outstanding will be approximately 13,589,069.</li><li>Closing of the Share Purchase Agreement shall not occur prior to the closing of a capital raise of not less than one million, five hundred thousand dollars (USD$1,500.000).</li><li>The share distribution of Star Gold (OTCQB: SRGZ) at the time of Closing, prior to any financing:<ul><li>Romios Gold - 20,383,604 (60.00%)</li><li>Star Gold - 13,589,069 (40.00%)</li><li>Total O/S: 33,972,673 (100.00%)</li></ul></li><li>The Parties will use their reasonable commercial efforts to finalize the Share Purchase Agreement by March 14, 2025 (\"Agreement Date\"), but in no event later than March 31, 2025 (\"Definitive Agreement Deadline\"). The Transaction is subject to TSX Venture Exchange and the US Securities and Exchange Commission (SEC) approval.</li></ul><p>Both Companies will work diligently to move forward through final due diligence and completion of the definitive Share Purchase Agreement within the timelines as set forth in today's announced Letter of Intent.</p><p><b>About Longstreet Property<br /></b>The Longstreet Property comprises 125 mineral claims covering approximately 1,012 ha (2,500 acres) in Nevada's Walker Lane, approximately 30 miles east of Round Mountain where historically more than 15 million oz of gold have been produced.  The main Au-Ag zone at Longstreet is about 325 m long, 200 m wide, and 3 to 85 m thick. It is developed on the edges of a collapsed caldera within Oligocene felsic welded tuffs and consists of Au-Ag bearing quartz veins and hydrothermally altered, brecciated and pyritized zones. Two NI 43-101 reports in 2013 and then again in 2021 determined an in-pit Indicated + Inferred resource estimate of 101,100 oz Au and 2,459,000 oz Ag (at grades of 0.636 g/t Au and 15.55 g/t Ag in the Indicated category, 0.575 g/t Au and 15.02 g/t Ag in the Inferred category). At a gold price of $1,500/oz and a silver price of $18/oz, the pre-tax IRR was calculated at 89% and the NPV was $53M. At current gold and silver prices, the economics are expected to be significantly better. Seven additional targets remain to be explored on the property, including the Opal Ridge zone which may be the down-faulted extension of the main zone. Ongoing mine permitting and baseline studies have been undertaken by Star Gold over the past few years, and it is estimated that these could take another 2 years while exploration continues on the property.</p><p><b>About Scossa Mine Property<br /></b>This historic property in NW Pershing County consists of a mix of 50 mining claims and private lands totalling 541 hectares (1,336.8 acres) that cover the former high-grade Scossa gold mine. It lies at the intersection of the Sleeper Mine trend and the Rye Patch trend. The mine exploited 4 adjacent, parallel epithermal veins 300 to 550 m long, and several shorter offshoot veins, and operated from the 1930s to the early 1940s when it shut down due to the war. The ore averaged over 1 oz/t Au and mining progressed only as deep as the 400 ft. (122 m) level; similar deposits in the region were typically mined to depths of around 1,200 ft. (366 m). Romios undertook a diamond drilling program in 2000 and Reverse Circulation drilling programs in 2003 and 2006, intersecting gold mineralization in several shallow holes (e.g., 3.35 m @ 180.2 g/t Au). Large sections of multiple veins have not been drilled as yet. A 3D model of the past drilling and underground workings was completed by Rangefront Mining Services on Romios' behalf in 2022. This model indicates that there is excellent potential for a substantial high-grade gold shoot at shallow levels down-plunge to the south of the old workings on the main vein, in the vicinity of Romios drill intersections. Records of past work on the adjacent 4 parallel veins are too incomplete to allow for a robust model but the Company's recent surface sampling, geological observations and limited past drilling suggest that these veins also have good potential for high-grade shoots above the paleo-boiling zone level (where gold begins to precipitate in epithermal systems). The presence of \"angel-wing\" bladed calcite replaced by silica in exposures at the base of the main hill suggest that there is at least 150 m of potentially mineralized veins above this paleo-boiling zone level, in addition to the likely significant extent of mineralized boiling zone material below these exposures (based on the numerous old shafts and workings at this level). </p><p><b>About Kinkaid Property</b><br />The Kinkaid property consists of 139 claims covering approximately 1,101 hectares (2,720 acres) in Mineral County and the Walker Lane mineral/tectonic belt of southern Nevada and are largely road accessible. The property encompasses an anomalous cluster of dozens of small-scale former mines and exploration workings that exploited high-grade Au-Cu+/-Ag vein deposits and several tungsten+/-gold skarn deposits with a locally apparent epithermal Au-Ag overprint. Impressive assays ranging from trace to 16.55% Cu, 78.16 g/t Au, 1,725 g/t Ag, 6.9% Zn and elevated Sb, Te, Co, Pb and barium assays have been returned from Romios' chip and grab samples. Historic mining operations extended over strike lengths up to 500 m in some cases and apparently largely ceased by the 1940s. The vein deposits are clustered in several discoloured, altered areas ~1 km across within an overall 3 km wide area, are typically accompanied by strong sericite alteration, and exhibit a positive correlation between copper and gold grades; together these features suggest that the veins are developed in the upper part of a porphyry copper type system.  The skarns immediately to the north of the vein clusters are surrounded by a prominent metamorphic aureole ~1 km wide, a further indication of buried intrusions at shallow depths on these claims. The recent discovery of numerous copper rich skarn boulders assaying from 0.73% to 13.3% Cu on the adjacent KIN claims may be indicative of another intrusive centre on those claims.</p><p><b>Qualified Persons</b></p><p>The technical information in this news release pertaining to the Scossa and Kinkaid properties has been reviewed and approved by John Biczok, P. Geo., Vice President, Exploration for Romios Gold and a Qualified Person as defined by National Instrument 43-101. In addition to his extensive experience with several major mining companies exploring for a wide variety of ore deposit types across Canada and India, Mr. Biczok spent 12 years conducting exploration and research at the Musselwhite gold mine in NW Ontario.</p><p>The technical information in this news release pertaining to the Longstreet Property has been reviewed and approved by Reinis N. Sipols PE, Managing Director Pack Leader Services LLC and a Qualified Person as defined by National Instrument 43-101 (MMSA #01440 QP). Mr. Sipols has extensive operational, engineering and exploration experience with several major mining companies in the United States, Mr. Sipols is the Project Manager and has spent over 12 years developing, designing, and permitting the Longstreet Project of Stargold near Tonopah, Nevada.</p><p><b>About Star Gold Corporation:</b><br />Star Gold Corporation is a leading mining company based in Nevada, dedicated to the exploration and development of high-quality mineral properties. With a strong commitment to sustainable practices and community engagement, Star Gold Corporation aims to deliver long-term value to its shareholders and stakeholders by building high grade resources in Nevada. Star Gold Corp is listed on the OTC Markets (OTCQB: SRGZ).</p><p><b>For more information:</b> <a href=\"https://api.newsfilecorp.com/redirect/zEOYEfVDwv\">www.stargoldcorp.com</a>. </p><p><b>About Romios Gold Resources Inc.:</b><br />Romios Gold Resources Inc. is a progressive Canadian mineral exploration company engaged in precious- and base-metal exploration, focused primarily on gold, copper and silver. It has a 100% interest in the Lundmark-Akow Lake Au-Cu property plus 4 additional claim blocks in northwestern Ontario and extensive claim holdings covering several significant porphyry copper-gold prospects in the \"Golden Triangle\" of British Columbia. Additional interests include the Kinkaid claims in Nevada covering numerous Au-Ag-Cu workings, and two former producers: the Scossa mine property (Nevada) which is a former high-grade gold producer and the La Corne molybdenum mine property (Quebec). The Company retains an ongoing interest in several properties including a 2% NSR on McEwen Mining's Hislop gold property in Ontario; a 2% NSR on Enduro Metals' Newmont Lake Au-Cu-Ag property in BC, and the Company has signed a definitive agreement with Copperhead Resources Inc. (\"Copperhead\") whereby Copperhead can acquire a 75% ownership interest in Romios' Red Line Property in BC.</p><p><b>For more information, please </b><a href=\"https://api.newsfilecorp.com/redirect/4Qp8Qhb2Gy\"><b>click here</b></a><b> for Romios' website.</b></p><p><b>Romios has 264 million common shares outstanding, 284 million shares fully diluted.</b></p><p><i>This News Release contains forward-looking statements which are typically preceded by, followed by or include the words \"believes\", \"expects\", \"anticipates\", \"estimates\", \"intends\", \"plans\" or similar expressions. Forward-Looking statements are not guarantees of future performance as they involve risks, uncertainties and assumptions. We do not intend and do not assume any obligation to update these forward-looking statements and shareholders are cautioned not to put undue reliance on such statements. TSX Venture Exchange or its Regulation Services Provider (as that term is defined in the policies of the TSX Venture Exchange) do not accept responsibility for the adequacy or accuracy of this release.</i></p><div id=\"contactInfo\"><p><b>For further information, please contact:</b></p><p><b>Lindsay Gorrill, Chairman, Star Gold Corp.</b> - 208-664-5066 or <a href=\"mailto:lgorrill@stargoldcorp.com\">lgorrill@stargoldcorp.com</a></p><p><b>Stephen Burega, CEO &#38; President, Romios Gold</b> - 647-515-3734 or <a href=\"mailto:sburega@romios.com\">sburega@romios.com</a></p></div><p id=\"corporateNewsLogoContainer\"><img src=\"https://images.newsfilecorp.com/files/5376/242926_romiosxstargoldlogo_200.jpg\" alt=\"Corporate Logo\" id=\"corporateNewsLogo\" /></p><p id=\"corporateLinkBack\">To view the source version of this press release, please visit <a href=\"https://api.newsfilecorp.com/redirect/jpD4pSo8MW\">https://www.newsfilecorp.com/release/242926</a></p>",
    "search_terms": "Scossa,Romios Gold Resources Inc.,RG",
    "master_gid": 2394,
    "date": "2025-02-28T20:36:00.000Z",
    "tags": "Canada,USA|Nevada||Gold|Mergers & Acquisitions,Project Acquisition",
    "image_id": null,
    "hidden": false,
    "company_id": 366,
    "provider": "newsfilecorp",
    "excerpt": "Coeur d'Alene, Idaho and Toronto, Ontario--(Newsfile Corp. - February 28, 2025) -Star Gold Corp. (OTCQB: SRGZ) (\"Star Gold\") and Romios Gold Resources Inc. (TSXV: RG) (OTC Pink: RMIOF) (FSE: D4R) (\"Romios Gold\")are pleased to announce their intent to enter into a share purchase agreement (the \"Share Purchase Agreement\") \") to",
    "is_regulatory": false,
    "refined_tags": [
      "Financials"
    ],
    "ftp_filename": null,
    "company_name": "Romios Gold Resources Inc.",
    "exchange": "TSXV",
    "root_ticker": "RG",
    "project_name": "Scossa",
    "gid": 2394,
    "location": "Nevada, United States",
    "plan_id": null,
    "description_text": "Coeur d'Alene, Idaho and Toronto, Ontario--(Newsfile Corp. - February 28, 2025) - Star Gold Corp. (OTCQB: SRGZ) (\"Star Gold\") and Romios Gold Resources Inc. (TSXV: RG) (OTC Pink: RMIOF) (FSE: D4R) (\"Romios Gold\") are pleased to announce their intent to enter into a share purchase agreement (the \"Share Purchase Agreement\") \") to acquire all issued and outstanding shares of Romios' wholly owned affiliate Romios Gold Nevada Inc. which includes all the rights and interests in the Scossa Mine Property (the \"Scossa Property\"), and Kinkaid Property (the \"Kinkaid Property\"). \"Romios has been focussed on identifying the right partner to move these exceptional projects forward, and I believe that partnering with Star Gold is going to produce significant benefits for Romios' shareholders as we take on a large ownership in Star Gold and work towards building value at all three projects,\" said Stephen Burega, CEO and President of Romios. \"This strategic partnership will allow for the creation of a multi-facetted Nevada story with a clear focus towards near-term production.\" \"We are very excited to complete this strategic acquisition of the Scossa and Kinkaid properties,\" said Lindsay Gorrill, Chairman of Star Gold. \"Scossa and Kinkaid complement our existing near-term production Longstreet property as we build a portfolio of high-quality projects in Nevada.\" General Terms of Transaction: Star Gold will reorganize and complete a share roll-back of the current issued and outstanding capital of the Purchaser, on a 10-1 basis, such that the total number of shares outstanding will be approximately 13,589,069. Closing of the Share Purchase Agreement shall not occur prior to the closing of a capital raise of not less than one million, five hundred thousand dollars (USD$1,500.000). The share distribution of Star Gold (OTCQB: SRGZ) at the time of Closing, prior to any financing: Romios Gold - 20,383,604 (60.00%) Star Gold - 13,589,069 (40.00%) Total O/S: 33,972,673 (100.00%) The Parties will use their reasonable commercial efforts to finalize the Share Purchase Agreement by March 14, 2025 (\"Agreement Date\"), but in no event later than March 31, 2025 (\"Definitive Agreement Deadline\"). The Transaction is subject to TSX Venture Exchange and the US Securities and Exchange Commission (SEC) approval. Both Companies will work diligently to move forward through final due diligence and completion of the definitive Share Purchase Agreement within the timelines as set forth in today's announced Letter of Intent. About Longstreet Property The Longstreet Property comprises 125 mineral claims covering approximately 1,012 ha (2,500 acres) in Nevada's Walker Lane, approximately 30 miles east of Round Mountain where historically more than 15 million oz of gold have been produced.  The main Au-Ag zone at Longstreet is about 325 m long, 200 m wide, and 3 to 85 m thick. It is developed on the edges of a collapsed caldera within Oligocene felsic welded tuffs and consists of Au-Ag bearing quartz veins and hydrothermally altered, brecciated and pyritized zones. Two NI 43-101 reports in 2013 and then again in 2021 determined an in-pit Indicated + Inferred resource estimate of 101,100 oz Au and 2,459,000 oz Ag (at grades of 0.636 g/t Au and 15.55 g/t Ag in the Indicated category, 0.575 g/t Au and 15.02 g/t Ag in the Inferred category). At a gold price of $1,500/oz and a silver price of $18/oz, the pre-tax IRR was calculated at 89% and the NPV was $53M. At current gold and silver prices, the economics are expected to be significantly better. Seven additional targets remain to be explored on the property, including the Opal Ridge zone which may be the down-faulted extension of the main zone. Ongoing mine permitting and baseline studies have been undertaken by Star Gold over the past few years, and it is estimated that these could take another 2 years while exploration continues on the property. About Scossa Mine Property This historic property in NW Pershing County consists of a mix of 50 mining claims and private lands totalling 541 hectares (1,336.8 acres) that cover the former high-grade Scossa gold mine. It lies at the intersection of the Sleeper Mine trend and the Rye Patch trend. The mine exploited 4 adjacent, parallel epithermal veins 300 to 550 m long, and several shorter offshoot veins, and operated from the 1930s to the early 1940s when it shut down due to the war. The ore averaged over 1 oz/t Au and mining progressed only as deep as the 400 ft. (122 m) level; similar deposits in the region were typically mined to depths of around 1,200 ft. (366 m). Romios undertook a diamond drilling program in 2000 and Reverse Circulation drilling programs in 2003 and 2006, intersecting gold mineralization in several shallow holes (e.g., 3.35 m @ 180.2 g/t Au). Large sections of multiple veins have not been drilled as yet. A 3D model of the past drilling and underground workings was completed by Rangefront Mining Services on Romios' behalf in 2022. This model indicates that there is excellent potential for a substantial high-grade gold shoot at shallow levels down-plunge to the south of the old workings on the main vein, in the vicinity of Romios drill intersections. Records of past work on the adjacent 4 parallel veins are too incomplete to allow for a robust model but the Company's recent surface sampling, geological observations and limited past drilling suggest that these veins also have good potential for high-grade shoots above the paleo-boiling zone level (where gold begins to precipitate in epithermal systems). The presence of \"angel-wing\" bladed calcite replaced by silica in exposures at the base of the main hill suggest that there is at least 150 m of potentially mineralized veins above this paleo-boiling zone level, in addition to the likely significant extent of mineralized boiling zone material below these exposures (based on the numerous old shafts and workings at this level). About Kinkaid Property The Kinkaid property consists of 139 claims covering approximately 1,101 hectares (2,720 acres) in Mineral County and the Walker Lane mineral/tectonic belt of southern Nevada and are largely road accessible. The property encompasses an anomalous cluster of dozens of small-scale former mines and exploration workings that exploited high-grade Au-Cu+/-Ag vein deposits and several tungsten+/-gold skarn deposits with a locally apparent epithermal Au-Ag overprint. Impressive assays ranging from trace to 16.55% Cu, 78.16 g/t Au, 1,725 g/t Ag, 6.9% Zn and elevated Sb, Te, Co, Pb and barium assays have been returned from Romios' chip and grab samples. Historic mining operations extended over strike lengths up to 500 m in some cases and apparently largely ceased by the 1940s. The vein deposits are clustered in several discoloured, altered areas ~1 km across within an overall 3 km wide area, are typically accompanied by strong sericite alteration, and exhibit a positive correlation between copper and gold grades; together these features suggest that the veins are developed in the upper part of a porphyry copper type system.  The skarns immediately to the north of the vein clusters are surrounded by a prominent metamorphic aureole ~1 km wide, a further indication of buried intrusions at shallow depths on these claims. The recent discovery of numerous copper rich skarn boulders assaying from 0.73% to 13.3% Cu on the adjacent KIN claims may be indicative of another intrusive centre on those claims. Qualified Persons The technical information in this news release pertaining to the Scossa and Kinkaid properties has been reviewed and approved by John Biczok, P. Geo., Vice President, Exploration for Romios Gold and a Qualified Person as defined by National Instrument 43-101. In addition to his extensive experience with several major mining companies exploring for a wide variety of ore deposit types across Canada and India, Mr. Biczok spent 12 years conducting exploration and research at the Musselwhite gold mine in NW Ontario. The technical information in this news release pertaining to the Longstreet Property has been reviewed and approved by Reinis N. Sipols PE, Managing Director Pack Leader Services LLC and a Qualified Person as defined by National Instrument 43-101 (MMSA #01440 QP). Mr. Sipols has extensive operational, engineering and exploration experience with several major mining companies in the United States, Mr. Sipols is the Project Manager and has spent over 12 years developing, designing, and permitting the Longstreet Project of Stargold near Tonopah, Nevada. About Star Gold Corporation: Star Gold Corporation is a leading mining company based in Nevada, dedicated to the exploration and development of high-quality mineral properties. With a strong commitment to sustainable practices and community engagement, Star Gold Corporation aims to deliver long-term value to its shareholders and stakeholders by building high grade resources in Nevada. Star Gold Corp is listed on the OTC Markets (OTCQB: SRGZ). For more information: www.stargoldcorp.com . About Romios Gold Resources Inc.: Romios Gold Resources Inc. is a progressive Canadian mineral exploration company engaged in precious- and base-metal exploration, focused primarily on gold, copper and silver. It has a 100% interest in the Lundmark-Akow Lake Au-Cu property plus 4 additional claim blocks in northwestern Ontario and extensive claim holdings covering several significant porphyry copper-gold prospects in the \"Golden Triangle\" of British Columbia. Additional interests include the Kinkaid claims in Nevada covering numerous Au-Ag-Cu workings, and two former producers: the Scossa mine property (Nevada) which is a former high-grade gold producer and the La Corne molybdenum mine property (Quebec). The Company retains an ongoing interest in several properties including a 2% NSR on McEwen Mining's Hislop gold property in Ontario; a 2% NSR on Enduro Metals' Newmont Lake Au-Cu-Ag property in BC, and the Company has signed a definitive agreement with Copperhead Resources Inc. (\"Copperhead\") whereby Copperhead can acquire a 75% ownership interest in Romios' Red Line Property in BC. For more information, please click here for Romios' website. Romios has 264 million common shares outstanding, 284 million shares fully diluted. This News Release contains forward-looking statements which are typically preceded by, followed by or include the words \"believes\", \"expects\", \"anticipates\", \"estimates\", \"intends\", \"plans\" or similar expressions. Forward-Looking statements are not guarantees of future performance as they involve risks, uncertainties and assumptions. We do not intend and do not assume any obligation to update these forward-looking statements and shareholders are cautioned not to put undue reliance on such statements. TSX Venture Exchange or its Regulation Services Provider (as that term is defined in the policies of the TSX Venture Exchange) do not accept responsibility for the adequacy or accuracy of this release. For further information, please contact: Lindsay Gorrill, Chairman, Star Gold Corp. - 208-664-5066 or lgorrill@stargoldcorp.com Stephen Burega, CEO & President, Romios Gold - 647-515-3734 or sburega@romios.com To view the source version of this press release, please visit https://www.newsfilecorp.com/release/242926",
    "primary_commodity": "Au"
  },
  "articleProject": {
    "gid": 2394,
    "project_name": "Scossa",
    "location": "Nevada, United States"
  },
  "articleExchange": "TSXV",
  "articleCompanyId": 366,
  "articleTicker": "RG",
  "articleCompanyName": "Romios Gold Resources Inc.",
  "allOtherCompanyProjects": [
    {
      "company_id": 366,
      "gid": 5419,
      "project_name": "Northeast Claim Block",
      "location": "British Columbia, Canada"
    },
    {
      "company_id": 366,
      "gid": 2394,
      "project_name": "Scossa",
      "location": "Nevada, United States"
    },
    {
      "company_id": 366,
      "gid": 4693,
      "project_name": "Kinkaid",
      "location": "Nevada, United States"
    },
    {
      "company_id": 366,
      "gid": 2393,
      "project_name": "Royce/Porc",
      "location": "British Columbia, Canada"
    },
    {
      "company_id": 366,
      "gid": 2392,
      "project_name": "JW",
      "location": "British Columbia, Canada"
    },
    {
      "company_id": 366,
      "gid": 2395,
      "project_name": "Trek",
      "location": "British Columbia, Canada"
    },
    {
      "company_id": 366,
      "gid": 3691,
      "project_name": "Markop Lake",
      "location": "Ontario, Canada"
    },
    {
      "company_id": 366,
      "gid": 3688,
      "project_name": "Arseno Lake",
      "location": "Ontario, Canada"
    },
    {
      "company_id": 366,
      "gid": 3687,
      "project_name": "North Caribou River",
      "location": "Ontario, Canada"
    },
    {
      "company_id": 366,
      "gid": 3690,
      "project_name": "Lundmark-Akow Lake",
      "location": "Ontario, Canada"
    },
    {
      "company_id": 366,
      "gid": 3689,
      "project_name": "Eyap Lake",
      "location": "Ontario, Canada"
    }
  ],
  "allOtherCompanyNews": [
    {
      "id": 104462,
      "company_id": 366,
      "title": "Romios Announces Field Work and Lakehead University M.Sc. Research Project on the Kinkaid High grade Cu-Au-Ag Project, Nevada",
      "link": null,
      "date": "2025-05-13T11:30:00.000Z",
      "hidden": false
    },
    {
      "id": 103491,
      "company_id": 366,
      "title": "Romios Gold Resources Inc. Announces Termination of Letter of Intent With Star Gold Resources Corp.",
      "link": null,
      "date": "2025-05-05T14:48:00.000Z",
      "hidden": false
    },
    {
      "id": -171873,
      "company_id": 366,
      "title": "Canadian Investment Regulatory Organization Trade Resumption - RG",
      "link": "https://contentapi.cision.com/api/v1.0/releases/20250228C8547",
      "date": "2025-02-28T21:23:00.000Z",
      "hidden": false
    },
    {
      "id": 89691,
      "company_id": 366,
      "title": "Star Gold and Romios Gold Announce Letter of Intent Regarding Top Tier Nevada Gold/Silver/Copper Projects - The Scossa Mine and Kinkaid Properties",
      "link": "https://www.newsfilecorp.com/release/242926/Star-Gold-and-Romios-Gold-Announce-Letter-of-Intent-Regarding-Top-Tier-Nevada-GoldSilverCopper-Projects-The-Scossa-Mine-and-Kinkaid-Properties",
      "date": "2025-02-28T20:36:00.000Z",
      "hidden": false
    },
    {
      "id": -171867,
      "company_id": 366,
      "title": "Canadian Investment Regulatory Organization Trading Halt - RG",
      "link": "https://contentapi.cision.com/api/v1.0/releases/20250228C4349",
      "date": "2025-02-28T20:02:00.000Z",
      "hidden": false
    },
    {
      "id": 89635,
      "company_id": 366,
      "title": "Romios Gold Exhibiting at PDAC 2025 and Invites Shareholders and Delegates to Re-Discover Romios at Booth 2717",
      "link": "https://www.newsfilecorp.com/release/242798/Romios-Gold-Exhibiting-at-PDAC-2025-and-Invites-Shareholders-and-Delegates-to-ReDiscover-Romios-at-Booth-2717",
      "date": "2025-02-28T12:30:00.000Z",
      "hidden": false
    },
    {
      "id": 83111,
      "company_id": 366,
      "title": "Romios Announces Closing of Non-Brokered Flow-Through Offering for $50,000",
      "link": "https://www.newsfilecorp.com/release/235613/Romios-Announces-Closing-of-NonBrokered-FlowThrough-Offering-for-50000",
      "date": "2024-12-30T23:33:00.000Z",
      "hidden": false
    },
    {
      "id": 82885,
      "company_id": 366,
      "title": "Romios Announces a Non-Brokered Flow-Through Offering of up to $75,000",
      "link": "https://www.newsfilecorp.com/release/234991/Romios-Announces-a-NonBrokered-FlowThrough-Offering-of-up-to-75000",
      "date": "2024-12-23T22:00:00.000Z",
      "hidden": false
    },
    {
      "id": 74061,
      "company_id": 366,
      "title": "Romios Provides a Review of the New Honeycomb Hill Porphyry Cu-Au-Ag Target at the Kinkaid Property, Nevada, USA and Tom Drivas Announces Change in Ownership Interest in Romios",
      "link": "https://www.newsfilecorp.com/release/225949/Romios-Provides-a-Review-of-the-New-Honeycomb-Hill-Porphyry-CuAuAg-Target-at-the-Kinkaid-Property-Nevada-USA-and-Tom-Drivas-Announces-Change-in-Ownership-Interest-in-Romios",
      "date": "2024-10-08T11:30:00.000Z",
      "hidden": false
    },
    {
      "id": 69434,
      "company_id": 366,
      "title": "Romios Reports Exceptional Assays up to 78.2 g/t Au and 574 g/t Ag and Expands Footprint of Possible Porphyry Centres at the Kinkaid Copper-Gold-Silver Property, Nevada, USA",
      "link": "https://www.newsfilecorp.com/release/221207/Romios-Reports-Exceptional-Assays-up-to-78.2-gt-Au-and-574-gt-Ag-and-Expands-Footprint-of-Possible-Porphyry-Centres-at-the-Kinkaid-CopperGoldSilver-Property-Nevada-USA",
      "date": "2024-08-27T11:30:00.000Z",
      "hidden": false
    }
  ]
}
