{
  "article": {
    "id": 31013,
    "link": "https://www.globenewswire.com/news-release/2023/02/09/2604562/0/en/Refined-Metals-Corp-Announces-the-Acquisition-of-the-Horizon-South-Property-in-Tonopah-Nevada.html",
    "title": "Refined Metals Corp Announces the Acquisition of the Horizon South Property in Tonopah, Nevada",
    "description": "<p><em>Horizon South is near American Lithium, American Battery Technology (ABTC), and Pan-American Energy Nevada Properties</em></p><p align=\"justify\">VANCOUVER, British Columbia, Feb.  09, 2023  (GLOBE NEWSWIRE) -- Refined Metals Corp. (CSE: RMC) (OTC: RFMCF) (FRA: CWA0) (the “<strong>Company</strong>” or “<strong>Refined</strong>”) is pleased to announce that it has entered into a property option agreement (the “Option Agreement”) with Horizon South Lithium Corp. (the “<strong>Vendor</strong>”) pursuant to which the Company has been granted the right to acquire a 100% interest in the Horizon South Lithium Property (the “<strong>Property</strong>”). The Property is comprised of 381 unpatented lode mining claims covering approximately 7,900 acres of land, located in the Big Smoky and Monte Cristo Basins of Esmeralda County, Nevada. The Company intends to explore the Property to determine the extent, if any, of claystone-hosted lithium mineralization.<br /></p>  <p align=\"justify\">The Property is adjacent to Pan American Energy Corp’s Horizon Lithium Project which is permitted to drill 22 holes in the coming months. Nearby is American Battery Technology’s Tonopah Flats project, which is a recipient of the DOE Bipartisan Infrastructure Law grant for USD $10 million to develop a commercial processing facility for lithium hydroxide. Additionally, General Motors announced intentions to invest USD $650 million in American Lithium which hosts the TLC deposit in the region. There continues to be active consolidation in the region with significant support from the government for development, including a USD $700 million loan for Ioneer’s Rhyolite Ridge project.</p>  <p align=\"justify\">Aman Parmar, Chief Executive Officer, comments, “The Property is in a highly sought after region and we are tremendously excited to acquire a property in such a high caliber neighbourhood. Nevada and the Tonopah jurisdiction are getting incredible support from federal, state, and county governments and have also emerged as leaders in lithium exploration and development. This has led to the increased interest in domestic lithium that has been driven by the electric vehicle and battery storage markets. The Agreement presents the Company with the ability to begin advancing the Property with exploration programs, which will also help us develop drill targets.”</p>  <p align=\"center\"><img alt=\"Horizon South Property Location\" data-mce-src=\"/api/ImageRender/DownloadFile?resourceId=5b952e70-83c5-47dd-871e-cf23a93f1081&amp;size=3\" height=\"400\" name=\"GNW_RichHtml_External_IMG\" src=\"https://ml.globenewswire.com/Resource/Download/5b952e70-83c5-47dd-871e-cf23a93f1081\" width=\"600\" /><br /></p>  <p align=\"center\"><em>Figure 1 – Horizon South Property Location</em></p>  <p align=\"center\"><img alt=\"Horizon South Regional Map\" data-mce-src=\"/api/ImageRender/DownloadFile?resourceId=a94420be-265c-4e13-80ae-6df055b774da&amp;size=3\" height=\"400\" name=\"GNW_RichHtml_External_IMG\" src=\"https://ml.globenewswire.com/Resource/Download/a94420be-265c-4e13-80ae-6df055b774da\" width=\"600\" /><br /></p>  <p align=\"center\"><em>Figure 2 – Horizon South Regional Map</em></p>  <p align=\"center\"><img alt=\"Horizon South Detailed Claim Map\" data-mce-src=\"/api/ImageRender/DownloadFile?resourceId=244cd1e4-1353-47b8-8081-f3e09660e53c&amp;size=3\" height=\"400\" name=\"GNW_RichHtml_External_IMG\" src=\"https://ml.globenewswire.com/Resource/Download/244cd1e4-1353-47b8-8081-f3e09660e53c\" width=\"600\" /><br /></p>  <p align=\"center\"><em>Figure 3 – Horizon South Detailed Claim Map</em></p>  <p><strong>Option Agreement Terms</strong></p>  <p align=\"justify\">Pursuant to the terms of the Option Agreement, the Company has the option to acquire a 100% interest in the Property from the Vendor, in consideration for completing a series of cash payments and issuances of common shares (“<strong>Common Shares</strong>”) in accordance with the following schedule:</p> <table style=\"border-top: solid black 1pt ; border-right: solid black 1pt ; border-bottom: solid black 1pt ; border-left: solid black 1pt ; border-collapse: collapse; width:100%; border-collapse:collapse ;\"><tr><td style=\"max-width:60%; width:60%; min-width:60%;;border-top: solid black 1pt ; border-right: solid black 1pt ; border-bottom: solid black 1pt ; border-left: solid black 1pt ; vertical-align: middle;   text-align: left;   padding-left: 10.0px; vertical-align: top ; \"><strong>Deadline</strong></td><td style=\"max-width:20%; width:20%; min-width:20%;;border-top: solid black 1pt ; border-right: solid black 1pt ; border-bottom: solid black 1pt ; border-left: solid black 1pt ; vertical-align: middle;   text-align: left;   padding-left: 10.0px; vertical-align: top ; \"><strong>Cash Payments</strong></td><td style=\"max-width:20%; width:20%; min-width:20%;;border-top: solid black 1pt ; border-right: solid black 1pt ; border-bottom: solid black 1pt ; border-left: solid black 1pt ; vertical-align: middle;   text-align: left;   padding-left: 10.0px; vertical-align: top ; \"><strong>Common Share Issuances*</strong></td></tr><tr><td style=\"border-top: solid black 1pt ; border-right: solid black 1pt ; border-bottom: solid black 1pt ; border-left: solid black 1pt ; vertical-align: middle;   text-align: left;   padding-left: 10.0px; vertical-align: top ; \">5 Business Days</td><td style=\"border-top: solid black 1pt ; border-right: solid black 1pt ; border-bottom: solid black 1pt ; border-left: solid black 1pt ; vertical-align: middle;   text-align: left;   padding-left: 10.0px; vertical-align: top ; \">-</td><td style=\"border-top: solid black 1pt ; border-right: solid black 1pt ; border-bottom: solid black 1pt ; border-left: solid black 1pt ; vertical-align: middle;   text-align: left;   padding-left: 10.0px; vertical-align: top ; \">C$250,000</td></tr><tr><td style=\"border-top: solid black 1pt ; border-right: solid black 1pt ; border-bottom: solid black 1pt ; border-left: solid black 1pt ; vertical-align: middle;   text-align: left;   padding-left: 10.0px; vertical-align: top ; \">60 Business Days</td><td style=\"border-top: solid black 1pt ; border-right: solid black 1pt ; border-bottom: solid black 1pt ; border-left: solid black 1pt ; vertical-align: middle;   text-align: left;   padding-left: 10.0px; vertical-align: top ; \">C$250,000</td><td style=\"border-top: solid black 1pt ; border-right: solid black 1pt ; border-bottom: solid black 1pt ; border-left: solid black 1pt ; vertical-align: middle;   text-align: left;   padding-left: 10.0px; vertical-align: top ; \">C$250,000</td></tr><tr><td style=\"border-top: solid black 1pt ; border-right: solid black 1pt ; border-bottom: solid black 1pt ; border-left: solid black 1pt ; vertical-align: middle;   text-align: left;   padding-left: 10.0px; vertical-align: top ; \">First Anniversary of Receipt of Drill Permits Necessary for the Company to Undertake Exploration Drilling (“<strong>Drill Permits</strong>”)</td><td style=\"border-top: solid black 1pt ; border-right: solid black 1pt ; border-bottom: solid black 1pt ; border-left: solid black 1pt ; vertical-align: middle;   text-align: left;   padding-left: 10.0px; vertical-align: top ; \">C$250,000</td><td style=\"border-top: solid black 1pt ; border-right: solid black 1pt ; border-bottom: solid black 1pt ; border-left: solid black 1pt ; vertical-align: middle;   text-align: left;   padding-left: 10.0px; vertical-align: top ; \">C$750,000</td></tr><tr><td style=\"border-top: solid black 1pt ; border-right: solid black 1pt ; border-bottom: solid black 1pt ; border-left: solid black 1pt ; vertical-align: middle;   text-align: left;   padding-left: 10.0px; vertical-align: top ; \">Second Anniversary of Receipt of Drill Permits</td><td style=\"border-top: solid black 1pt ; border-right: solid black 1pt ; border-bottom: solid black 1pt ; border-left: solid black 1pt ; vertical-align: middle;   text-align: left;   padding-left: 10.0px; vertical-align: top ; \">C$250,000</td><td style=\"border-top: solid black 1pt ; border-right: solid black 1pt ; border-bottom: solid black 1pt ; border-left: solid black 1pt ; vertical-align: middle;   text-align: left;   padding-left: 10.0px; vertical-align: top ; \">C$750,000</td></tr></table> <p align=\"justify\"><em>* To be settled with Common Shares valued at the greater of the 20-day volume-weighted average price (“VWAP”) of the Common Shares on the due date of each Common Share obligation and the lowest price permissible pursuant to the policies of the exchange(s) on which the Common Shares are then listed.</em></p>  <p align=\"justify\">All Common Shares issued to the Vendor pursuant to the Option Agreement will be subject to a twelve-month contractual escrow arrangement, during which time, subject to customary exceptions, such Common Shares may not be traded without the prior approval of the Company. The Common Shares issuable pursuant to the Option Agreement will be released from the escrow arrangement in four equal tranches: 25% will be released after three (3) months, a further 25% after six (6) months, a further 25% after nine (9) months, and the remaining 25% balance after twelve months. In addition, all Common Shares issued pursuant to the Option Agreement shall be subject to a statutory four month hold period pursuant to applicable Canadian securities laws. During the term of the Option Agreement, the Company will be the operator of the Property, and will be responsible for paying all exploration costs and maintenance fees owing to the Bureau of Land Management.</p>  <p align=\"justify\"><strong>Related Party Transaction Disclosure</strong></p>  <p align=\"justify\">As a result of the foregoing, the Company’s entrance into the Option Agreement, and the potential issuance of Common Shares and the payment of Cash to the Vendor, is considered to be a “related party transaction” as defined under Multilateral Instrument 61-101 – <em>Protection of Minority Security Holders in Special</em> <em>Transactions</em> (“<strong>MI 61-101</strong>”). The Company is relying on the exemptions from the formal valuation and minority approval requirements found in sections 5.5(a) and 5.7(1)(a) of MI 61-101, as the fair market value of the transaction is not more than 25% of the Company’s market capitalization. The Option Agreement was unanimously approved by the independent directors of the Company.</p>  <p align=\"justify\"><strong>About Refined Metals Corp.</strong></p>  <p align=\"justify\">Refined Metals Corp. is a junior mining company dedicated to identifying, evaluating and acquiring interests in mineral properties in North America. The Company’s business is currently focused on the exploration and development of the Rose Property, a prospective, exploration stage silver-gold-copper-zinc property located near Kamloops, British Columbia. The Company also holds an option to acquire a prospective, exploration stage lithium property located in the Lac Simard region of Quebec pursuant to the Option Agreement. The Company continues to review other mineral properties in North America for possible acquisition in the future.</p>  <p align=\"justify\"><strong>For further information, please contact:</strong></p>  <p>Phone: (604) 398-3378<br />Email: <a href=\"https://www.globenewswire.com/Tracker?data=YBJcXt0KxMQOXoZG5sbN1HDnnEUme5TwyoaxPbJYWGAdd_vSr1JADsnS3i0A4sF-5VvZ3Qqad0wHD8eXG2o0UKuUQ_iy3FsdUM870byVa6SHS_gKyOQwN6_yh4jFAVi4\" rel=\"nofollow\" target=\"_blank\" title=\"Info@refinedmetalscorp.com\">Info@refinedmetalscorp.com</a></p>  <p align=\"justify\"><strong>Forward-Looking Statements</strong></p>  <p align=\"justify\"><em>Certain statements contained in this press release constitute forward-looking information. These statements relate to future events or future performance. The use of any of the words \"could\", \"intend\", \"expect\", \"believe\", \"will\", \"projected\", \"estimated\" and similar expressions and statements relating to matters that are not historical facts are intended to identify forward-looking information and are based on the Company’s current beliefs or assumptions as to the outcome and timing of such future events. In particular, this press release contains forward-looking information relating to, among other things, the Company’s exploration plans and objectives at the Property and the exploration potential of the Property, including the potential of the Property to host lithium mineralization (whether hosted by the adjacent geology, extending from the adjacent mineral properties, or otherwise). </em></p>  <p align=\"justify\"><em>Various assumptions or factors are typically applied in drawing conclusions or making the forecasts or projections set out in forward-looking information, including, in respect of the forward-looking information included in this press release, the assumption that: the Company will successfully complete its planned exploration program in accordance with the expected parameters and that such program will yield the results anticipated by the Company, including the establishment of lithium mineralization at the Property. </em></p>  <p align=\"justify\"><em>Although forward-looking information is based on the reasonable assumptions of the Company’s management, there can be no assurance that any forward-looking information will prove to be accurate. Forward looking information involves known and unknown risks, uncertainties and other factors which may cause the actual results, performance or achievements to be materially different from any future results, performance or achievements expressed or implied by the forward-looking information. Such factors include risks inherent in the exploration and development of mineral deposits, including risks relating to changes in project parameters as plans continue to be redefined, that mineral exploration is inherently uncertain and that the results of mineral exploration may not be indicative of the actual geology or mineralization of a project and that mineral exploration may be unsuccessful or fail to achieve the results anticipated by the Company, including the establishment of lithium mineralization at the Property. The forward-looking information contained in this release is made as of the date hereof, and the Company not obligated to update or revise any forward-looking information, whether as a result of new information, future events or otherwise, except as required by applicable securities laws. Because of the risks, uncertainties and assumptions contained herein, investors should not place undue reliance on forward-looking information. The foregoing statements expressly qualify any forward-looking information contained herein.</em></p>  <p align=\"center\"><strong><em>The CSE has neither approved nor disapproved the information contained herein.</em></strong></p>  <p>Graphics accompanying this announcement are available at:</p>  <p><img src=\"https://ml.globenewswire.com/Resource/Download/5b952e70-83c5-47dd-871e-cf23a93f1081?size=original\" alt=\"\"/></p>  <p><img src=\"https://ml.globenewswire.com/Resource/Download/a94420be-265c-4e13-80ae-6df055b774da?size=original\" alt=\"\"/></p>  <p align=\"justify\"><img src=\"https://ml.globenewswire.com/Resource/Download/244cd1e4-1353-47b8-8081-f3e09660e53c?size=original\" alt=\"\"/></p>  <br /><img src='https://ml.globenewswire.com/media/NTM0MTYyMGQtZTg2OS00MjQwLWFhN2ItZjkyYzdkZjFmYmFiLTUwMDExMjMwMg==/tiny/Refined-Metals-Corp-.png' referrerpolicy='no-referrer-when-downgrade' />",
    "search_terms": "Horizon South,Refined Energy Corp.,RMC",
    "master_gid": 4026,
    "date": "2023-02-09T05:00:00.000Z",
    "tags": "Canada,USA|Nevada||Lithium|Project Acquisition",
    "image_id": null,
    "hidden": false,
    "company_id": 2288,
    "provider": null,
    "excerpt": "Horizon South is near American Lithium, American Battery Technology (ABTC), and Pan-American Energy Nevada PropertiesVANCOUVER, British Columbia, Feb.  09, 2023  (GLOBE NEWSWIRE) -- Refined Metals Corp. (CSE: RMC) (OTC: RFMCF) (FRA: CWA0) (the “Company” or “Refined”) is pleased to announce that it has entered into a property option",
    "is_regulatory": false,
    "refined_tags": [
      "Project Acquisition"
    ],
    "ftp_filename": null,
    "company_name": "Refined Energy Corp.",
    "exchange": "CSE",
    "root_ticker": "RUU",
    "project_name": "Horizon South",
    "gid": 4026,
    "location": "Nevada, United States",
    "plan_id": null,
    "description_text": "Horizon South is near American Lithium, American Battery Technology (ABTC), and Pan-American Energy Nevada Properties VANCOUVER, British Columbia, Feb.  09, 2023  (GLOBE NEWSWIRE) -- Refined Metals Corp. (CSE: RMC) (OTC: RFMCF) (FRA: CWA0) (the “ Company ” or “ Refined ”) is pleased to announce that it has entered into a property option agreement (the “Option Agreement”) with Horizon South Lithium Corp. (the “ Vendor ”) pursuant to which the Company has been granted the right to acquire a 100% interest in the Horizon South Lithium Property (the “ Property ”). The Property is comprised of 381 unpatented lode mining claims covering approximately 7,900 acres of land, located in the Big Smoky and Monte Cristo Basins of Esmeralda County, Nevada. The Company intends to explore the Property to determine the extent, if any, of claystone-hosted lithium mineralization. The Property is adjacent to Pan American Energy Corp’s Horizon Lithium Project which is permitted to drill 22 holes in the coming months. Nearby is American Battery Technology’s Tonopah Flats project, which is a recipient of the DOE Bipartisan Infrastructure Law grant for USD $10 million to develop a commercial processing facility for lithium hydroxide. Additionally, General Motors announced intentions to invest USD $650 million in American Lithium which hosts the TLC deposit in the region. There continues to be active consolidation in the region with significant support from the government for development, including a USD $700 million loan for Ioneer’s Rhyolite Ridge project. Aman Parmar, Chief Executive Officer, comments, “The Property is in a highly sought after region and we are tremendously excited to acquire a property in such a high caliber neighbourhood. Nevada and the Tonopah jurisdiction are getting incredible support from federal, state, and county governments and have also emerged as leaders in lithium exploration and development. This has led to the increased interest in domestic lithium that has been driven by the electric vehicle and battery storage markets. The Agreement presents the Company with the ability to begin advancing the Property with exploration programs, which will also help us develop drill targets.” Figure 1 – Horizon South Property Location Figure 2 – Horizon South Regional Map Figure 3 – Horizon South Detailed Claim Map Option Agreement Terms Pursuant to the terms of the Option Agreement, the Company has the option to acquire a 100% interest in the Property from the Vendor, in consideration for completing a series of cash payments and issuances of common shares (“ Common Shares ”) in accordance with the following schedule: Deadline Cash Payments Common Share Issuances* 5 Business Days - C$250,000 60 Business Days C$250,000 C$250,000 First Anniversary of Receipt of Drill Permits Necessary for the Company to Undertake Exploration Drilling (“ Drill Permits ”) C$250,000 C$750,000 Second Anniversary of Receipt of Drill Permits C$250,000 C$750,000 * To be settled with Common Shares valued at the greater of the 20-day volume-weighted average price (“VWAP”) of the Common Shares on the due date of each Common Share obligation and the lowest price permissible pursuant to the policies of the exchange(s) on which the Common Shares are then listed. All Common Shares issued to the Vendor pursuant to the Option Agreement will be subject to a twelve-month contractual escrow arrangement, during which time, subject to customary exceptions, such Common Shares may not be traded without the prior approval of the Company. The Common Shares issuable pursuant to the Option Agreement will be released from the escrow arrangement in four equal tranches: 25% will be released after three (3) months, a further 25% after six (6) months, a further 25% after nine (9) months, and the remaining 25% balance after twelve months. In addition, all Common Shares issued pursuant to the Option Agreement shall be subject to a statutory four month hold period pursuant to applicable Canadian securities laws. During the term of the Option Agreement, the Company will be the operator of the Property, and will be responsible for paying all exploration costs and maintenance fees owing to the Bureau of Land Management. Related Party Transaction Disclosure As a result of the foregoing, the Company’s entrance into the Option Agreement, and the potential issuance of Common Shares and the payment of Cash to the Vendor, is considered to be a “related party transaction” as defined under Multilateral Instrument 61-101 – Protection of Minority Security Holders in Special Transactions (“ MI 61-101 ”). The Company is relying on the exemptions from the formal valuation and minority approval requirements found in sections 5.5(a) and 5.7(1)(a) of MI 61-101, as the fair market value of the transaction is not more than 25% of the Company’s market capitalization. The Option Agreement was unanimously approved by the independent directors of the Company. About Refined Metals Corp. Refined Metals Corp. is a junior mining company dedicated to identifying, evaluating and acquiring interests in mineral properties in North America. The Company’s business is currently focused on the exploration and development of the Rose Property, a prospective, exploration stage silver-gold-copper-zinc property located near Kamloops, British Columbia. The Company also holds an option to acquire a prospective, exploration stage lithium property located in the Lac Simard region of Quebec pursuant to the Option Agreement. The Company continues to review other mineral properties in North America for possible acquisition in the future. For further information, please contact: Phone: (604) 398-3378 Email: Info@refinedmetalscorp.com Forward-Looking Statements Certain statements contained in this press release constitute forward-looking information. These statements relate to future events or future performance. The use of any of the words \"could\", \"intend\", \"expect\", \"believe\", \"will\", \"projected\", \"estimated\" and similar expressions and statements relating to matters that are not historical facts are intended to identify forward-looking information and are based on the Company’s current beliefs or assumptions as to the outcome and timing of such future events. In particular, this press release contains forward-looking information relating to, among other things, the Company’s exploration plans and objectives at the Property and the exploration potential of the Property, including the potential of the Property to host lithium mineralization (whether hosted by the adjacent geology, extending from the adjacent mineral properties, or otherwise). Various assumptions or factors are typically applied in drawing conclusions or making the forecasts or projections set out in forward-looking information, including, in respect of the forward-looking information included in this press release, the assumption that: the Company will successfully complete its planned exploration program in accordance with the expected parameters and that such program will yield the results anticipated by the Company, including the establishment of lithium mineralization at the Property. Although forward-looking information is based on the reasonable assumptions of the Company’s management, there can be no assurance that any forward-looking information will prove to be accurate. Forward looking information involves known and unknown risks, uncertainties and other factors which may cause the actual results, performance or achievements to be materially different from any future results, performance or achievements expressed or implied by the forward-looking information. Such factors include risks inherent in the exploration and development of mineral deposits, including risks relating to changes in project parameters as plans continue to be redefined, that mineral exploration is inherently uncertain and that the results of mineral exploration may not be indicative of the actual geology or mineralization of a project and that mineral exploration may be unsuccessful or fail to achieve the results anticipated by the Company, including the establishment of lithium mineralization at the Property. The forward-looking information contained in this release is made as of the date hereof, and the Company not obligated to update or revise any forward-looking information, whether as a result of new information, future events or otherwise, except as required by applicable securities laws. Because of the risks, uncertainties and assumptions contained herein, investors should not place undue reliance on forward-looking information. The foregoing statements expressly qualify any forward-looking information contained herein. The CSE has neither approved nor disapproved the information contained herein. Graphics accompanying this announcement are available at:",
    "primary_commodity": "Li"
  },
  "articleProject": {
    "gid": 4026,
    "project_name": "Horizon South",
    "location": "Nevada, United States"
  },
  "articleExchange": "CSE",
  "articleCompanyId": 2288,
  "articleTicker": "RUU",
  "articleCompanyName": "Refined Energy Corp.",
  "allOtherCompanyProjects": [
    {
      "company_id": 2288,
      "gid": 4026,
      "project_name": "Horizon South",
      "location": "Nevada, United States"
    },
    {
      "company_id": 2288,
      "gid": 4374,
      "project_name": "Lac Simard",
      "location": "Quebec, Canada"
    },
    {
      "company_id": 2288,
      "gid": 4375,
      "project_name": "Rose",
      "location": "British Columbia, Canada"
    },
    {
      "company_id": 2288,
      "gid": 9710,
      "project_name": "Basin",
      "location": "Saskatchewan, Canada"
    }
  ],
  "allOtherCompanyNews": [
    {
      "id": 91813,
      "company_id": 2288,
      "title": "Refined Energy Corp Announces Uplisting on the OTCQB",
      "link": null,
      "date": "2025-03-19T12:00:00.000Z",
      "hidden": false
    },
    {
      "id": 89861,
      "company_id": 2288,
      "title": "Refined Energy Corp Receives Permit for Dufferin Work",
      "link": "https://www.globenewswire.com/news-release/2025/03/03/3035629/0/en/Refined-Energy-Corp-Receives-Permit-for-Dufferin-Work.html",
      "date": "2025-03-03T13:30:00.000Z",
      "hidden": false
    },
    {
      "id": 88970,
      "company_id": 2288,
      "title": "Refined Energy Corp Engages TerraLogic Exploration to Advance Basin and Milner Properties",
      "link": "https://www.globenewswire.com/news-release/2025/02/24/3031082/0/en/Refined-Energy-Corp-Engages-TerraLogic-Exploration-to-Advance-Basin-and-Milner-Properties.html",
      "date": "2025-02-24T13:00:00.000Z",
      "hidden": false
    },
    {
      "id": 87768,
      "company_id": 2288,
      "title": "Refined Energy Corp Announces New OTC Ticker Symbol: RRUUF",
      "link": "https://www.globenewswire.com/news-release/2025/02/13/3025834/0/en/Refined-Energy-Corp-Announces-New-OTC-Ticker-Symbol-RRUUF.html",
      "date": "2025-02-13T13:00:00.000Z",
      "hidden": false
    },
    {
      "id": 86484,
      "company_id": 2288,
      "title": "Refined Energy Corp. Announces Extension of Marketing Program and Proposed Debt Settlement",
      "link": "https://www.globenewswire.com/news-release/2025/01/31/3019039/0/en/Refined-Energy-Corp-Announces-Extension-of-Marketing-Program-and-Proposed-Debt-Settlement.html",
      "date": "2025-01-31T22:00:00.000Z",
      "hidden": false
    },
    {
      "id": 85686,
      "company_id": 2288,
      "title": "Refined Energy Corp. Details Proposed Summer Program for Basin and Milner Projects",
      "link": "https://www.globenewswire.com/news-release/2025/01/29/3017099/0/en/Refined-Energy-Corp-Details-Proposed-Summer-Program-for-Basin-and-Milner-Projects.html",
      "date": "2025-01-29T13:00:00.000Z",
      "hidden": false
    },
    {
      "id": 84743,
      "company_id": 2288,
      "title": "Refined Energy Corp. Identifies Uranium Targets at Dufferin North in the Athabasca Basin",
      "link": "https://www.globenewswire.com/news-release/2025/01/21/3012587/0/en/Refined-Energy-Corp-Identifies-Uranium-Targets-at-Dufferin-North-in-the-Athabasca-Basin.html",
      "date": "2025-01-21T13:00:00.000Z",
      "hidden": false
    },
    {
      "id": 83388,
      "company_id": 2288,
      "title": "Refined Energy Corp. Identifies Uranium Drill Targets at Dufferin West in the Athabasca Basin",
      "link": "https://www.globenewswire.com/news-release/2025/01/07/3005327/0/en/Refined-Energy-Corp-Identifies-Uranium-Drill-Targets-at-Dufferin-West-in-the-Athabasca-Basin.html",
      "date": "2025-01-07T13:00:00.000Z",
      "hidden": false
    },
    {
      "id": -162899,
      "company_id": 2288,
      "title": "Refined Energy Corp. Announces Option Grant to Advisory Board Members",
      "link": "https://www.globenewswire.com/news-release/2024/12/31/3003112/0/en/Refined-Energy-Corp-Announces-Option-Grant-to-Advisory-Board-Members.html",
      "date": "2024-12-31T13:00:00.000Z",
      "hidden": false
    },
    {
      "id": -154243,
      "company_id": 2288,
      "title": "Refined Energy Corp. to Amend Expiry Date of Warrants",
      "link": "https://www.globenewswire.com/news-release/2024/11/14/2981722/0/en/Refined-Energy-Corp-to-Amend-Expiry-Date-of-Warrants.html",
      "date": "2024-11-14T23:53:00.000Z",
      "hidden": false
    }
  ]
}
