{
  "article": {
    "id": 76501,
    "link": "https://www.globenewswire.com/news-release/2024/10/29/2970657/0/en/Evergold-Options-the-Rockland-Gold-Property-to-Wolfden-and-Wolfden-Prepares-to-Drill.html",
    "title": "Evergold Options the Rockland Gold Property to Wolfden, and Wolfden Prepares to Drill",
    "description": "<p align=\"justify\">TORONTO, Oct.  29, 2024  (GLOBE NEWSWIRE) -- <strong>Evergold Corp. (TSX-V: EVER, OTC: EVGUF, WKN:</strong> <strong>A2PTHZ</strong><strong>)</strong> (“<strong>Evergold</strong>” or the “<strong>Company</strong>”) is pleased to announce that it has granted Wolfden Resources Corporation (“Wolfden”) an option to acquire in two stages up to a 75% interest in the Company’s drill-permitted, past producing Rockland gold-silver property, located south of Yerington in Nevada’s Walker Lane geological belt.   It is anticipated that the agreement will lead to the commencement of a minimum 5,000 feet of core drilling in the near future. Under the first stage, Wolfden may earn an initial 51% interest by completing $US1.175 million in exploration expenditures before January 1, 2026, including posting a drilling bond with the U.S. Forest Service by December 15 this year, and making cash payments totaling $US600,000 to the underlying property rights holder Enigma Resources LLC (“Enigma”) by March 1, 2028. Wolfden can elect to earn an additional 24% interest, bringing its total interest to 75%, by completing a pre-feasibility study within 5 to 8 years, following which the parties may elect to establish a joint venture on standard industry terms. Completion of the acquisition of the option by Wolfden is subject to receipt of all regulatory approvals, including the approval of the TSX Venture Exchange.</p>  <p align=\"justify\">“Ron Little and the Wolfden team including advisor and past Chair Ewan Downie, have had tremendous success finding and developing mineral deposits, and building and operating mines, in Africa and North America, including in the state of Nevada,” said Kevin Keough, Evergold’s President and CEO. “We are therefore very happy to have them taking on the Rockland project and advancing it expeditiously to drilling, as it presents both a vote of confidence in its exciting exploration merits, amply reviewed in Wolfden’s news release, and a source of potential near-term value generation for Evergold shareholders.”</p>  <p align=\"justify\"><strong>About Evergold</strong></p>  <p align=\"justify\">Evergold Corp. is a TSX-V listed mineral exploration company with projects in B.C. and Nevada. The Evergold team has a track record of success in the junior mining space, most recently the establishment of GT Gold Corp. in 2016 and the discovery of the Saddle South epithermal vein and Saddle North porphyry copper-gold deposits near Iskut B.C., sold to Newmont in 2021 for a fully diluted value of $456 million, representing a 1,136% (12.4 X) return on exploration outlays of $36.9 million.</p>  <p align=\"justify\"><strong>For additional information, please contact:</strong></p>  <p align=\"justify\">Kevin M. Keough                 <br />President and CEO                        <br />Tel: (613) 622-1916                <br /><a href=\"https://www.globenewswire.com/Tracker?data=vHa44m7-HralsbSsXR5Eby7-QT2tWiiYpxqaxORU_k-nO9HYfVrMGoxTmkol2h1G1jkxiAE6i9f9JUcsyzieqw4Go_UAqpOQn_Oc6Fg5raE=\" rel=\"nofollow\" target=\"_blank\" title=\"www.evergoldcorp.ca\">www.evergoldcorp.ca</a>                         <br /><a href=\"https://www.globenewswire.com/Tracker?data=IsGIm3Mi-6t0gt8dgEHtmdzrZRZrXOcl6P_RtC1msBwj2jhnwyOP7zGPTQY6VJiB98T1yxoB48c4EBBIQ59VSZEd8N7HaM-3hDj5ID_TdUYMwC5bqD9-uHvj5vjm8XV9\" rel=\"nofollow\" target=\"_blank\" title=\"\"><em>kevin.keough@evergoldcorp.ca</em></a> <em>        </em></p>  <p align=\"justify\"><em>Neither the TSX Venture Exchange nor its Regulation Services Provider (as that term is defined in the policies of the TSX Venture Exchange) accepts responsibility for the adequacy or accuracy of this news release.</em></p>  <p align=\"justify\"><strong><em>Cautionary Statement Regarding Forward-Looking Information</em></strong></p>  <p align=\"justify\"><em>This news release includes certain “forward-looking statements” which are not comprised of historical facts. Forward-looking statements include estimates and statements that describe the Company’s future plans, objectives or goals, including words to the effect that the Company or management expects a stated condition or result to occur. Forward-looking statements may be identified by such terms as “believes”, “anticipates”, “expects”, “estimates”, “may”, “could”, “would”, “will”, or “plan”. Since forward-looking statements are based on assumptions and address future events and conditions, by their very nature they involve inherent risks and uncertainties. Although these statements are based on information currently available to the Company, the Company provides no assurance that actual results will meet management’s expectations. Risks, uncertainties and other factors involved with forward-looking information could cause actual events, results, performance, prospects and opportunities to differ materially from those expressed or implied by such forward-looking information. Forward looking information in this news release includes, but is not limited to, the Company’s objectives, goals or future plans, statements, exploration results, potential mineralization, the estimation of mineral resources, exploration and mine development plans, timing of the commencement of operations and estimates of market conditions. Factors that could cause actual results to differ materially from such forward-looking information include, but are not limited to failure to identify mineral resources, failure to convert estimated mineral resources to reserves, the inability to complete a feasibility study which recommends a production decision, the preliminary nature of metallurgical test results, delays in obtaining or failures to obtain required governmental, environmental or other project approvals, political risks, inability to fulfill the duty to accommodate First Nations and other indigenous peoples, </em><em>an inability to complete the second tranche of Offering on satisfactory terms or on the timeline as announced or at all and the expected expenditure of the proceeds of the second tranche of the Offering; an inability to predict and counteract the effects of COVID-19 on the business of the Company, including but not limited to the effects of COVID-19 on the price of commodities, capital market conditions, restrictions on labour and international travel and supply chains, </em><em>uncertainties relating to the availability and costs of financing needed in the future, changes in equity markets, inflation, changes in exchange rates, fluctuations in commodity prices, delays in the development of projects, capital and operating costs varying significantly from estimates and the other risks involved in the mineral exploration and development industry, and those risks set out in the Company’s public documents filed on SEDAR. Although the Company believes that the assumptions and factors used in preparing the forward-looking information in this news release are reasonable, undue reliance should not be placed on such information, which only applies as of the date of this news release, and no assurance can be given that such events will occur in the disclosed time frames or at all. The Company disclaims any intention or obligation to update or revise any forward-looking information, whether as a result of new information, future events or otherwise, other than as required by law.</em></p>  <br /><img src='https://ml.globenewswire.com/media/YzJkYmQyMDAtMWU1NS00YzBkLWJmZGYtMzk5ZTUzZmZjMGI5LTEyMDE1MjQ=/tiny/Evergold-Corp-.png' referrerpolicy='no-referrer-when-downgrade' />",
    "search_terms": "Rockland,Evergold Corp.,EVER",
    "master_gid": 1085,
    "date": "2024-10-29T11:00:00.000Z",
    "tags": "|||Gold,Silver|Project Acquisition",
    "image_id": null,
    "hidden": false,
    "company_id": 213,
    "provider": "globenewswire",
    "excerpt": "TORONTO, Oct. 29, 2024 (GLOBE NEWSWIRE) --Evergold Corp. (TSX-V: EVER, OTC: EVGUF, WKN:A2PTHZ)(“Evergold” or the “Company”) is pleased to announce that it has granted Wolfden Resources Corporation (“Wolfden”) an option to acquire in two stages up to a 75% interest in the Company’s drill-permitted, past producing Rockland gold-silver property, located",
    "is_regulatory": false,
    "refined_tags": [
      "Mergers & Acquisitions"
    ],
    "ftp_filename": null,
    "company_name": "Evergold Corp.",
    "exchange": "TSXV",
    "root_ticker": "EVER",
    "project_name": "Rockland",
    "gid": 1085,
    "location": "Nevada, United States",
    "plan_id": "companytier2",
    "description_text": "TORONTO, Oct.  29, 2024  (GLOBE NEWSWIRE) -- Evergold Corp. (TSX-V: EVER, OTC: EVGUF, WKN: A2PTHZ ) (“ Evergold ” or the “ Company ”) is pleased to announce that it has granted Wolfden Resources Corporation (“Wolfden”) an option to acquire in two stages up to a 75% interest in the Company’s drill-permitted, past producing Rockland gold-silver property, located south of Yerington in Nevada’s Walker Lane geological belt.   It is anticipated that the agreement will lead to the commencement of a minimum 5,000 feet of core drilling in the near future. Under the first stage, Wolfden may earn an initial 51% interest by completing $US1.175 million in exploration expenditures before January 1, 2026, including posting a drilling bond with the U.S. Forest Service by December 15 this year, and making cash payments totaling $US600,000 to the underlying property rights holder Enigma Resources LLC (“Enigma”) by March 1, 2028. Wolfden can elect to earn an additional 24% interest, bringing its total interest to 75%, by completing a pre-feasibility study within 5 to 8 years, following which the parties may elect to establish a joint venture on standard industry terms. Completion of the acquisition of the option by Wolfden is subject to receipt of all regulatory approvals, including the approval of the TSX Venture Exchange. “Ron Little and the Wolfden team including advisor and past Chair Ewan Downie, have had tremendous success finding and developing mineral deposits, and building and operating mines, in Africa and North America, including in the state of Nevada,” said Kevin Keough, Evergold’s President and CEO. “We are therefore very happy to have them taking on the Rockland project and advancing it expeditiously to drilling, as it presents both a vote of confidence in its exciting exploration merits, amply reviewed in Wolfden’s news release, and a source of potential near-term value generation for Evergold shareholders.” About Evergold Evergold Corp. is a TSX-V listed mineral exploration company with projects in B.C. and Nevada. The Evergold team has a track record of success in the junior mining space, most recently the establishment of GT Gold Corp. in 2016 and the discovery of the Saddle South epithermal vein and Saddle North porphyry copper-gold deposits near Iskut B.C., sold to Newmont in 2021 for a fully diluted value of $456 million, representing a 1,136% (12.4 X) return on exploration outlays of $36.9 million. For additional information, please contact: Kevin M. Keough President and CEO Tel: (613) 622-1916 www.evergoldcorp.ca kevin.keough@evergoldcorp.ca Neither the TSX Venture Exchange nor its Regulation Services Provider (as that term is defined in the policies of the TSX Venture Exchange) accepts responsibility for the adequacy or accuracy of this news release. Cautionary Statement Regarding Forward-Looking Information This news release includes certain “forward-looking statements” which are not comprised of historical facts. Forward-looking statements include estimates and statements that describe the Company’s future plans, objectives or goals, including words to the effect that the Company or management expects a stated condition or result to occur. Forward-looking statements may be identified by such terms as “believes”, “anticipates”, “expects”, “estimates”, “may”, “could”, “would”, “will”, or “plan”. Since forward-looking statements are based on assumptions and address future events and conditions, by their very nature they involve inherent risks and uncertainties. Although these statements are based on information currently available to the Company, the Company provides no assurance that actual results will meet management’s expectations. Risks, uncertainties and other factors involved with forward-looking information could cause actual events, results, performance, prospects and opportunities to differ materially from those expressed or implied by such forward-looking information. Forward looking information in this news release includes, but is not limited to, the Company’s objectives, goals or future plans, statements, exploration results, potential mineralization, the estimation of mineral resources, exploration and mine development plans, timing of the commencement of operations and estimates of market conditions. Factors that could cause actual results to differ materially from such forward-looking information include, but are not limited to failure to identify mineral resources, failure to convert estimated mineral resources to reserves, the inability to complete a feasibility study which recommends a production decision, the preliminary nature of metallurgical test results, delays in obtaining or failures to obtain required governmental, environmental or other project approvals, political risks, inability to fulfill the duty to accommodate First Nations and other indigenous peoples, an inability to complete the second tranche of Offering on satisfactory terms or on the timeline as announced or at all and the expected expenditure of the proceeds of the second tranche of the Offering; an inability to predict and counteract the effects of COVID-19 on the business of the Company, including but not limited to the effects of COVID-19 on the price of commodities, capital market conditions, restrictions on labour and international travel and supply chains, uncertainties relating to the availability and costs of financing needed in the future, changes in equity markets, inflation, changes in exchange rates, fluctuations in commodity prices, delays in the development of projects, capital and operating costs varying significantly from estimates and the other risks involved in the mineral exploration and development industry, and those risks set out in the Company’s public documents filed on SEDAR. Although the Company believes that the assumptions and factors used in preparing the forward-looking information in this news release are reasonable, undue reliance should not be placed on such information, which only applies as of the date of this news release, and no assurance can be given that such events will occur in the disclosed time frames or at all. The Company disclaims any intention or obligation to update or revise any forward-looking information, whether as a result of new information, future events or otherwise, other than as required by law.",
    "primary_commodity": "Ag"
  },
  "articleProject": {
    "gid": 1085,
    "project_name": "Rockland",
    "location": "Nevada, United States"
  },
  "articleExchange": "TSXV",
  "articleCompanyId": 213,
  "articleTicker": "EVER",
  "articleCompanyName": "Evergold Corp.",
  "allOtherCompanyProjects": [
    {
      "company_id": 213,
      "gid": 208,
      "project_name": "Snoball",
      "location": "British Columbia, Canada"
    },
    {
      "company_id": 213,
      "gid": 204,
      "project_name": "Golden Lion",
      "location": "British Columbia, Canada"
    },
    {
      "company_id": 213,
      "gid": 1085,
      "project_name": "Rockland",
      "location": "Nevada, United States"
    },
    {
      "company_id": 213,
      "gid": 5209,
      "project_name": "DEM",
      "location": "British Columbia, Canada"
    },
    {
      "company_id": 213,
      "gid": 206,
      "project_name": "Holy Cross",
      "location": "British Columbia, Canada"
    }
  ],
  "allOtherCompanyNews": [
    {
      "id": 93708,
      "company_id": 213,
      "title": "Evergold Closes $1,072,000 Private Placement to Support Follow-up Drilling at Emerging DEM1 Gold-Silver Discovery, BC",
      "link": "https://app.quotemedia.com/data/downloadFiling?webmasterId=104408&ref=67901f48965f0b6e85142438&type=PDFC&formType=002-002-001089-003001&formDescription=News+release&dateFiled=2025-01-21",
      "date": "2025-01-21T22:27:20.000Z",
      "hidden": false
    },
    {
      "id": 83360,
      "company_id": 213,
      "title": "Evergold Invites Parties to Partner with it to Advance its Flagship Golden Lion (Gold-Silver-Copper) and DEM (Gold-Antimony) Properties, BC",
      "link": "https://www.globenewswire.com/news-release/2025/01/07/3005240/0/en/Evergold-Invites-Parties-to-Partner-with-it-to-Advance-its-Flagship-Golden-Lion-Gold-Silver-Copper-and-DEM-Gold-Antimony-Properties-BC.html",
      "date": "2025-01-07T12:00:00.000Z",
      "hidden": false
    },
    {
      "id": 81595,
      "company_id": 213,
      "title": "Evergold’s DEM Prospect in B.C. Returns High Grades of Antimony in Drilling, Within a Broad System Also Hosting Gold, Silver and Additional Critical Elements",
      "link": "https://www.globenewswire.com/news-release/2024/12/11/2995253/0/en/Evergold-s-DEM-Prospect-in-B-C-Returns-High-Grades-of-Antimony-in-Drilling-Within-a-Broad-System-Also-Hosting-Gold-Silver-and-Additional-Critical-Elements.html",
      "date": "2024-12-11T12:00:00.000Z",
      "hidden": false
    },
    {
      "id": 76501,
      "company_id": 213,
      "title": "Evergold Options the Rockland Gold Property to Wolfden, and Wolfden Prepares to Drill",
      "link": "https://www.globenewswire.com/news-release/2024/10/29/2970657/0/en/Evergold-Options-the-Rockland-Gold-Property-to-Wolfden-and-Wolfden-Prepares-to-Drill.html",
      "date": "2024-10-29T11:00:00.000Z",
      "hidden": false
    },
    {
      "id": 74203,
      "company_id": 213,
      "title": "Evergold Awaits New Drill Assays from DEM Porphyry “Halo”, Identifies Likely Location of Intrusive Centre",
      "link": "https://www.globenewswire.com/news-release/2024/10/09/2960383/0/en/Evergold-Awaits-New-Drill-Assays-from-DEM-Porphyry-Halo-Identifies-Likely-Location-of-Intrusive-Centre.html",
      "date": "2024-10-09T11:00:00.000Z",
      "hidden": false
    },
    {
      "id": 71767,
      "company_id": 213,
      "title": "Evergold Initiates Follow-up Drilling at its Exciting DEM Precious & Strategic Metals Discovery, Central B.C.",
      "link": "https://www.globenewswire.com/news-release/2024/09/18/2948081/0/en/Evergold-Initiates-Follow-up-Drilling-at-its-Exciting-DEM-Precious-Strategic-Metals-Discovery-Central-B-C.html",
      "date": "2024-09-18T11:00:00.000Z",
      "hidden": false
    },
    {
      "id": 67601,
      "company_id": 213,
      "title": "Evergold Prepares to Drill Crucial Follow-up Holes at DEM Gold Discovery, B.C.",
      "link": "https://www.globenewswire.com/news-release/2024/08/06/2924881/0/en/Evergold-Prepares-to-Drill-Crucial-Follow-up-Holes-at-DEM-Gold-Discovery-B-C.html",
      "date": "2024-08-06T11:00:00.000Z",
      "hidden": false
    },
    {
      "id": 64277,
      "company_id": 213,
      "title": "Evergold Extends Second Tranche of Non-Brokered Private Placement",
      "link": "https://www.globenewswire.com/news-release/2024/07/05/2908997/0/en/Evergold-Extends-Second-Tranche-of-Non-Brokered-Private-Placement.html",
      "date": "2024-07-05T11:00:00.000Z",
      "hidden": false
    },
    {
      "id": 63504,
      "company_id": 213,
      "title": "Evergold Commences Fieldwork on DEM Property, Central B.C.",
      "link": "https://www.globenewswire.com/news-release/2024/06/26/2904372/0/en/Evergold-Commences-Fieldwork-on-DEM-Property-Central-B-C.html",
      "date": "2024-06-26T11:00:00.000Z",
      "hidden": false
    },
    {
      "id": 55542,
      "company_id": 213,
      "title": "Evergold Closes $1,072,000 Private Placement to Support Follow-up Drilling at Emerging DEM1 Gold-Silver++ Discovery, BC",
      "link": "https://www.globenewswire.com/news-release/2024/06/12/2897424/0/en/Evergold-Closes-1-072-000-Private-Placement-to-Support-Follow-up-Drilling-at-Emerging-DEM1-Gold-Silver-Discovery-BC.html",
      "date": "2024-06-12T11:00:00.000Z",
      "hidden": false
    }
  ]
}
