{
  "article": {
    "id": 53956,
    "link": "https://www.newsfilecorp.com/release/209419/Basin-Uranium-Stakes-Uranium-Project-in-the-Great-Divide-Basin-Wyoming",
    "title": "Basin Uranium Stakes Uranium Project in the Great Divide Basin, Wyoming",
    "description": "<img src=\"https://api.newsfilecorp.com/newsinfo/209419/367\" id=\"367\" width=\"2\" height=\"2\" style=\"width: 1px;  height: 1px;border: 0px solid;\" /><p>Vancouver, British Columbia--(Newsfile Corp. - May 16, 2024) - <b>BASIN URANIUM CORP. (CSE: NCLR) (CNSX: NCLR.CN) </b>(\"<b>Basin Uranium</b>\" or the \"<b>Company</b>\") is pleased to announce it has acquired the Great Divide Basin Uranium Project (the \"<b>Project</b>\" or \"<b>GDB</b>\") located in Sweetwater County, Wyoming, USA. The Project, which was acquired through direct staking by the Company, is comprised of 104 unpatented mineral lode claims totaling approximately 1,880 acres located in south-central Wyoming and within the Great Divide Basin (Figure 1). The claims are located contiguous with Premier American Uranium's Cyclone Project which hosts an exploration target ranging from 6.5 million short tons averaging 0.06% U<sub>3</sub>O<sub>8</sub> (7.9 million lbs. U<sub>3</sub>O<sub>8</sub>) to 10.5 million short tons averaging 0.06% U<sub>3</sub>O<sub>8</sub> (12.6 million lbs. U<sub>3</sub>O<sub>8</sub>)<sup>1</sup>. Wyoming is home to both the largest uranium reserves and top producing uranium state in US<sup>2</sup>, with the Great Divide Basin representing the least exploited of Wyoming's basins estimated to contain over 270 million pounds of uranium<sup>3</sup>.</p><p>\"The staking of the GDB property represents our continued expansion into the USA and second internally generated project in Wyoming. We continue to execute on acquiring and developing strategic assets located in prolific mining districts with extensive historical exploration,\" commented Mike Blady, CEO of Basin Uranium. \"The GDB Project and surrounding area have played host to a plethora of explorers, starting with the U.S. government in the 1950's and most recently Tournigan Energy Ltd. in the mid 2000's. The well understood geology, historic exploration, and proximity to UR Energy's Lost Creek ISR mine and processing facility add to the appeal and potential of GDB. Wyoming represents one of the premiere exploration and mining jurisdictions for uranium within the USA which provides for a clearly defined and expedient pathway for permitting and development.\"</p><p><b>The Great Divide Basin (GDB) Project, Wyoming</b></p><p>The GDB Project is comprised of approximately 1,880 acres of contiguous claims (104 unpatented mineral lode claims) located south and west of Jeffrey City and north and west of Wamsutter, Wyoming. The Project adjoins Premier American Uranium's Cyclone Project and is readily accessible by gravel and dirt roads maintained by the Bureau of Land Management (BLM). The Project has seen extensive historical drilling dating back to the 1970's with many of the pads identifiable on the western half of the project. More recently, Tournigan Energy drilled a number of wells with grade-thickness or GT (grade U<sub>3</sub>O<sub>8 </sub>X thickness in feet) in excess of 0.25GT from a grid located about 500 - 1,000 feet to the southwest of the project, further highlighting the potential for economic grade uranium mineralization within the immediate vicinity. </p><p style=\"text-align: center;\"><a rel=\"nofollow\" href=\"https://images.newsfilecorp.com/files/8416/209419_3d9f0ef1d47f0b8a_001full.jpg\"><img src=\"https://images.newsfilecorp.com/files/8416/209419_3d9f0ef1d47f0b8a_001.jpg\" style=\"border-width: 0px;\" alt=\"Cannot view this image? Visit: https://images.newsfilecorp.com/files/8416/209419_3d9f0ef1d47f0b8a_001.jpg\" /></a><br /><br /><b>Figure 1 - GDB Project Location <br /></b></p><p style=\"text-align: center;\">To view an enhanced version of this graphic, please visit:<br /><a rel=\"nofollow\" href=\"https://images.newsfilecorp.com/files/8416/209419_3d9f0ef1d47f0b8a_001full.jpg\">https://images.newsfilecorp.com/files/8416/209419_3d9f0ef1d47f0b8a_001full.jpg</a></p><p><b>Qualified Person</b></p><p>R. Tim Henneberry, PGeo (B.C.), a technical advisor to the Company, is the Qualified Person as defined by National Instrument 43-101 who has reviewed and approved the technical data in this news release.</p><p><b>About Basin Uranium Corp. </b></p><p>Basin Uranium is a Canadian junior exploration company focused on mineral exploration and development in the green energy sector. The company has five advanced-stage uranium projects located in the United States, namely the Chord and Wolf Canyon projects in South Dakota, the South Pass and Great Divide Basin projects in Wyoming, and the Wray Mesa project in Utah. All five projects have seen extensive historical exploration and located in prospective development areas. The Company also has the Mann Lake uranium project, located in the world-class Athabasca basin of Northern Saskatchewan, Canada, in addition to the CHG gold project in south-central British Columbia.</p><p>For further information, please contact Mr. Mike Blady or view the Company's filings at <a href=\"https://api.newsfilecorp.com/redirect/wW0RntAmvp\">www.sedarplus.ca</a>. </p><p>On Behalf of the Board of Directors <br />Mike Blady <br />Chief Executive Officer<br /><a href=\"mailto:info@basinuranium.ca\">info@basinuranium.ca</a> <br />604-722-9842 </p><p><i><b>Neither the Canadian Securities Exchange nor its regulation services provider accepts responsibility for the adequacy or accuracy of this news release</b></i><b>. </b></p><p><b>FORWARD-LOOKING STATEMENTS: </b></p><p><i>Cautionary Note Regarding Forward-Looking Statements: This news release includes certain statements and information that may constitute forward-looking information within the meaning of applicable Canadian securities laws. All statements in this news release, other than statements of historical facts, including statements regarding future estimates, plans, objectives, timing, assumptions or expectations of future performance are forward-looking statements and contain forward-looking information. Generally, forward-looking statements and information can be identified by the use of forward-looking terminology such as \"intends\" or \"anticipates\", or variations of such words and phrases or statements that certain actions, events or results \"may\", \"could\", \"should\", \"would\" or \"occur\". Forward-looking statements are based on certain material assumptions and analysis made by the Company and the opinions and estimates of management as of the date of this news release. These forward-looking statements are subject to known and unknown risks, uncertainties and other factors that may cause the actual results, level of activity, performance or achievements of the Company to be materially different from those expressed or implied by such forward-looking statements or forward-looking information. Important factors that may cause actual results to vary include, without limitation, uncertainties affecting the expected use of proceeds. Although management of the Company has attempted to identify important factors that could cause actual results to differ materially from those contained in forward-looking statements or forward-looking information, there may be other factors that cause results not to be as anticipated, estimated or intended. There can be no assurance that such statements will prove to be accurate, as actual results and future events could differ materially from those anticipated in such statements. Accordingly, readers should not place undue reliance on forward-looking statements and forward-looking information. Readers are cautioned that reliance on such information may not be appropriate for other purposes. The Company does not undertake to update any forward-looking statement, forward-looking information or financial out-look that are incorporated by reference herein, except in accordance with applicable securities laws. </i></p><hr style=\"width: 33%; margin-left: 0px; border-top: 1px solid #000000;\" /><p><font style=\"font-size: 11px;\"><sup>1</sup> Technical Report on the Cyclone Rim Uranium Project Great Divide Basin Wyoming, USA. June 30, 2023. <a href=\"https://api.newsfilecorp.com/redirect/gORQACxg02\">https://premierur.com/wyoming/cyclone-project/</a><br /><sup>2</sup> Domestic Uranium Production Report - Q2/2023, US Energy Information Administration <a href=\"https://api.newsfilecorp.com/redirect/pEgPnfRz2o\">https://www.eia.gov/uranium/production/quarterly/qupdtable1.php</a><br /><sup>3</sup> Applied Exploration Geology and Uranium Resources of Great Divide Basin, Wyoming <a href=\"https://api.newsfilecorp.com/redirect/YYJw1TqjJ8\">https://pubs.geoscienceworld.org/aapgbull/article-abstract/63/5/822/558172/Applied-Exploration-Geology-and-Uranium-Resources</a></font></p><p id=\"corporateLinkBack\">To view the source version of this press release, please visit <a href=\"https://api.newsfilecorp.com/redirect/0VvoPFELrm\">https://www.newsfilecorp.com/release/209419</a></p>",
    "search_terms": "Great Divide Basin (GDB),Basin Uranium Corp,NCLR",
    "master_gid": 6936,
    "date": "2024-05-16T07:05:00.000Z",
    "tags": "USA|Wyoming||Uranium|Project Acquisition",
    "image_id": null,
    "hidden": false,
    "company_id": 1142,
    "provider": null,
    "excerpt": "Vancouver, British Columbia--(Newsfile Corp. - May 16, 2024) -BASIN URANIUM CORP. (CSE: NCLR) (CNSX: NCLR.CN)(\"Basin Uranium\" or the \"Company\") is pleased to announce it has acquired the Great Divide Basin Uranium Project (the \"Project\" or \"GDB\") located in Sweetwater County, Wyoming, USA. The Project, which was acquired through direct staking",
    "is_regulatory": false,
    "refined_tags": [
      "Project Acquisition"
    ],
    "ftp_filename": null,
    "company_name": "Basin Uranium Corp",
    "exchange": "CSE",
    "root_ticker": "NCLR",
    "project_name": "Great Divide Basin (GDB)",
    "gid": 6936,
    "location": "Wyoming, United States",
    "plan_id": null,
    "description_text": "Vancouver, British Columbia--(Newsfile Corp. - May 16, 2024) - BASIN URANIUM CORP. (CSE: NCLR) (CNSX: NCLR.CN) (\" Basin Uranium \" or the \" Company \") is pleased to announce it has acquired the Great Divide Basin Uranium Project (the \" Project \" or \" GDB \") located in Sweetwater County, Wyoming, USA. The Project, which was acquired through direct staking by the Company, is comprised of 104 unpatented mineral lode claims totaling approximately 1,880 acres located in south-central Wyoming and within the Great Divide Basin (Figure 1). The claims are located contiguous with Premier American Uranium's Cyclone Project which hosts an exploration target ranging from 6.5 million short tons averaging 0.06% U 3 O 8 (7.9 million lbs. U 3 O 8 ) to 10.5 million short tons averaging 0.06% U 3 O 8 (12.6 million lbs. U 3 O 8 ) 1 . Wyoming is home to both the largest uranium reserves and top producing uranium state in US 2 , with the Great Divide Basin representing the least exploited of Wyoming's basins estimated to contain over 270 million pounds of uranium 3 . \"The staking of the GDB property represents our continued expansion into the USA and second internally generated project in Wyoming. We continue to execute on acquiring and developing strategic assets located in prolific mining districts with extensive historical exploration,\" commented Mike Blady, CEO of Basin Uranium. \"The GDB Project and surrounding area have played host to a plethora of explorers, starting with the U.S. government in the 1950's and most recently Tournigan Energy Ltd. in the mid 2000's. The well understood geology, historic exploration, and proximity to UR Energy's Lost Creek ISR mine and processing facility add to the appeal and potential of GDB. Wyoming represents one of the premiere exploration and mining jurisdictions for uranium within the USA which provides for a clearly defined and expedient pathway for permitting and development.\" The Great Divide Basin (GDB) Project, Wyoming The GDB Project is comprised of approximately 1,880 acres of contiguous claims (104 unpatented mineral lode claims) located south and west of Jeffrey City and north and west of Wamsutter, Wyoming. The Project adjoins Premier American Uranium's Cyclone Project and is readily accessible by gravel and dirt roads maintained by the Bureau of Land Management (BLM). The Project has seen extensive historical drilling dating back to the 1970's with many of the pads identifiable on the western half of the project. More recently, Tournigan Energy drilled a number of wells with grade-thickness or GT (grade U 3 O 8 X thickness in feet) in excess of 0.25GT from a grid located about 500 - 1,000 feet to the southwest of the project, further highlighting the potential for economic grade uranium mineralization within the immediate vicinity. Figure 1 - GDB Project Location To view an enhanced version of this graphic, please visit: https://images.newsfilecorp.com/files/8416/209419_3d9f0ef1d47f0b8a_001full.jpg Qualified Person R. Tim Henneberry, PGeo (B.C.), a technical advisor to the Company, is the Qualified Person as defined by National Instrument 43-101 who has reviewed and approved the technical data in this news release. About Basin Uranium Corp. Basin Uranium is a Canadian junior exploration company focused on mineral exploration and development in the green energy sector. The company has five advanced-stage uranium projects located in the United States, namely the Chord and Wolf Canyon projects in South Dakota, the South Pass and Great Divide Basin projects in Wyoming, and the Wray Mesa project in Utah. All five projects have seen extensive historical exploration and located in prospective development areas. The Company also has the Mann Lake uranium project, located in the world-class Athabasca basin of Northern Saskatchewan, Canada, in addition to the CHG gold project in south-central British Columbia. For further information, please contact Mr. Mike Blady or view the Company's filings at www.sedarplus.ca . On Behalf of the Board of Directors Mike Blady Chief Executive Officer info@basinuranium.ca 604-722-9842 Neither the Canadian Securities Exchange nor its regulation services provider accepts responsibility for the adequacy or accuracy of this news release . FORWARD-LOOKING STATEMENTS: Cautionary Note Regarding Forward-Looking Statements: This news release includes certain statements and information that may constitute forward-looking information within the meaning of applicable Canadian securities laws. All statements in this news release, other than statements of historical facts, including statements regarding future estimates, plans, objectives, timing, assumptions or expectations of future performance are forward-looking statements and contain forward-looking information. Generally, forward-looking statements and information can be identified by the use of forward-looking terminology such as \"intends\" or \"anticipates\", or variations of such words and phrases or statements that certain actions, events or results \"may\", \"could\", \"should\", \"would\" or \"occur\". Forward-looking statements are based on certain material assumptions and analysis made by the Company and the opinions and estimates of management as of the date of this news release. These forward-looking statements are subject to known and unknown risks, uncertainties and other factors that may cause the actual results, level of activity, performance or achievements of the Company to be materially different from those expressed or implied by such forward-looking statements or forward-looking information. Important factors that may cause actual results to vary include, without limitation, uncertainties affecting the expected use of proceeds. Although management of the Company has attempted to identify important factors that could cause actual results to differ materially from those contained in forward-looking statements or forward-looking information, there may be other factors that cause results not to be as anticipated, estimated or intended. There can be no assurance that such statements will prove to be accurate, as actual results and future events could differ materially from those anticipated in such statements. Accordingly, readers should not place undue reliance on forward-looking statements and forward-looking information. Readers are cautioned that reliance on such information may not be appropriate for other purposes. The Company does not undertake to update any forward-looking statement, forward-looking information or financial out-look that are incorporated by reference herein, except in accordance with applicable securities laws. 1 Technical Report on the Cyclone Rim Uranium Project Great Divide Basin Wyoming, USA. June 30, 2023. https://premierur.com/wyoming/cyclone-project/ 2 Domestic Uranium Production Report - Q2/2023, US Energy Information Administration https://www.eia.gov/uranium/production/quarterly/qupdtable1.php 3 Applied Exploration Geology and Uranium Resources of Great Divide Basin, Wyoming https://pubs.geoscienceworld.org/aapgbull/article-abstract/63/5/822/558172/Applied-Exploration-Geology-and-Uranium-Resources To view the source version of this press release, please visit https://www.newsfilecorp.com/release/209419",
    "primary_commodity": "U"
  },
  "articleProject": {
    "gid": 6936,
    "project_name": "Great Divide Basin (GDB)",
    "location": "Wyoming, United States"
  },
  "articleExchange": "CSE",
  "articleCompanyId": 1142,
  "articleTicker": "NCLR",
  "articleCompanyName": "Basin Uranium Corp",
  "allOtherCompanyProjects": [
    {
      "company_id": 1142,
      "gid": 6936,
      "project_name": "Great Divide Basin (GDB)",
      "location": "Wyoming, United States"
    },
    {
      "company_id": 1142,
      "gid": 5855,
      "project_name": "South Pass",
      "location": "Wyoming, United States"
    },
    {
      "company_id": 1142,
      "gid": 1969,
      "project_name": "Mann Lake",
      "location": "Saskatchewan, Canada"
    },
    {
      "company_id": 1142,
      "gid": 3522,
      "project_name": "Wray Mesa",
      "location": "Utah, United States"
    },
    {
      "company_id": 1142,
      "gid": 5254,
      "project_name": "Chord",
      "location": "South Dakota, United States"
    },
    {
      "company_id": 1142,
      "gid": 6343,
      "project_name": "Wolf Canyon",
      "location": "South Dakota, United States"
    }
  ],
  "allOtherCompanyNews": [
    {
      "id": 85035,
      "company_id": 1142,
      "title": "Basin Uranium Closes Previously Announced Non-brokered Private Placement of Units",
      "link": "https://www.newsfilecorp.com/release/238155/Basin-Uranium-Closes-Previously-Announced-Nonbrokered-Private-Placement-of-Units",
      "date": "2025-01-23T01:16:00.000Z",
      "hidden": false
    },
    {
      "id": 82892,
      "company_id": 1142,
      "title": "Basin Uranium Announces Non-Brokered Private Placement of Units",
      "link": "https://www.newsfilecorp.com/release/234992/Basin-Uranium-Announces-NonBrokered-Private-Placement-of-Units",
      "date": "2024-12-23T23:00:00.000Z",
      "hidden": false
    },
    {
      "id": 73434,
      "company_id": 1142,
      "title": "Basin Uranium Receives South Pass Project Approval",
      "link": "https://www.newsfilecorp.com/release/224691/Basin-Uranium-Receives-South-Pass-Project-Approval",
      "date": "2024-10-01T13:00:00.000Z",
      "hidden": false
    },
    {
      "id": 71508,
      "company_id": 1142,
      "title": "Basin Uranium Provides Chord Permitting Update",
      "link": "https://www.newsfilecorp.com/release/223142/Basin-Uranium-Provides-Chord-Permitting-Update",
      "date": "2024-09-16T13:00:00.000Z",
      "hidden": false
    },
    {
      "id": 63499,
      "company_id": 1142,
      "title": "Basin Uranium Kicks off Field Surveys at Chord",
      "link": "https://www.newsfilecorp.com/release/214377/Basin-Uranium-Kicks-off-Field-Surveys-at-Chord",
      "date": "2024-06-26T07:05:00.000Z",
      "hidden": false
    },
    {
      "id": 55441,
      "company_id": 1142,
      "title": "Basin Uranium Permits for Additional Drilling and ISR Testing at Chord",
      "link": "https://www.newsfilecorp.com/release/212347/Basin-Uranium-Permits-for-Additional-Drilling-and-ISR-Testing-at-Chord",
      "date": "2024-06-11T07:05:00.000Z",
      "hidden": false
    },
    {
      "id": 54531,
      "company_id": 1142,
      "title": "Basin Uranium Announces Submission of Permit at South Pass",
      "link": "https://www.newsfilecorp.com/release/210703/Basin-Uranium-Announces-Submission-of-Permit-at-South-Pass",
      "date": "2024-05-28T07:05:00.000Z",
      "hidden": false
    },
    {
      "id": 54246,
      "company_id": 1142,
      "title": "Basin Uranium Announces Filing of Technical Report Including Maiden Resource Estimate for Chord",
      "link": "https://www.newsfilecorp.com/release/210036/Basin-Uranium-Announces-Filing-of-Technical-Report-Including-Maiden-Resource-Estimate-for-Chord",
      "date": "2024-05-22T07:05:00.000Z",
      "hidden": false
    },
    {
      "id": 53956,
      "company_id": 1142,
      "title": "Basin Uranium Stakes Uranium Project in the Great Divide Basin, Wyoming",
      "link": "https://www.newsfilecorp.com/release/209419/Basin-Uranium-Stakes-Uranium-Project-in-the-Great-Divide-Basin-Wyoming",
      "date": "2024-05-16T07:05:00.000Z",
      "hidden": false
    },
    {
      "id": 53715,
      "company_id": 1142,
      "title": "Basin Uranium Announces Acceleration of Warrant Expiry Date",
      "link": "https://www.newsfilecorp.com/release/208830/Basin-Uranium-Announces-Acceleration-of-Warrant-Expiry-Date",
      "date": "2024-05-10T20:39:00.000Z",
      "hidden": false
    }
  ]
}
