{
  "article": {
    "id": 44455,
    "link": "https://www.newsfilecorp.com/release/188033/Bayhorse-Adds-Idaho-Claims-to-The-Bayhorse-Property",
    "title": "Bayhorse Adds Idaho Claims to The Bayhorse Property",
    "description": "<img src=\"https://api.newsfilecorp.com/newsinfo/188033/367\" id=\"367\" width=\"2\" height=\"2\" style=\"width: 1px;  height: 1px;border: 0px solid;\" /><p>Vancouver, British Columbia--(Newsfile Corp. - November 20, 2023) - <b>Bayhorse Silver Inc, (TSXV:&#160;BHS)&#160;(OTCQB:&#160;BHSIF) (FSE: 7KXN) (the \"Company\" or \"Bayhorse\")</b> has added additional claims in Idaho to its Bayhorse Silver Mine Property, Oregon, USA.</p><p>The new claims extend over 1.6 km (1 mile) east from the Bayhorse Mine across the Snake River into Idaho along a south-east trend that historic geological mapping (Figure 1) shows the presence of silver-hosting rhyolite. Historic mine workings and known silver-bearing mineralization are present in the new claims area.</p><p>Hercules Silver has recently discovered a copper porphyry deposit associated with a red schist conglomerate at one of its properties lying approximately 40 km (26 miles) north-northeast of the Bayhorse Mine (Figure 2 below). Hercules has acquired a second property 24 km (14 miles) NE of Bayhorse. A conglomerate, similar to that on the Hercules ground is present adjacent to the silver-bearing rhyolite on the Bayhorse Property, prompting the extension of the new claims into Idaho.</p><p>The Bayhorse and Hercules Silver properties have similar geological settings and silver mineralization, including significant copper, antimony, and zinc credits. This has spurred Bayhorse to extend further the known silver bearing zones.</p><p>An airborne deep penetrating VTEM survey is planned over the entire Bayhorse claims in both Idaho and Oregon to determine whether an anomaly is present that could indicate the presence of both high-grade silver and a porphyry copper deposit. </p><p>Drs. Ray and Conway are currently assessing the Bayhorse Mine structure and geology to determine how best to test the extensive historic underground workings to depth for any underlying mineralization below the known mineral horizon.</p><p style=\"text-align: center;\"><a rel=\"nofollow\" href=\"https://images.newsfilecorp.com/files/5015/188033_35dbcc3424f43844_001full.jpg\"><img src=\"https://images.newsfilecorp.com/files/5015/188033_35dbcc3424f43844_001.jpg\" style=\"border-width: 0px;\" alt=\"Cannot view this image? Visit: https://images.newsfilecorp.com/files/5015/188033_35dbcc3424f43844_001.jpg\" /></a><br /><br />Figure 1.</p><p style=\"text-align: center;\">To view an enhanced version of this graphic, please visit:<br /><a rel=\"nofollow\" href=\"https://images.newsfilecorp.com/files/5015/188033_35dbcc3424f43844_001full.jpg\">https://images.newsfilecorp.com/files/5015/188033_35dbcc3424f43844_001full.jpg</a></p><p style=\"text-align: center;\"><a rel=\"nofollow\" href=\"https://images.newsfilecorp.com/files/5015/188033_35dbcc3424f43844_002full.jpg\"><img src=\"https://images.newsfilecorp.com/files/5015/188033_35dbcc3424f43844_002.jpg\" style=\"border-width: 0px;\" alt=\"Cannot view this image? Visit: https://images.newsfilecorp.com/files/5015/188033_35dbcc3424f43844_002.jpg\" /></a><br /><br />Figure 2.</p><p style=\"text-align: center;\">To view an enhanced version of this graphic, please visit:<br /><a rel=\"nofollow\" href=\"https://images.newsfilecorp.com/files/5015/188033_35dbcc3424f43844_002full.jpg\">https://images.newsfilecorp.com/files/5015/188033_35dbcc3424f43844_002full.jpg</a></p><p>This News Release has been prepared on behalf of the Bayhorse Silver Inc. Board of Directors, which accepts full responsibility for its content. Dr. G.E. Ray, P.Geo, a Qualified Person and Consultant to the Company has prepared, supervised the preparation of, and approved the technical content of this press release.</p><p>On Behalf of the Board.</p><p>Graeme O'Neill, CEO<br />866-399-6539</p><p><b>About Bayhorse Silver Inc.</b></p><p>Bayhorse Silver Inc. is an exploration and production company with a 100% interest in the historic Bayhorse Silver Mine located in Oregon, USA. With  state of the art Steinert Ore-Sorting technology reducing waste rock entering the processing stream by up to 85%, we have created a minimum environmental impact facility capable of mining 200 tons of mineralization per day and the ability to process and supply 3,600 tons per year of silver/copper/antimony concentrate ranging between 7,500 to 15,000 g/t using standard flotation processing at its milling facility in nearby Payette County, Idaho, USA, with an offtake agreement in place with Ocean Partners UK Limited. The Company also has an option to acquire an 80% interest in the Brandywine high grade silver/gold property located in B.C. Canada. The Company has an experienced management and technical team with extensive mining expertise in both exploration and building mines.</p><p><i>Neither the TSX Venture Exchange nor its Regulation Services Provider (as that term is defined in the policies of the TSX Venture Exchange) accepts responsibility for the adequacy or accuracy of this release.</i></p><p id=\"corporateNewsLogoContainer\"><img src=\"https://images.newsfilecorp.com/files/5015/188033_35dbcc3424f43844_logo.jpg\" id=\"corporateNewsLogo\" alt=\"Corporate Logo\" /></p><p id=\"corporateLinkBack\">To view the source version of this press release, please visit <a href=\"https://api.newsfilecorp.com/redirect/85Em8ueXeW\">https://www.newsfilecorp.com/release/188033</a></p>",
    "search_terms": "Bayhorse,Bayhorse Silver Inc.,BHS",
    "master_gid": 2846,
    "date": "2023-11-20T14:40:00.000Z",
    "tags": "USA|Idaho,Oregon||Silver|Project Acquisition",
    "image_id": null,
    "hidden": false,
    "company_id": 1144,
    "provider": null,
    "excerpt": "Vancouver, British Columbia--(Newsfile Corp. - November 20, 2023) -Bayhorse Silver Inc, (TSXV:&#160;BHS)&#160;(OTCQB:&#160;BHSIF) (FSE: 7KXN) (the \"Company\" or \"Bayhorse\")has added additional claims in Idaho to its Bayhorse Silver Mine Property, Oregon, USA.The new claims extend over 1.6 km (1 mile) east from the Bayhorse Mine across the Snake River into Idaho",
    "is_regulatory": false,
    "refined_tags": [
      "Project Acquisition"
    ],
    "ftp_filename": null,
    "company_name": "Bayhorse Silver Inc.",
    "exchange": "TSXV",
    "root_ticker": "BHS",
    "project_name": "Bayhorse",
    "gid": 2846,
    "location": "Oregon, United States",
    "plan_id": null,
    "description_text": "Vancouver, British Columbia--(Newsfile Corp. - November 20, 2023) - Bayhorse Silver Inc, (TSXV: BHS) (OTCQB: BHSIF) (FSE: 7KXN) (the \"Company\" or \"Bayhorse\") has added additional claims in Idaho to its Bayhorse Silver Mine Property, Oregon, USA. The new claims extend over 1.6 km (1 mile) east from the Bayhorse Mine across the Snake River into Idaho along a south-east trend that historic geological mapping (Figure 1) shows the presence of silver-hosting rhyolite. Historic mine workings and known silver-bearing mineralization are present in the new claims area. Hercules Silver has recently discovered a copper porphyry deposit associated with a red schist conglomerate at one of its properties lying approximately 40 km (26 miles) north-northeast of the Bayhorse Mine (Figure 2 below). Hercules has acquired a second property 24 km (14 miles) NE of Bayhorse. A conglomerate, similar to that on the Hercules ground is present adjacent to the silver-bearing rhyolite on the Bayhorse Property, prompting the extension of the new claims into Idaho. The Bayhorse and Hercules Silver properties have similar geological settings and silver mineralization, including significant copper, antimony, and zinc credits. This has spurred Bayhorse to extend further the known silver bearing zones. An airborne deep penetrating VTEM survey is planned over the entire Bayhorse claims in both Idaho and Oregon to determine whether an anomaly is present that could indicate the presence of both high-grade silver and a porphyry copper deposit. Drs. Ray and Conway are currently assessing the Bayhorse Mine structure and geology to determine how best to test the extensive historic underground workings to depth for any underlying mineralization below the known mineral horizon. Figure 1. To view an enhanced version of this graphic, please visit: https://images.newsfilecorp.com/files/5015/188033_35dbcc3424f43844_001full.jpg Figure 2. To view an enhanced version of this graphic, please visit: https://images.newsfilecorp.com/files/5015/188033_35dbcc3424f43844_002full.jpg This News Release has been prepared on behalf of the Bayhorse Silver Inc. Board of Directors, which accepts full responsibility for its content. Dr. G.E. Ray, P.Geo, a Qualified Person and Consultant to the Company has prepared, supervised the preparation of, and approved the technical content of this press release. On Behalf of the Board. Graeme O'Neill, CEO 866-399-6539 About Bayhorse Silver Inc. Bayhorse Silver Inc. is an exploration and production company with a 100% interest in the historic Bayhorse Silver Mine located in Oregon, USA. With  state of the art Steinert Ore-Sorting technology reducing waste rock entering the processing stream by up to 85%, we have created a minimum environmental impact facility capable of mining 200 tons of mineralization per day and the ability to process and supply 3,600 tons per year of silver/copper/antimony concentrate ranging between 7,500 to 15,000 g/t using standard flotation processing at its milling facility in nearby Payette County, Idaho, USA, with an offtake agreement in place with Ocean Partners UK Limited. The Company also has an option to acquire an 80% interest in the Brandywine high grade silver/gold property located in B.C. Canada. The Company has an experienced management and technical team with extensive mining expertise in both exploration and building mines. Neither the TSX Venture Exchange nor its Regulation Services Provider (as that term is defined in the policies of the TSX Venture Exchange) accepts responsibility for the adequacy or accuracy of this release. To view the source version of this press release, please visit https://www.newsfilecorp.com/release/188033",
    "primary_commodity": "Ag"
  },
  "articleProject": {
    "gid": 2846,
    "project_name": "Bayhorse",
    "location": "Oregon, United States"
  },
  "articleExchange": "TSXV",
  "articleCompanyId": 1144,
  "articleTicker": "BHS",
  "articleCompanyName": "Bayhorse Silver Inc.",
  "allOtherCompanyProjects": [
    {
      "company_id": 1144,
      "gid": 48,
      "project_name": "Harrison",
      "location": "British Columbia, Canada"
    },
    {
      "company_id": 1144,
      "gid": 2846,
      "project_name": "Bayhorse",
      "location": "Oregon, United States"
    },
    {
      "company_id": 1144,
      "gid": 45,
      "project_name": "Brandywine",
      "location": "British Columbia, Canada"
    }
  ],
  "allOtherCompanyNews": [
    {
      "id": 107703,
      "company_id": 1144,
      "title": "Bayhorse Silver Confirms Strike Extensions 150 Meters (492ft) of Silver Mineralization at the Bayhorse Silver Mine, Oregon, USA. Plans Additional Underground Drilling Program to Extend New High Grade Drift Zone. Posts Baseline Permit Studies to Website",
      "link": null,
      "date": "2025-06-11T14:33:00.000Z",
      "hidden": false
    },
    {
      "id": 104363,
      "company_id": 1144,
      "title": "Bayhorse Silver Closes First Tranche of 20 Million Unit Non-Brokered Private Placement",
      "link": "https://app.quotemedia.com/data/downloadFiling?webmasterId=104408&ref=682239712001cc1ea02a5492&type=PDFC&formType=002-002-001089-003001&formDescription=News+release&dateFiled=2025-05-12",
      "date": "2025-05-12T18:09:53.000Z",
      "hidden": false
    },
    {
      "id": 103727,
      "company_id": 1144,
      "title": "Bayhorse Silver Increases and Reprices Its Recently Announced 15 Million Unit Non-Brokered Private Placement",
      "link": "https://app.quotemedia.com/data/downloadFiling?webmasterId=104408&ref=681a898e8e3fa6758f68bb55&type=PDFC&formType=002-002-001089-003001&formDescription=News+release&dateFiled=2025-05-06",
      "date": "2025-05-06T22:13:34.000Z",
      "hidden": false
    },
    {
      "id": 102735,
      "company_id": 1144,
      "title": "Bayhorse Silver Announces A 15 Million Unit Non-Brokered Private Placement For The Recently Announced Drill Program at the Bayhorse Silver Mine, Oregon, And IP Survey On Its Adjacent Pegasus Project, Idaho, USA",
      "link": "https://app.quotemedia.com/data/downloadFiling?webmasterId=104408&ref=6806ad3278f0466da96d7272&type=PDFC&formType=002-002-001089-003001&formDescription=News+release&dateFiled=2025-04-21",
      "date": "2025-04-21T13:40:18.000Z",
      "hidden": false
    },
    {
      "id": 99671,
      "company_id": 1144,
      "title": "Bayhorse Silver Commences Drilling At 30M By 40M IP Target Below Historic High Grade Silver Sunshine Stope At The Bayhorse Silver Mine, Oregon, USA",
      "link": null,
      "date": "2025-04-14T13:52:00.000Z",
      "hidden": false
    },
    {
      "id": 93135,
      "company_id": 1144,
      "title": "Bayhorse Silver Receives Final Bayhorse Silver Mine IP Survey Results, Extends Bayhorse Potential Mineralized Zone To Over 600 M, Identifies First IP Drill Target",
      "link": null,
      "date": "2025-03-31T13:29:00.000Z",
      "hidden": false
    },
    {
      "id": 92508,
      "company_id": 1144,
      "title": "Bayhorse Silver Reports Anomalous Copper-Zinc Assay Results from the Last 112 m of Drill Hole BH24-01 from 207 m (680ft) Downhole to End of Hole at 318 m (1050 ft)",
      "link": null,
      "date": "2025-03-25T14:18:00.000Z",
      "hidden": false
    },
    {
      "id": 95667,
      "company_id": 1144,
      "title": "Bayhorse Silver Extends Warrants",
      "link": "https://app.quotemedia.com/data/downloadFiling?webmasterId=104408&ref=67d31fbccfb2b16461759501&type=PDFC&formType=002-002-001089-003001&formDescription=News+release&dateFiled=2025-03-13",
      "date": "2025-03-13T18:11:08.000Z",
      "hidden": false
    },
    {
      "id": 90018,
      "company_id": 1144,
      "title": "Bayhorse Silver Extends Bayhorse Breccia Zone From 90 M (300ft) Downhole to 318 M (1050 ft) Reports Anomalous Copper-Zinc Assay Results From The First 115 M Of The Breccia Zone, And Preliminary IP Results",
      "link": "https://www.newsfilecorp.com/release/243247/Bayhorse-Silver-Extends-Bayhorse-Breccia-Zone-From-90-M-300ft-Downhole-to-318-M-1050-ft-Reports-Anomalous-CopperZinc-Assay-Results-From-The-First-115-M-Of-The-Breccia-Zone-And-Preliminary-IP-Results",
      "date": "2025-03-04T14:06:00.000Z",
      "hidden": false
    },
    {
      "id": 84361,
      "company_id": 1144,
      "title": "Bayhorse Silver Submits 115 Meters Of Core Samples For Assay, And Plans Downhole Geophysical Surveys of the Bayhorse Silver Mine",
      "link": "https://www.newsfilecorp.com/release/237365/Bayhorse-Silver-Submits-115-Meters-Of-Core-Samples-For-Assay-And-Plans-Downhole-Geophysical-Surveys-of-the-Bayhorse-Silver-Mine",
      "date": "2025-01-16T14:00:00.000Z",
      "hidden": false
    }
  ]
}
