{
  "article": {
    "id": 51379,
    "link": "https://contentapi.cision.com/api/v1.0/releases/20240402VA77268",
    "title": "C2C Metals Corp. Announces Acquisition of its Second United States Uranium Project",
    "description": "\n\n<p class=\"prntar\"><b>CSE: CTOC<br></br></b><b><span><a href=\"https://c212.net/c/link/?t=0&amp;l=en&amp;o=4130977-1&amp;h=3991152936&amp;u=http%3A%2F%2Fwww.c2cmetals.com&amp;a=www.c2cmetals.com\" rel=\"nofollow\" target=\"_blank\">www.c2cmetals.com</a></span></b></p>\n<p><span class=\"legendSpanClass\"><span class=\"xn-location\">VANCOUVER, BC</span></span>, <span class=\"legendSpanClass\"><span class=\"xn-chron\">April 2, 2024</span></span> /PRNewswire/ - <b>C2C Metals Corp. </b>(CSE: CTOC) <b>(</b><b>the \"Company\" or \"C2C\")</b> reports today the acquisition of its second <span class=\"xn-location\">United States</span> uranium project acquired through claim staking. The project was identified and drilled by URADCO in 1981 establishing a historic resource as detailed below. The Blue Jay Mine Project lies in <span class=\"xn-location\">San Juan County, Utah</span>, and is located in the La Sal Uranium District which is recognized as the second most significant uranium producer in the <span class=\"xn-location\">Utah</span>-<span class=\"xn-location\">Colorado</span> region.</p>\n<p><span class=\"xn-person\">Chris Huggins</span>, Chief Executive Officer stated: \"The Blue Jay Mine Project is C2C's second uranium project as we continue to delve into the private mining database. The Blue Jay is another excellent example of high value uranium properties that have been neglected for over 40 years.  Having access to an extensive database allows C2C to capitalize on previous work that has outlined very promising areas with significant uranium mineralization. The project's mineralization remains open along trend to the west and offers excellent exploration potential.\"</p>\n<div aria-level=\"3\" class=\"wcag-arialevel-3\" role=\"heading\" style=\"display: block; font-size: 1.17em; margin-block-start: 1em; margin-block-end: 1em; margin-inline-start: 0px; margin-inline-end: 0px; font-weight: bold;\"><b>Blue Jay Mine Uranium Property, <span class=\"xn-location\">San Juan County</span>, <span class=\"xn-location\">Southeastern Utah</span></b></div><p>C2C's Blue Jay Mine Uranium Property comprises 28 mineral claims covering about 560 acres, located approximately 30 miles south of <span class=\"xn-location\">Moab</span>, <span class=\"xn-location\">San Juan County, Utah</span>, within the La Sal Uranium District. The claims are located about 2 to 3 miles northwesterly from three historic uranium producing mines, including the Rattlesnake Mine - one of the top four past producing uranium-vanadium mines in the <span class=\"xn-location\">La Sal</span> District. The project area is also within, or adjacent to, the largest favorable channel trend in the western part of the La Sal Uranium Mining District, <span class=\"xn-location\">Utah</span>, which hosts many of the largest uranium deposits in the <span class=\"xn-location\">La Sal</span> District.</p>\n<p>The claim area saw extensive drilling by URADCO, a subsidiary of Pennsylvania Power and Light Corp (PPL), with some drill sites still visible today. Using URADCO\"s drill results from 22 holes, in <span class=\"xn-chron\">March 1981</span>, Atlas Minerals' Chief Mining Engineer prepared a preliminary economic evaluation for Atlas' President of  a deposit on the property estimating about 110,000 pounds U<sub>3</sub>O<sub>8</sub>, at an average grade of about 0.25% U<sub>3</sub>O<sub>8</sub>, at depths of 330 to 360 ft. The Atlas report classified the uranium resources as \"economically viable reserves.\" Other information in the Atlas historic records suggests there may be additional lower grade mineralization including 140,000 lbs. U<sub>3</sub>O<sub>8</sub>, on property covered by C2C's claims. The Atlas engineer also estimated the V<sub>2</sub>O<sub>5</sub> deposit grade to be 1.25%, based on a historic V<sub>2</sub>O<sub>5</sub>:U<sub>3</sub>O<sub>8 </sub>ratio of 5:1 for the <span class=\"xn-location\">La Sal</span> District, suggesting an estimated 550,000 lbs. V<sub>2</sub>O<sub>5</sub> included with the estimated uranium resource. At the 1981 Atlas report date, the uranium market price had been falling precipitously, and Atas elected not to acquire the URADCO drilled property. The estimated uranium mineral resources in the Atlas Minerals report are historic in nature and do not conform to the resource reporting terminology as defined in NI 43-101.</p>\n<p>The La Sal Uranium-Vanadium District is identified as having <span class=\"xn-location\">Utah's</span> second highest potential for the discovery of additional uranium reserves. C2C's 28 claims including the historic Blue Jay Mine Portal, are also located in an area identified as having \"high exploration potential,\" by the Utah Geological Survey in its report \"Uranium Potential in <span class=\"xn-location\">Utah</span><sup>1</sup>.\"</p>\n<p>The sandstone-type uranium-vanadium mineralization at the Blue Jay Mine Property is hosted within the upper most sandstone \"rim\" of the Salt Wash Member of the Jurassic age Morrison Formation. The uranium mineralization on the claims is typical of the Sandstone uranium deposits of the Salt Wash type, of the Colorado Plateau Province. A major characteristic of the Salt Wash type deposits is the occurrence of vanadium together with the uranium, with vanadium usually occurring in higher concentrations than uranium, making them different from the <span class=\"xn-location\">Wyoming</span> and <span class=\"xn-location\">New Mexico</span> uranium deposits, which routinely have very low concentrations of vanadium.</p>\n<p>Based on the historic information from the Atlas Minerals' report, C2C's exploration target for the property is between 100,000 and 250,000 lbs. U<sub>3</sub>O<sub>8</sub>, at an estimated average grade ranging from 0.15% to 0.25% U<sub>3</sub>O<sub>8</sub>, at depths between 330 and 360 ft. The target deposit is conceptional in nature and should not be relied upon by the reader. A Qualified Person (as defined in NI 43-101) has not done sufficient work to verify the historical information on which the conceptual exploration target is based.  Additional work, including drilling, will be required to confirm the presence of uranium, and if present, to establish the amount and grade of any mineralization that is found. C2C is not treating the historical information as reliable, and it should not be relied upon.</p>\n<div class=\"PRN_ImbeddedAssetReference\" id=\"DivAssetPlaceHolder3126\"><p><a href=\"https://mma.prnewswire.com/media/2376907/C2C_Metals_Corp__C2C_Metals_Corp__Announces_Acquisition_of_its_S.html\" rel=\"nofollow\" target=\"_blank\"><img alt=\"Figure 1 C2C Uranium Project Area Map (CNW Group/C2C Metals Corp.)\" src=\"https://mma.prnewswire.com/media/2376907/C2C_Metals_Corp__C2C_Metals_Corp__Announces_Acquisition_of_its_S.jpg?p=original\" title=\"Figure 1 C2C Uranium Project Area Map (CNW Group/C2C Metals Corp.)\"></img></a></p>\n</div><p>The technical content concerning the Property in this news release was reviewed and approved by Dr. <span class=\"xn-person\">Douglas H. Underhill</span>, CPG, Chief Geologist for C2C Metals Corp., a Qualified Person as defined by National Instrument 43-101.</p>\n<div aria-level=\"3\" class=\"wcag-arialevel-3\" role=\"heading\" style=\"display: block; font-size: 1.17em; margin-block-start: 1em; margin-block-end: 1em; margin-inline-start: 0px; margin-inline-end: 0px; font-weight: bold;\"><b>About C2C Metals Corp.</b></div><p>C2C Metals is a mineral exploration company which holds a portfolio of uranium, gold and copper projects in <span class=\"xn-location\">the United States</span> and <span class=\"xn-location\">Canada</span>.</p>\n<div><table border=\"0\" cellpadding=\"1\" cellspacing=\"0\" class=\"prnbcc\"><tr><td class=\"prnpr2 prnpl2 prnvab prnsbtb0 prnrbrb0 prnsbbb0 prnsblb0\" colspan=\"1\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\"><sup>1</sup> Gloyn, R.W., and Ken Krahulec, 2005, \"Uranium Potential in Utah,\" Utah Geological Survey, Salt Lake City, Utah, 54 p.</span></p>\n</td></tr></table></div><p><i>Neither the Canadian Securities Exchange nor its Market Regulator (as that term is defined in policies of the Canadian Securities Exchange) accepts responsibility for the adequacy or accuracy of this release.</i></p>\n<div aria-level=\"3\" class=\"wcag-arialevel-3\" role=\"heading\" style=\"display: block; font-size: 1.17em; margin-block-start: 1em; margin-block-end: 1em; margin-inline-start: 0px; margin-inline-end: 0px; font-weight: bold;\"><b>Forward Looking Statements</b></div><p>This news release may include forward-looking statements that are subject to risks and uncertainties and can be identified by the use of forward-looking terminology such as \"expected\", \"will be\", \"anticipated\", \"may\" or variations of such words and phrases or statements that certain actions, events or results \"will\" occur. All statements within, other than statements of historical fact, are to be considered forward looking. Forward-looking statements in this news release include but are not limited to: the completion of the name change.  Although the Company believes the expectations expressed in such forward-looking statements are based on reasonable assumptions, such statements are not guarantees of future performance and actual results or developments may differ materially from those in forward-looking statements. Factors that could cause actual results to differ materially from those in forward-looking statements include market prices, continued availability of capital and financing, and general economic, market or business conditions. There can be no assurances that such statements will prove accurate and, therefore, readers are advised to rely on their own evaluation of such uncertainties. We do not assume any obligation to update any forward-looking statements except as required under the applicable laws.</p>\n\n<div class=\"PRN_ImbeddedAssetReference\" id=\"DivAssetPlaceHolder0\">\n                    <p>\n                            <a href=\"https://mma.prnewswire.com/media/2376906/C2C_Metals_Corp__C2C_Metals_Corp__Announces_Acquisition_of_its_S.html\" rel=\"nofollow\" target=\"_blank\">\n                        <img alt=\"C2C Metals Corp. Logo (CNW Group/C2C Metals Corp.)\" src=\"https://mma.prnewswire.com/media/2376906/C2C_Metals_Corp__C2C_Metals_Corp__Announces_Acquisition_of_its_S.jpg\" title=\"C2C Metals Corp. Logo (CNW Group/C2C Metals Corp.)\"></img>\n                            </a>\n                    </p>\n\n</div>\n\n\n\n\n\n<p id=\"PURL\"><img alt=\"Cision\" height=\"12\" src=\"https://c212.net/c/img/favicon.png?sn=VA77268&amp;sd=2024-04-02\" title=\"Cision\" width=\"12\"></img> View original content to download multimedia:<a href=\"https://www.prnewswire.com/news-releases/c2c-metals-corp-announces-acquisition-of-its-second-united-states-uranium-project-302105293.html\" id=\"PRNURL\" rel=\"nofollow\" target=\"_blank\">https://www.prnewswire.com/news-releases/c2c-metals-corp-announces-acquisition-of-its-second-united-states-uranium-project-302105293.html</a></p>\n<p>SOURCE  C2C Metals Corp.</p>\n\n<img alt=\"\" src=\"https://rt.prnewswire.com/rt.gif?NewsItemId=VA77268&amp;Transmission_Id=202404020730PR_NEWS_USPR_____VA77268&amp;DateId=20240402\" style=\"border:0px; width:1px; height:1px;\"></img>\n",
    "search_terms": "Blue Jay Mine,Urano Energy Corp,,CTOC",
    "master_gid": 6608,
    "date": "2024-04-02T11:30:00.000Z",
    "tags": "USA|Colorado,Utah||Uranium|Project Acquisition",
    "image_id": null,
    "hidden": false,
    "company_id": 321,
    "provider": null,
    "excerpt": "CSE: CTOCwww.c2cmetals.comVANCOUVER, BC,April 2, 2024/PRNewswire/ -C2C Metals Corp.(CSE: CTOC)(the \"Company\" or \"C2C\")reports today the acquisition of its secondUnited Statesuranium project acquired through claim staking. The project was identified and drilled by URADCO in 1981 establishing a historic resource as detailed below. The Blue Jay Mine Project lies inSan Juan County,",
    "is_regulatory": false,
    "refined_tags": [
      "Project Acquisition"
    ],
    "ftp_filename": null,
    "company_name": "Urano Energy Corp,",
    "exchange": "CSE",
    "root_ticker": "UE",
    "project_name": "Blue Jay Mine",
    "gid": 6608,
    "location": "Utah, United States",
    "plan_id": null,
    "description_text": "CSE: CTOC www.c2cmetals.com VANCOUVER, BC , April 2, 2024 /PRNewswire/ - C2C Metals Corp. (CSE: CTOC) ( the \"Company\" or \"C2C\") reports today the acquisition of its second United States uranium project acquired through claim staking. The project was identified and drilled by URADCO in 1981 establishing a historic resource as detailed below. The Blue Jay Mine Project lies in San Juan County, Utah , and is located in the La Sal Uranium District which is recognized as the second most significant uranium producer in the Utah - Colorado region. Chris Huggins , Chief Executive Officer stated: \"The Blue Jay Mine Project is C2C's second uranium project as we continue to delve into the private mining database. The Blue Jay is another excellent example of high value uranium properties that have been neglected for over 40 years.  Having access to an extensive database allows C2C to capitalize on previous work that has outlined very promising areas with significant uranium mineralization. The project's mineralization remains open along trend to the west and offers excellent exploration potential.\" Blue Jay Mine Uranium Property, San Juan County , Southeastern Utah C2C's Blue Jay Mine Uranium Property comprises 28 mineral claims covering about 560 acres, located approximately 30 miles south of Moab , San Juan County, Utah , within the La Sal Uranium District. The claims are located about 2 to 3 miles northwesterly from three historic uranium producing mines, including the Rattlesnake Mine - one of the top four past producing uranium-vanadium mines in the La Sal District. The project area is also within, or adjacent to, the largest favorable channel trend in the western part of the La Sal Uranium Mining District, Utah , which hosts many of the largest uranium deposits in the La Sal District. The claim area saw extensive drilling by URADCO, a subsidiary of Pennsylvania Power and Light Corp (PPL), with some drill sites still visible today. Using URADCO\"s drill results from 22 holes, in March 1981 , Atlas Minerals' Chief Mining Engineer prepared a preliminary economic evaluation for Atlas' President of  a deposit on the property estimating about 110,000 pounds U 3 O 8 , at an average grade of about 0.25% U 3 O 8 , at depths of 330 to 360 ft. The Atlas report classified the uranium resources as \"economically viable reserves.\" Other information in the Atlas historic records suggests there may be additional lower grade mineralization including 140,000 lbs. U 3 O 8 , on property covered by C2C's claims. The Atlas engineer also estimated the V 2 O 5 deposit grade to be 1.25%, based on a historic V 2 O 5 :U 3 O 8 ratio of 5:1 for the La Sal District, suggesting an estimated 550,000 lbs. V 2 O 5 included with the estimated uranium resource. At the 1981 Atlas report date, the uranium market price had been falling precipitously, and Atas elected not to acquire the URADCO drilled property. The estimated uranium mineral resources in the Atlas Minerals report are historic in nature and do not conform to the resource reporting terminology as defined in NI 43-101. The La Sal Uranium-Vanadium District is identified as having Utah's second highest potential for the discovery of additional uranium reserves. C2C's 28 claims including the historic Blue Jay Mine Portal, are also located in an area identified as having \"high exploration potential,\" by the Utah Geological Survey in its report \"Uranium Potential in Utah 1 .\" The sandstone-type uranium-vanadium mineralization at the Blue Jay Mine Property is hosted within the upper most sandstone \"rim\" of the Salt Wash Member of the Jurassic age Morrison Formation. The uranium mineralization on the claims is typical of the Sandstone uranium deposits of the Salt Wash type, of the Colorado Plateau Province. A major characteristic of the Salt Wash type deposits is the occurrence of vanadium together with the uranium, with vanadium usually occurring in higher concentrations than uranium, making them different from the Wyoming and New Mexico uranium deposits, which routinely have very low concentrations of vanadium. Based on the historic information from the Atlas Minerals' report, C2C's exploration target for the property is between 100,000 and 250,000 lbs. U 3 O 8 , at an estimated average grade ranging from 0.15% to 0.25% U 3 O 8 , at depths between 330 and 360 ft. The target deposit is conceptional in nature and should not be relied upon by the reader. A Qualified Person (as defined in NI 43-101) has not done sufficient work to verify the historical information on which the conceptual exploration target is based.  Additional work, including drilling, will be required to confirm the presence of uranium, and if present, to establish the amount and grade of any mineralization that is found. C2C is not treating the historical information as reliable, and it should not be relied upon. The technical content concerning the Property in this news release was reviewed and approved by Dr. Douglas H. Underhill , CPG, Chief Geologist for C2C Metals Corp., a Qualified Person as defined by National Instrument 43-101. About C2C Metals Corp. C2C Metals is a mineral exploration company which holds a portfolio of uranium, gold and copper projects in the United States and Canada . 1 Gloyn, R.W., and Ken Krahulec, 2005, \"Uranium Potential in Utah,\" Utah Geological Survey, Salt Lake City, Utah, 54 p. Neither the Canadian Securities Exchange nor its Market Regulator (as that term is defined in policies of the Canadian Securities Exchange) accepts responsibility for the adequacy or accuracy of this release. Forward Looking Statements This news release may include forward-looking statements that are subject to risks and uncertainties and can be identified by the use of forward-looking terminology such as \"expected\", \"will be\", \"anticipated\", \"may\" or variations of such words and phrases or statements that certain actions, events or results \"will\" occur. All statements within, other than statements of historical fact, are to be considered forward looking. Forward-looking statements in this news release include but are not limited to: the completion of the name change.  Although the Company believes the expectations expressed in such forward-looking statements are based on reasonable assumptions, such statements are not guarantees of future performance and actual results or developments may differ materially from those in forward-looking statements. Factors that could cause actual results to differ materially from those in forward-looking statements include market prices, continued availability of capital and financing, and general economic, market or business conditions. There can be no assurances that such statements will prove accurate and, therefore, readers are advised to rely on their own evaluation of such uncertainties. We do not assume any obligation to update any forward-looking statements except as required under the applicable laws. View original content to download multimedia: https://www.prnewswire.com/news-releases/c2c-metals-corp-announces-acquisition-of-its-second-united-states-uranium-project-302105293.html SOURCE  C2C Metals Corp.",
    "primary_commodity": "U"
  },
  "articleProject": {
    "gid": 6608,
    "project_name": "Blue Jay Mine",
    "location": "Utah, United States"
  },
  "articleExchange": "CSE",
  "articleCompanyId": 321,
  "articleTicker": "UE",
  "articleCompanyName": "Urano Energy Corp,",
  "allOtherCompanyProjects": [
    {
      "company_id": 321,
      "gid": 3405,
      "project_name": "Mega Vein",
      "location": "Newfoundland & Labrador, Canada"
    },
    {
      "company_id": 321,
      "gid": 1381,
      "project_name": "Badger",
      "location": "Newfoundland and Labrador, Canada"
    },
    {
      "company_id": 321,
      "gid": 743,
      "project_name": "Quartz",
      "location": "Yukon, Canada"
    },
    {
      "company_id": 321,
      "gid": 728,
      "project_name": "Korat",
      "location": "Yukon, Canada"
    },
    {
      "company_id": 321,
      "gid": 5952,
      "project_name": "Sonora Gulch",
      "location": "Yukon, Canada"
    },
    {
      "company_id": 321,
      "gid": 3403,
      "project_name": "Dunnage",
      "location": ""
    },
    {
      "company_id": 321,
      "gid": 6608,
      "project_name": "Blue Jay Mine",
      "location": "Utah, United States"
    },
    {
      "company_id": 321,
      "gid": 735,
      "project_name": "Portland",
      "location": "Yukon, Canada"
    },
    {
      "company_id": 321,
      "gid": 727,
      "project_name": "Bishop",
      "location": "Yukon, Canada"
    },
    {
      "company_id": 321,
      "gid": 729,
      "project_name": "Wounded Moose",
      "location": "Yukon, Canada"
    },
    {
      "company_id": 321,
      "gid": 1383,
      "project_name": "Millertown",
      "location": "Newfoundland and Labrador, Canada"
    },
    {
      "company_id": 321,
      "gid": 3404,
      "project_name": "New World Island",
      "location": "Canada"
    },
    {
      "company_id": 321,
      "gid": 738,
      "project_name": "Sulphur",
      "location": "Yukon, Canada"
    },
    {
      "company_id": 321,
      "gid": 1382,
      "project_name": "Barrens Lake",
      "location": "Newfoundland and Labrador, Canada"
    },
    {
      "company_id": 321,
      "gid": 10756,
      "project_name": "North Lisbon Valley",
      "location": "Utah, United States"
    },
    {
      "company_id": 321,
      "gid": 9105,
      "project_name": "Eula Belle",
      "location": "Colorado, United States"
    },
    {
      "company_id": 321,
      "gid": 9106,
      "project_name": "Mum-Whitney Extension",
      "location": "Colorado, United States"
    },
    {
      "company_id": 321,
      "gid": 9107,
      "project_name": "Norther ",
      "location": "Colorado, United States"
    },
    {
      "company_id": 321,
      "gid": 9108,
      "project_name": "Spud Patch",
      "location": "Colorado, United States"
    },
    {
      "company_id": 321,
      "gid": 9109,
      "project_name": "Dulaney Extension",
      "location": "Colorado, United States"
    },
    {
      "company_id": 321,
      "gid": 5270,
      "project_name": "Codroy",
      "location": "Newfoundland and Labrador, Canada"
    },
    {
      "company_id": 321,
      "gid": 6247,
      "project_name": "Melinda",
      "location": "Utah, United States"
    },
    {
      "company_id": 321,
      "gid": 6820,
      "project_name": "Sun",
      "location": "Utah, United States"
    },
    {
      "company_id": 321,
      "gid": 9210,
      "project_name": "Utah and Colorado Projects",
      "location": "Colorado, United States"
    },
    {
      "company_id": 321,
      "gid": 734,
      "project_name": "Lucky Joe",
      "location": "Yukon, Canada"
    }
  ],
  "allOtherCompanyNews": [
    {
      "id": 107949,
      "company_id": 321,
      "title": "Urano Energy Announces Completion of Upsized Private Placement",
      "link": "https://contentapi.cision.com/api/v1.0/releases/20250612C4034",
      "date": "2025-06-12T20:05:00.000Z",
      "hidden": false
    },
    {
      "id": 106569,
      "company_id": 321,
      "title": "Urano Energy Announces Increase in Private Placement",
      "link": "https://contentapi.cision.com/api/v1.0/releases/20250602C7427",
      "date": "2025-06-02T11:00:00.000Z",
      "hidden": false
    },
    {
      "id": 105747,
      "company_id": 321,
      "title": "Urano Energy Announces Non-Brokered Private Placement",
      "link": "https://contentapi.cision.com/api/v1.0/releases/20250526C2868",
      "date": "2025-05-26T11:00:00.000Z",
      "hidden": false
    },
    {
      "id": 90198,
      "company_id": 321,
      "title": "Urano Energy Completes Initial Review of Historical Uranium Reserves and Resources",
      "link": "https://contentapi.cision.com/api/v1.0/releases/20250306C8399",
      "date": "2025-03-06T12:00:00.000Z",
      "hidden": false
    },
    {
      "id": 82203,
      "company_id": 321,
      "title": "Urano Energy Appoints Kyle Kimmerle to the Board of Directors",
      "link": "https://contentapi.cision.com/api/v1.0/releases/20241217C2220",
      "date": "2024-12-17T12:00:00.000Z",
      "hidden": false
    },
    {
      "id": 81056,
      "company_id": 321,
      "title": "Urano Energy Completes Acquisition of Uranium Properties in Utah and Colorado",
      "link": "https://contentapi.cision.com/api/v1.0/releases/20241205C5284",
      "date": "2024-12-05T12:00:00.000Z",
      "hidden": false
    },
    {
      "id": -156786,
      "company_id": 321,
      "title": "Urano Energy to Acquire Advanced Uranium Properties in Utah and Colorado",
      "link": "https://contentapi.cision.com/api/v1.0/releases/20241127C6455",
      "date": "2024-11-27T12:00:00.000Z",
      "hidden": false
    },
    {
      "id": 77628,
      "company_id": 321,
      "title": "Urano Energy Announces Completion of Name Change and Appointment of Dr. Douglas Underhill to the Board of Directors",
      "link": "https://contentapi.cision.com/api/v1.0/releases/20241104VA47052",
      "date": "2024-11-04T12:00:00.000Z",
      "hidden": false
    },
    {
      "id": -151066,
      "company_id": 321,
      "title": "C2C Metals Announces Change of Name to Urano Energy Corp.",
      "link": "https://contentapi.cision.com/api/v1.0/releases/20241030VA43801",
      "date": "2024-10-30T11:00:00.000Z",
      "hidden": false
    },
    {
      "id": -148954,
      "company_id": 321,
      "title": "C2C Metals Corp. Acquires Uranium Mineral Claims in the Uravan Mining District",
      "link": "https://contentapi.cision.com/api/v1.0/releases/20241023C1065",
      "date": "2024-10-23T11:00:00.000Z",
      "hidden": false
    }
  ]
}
