{
  "article": {
    "id": 72140,
    "link": "https://contentapi.cision.com/api/v1.0/releases/20240923C0886",
    "title": "Uranium Energy Corp Expands U.S. Production Capacity with Acquisition of Rio Tinto's Sweetwater Plant and Wyoming Uranium Assets",
    "description": "\n\n<p class=\"prntar\">NYSE American: <b>UEC</b></p>\n<p><span class=\"legendSpanClass\"><span class=\"xn-location\">CASPER, Wyo</span></span>, <span class=\"legendSpanClass\"><span class=\"xn-chron\">Sept. 23, 2024</span></span> /CNW/ - Uranium Energy Corp. (NYSE American: UEC) the \"<b>Company</b>\" or \"<b>UEC</b>\") is pleased to announce that it has entered into an agreement with Rio Tinto America Inc. (\"<b>Rio Tinto</b>\") to acquire 100% of Rio Tinto's <span class=\"xn-location\">Wyoming</span> assets, comprised of the wholly-owned and fully-licensed Sweetwater Plant  and a portfolio of uranium mining projects with approximately 175 million pounds of historic resources<sup>(1) </sup>(the \"<b>Transaction</b>\"). The purchase price payable at closing is <span class=\"xn-money\">$175 million</span>, subject to customary working capital adjustments, and will be funded with UEC's available liquidity.</p>\n<p><b>Transaction Rationale and Highlights:</b></p>\n<ul type=\"disc\"><li><b>Creates UEC's Third U.S. Hub-and-Spoke Production Platform –</b> UEC currently controls 12 uranium projects in the Great Divide Basin of <span class=\"xn-location\">Wyoming</span>. The addition of Rio Tinto's Sweetwater Plant and portfolio of permitted and exploration stage projects is highly strategic and enables UEC to unlock the development potential of the Company's extensive portfolio in the Great Divide Basin, creating a third U.S. hub-and-spoke production platform within UEC's pure-play uranium business.</li><li><b>Highly Invested Asset Base with Operating Synergies – </b>Significant asset base with high replacement value and substantial time and cost-savings compared to building and licensing a new processing facility and assembling similar levels of geological data, with minimal capital required to prepare the Sweetwater Plant for in-situ recovery (\"ISR\") processing. In addition, the Transaction provides UEC critical scale in the Great Divide Basin, with opportunities to realize synergies from shared infrastructure and project personnel expertise.</li><li><b>Sizeable and Accretive Resource Growth –</b> Addition of approximately 175 million pounds of historic uranium resources<sup>(1)</sup>, at an in-situ valuation multiple well below UEC's current trading levels. Approximately half of these resources appear amenable to ISR mining methods and half to conventional mining. ISR amenable resources will be prioritized for development and near-term production, with conventional resources providing substantial optionality for further production growth. </li><li><b>Significant Scarcity Value and Production Optionality – </b>The Transaction represents an increasingly rare opportunity to acquire licensed facilities and permitted uranium mining resource properties from a global mining leader. These assets significantly enhance and expedite UEC's production capabilities in the Great Divide Basin. The Sweetwater Plant, a 3,000 ton per day processing mill, with a licensed capacity of 4.1 million pounds per year, can also be adapted for recovery of uranium from loaded resins produced by ISR operations. This provides UEC with production flexibility for both ISR and conventional mining.</li><li><b>Extensive Land Package, Geological Data and Exploration Opportunities – </b>Adds more than 53,000 highly prospective acres of land for future exploration along with an extensive geological database gathered from over 6.1 million feet of drilling (approximately 13,000 drill holes with 26,000 assay records, and downhole geophysical logs with equivalent uranium grades) facilitating historical resource conversion and more effective exploration.  Combined with UEC's existing 54,615 acres of mining rights in the Great Divide Basin, this will establish a portfolio of approximately 108,000 acres of mining and exploration prospects.</li><li><b>Attractive Industry Tailwinds, Driven by Geopolitical Catalysts and Growing Clean Energy Demand – </b>As illustrated by the recently announced planned restart of Three Mile Island Unit 1 and Microsoft's long-term power purchase agreement with the facility, U.S. nuclear energy will be a critical supplier of the carbon-free energy needed to fuel the artificial intelligence boom. The growing demand for domestically sourced uranium is further bolstered by recent geopolitical events, including the U.S. import ban on Russian uranium, the U.S. Department of Energy's recently issued Request for Proposal to purchase domestically sourced supply and Russian threats to limit or ban exports to the western world.</li></ul><p><span class=\"xn-person\">Amir Adnani</span>, President and CEO, stated:</p>\n<p>\"<i>Expanding our production capabilities with the acquisition of highly sought after and fully licensed uranium assets in the U.S. is an important and timely milestone, especially in <span class=\"xn-location\">Wyoming</span>, where we have recently restarted ISR production. </i></p>\n<p><i>With this Transaction, we are building upon our transformative acquisition of Uranium One Americas in 2021, which added a large portfolio of holdings in the Great Divide Basin of Wyoming.  </i><i>We recognized early on that there are meaningful development synergies with the Rio Tinto assets, particularly the Sweetwater Plant. These assets will unlock tremendous value by establishing our third hub-and-spoke production platform and cement UEC as the leading uranium developer in <span class=\"xn-location\">Wyoming</span> and the U.S.</i></p>\n<p><i>We're witnessing unprecedented global growth in nuclear energy and demand for uranium as demonstrated by the recently proposed Three Mile Island restart in support of Microsoft's AI growth. The Russian uranium ban and recent comments by Russian government officials regarding restricting future uranium exports to the west underscore the critical importance of maintaining reliable domestic supply chains to power our growing requirements for clean baseload energy.  With our fourth acquisition since 2021, UEC is continuing to execute towards building the premier and fastest growing North American uranium company.\"</i></p>\n<p><span class=\"xn-person\">Donna Wichers</span>, Vice President of Wyoming Operations, stated:</p>\n<p><i>\"In my 46 years of operating experience in <span class=\"xn-location\">Wyoming</span>, this is the first time that such a large portfolio of assets has been consolidated with one company, offering a pathway to near-term production, development and untapped exploration potential. </i></p>\n<p><i>After closing, our next steps to advance these assets are expected to include:</i></p>\n<p><i>1)     </i><i>completing an S-K 1300 resource report to upgrade and confirm historic estimates; <br></br></i><i>2)     </i><i>building a dedicated team to advance our third hub-and-spoke production platform; and <br></br></i><i>3)     </i><i>refurbishing parts of the Sweetwater Plant and completing equipment modifications for ISR processing.\"</i></p>\n<div class=\"PRN_ImbeddedAssetReference\" id=\"DivAssetPlaceHolder2073\"><p><a href=\"https://mma.prnewswire.com/media/2512069/Uranium_Energy_Corp_Uranium_Energy_Corp_Expands%C2%A0U_S__Production.html\" rel=\"nofollow\" target=\"_blank\"><img alt=\"This map illustrates the position of Rio Tinto’s assets relative to the existing UEC portfolio in the Great Divide Basin. (CNW Group/Uranium Energy Corp)\" src=\"https://mma.prnewswire.com/media/2512069/Uranium_Energy_Corp_Uranium_Energy_Corp_Expands%C2%A0U_S__Production.jpg?p=original\" title=\"This map illustrates the position of Rio Tinto’s assets relative to the existing UEC portfolio in the Great Divide Basin. (CNW Group/Uranium Energy Corp)\"></img></a></p>\n</div><p><b>About the Red Desert Uranium Project</b></p>\n<p>The Red Desert Project is a development-stage uranium project, encompassing approximately 20,005 acres of exploration and mining rights in the Great Divide Basin, including 17,750 acres of unpatented mining claims, 1,975 acres of patented lands and 1,280 acres of state uranium leases. Between three deposits, historic uranium resources are estimated at approximately 42 million pounds of U<sub>3</sub>O<sub>8 </sub>.<sup>(1) </sup> There is potential for further discoveries, particularly in the shallow mineralization adjacent to the Sweetwater Plant. The deposits are favorable for ISR mining, with uranium hosted below the water table at depths suitable for oxygen dissolution, and in fluvial sands confined by low permeability silts or clays.</p>\n<p><b>About the Green Mountain Uranium Project</b></p>\n<p>The Green Mountain Project is a development-stage uranium project located 22 miles north of the Sweetwater Plant. The project spans approximately 32,040 acres of exploration and mining rights, including 29,400 acres of unpatented mining claims, 640 acres of patented lands and 2,000 acres of state uranium leases. Between five deposits, historic uranium resources are estimated at approximately133 million pounds of U<sub>3</sub>O<sub>8 </sub>.<sup>(1) </sup> Desert View and Whiskey Peak have large areas that have been identified as having good potential for ISR mining, whereas the other deposits are considered appropriate for conventional mining.</p>\n<p><b>About the Sweetwater Plant</b></p>\n<p>The Sweetwater Plant is a 3,000 ton per day conventional processing mill with a licensed capacity of 4.1 million pounds of U<sub>3</sub>O<sub>8</sub>. It is located approximately 40 miles northwest of <span class=\"xn-location\">Rawlins</span> and 75 miles northeast of <span class=\"xn-location\">Rock Springs, Wyoming</span>. Access to the mill is via 30 miles of paved road from US Highway 287 to the east of the site. The fully licensed mill operated from 1981 to 1983 and has been kept under care and maintenance since then. It is the only conventional processing mill in <span class=\"xn-location\">Wyoming</span>.</p>\n<p>The plant has considerable infrastructure in place, including well-maintained buildings and equipment, a wash bay, warehouse, workshop, offices, access road and utilities. There is potential for the plant to be adapted for the recovery of uranium from loaded resins produced by ISR operations, subject to obtaining any necessary modifications to permits and licenses.</p>\n<p><b>The Transaction </b></p>\n<p>The Transaction is being completed pursuant to a stock purchase agreement between a subsidiary of the Company and Rio Tinto. Under the agreement, UEC will acquire 100% of the outstanding shares of two subsidiaries of Rio Tinto that hold its <span class=\"xn-location\">Wyoming</span> uranium assets. On completion of the Transaction, the Company will arrange to replace approximately <span class=\"xn-money\">$25 million</span> in surety bonds securing future reclamation costs relating to the acquired assets. Completion of the Transaction is subject to customary conditions for a transaction of this nature, with closing expected to occur in the fourth quarter of the calendar year 2024. </p>\n<div><table border=\"0\" cellpadding=\"1\" cellspacing=\"0\" class=\"prnbcc\"><tr><td class=\"prngen2\" colspan=\"1\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\"><u>Note</u>:</span></p>\n</td><td class=\"prngen3\" colspan=\"1\" rowspan=\"1\"><br></br></td></tr><tr><td class=\"prngen3\" colspan=\"1\" rowspan=\"1\"><br></br></td><td class=\"prngen2\" colspan=\"1\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\"> </span></p>\n<ol type=\"1\"><li class=\"prnews_li\">Based upon internal studies and other historic data prepared by prior owners in regards to the projects and dated between 1984 and 2019. Such estimates are being treated by the Company as historical in nature and a qualified person has not done sufficient work to classify the historical estimates as current mineral resources. The Company is not treating them as current resource estimates and is disclosing these historic estimates for illustrative purposes and to provide readers with relevant information regarding the projects. In addition, such estimates were not prepared under S-K 1300 standards and the results of future estimates by the Company may vary from these historic estimates.</li></ol><p class=\"prnml4\"><span class=\"prnews_span\"> </span></p>\n</td></tr></table></div><p><b>Advisors and Counsel</b></p>\n<p>Goldman Sachs &amp; Co. LLC and Rothschild &amp; Co are acting as financial advisors to UEC in connection with the Transaction. <span class=\"xn-location\">Holland</span> &amp; Hart LLP and McMillan LLP are acting as its legal advisors.</p>\n<p><b>About Uranium Energy Corp</b></p>\n<p>Uranium Energy Corp is the fastest growing supplier of fuel for the green energy transition to a low carbon future. UEC is the largest, diversified North American focused uranium company, advancing the next generation of low-cost, environmentally friendly ISR mining uranium projects in <span class=\"xn-location\">the United States</span> and high-grade conventional projects in <span class=\"xn-location\">Canada</span>. The Company has two production-ready ISR hub and spoke platforms in <span class=\"xn-location\">South Texas</span> and <span class=\"xn-location\">Wyoming</span>. These two production platforms are anchored by fully operational Central Processing Plants (\"CPPs\") and served by seven U.S. ISR uranium projects with all their major permits in place. In <span class=\"xn-chron\">August 2024</span>, production began at the Christensen Ranch project in <span class=\"xn-location\">Wyoming</span>, sending uranium loaded resin to the CPP at Irigaray (<span class=\"xn-location\">Wyoming</span> hub).  Additionally, the Company has diversified uranium holdings including: (1) one of the largest physical uranium portfolios of U.S. warehoused U<sub>3</sub>O<sub>8</sub>; (2) a major equity stake in Uranium Royalty Corp., the only royalty company in the sector; and (3) a Western Hemisphere pipeline of resource stage uranium projects. The Company's operations are managed by professionals with decades of hands-on experience in the key facets of uranium exploration, development and mining.</p>\n<p><b>Stock Exchange Information:</b> <br></br>NYSE American: <b>UEC</b> <br></br>WKN: <b>AØJDRR</b> <br></br>ISN: <b>US916896103</b></p>\n<p><b>Safe Harbor Statement</b></p>\n<p>Except for the statements of historical fact contained herein, the information presented in this news release constitutes \"forward-looking statements\" as such term is used in applicable <span class=\"xn-location\">United States</span> and Canadian securities laws. These statements relate to analyses and other information that are based on forecasts of future results, estimates of amounts not yet determinable and assumptions of management. Any other statements that express or involve discussions with respect to predictions, expectations, beliefs, plans, projections, objectives, assumptions or future events or performance (often, but not always, using words or phrases such as \"expects\" or \"does not expect\", \"is expected\", \"anticipates\" or \"does not anticipate\", \"plans, \"estimates\" or \"intends\", or stating that certain actions, events or results \"may\", \"could\", \"would\", \"might\" or \"will\" be taken, occur or be achieved) are not statements of historical fact and should be viewed as \"forward-looking statements\". Such forward looking statements involve known and unknown risks, uncertainties and other factors which may cause the actual results, performance or achievements of the Company to be materially different from any future results, performance or achievements expressed or implied by such forward-looking statements. Such risks and other factors include, among others, the actual results of exploration activities, variations in the underlying assumptions associated with the estimation or realization of mineral resources, future mineral resource estimates may vary from historic estimates, the availability of capital to fund programs and the resulting dilution caused by the raising of capital through the sale of shares, accidents, labor disputes and other risks of the mining industry including, without limitation, those associated with the environment, delays in obtaining governmental approvals, permits or financing or in the completion of development or construction activities, title disputes or claims limitations on insurance coverage. Although the Company has attempted to identify important factors that could cause actual actions, events or results to differ materially from those described in forward-looking statements, there may be other factors that cause actions, events or results not to be as anticipated, estimated or intended. Many of these factors are beyond the Company's ability to control or predict. There can be no assurance that such statements will prove to be accurate as actual results and future events could differ materially from those anticipated in such statements. Accordingly, readers should not place undue reliance on forward-looking statements contained in this news release and in any document referred to in this news release. Important factors that may cause actual results to differ materially and that could impact the Company and the statements contained in this news release can be found in the Company's filings with the Securities and Exchange Commission. For forward-looking statements in this news release, the Company claims the protection of the safe harbor for forward-looking statements contained in the Private Securities Litigation Reform Act of 1995. The Company assumes no obligation to update or supplement any forward-looking statements whether as a result of new information, future events or otherwise. This news release shall not constitute an offer to sell or the solicitation of an offer to buy securities.</p>\n\n<div class=\"PRN_ImbeddedAssetReference\" id=\"DivAssetPlaceHolder0\">\n</div>\n\n\n\n\n\n<p id=\"PURL\"><img alt=\"Cision\" height=\"12\" src=\"https://c212.net/c/img/favicon.png?sn=VA12530&amp;sd=2024-09-23\" title=\"Cision\" width=\"12\"></img> View original content to download multimedia:<a href=\"https://www.prnewswire.com/news-releases/uranium-energy-corp-expands-us-production-capacity-with-acquisition-of-rio-tintos-sweetwater-plant-and-wyoming-uranium-assets-302255092.html\" id=\"PRNURL\" rel=\"nofollow\" target=\"_blank\">https://www.prnewswire.com/news-releases/uranium-energy-corp-expands-us-production-capacity-with-acquisition-of-rio-tintos-sweetwater-plant-and-wyoming-uranium-assets-302255092.html</a></p>\n<p>SOURCE  Uranium Energy Corp</p>\n<img alt=\"\" src=\"https://rt.newswire.ca/rt.gif?NewsItemId=C0886&amp;Transmission_Id=202409230600CANADANWCANADAPR_C0886&amp;DateId=20240923\" style=\"border:0px; width:1px; height:1px;\"></img>\n\n",
    "search_terms": "Sweetwater Plant,Uranium Energy Corp,UEC",
    "master_gid": 8625,
    "date": "2024-09-23T10:00:00.000Z",
    "tags": "USA|Wyoming||Uranium|Project Acquisition",
    "image_id": null,
    "hidden": false,
    "company_id": 1991,
    "provider": "cision",
    "excerpt": "NYSE American:UECCASPER, Wyo,Sept. 23, 2024/CNW/ - Uranium Energy Corp. (NYSE American: UEC) the \"Company\" or \"UEC\") is pleased to announce that it has entered into an agreement with Rio Tinto America Inc. (\"Rio Tinto\") to acquire 100% of Rio Tinto'sWyomingassets, comprised of the wholly-owned and fully-licensed Sweetwater Plant  and a portfolio",
    "is_regulatory": false,
    "refined_tags": [],
    "ftp_filename": null,
    "company_name": "Uranium Energy Corp",
    "exchange": "NYSE",
    "root_ticker": "UEC",
    "project_name": "Sweetwater Plant",
    "gid": 8625,
    "location": null,
    "plan_id": null,
    "description_text": "NYSE American: UEC CASPER, Wyo , Sept. 23, 2024 /CNW/ - Uranium Energy Corp. (NYSE American: UEC) the \" Company \" or \" UEC \") is pleased to announce that it has entered into an agreement with Rio Tinto America Inc. (\" Rio Tinto \") to acquire 100% of Rio Tinto's Wyoming assets, comprised of the wholly-owned and fully-licensed Sweetwater Plant  and a portfolio of uranium mining projects with approximately 175 million pounds of historic resources (1) (the \" Transaction \"). The purchase price payable at closing is $175 million , subject to customary working capital adjustments, and will be funded with UEC's available liquidity. Transaction Rationale and Highlights: Creates UEC's Third U.S. Hub-and-Spoke Production Platform – UEC currently controls 12 uranium projects in the Great Divide Basin of Wyoming . The addition of Rio Tinto's Sweetwater Plant and portfolio of permitted and exploration stage projects is highly strategic and enables UEC to unlock the development potential of the Company's extensive portfolio in the Great Divide Basin, creating a third U.S. hub-and-spoke production platform within UEC's pure-play uranium business. Highly Invested Asset Base with Operating Synergies – Significant asset base with high replacement value and substantial time and cost-savings compared to building and licensing a new processing facility and assembling similar levels of geological data, with minimal capital required to prepare the Sweetwater Plant for in-situ recovery (\"ISR\") processing. In addition, the Transaction provides UEC critical scale in the Great Divide Basin, with opportunities to realize synergies from shared infrastructure and project personnel expertise. Sizeable and Accretive Resource Growth – Addition of approximately 175 million pounds of historic uranium resources (1) , at an in-situ valuation multiple well below UEC's current trading levels. Approximately half of these resources appear amenable to ISR mining methods and half to conventional mining. ISR amenable resources will be prioritized for development and near-term production, with conventional resources providing substantial optionality for further production growth. Significant Scarcity Value and Production Optionality – The Transaction represents an increasingly rare opportunity to acquire licensed facilities and permitted uranium mining resource properties from a global mining leader. These assets significantly enhance and expedite UEC's production capabilities in the Great Divide Basin. The Sweetwater Plant, a 3,000 ton per day processing mill, with a licensed capacity of 4.1 million pounds per year, can also be adapted for recovery of uranium from loaded resins produced by ISR operations. This provides UEC with production flexibility for both ISR and conventional mining. Extensive Land Package, Geological Data and Exploration Opportunities – Adds more than 53,000 highly prospective acres of land for future exploration along with an extensive geological database gathered from over 6.1 million feet of drilling (approximately 13,000 drill holes with 26,000 assay records, and downhole geophysical logs with equivalent uranium grades) facilitating historical resource conversion and more effective exploration.  Combined with UEC's existing 54,615 acres of mining rights in the Great Divide Basin, this will establish a portfolio of approximately 108,000 acres of mining and exploration prospects. Attractive Industry Tailwinds, Driven by Geopolitical Catalysts and Growing Clean Energy Demand – As illustrated by the recently announced planned restart of Three Mile Island Unit 1 and Microsoft's long-term power purchase agreement with the facility, U.S. nuclear energy will be a critical supplier of the carbon-free energy needed to fuel the artificial intelligence boom. The growing demand for domestically sourced uranium is further bolstered by recent geopolitical events, including the U.S. import ban on Russian uranium, the U.S. Department of Energy's recently issued Request for Proposal to purchase domestically sourced supply and Russian threats to limit or ban exports to the western world. Amir Adnani , President and CEO, stated: \" Expanding our production capabilities with the acquisition of highly sought after and fully licensed uranium assets in the U.S. is an important and timely milestone, especially in Wyoming , where we have recently restarted ISR production. With this Transaction, we are building upon our transformative acquisition of Uranium One Americas in 2021, which added a large portfolio of holdings in the Great Divide Basin of Wyoming. We recognized early on that there are meaningful development synergies with the Rio Tinto assets, particularly the Sweetwater Plant. These assets will unlock tremendous value by establishing our third hub-and-spoke production platform and cement UEC as the leading uranium developer in Wyoming and the U.S. We're witnessing unprecedented global growth in nuclear energy and demand for uranium as demonstrated by the recently proposed Three Mile Island restart in support of Microsoft's AI growth. The Russian uranium ban and recent comments by Russian government officials regarding restricting future uranium exports to the west underscore the critical importance of maintaining reliable domestic supply chains to power our growing requirements for clean baseload energy.  With our fourth acquisition since 2021, UEC is continuing to execute towards building the premier and fastest growing North American uranium company.\" Donna Wichers , Vice President of Wyoming Operations, stated: \"In my 46 years of operating experience in Wyoming , this is the first time that such a large portfolio of assets has been consolidated with one company, offering a pathway to near-term production, development and untapped exploration potential. After closing, our next steps to advance these assets are expected to include: 1) completing an S-K 1300 resource report to upgrade and confirm historic estimates; 2) building a dedicated team to advance our third hub-and-spoke production platform; and 3) refurbishing parts of the Sweetwater Plant and completing equipment modifications for ISR processing.\" About the Red Desert Uranium Project The Red Desert Project is a development-stage uranium project, encompassing approximately 20,005 acres of exploration and mining rights in the Great Divide Basin, including 17,750 acres of unpatented mining claims, 1,975 acres of patented lands and 1,280 acres of state uranium leases. Between three deposits, historic uranium resources are estimated at approximately 42 million pounds of U 3 O 8 . (1) There is potential for further discoveries, particularly in the shallow mineralization adjacent to the Sweetwater Plant. The deposits are favorable for ISR mining, with uranium hosted below the water table at depths suitable for oxygen dissolution, and in fluvial sands confined by low permeability silts or clays. About the Green Mountain Uranium Project The Green Mountain Project is a development-stage uranium project located 22 miles north of the Sweetwater Plant. The project spans approximately 32,040 acres of exploration and mining rights, including 29,400 acres of unpatented mining claims, 640 acres of patented lands and 2,000 acres of state uranium leases. Between five deposits, historic uranium resources are estimated at approximately133 million pounds of U 3 O 8 . (1) Desert View and Whiskey Peak have large areas that have been identified as having good potential for ISR mining, whereas the other deposits are considered appropriate for conventional mining. About the Sweetwater Plant The Sweetwater Plant is a 3,000 ton per day conventional processing mill with a licensed capacity of 4.1 million pounds of U 3 O 8 . It is located approximately 40 miles northwest of Rawlins and 75 miles northeast of Rock Springs, Wyoming . Access to the mill is via 30 miles of paved road from US Highway 287 to the east of the site. The fully licensed mill operated from 1981 to 1983 and has been kept under care and maintenance since then. It is the only conventional processing mill in Wyoming . The plant has considerable infrastructure in place, including well-maintained buildings and equipment, a wash bay, warehouse, workshop, offices, access road and utilities. There is potential for the plant to be adapted for the recovery of uranium from loaded resins produced by ISR operations, subject to obtaining any necessary modifications to permits and licenses. The Transaction The Transaction is being completed pursuant to a stock purchase agreement between a subsidiary of the Company and Rio Tinto. Under the agreement, UEC will acquire 100% of the outstanding shares of two subsidiaries of Rio Tinto that hold its Wyoming uranium assets. On completion of the Transaction, the Company will arrange to replace approximately $25 million in surety bonds securing future reclamation costs relating to the acquired assets. Completion of the Transaction is subject to customary conditions for a transaction of this nature, with closing expected to occur in the fourth quarter of the calendar year 2024. Note : Based upon internal studies and other historic data prepared by prior owners in regards to the projects and dated between 1984 and 2019. Such estimates are being treated by the Company as historical in nature and a qualified person has not done sufficient work to classify the historical estimates as current mineral resources. The Company is not treating them as current resource estimates and is disclosing these historic estimates for illustrative purposes and to provide readers with relevant information regarding the projects. In addition, such estimates were not prepared under S-K 1300 standards and the results of future estimates by the Company may vary from these historic estimates. Advisors and Counsel Goldman Sachs & Co. LLC and Rothschild & Co are acting as financial advisors to UEC in connection with the Transaction. Holland & Hart LLP and McMillan LLP are acting as its legal advisors. About Uranium Energy Corp Uranium Energy Corp is the fastest growing supplier of fuel for the green energy transition to a low carbon future. UEC is the largest, diversified North American focused uranium company, advancing the next generation of low-cost, environmentally friendly ISR mining uranium projects in the United States and high-grade conventional projects in Canada . The Company has two production-ready ISR hub and spoke platforms in South Texas and Wyoming . These two production platforms are anchored by fully operational Central Processing Plants (\"CPPs\") and served by seven U.S. ISR uranium projects with all their major permits in place. In August 2024 , production began at the Christensen Ranch project in Wyoming , sending uranium loaded resin to the CPP at Irigaray ( Wyoming hub).  Additionally, the Company has diversified uranium holdings including: (1) one of the largest physical uranium portfolios of U.S. warehoused U 3 O 8 ; (2) a major equity stake in Uranium Royalty Corp., the only royalty company in the sector; and (3) a Western Hemisphere pipeline of resource stage uranium projects. The Company's operations are managed by professionals with decades of hands-on experience in the key facets of uranium exploration, development and mining. Stock Exchange Information: NYSE American: UEC WKN: AØJDRR ISN: US916896103 Safe Harbor Statement Except for the statements of historical fact contained herein, the information presented in this news release constitutes \"forward-looking statements\" as such term is used in applicable United States and Canadian securities laws. These statements relate to analyses and other information that are based on forecasts of future results, estimates of amounts not yet determinable and assumptions of management. Any other statements that express or involve discussions with respect to predictions, expectations, beliefs, plans, projections, objectives, assumptions or future events or performance (often, but not always, using words or phrases such as \"expects\" or \"does not expect\", \"is expected\", \"anticipates\" or \"does not anticipate\", \"plans, \"estimates\" or \"intends\", or stating that certain actions, events or results \"may\", \"could\", \"would\", \"might\" or \"will\" be taken, occur or be achieved) are not statements of historical fact and should be viewed as \"forward-looking statements\". Such forward looking statements involve known and unknown risks, uncertainties and other factors which may cause the actual results, performance or achievements of the Company to be materially different from any future results, performance or achievements expressed or implied by such forward-looking statements. Such risks and other factors include, among others, the actual results of exploration activities, variations in the underlying assumptions associated with the estimation or realization of mineral resources, future mineral resource estimates may vary from historic estimates, the availability of capital to fund programs and the resulting dilution caused by the raising of capital through the sale of shares, accidents, labor disputes and other risks of the mining industry including, without limitation, those associated with the environment, delays in obtaining governmental approvals, permits or financing or in the completion of development or construction activities, title disputes or claims limitations on insurance coverage. Although the Company has attempted to identify important factors that could cause actual actions, events or results to differ materially from those described in forward-looking statements, there may be other factors that cause actions, events or results not to be as anticipated, estimated or intended. Many of these factors are beyond the Company's ability to control or predict. There can be no assurance that such statements will prove to be accurate as actual results and future events could differ materially from those anticipated in such statements. Accordingly, readers should not place undue reliance on forward-looking statements contained in this news release and in any document referred to in this news release. Important factors that may cause actual results to differ materially and that could impact the Company and the statements contained in this news release can be found in the Company's filings with the Securities and Exchange Commission. For forward-looking statements in this news release, the Company claims the protection of the safe harbor for forward-looking statements contained in the Private Securities Litigation Reform Act of 1995. The Company assumes no obligation to update or supplement any forward-looking statements whether as a result of new information, future events or otherwise. This news release shall not constitute an offer to sell or the solicitation of an offer to buy securities. View original content to download multimedia: https://www.prnewswire.com/news-releases/uranium-energy-corp-expands-us-production-capacity-with-acquisition-of-rio-tintos-sweetwater-plant-and-wyoming-uranium-assets-302255092.html SOURCE  Uranium Energy Corp",
    "primary_commodity": "U"
  },
  "articleProject": {
    "gid": 8625,
    "project_name": "Sweetwater Plant",
    "location": null
  },
  "articleExchange": "NYSE",
  "articleCompanyId": 1991,
  "articleTicker": "UEC",
  "articleCompanyName": "Uranium Energy Corp",
  "allOtherCompanyProjects": [
    {
      "company_id": 1991,
      "gid": 9859,
      "project_name": "Irigaray CPP (Hub)",
      "location": "Wyoming, United States"
    },
    {
      "company_id": 1991,
      "gid": 3418,
      "project_name": "Reno Creek",
      "location": "Wyoming, United States"
    },
    {
      "company_id": 1991,
      "gid": 5140,
      "project_name": "Palangana",
      "location": "Texas, United States"
    },
    {
      "company_id": 1991,
      "gid": 4253,
      "project_name": "Workman Creek",
      "location": "Arizona, United States"
    },
    {
      "company_id": 1991,
      "gid": 5737,
      "project_name": "Alto Parana",
      "location": "Alto Parana, Paraguay"
    },
    {
      "company_id": 1991,
      "gid": 5139,
      "project_name": "Burke Hollow",
      "location": "Texas, United States"
    },
    {
      "company_id": 1991,
      "gid": 10592,
      "project_name": "Anderson",
      "location": "Arizona, United States"
    },
    {
      "company_id": 1991,
      "gid": 10755,
      "project_name": "Central Lisbon Valley",
      "location": "Utah, United States"
    },
    {
      "company_id": 1991,
      "gid": 5106,
      "project_name": "Christensen Ranch (Willow Creek)",
      "location": "Wyoming, United States"
    },
    {
      "company_id": 1991,
      "gid": 9541,
      "project_name": "Hobson CPP",
      "location": "Texas, United States"
    },
    {
      "company_id": 1991,
      "gid": 9543,
      "project_name": "Salvo",
      "location": "Texas, United States"
    },
    {
      "company_id": 1991,
      "gid": 9544,
      "project_name": "Oviedo",
      "location": "Caaguazu, Paraguay"
    },
    {
      "company_id": 1991,
      "gid": 6298,
      "project_name": "Roughrider",
      "location": "Saskatchewan, Canada"
    },
    {
      "company_id": 1991,
      "gid": 8625,
      "project_name": "Sweetwater Plant",
      "location": null
    },
    {
      "company_id": 1991,
      "gid": 9213,
      "project_name": "Green Mountain",
      "location": "Wyoming, United States"
    }
  ],
  "allOtherCompanyNews": [
    {
      "id": 106515,
      "company_id": 1991,
      "title": "Uranium Energy Corp Files Quarterly Report For the Third Quarter of Fiscal 2025",
      "link": "https://contentapi.cision.com/api/v1.0/releases/20250602C6902",
      "date": "2025-06-02T10:30:00.000Z",
      "hidden": false
    },
    {
      "id": 105872,
      "company_id": 1991,
      "title": "Uranium Energy Corp Applauds Trump Administration's Transformational Executive Orders to Quadruple U.S. Nuclear Capacity and Rebuild Domestic Uranium Fuel Cycle",
      "link": "https://contentapi.cision.com/api/v1.0/releases/20250527VA96214",
      "date": "2025-05-27T11:00:00.000Z",
      "hidden": false
    },
    {
      "id": 103808,
      "company_id": 1991,
      "title": "Uranium Energy Corp and Radiant Industries Announce U.S. Uranium Supply Agreement to Support Deployment of Microreactors, Building the Full Nuclear Power Value Chain in America",
      "link": "https://contentapi.cision.com/api/v1.0/releases/20250507C5925",
      "date": "2025-05-07T11:00:00.000Z",
      "hidden": false
    },
    {
      "id": 100175,
      "company_id": 1991,
      "title": "Uranium Energy Corp President and Chief Executive Officer, Amir Adnani, Appointed to World Nuclear Association Board of Management",
      "link": "https://contentapi.cision.com/api/v1.0/releases/20250417VA66924",
      "date": "2025-04-17T12:30:00.000Z",
      "hidden": false
    },
    {
      "id": 90762,
      "company_id": 1991,
      "title": "Uranium Energy Corp Files Quarterly Report For the Second Quarter of Fiscal 2025",
      "link": "https://contentapi.cision.com/api/v1.0/releases/20250312C4016",
      "date": "2025-03-12T10:30:00.000Z",
      "hidden": false
    },
    {
      "id": 88343,
      "company_id": 1991,
      "title": "Uranium Energy Corp Achieves Key Production Milestone with Drummed Uranium Concentrates at Irigaray Plant",
      "link": "https://contentapi.cision.com/api/v1.0/releases/20250219VA21635",
      "date": "2025-02-19T11:45:00.000Z",
      "hidden": false
    },
    {
      "id": -164572,
      "company_id": 1991,
      "title": "Uranium Energy Corp Increases Holdings in Anfield Energy",
      "link": "https://contentapi.cision.com/api/v1.0/releases/20250115VA97691",
      "date": "2025-01-15T22:53:00.000Z",
      "hidden": false
    },
    {
      "id": 82485,
      "company_id": 1991,
      "title": "Uranium Energy Corp to Speak at Goldman Sachs Energy, CleanTech &amp; Utilities Conference",
      "link": "https://contentapi.cision.com/api/v1.0/releases/20241219C7276",
      "date": "2024-12-19T13:00:00.000Z",
      "hidden": false
    },
    {
      "id": 81156,
      "company_id": 1991,
      "title": "Uranium Energy Corp Completes Acquisition of Rio Tinto's Sweetwater Plant and Wyoming Uranium Assets",
      "link": "https://contentapi.cision.com/api/v1.0/releases/20241206C1321",
      "date": "2024-12-06T11:30:00.000Z",
      "hidden": false
    },
    {
      "id": 81029,
      "company_id": 1991,
      "title": "Uranium Energy Corp Files Quarterly Report For the First Quarter of Fiscal 2025",
      "link": "https://contentapi.cision.com/api/v1.0/releases/20241205VA72594",
      "date": "2024-12-05T11:30:00.000Z",
      "hidden": false
    }
  ]
}
