{
  "article": {
    "id": 81156,
    "link": "https://contentapi.cision.com/api/v1.0/releases/20241206C1321",
    "title": "Uranium Energy Corp Completes Acquisition of Rio Tinto's Sweetwater Plant and Wyoming Uranium Assets",
    "description": "\n\n<p class=\"prntar\">NYSE American: <b>UEC</b></p>\n<p><span class=\"legendSpanClass\"><span class=\"xn-location\">CASPER, Wyo.</span></span>, <span class=\"legendSpanClass\"><span class=\"xn-chron\">Dec. 6, 2024</span></span> /CNW/ - Uranium Energy Corp. (NYSE American: UEC) (the \"<b>Company</b>\" or \"<b>UEC</b>\") is pleased to announce the completion of the previously announced (<span class=\"xn-chron\">September 23, 2024</span>) agreement with Rio Tinto America Inc. (\"<b>Rio Tinto</b>\") to acquire 100% of Rio Tinto's <span class=\"xn-location\">Wyoming</span> assets, comprised of the wholly-owned and fully-licensed Sweetwater Plant and a portfolio of uranium mining properties, including the Red Desert Project and the Green Mountain Project, with approximately 175 million pounds of historic resources<sup>(1) </sup>(the \"<b>Transaction</b>\"). The purchase price paid was approximately <span class=\"xn-money\">$175.4 million</span> in cash and was funded with UEC's available liquidity.</p>\n\n<p><span class=\"xn-person\">Amir Adnani</span>, President and CEO, stated: \"<i>The Transaction presents a rare opportunity to acquire U.S. licensed facilities and uranium mining properties from a leading global miner. These assets will significantly enhance and accelerate UEC's production capabilities in <span class=\"xn-location\">Wyoming's</span> Great Divide Basin. The Sweetwater Plant, a 3,000-ton-per-day processing mill with a licensed capacity of 4.1 million pounds U<sub>3</sub>O<sub>8</sub> annually, can also be adapted to recover uranium from loaded resins produced by In-Situ-Recovery (\"ISR\") operations, offering UEC the flexibility to support both ISR and conventional mining</i><i>. With the addition of the Sweetwater Plant, UEC has the largest licensed production capacity in the U.S.</i></p>\n<p><i>The recent investments in nuclear power by Big Tech companies, including Microsoft, Amazon, Google and Meta, demonstrates unprecedented interest from several of the world's largest and most sophisticated companies in expanding America's nuclear energy baseload capacity. These companies fully realize nuclear power is a key source of highly reliable, clean and safe energy to power the increased energy demands required by AI computing. As the largest U.S.-based uranium company, UEC will play a critical role in supplying the fuel required for today and the future – a point further underscored by <span class=\"xn-location\">Russia's</span> recently announced uranium export restrictions.\" </i></p>\n<p><b>Transaction Highlights:</b></p>\n<ul type=\"disc\"><li><b>Creates UEC's Third U.S. Hub-and-Spoke Production Platform;<br></br><br></br></b></li><li><b>Acquisition of a Highly Invested Asset Base with Operating Synergies; <br></br><br></br></b></li><li><b>Combined U.S. licensed production capacity of 12.1 million pounds of U<sub>3</sub>O<sub>8</sub> per year;<br></br><br></br></b></li><li><b>Drives Sizeable and Accretive Resource Growth; </b> <br></br><br></br></li><li><b>Unlocks Significant Scarcity Value and Production Optionality; and<br></br><br></br></b></li><li><b>Adds Extensive Land Package, Geological Data and Exploration Opportunities. </b></li></ul><p>The Company's next steps for the acquired asset portfolio include (1) completing a SEC Regulation S-K 1300 (\"<b>S-K 1300</b>\") technical resource summary report to upgrade and confirm historic estimates, (2) building out a dedicated team to focus on advancing the <span class=\"xn-location\">Sweetwater</span> hub-and-spoke production platform, and (3) refurbishing parts of the Sweetwater Plant and completing equipment modifications for In-Situ Recovery processing.</p>\n<p><b>About the Red Desert Uranium Project</b></p>\n<p>The Red Desert Project is a development-stage uranium project, encompassing approximately 20,005 acres of exploration and mining rights in the Great Divide Basin, including 17,750 acres of unpatented mining claims, 1,975 acres of patented lands and 1,280 acres of state uranium leases. Between three deposits, historic uranium resources are estimated at approximately 42 million pounds of U<sub>3</sub>O<sub>8 </sub>.<sup>(1) </sup> There is potential for further discoveries, particularly in the shallow mineralization adjacent to the Sweetwater Plant. The deposits are favorable for ISR mining, with uranium hosted below the water table at depths suitable for oxygen dissolution, and in fluvial sands confined by low permeability silts or clays.</p>\n<p><b>About the Green Mountain Uranium Project</b></p>\n<p>The Green Mountain Project is a development-stage uranium project located 22 miles north of the Sweetwater Plant. The project spans approximately 32,040 acres of exploration and mining rights, including 29,400 acres of unpatented mining claims, 640 acres of patented lands and 2,000 acres of state uranium leases. Between five deposits, historic uranium resources are estimated at approximately133 million pounds of U<sub>3</sub>O<sub>8 </sub>.<sup>(1) </sup> Desert View and Whiskey Peak have large areas that have been identified as having good potential for ISR mining, whereas the other deposits are considered appropriate for conventional mining.</p>\n<p><b>About the Sweetwater Plant</b></p>\n<p>The Sweetwater Plant is a 3,000 ton per day conventional processing mill with a licensed capacity of 4.1 million pounds of U<sub>3</sub>O<sub>8</sub>. It is located approximately 40 miles northwest of <span class=\"xn-location\">Rawlins</span> and 75 miles northeast of <span class=\"xn-location\">Rock Springs, Wyoming</span>. Access to the mill is via 30 miles of paved road from US Highway 287 to the east of the site. The fully licensed mill operated from 1981 to 1983 and has been kept under diligent care and maintenance since then. It is the only conventional processing mill in <span class=\"xn-location\">Wyoming</span>.</p>\n<p>The plant has considerable infrastructure in place, including well-maintained buildings and equipment, a wash bay, warehouse, workshop, offices, access road and utilities. There is potential for the plant to be adapted for the recovery of uranium from loaded resins produced by ISR operations, subject to obtaining any necessary modifications to permits and licenses.</p>\n<div><table border=\"0\" cellpadding=\"1\" cellspacing=\"0\" class=\"prnbcc\"><tr><td class=\"prngen2\" colspan=\"1\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\"><u>Note</u>:</span></p>\n</td><td class=\"prngen2\" colspan=\"1\" rowspan=\"1\"><br></br></td></tr><tr><td class=\"prnpr2 prnpl2 prnvat prntar prnsbtb0 prnrbrb0 prnsbbb0 prnsblb0\" colspan=\"1\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\">1.</span></p>\n</td><td class=\"prngen2\" colspan=\"1\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\">Based upon internal studies and other historic data prepared by prior owners in regards to the projects and dated between 1984 and 2019. Such estimates are being treated by the Company as historical in nature and a qualified person has not done sufficient work to classify the historical estimates as current mineral resources. The Company is not treating them as current resource estimates and is disclosing these historic estimates for illustrative purposes and to provide readers with relevant information regarding the projects. In addition, such estimates were not prepared under S-K 1300 standards and the results of future estimates by the Company may vary from these historic estimates.</span></p>\n</td></tr></table></div><p><b>Advisors and Counsel<br></br></b>Goldman Sachs &amp; Co. LLC and Rothschild &amp; Co acted as financial advisors to UEC in connection with the Transaction. <span class=\"xn-location\">Holland</span> &amp; Hart LLP and McMillan LLP acted as its legal advisors.</p>\n<p><b>About Uranium Energy Corp</b></p>\n<p>Uranium Energy Corp is America's largest and fastest growing supplier of uranium needed to produce safe, clean, reliable nuclear energy. UEC is advancing the next generation of low-cost, environmentally friendly ISR mining uranium projects in <span class=\"xn-location\">the United States</span> and high-grade conventional projects in Canada. The Company has two production-ready ISR hub and spoke platforms in <span class=\"xn-location\">South Texas</span> and <span class=\"xn-location\">Wyoming</span>. These two production platforms are anchored by fully operational Central Processing Plants (\"CPPs\") and served by seven U.S. ISR uranium projects with all their major permits in place. In <span class=\"xn-chron\">August 2024</span>, production began at the Christensen Ranch project in <span class=\"xn-location\">Wyoming</span>, sending uranium loaded resin to the CPP at Irigaray (<span class=\"xn-location\">Wyoming</span> hub).  Additionally, the Company has diversified uranium holdings including: (1) one of the largest physical uranium portfolios of U.S. warehoused U<sub>3</sub>O<sub>8</sub>; (2) a major equity stake in Uranium Royalty Corp., the only royalty company in the sector; and (3) a Western Hemisphere pipeline of resource stage uranium projects. The Company's operations are managed by professionals with decades of hands-on experience in the key facets of uranium exploration, development and mining.</p>\n<p><b>Stock Exchange Information:<br></br></b>NYSE American: <b>UEC</b><br></br>WKN: <b>AØJDRR</b><br></br>ISN: <b>US916896103</b></p>\n<p><b>Safe Harbor Statement</b></p>\n<p>Except for the statements of historical fact contained herein, the information presented in this news release constitutes \"forward-looking statements\" as such term is used in applicable <span class=\"xn-location\">United States</span> and Canadian securities laws. These statements relate to analyses and other information that are based on forecasts of future results, estimates of amounts not yet determinable and assumptions of management. Any other statements that express or involve discussions with respect to predictions, expectations, beliefs, plans, projections, objectives, assumptions or future events or performance (often, but not always, using words or phrases such as \"expects\" or \"does not expect\", \"is expected\", \"anticipates\" or \"does not anticipate\", \"plans, \"estimates\" or \"intends\", or stating that certain actions, events or results \"may\", \"could\", \"would\", \"might\" or \"will\" be taken, occur or be achieved) are not statements of historical fact and should be viewed as \"forward-looking statements\". Such forward looking statements involve known and unknown risks, uncertainties and other factors which may cause the actual results, performance or achievements of the Company to be materially different from any future results, performance or achievements expressed or implied by such forward-looking statements. Such risks and other factors include, among others, the actual results of exploration activities, variations in the underlying assumptions associated with the estimation or realization of mineral resources, future mineral resource estimates may vary from historic estimates, the availability of capital to fund programs and the resulting dilution caused by the raising of capital through the sale of shares, accidents, labor disputes and other risks of the mining industry including, without limitation, those associated with the environment, delays in obtaining governmental approvals, permits or financing or in the completion of development or construction activities, title disputes or claims limitations on insurance coverage. Although the Company has attempted to identify important factors that could cause actual actions, events or results to differ materially from those described in forward-looking statements, there may be other factors that cause actions, events or results not to be as anticipated, estimated or intended. Many of these factors are beyond the Company's ability to control or predict. There can be no assurance that such statements will prove to be accurate as actual results and future events could differ materially from those anticipated in such statements. Accordingly, readers should not place undue reliance on forward-looking statements contained in this news release and in any document referred to in this news release. Important factors that may cause actual results to differ materially and that could impact the Company and the statements contained in this news release can be found in the Company's filings with the Securities and Exchange Commission. For forward-looking statements in this news release, the Company claims the protection of the safe harbor for forward-looking statements contained in the Private Securities Litigation Reform Act of 1995. The Company assumes no obligation to update or supplement any forward-looking statements whether as a result of new information, future events or otherwise. This news release shall not constitute an offer to sell or the solicitation of an offer to buy securities.</p>\n\n\n\n\n\n\n<p id=\"PURL\"><img alt=\"Cision\" height=\"12\" src=\"https://c212.net/c/img/favicon.png?sn=VA73636&amp;sd=2024-12-06\" title=\"Cision\" width=\"12\"></img> View original content:<a href=\"https://www.prnewswire.com/news-releases/uranium-energy-corp-completes-acquisition-of-rio-tintos-sweetwater-plant-and-wyoming-uranium-assets-302324647.html\" id=\"PRNURL\" rel=\"nofollow\" target=\"_blank\">https://www.prnewswire.com/news-releases/uranium-energy-corp-completes-acquisition-of-rio-tintos-sweetwater-plant-and-wyoming-uranium-assets-302324647.html</a></p>\n<p>SOURCE  Uranium Energy Corp</p>\n<img alt=\"\" src=\"https://rt.newswire.ca/rt.gif?NewsItemId=C1321&amp;Transmission_Id=202412060630CANADANWCANADAPR_C1321&amp;DateId=20241206\" style=\"border:0px; width:1px; height:1px;\"></img>\n\n",
    "search_terms": "Sweetwater Plant,Uranium Energy Corp,UEC",
    "master_gid": 8625,
    "date": "2024-12-06T11:30:00.000Z",
    "tags": "USA|Wyoming||Uranium|Project Acquisition",
    "image_id": null,
    "hidden": false,
    "company_id": 1991,
    "provider": "cision",
    "excerpt": "NYSE American:UECCASPER, Wyo.,Dec. 6, 2024/CNW/ - Uranium Energy Corp. (NYSE American: UEC) (the \"Company\" or \"UEC\") is pleased to announce the completion of the previously announced (September 23, 2024) agreement with Rio Tinto America Inc. (\"Rio Tinto\") to acquire 100% of Rio Tinto'sWyomingassets, comprised of the wholly-owned and fully-licensed Sweetwater Plant and",
    "is_regulatory": false,
    "refined_tags": [],
    "ftp_filename": null,
    "company_name": "Uranium Energy Corp",
    "exchange": "NYSE",
    "root_ticker": "UEC",
    "project_name": "Sweetwater Plant",
    "gid": 8625,
    "location": null,
    "plan_id": null,
    "description_text": "NYSE American: UEC CASPER, Wyo. , Dec. 6, 2024 /CNW/ - Uranium Energy Corp. (NYSE American: UEC) (the \" Company \" or \" UEC \") is pleased to announce the completion of the previously announced ( September 23, 2024 ) agreement with Rio Tinto America Inc. (\" Rio Tinto \") to acquire 100% of Rio Tinto's Wyoming assets, comprised of the wholly-owned and fully-licensed Sweetwater Plant and a portfolio of uranium mining properties, including the Red Desert Project and the Green Mountain Project, with approximately 175 million pounds of historic resources (1) (the \" Transaction \"). The purchase price paid was approximately $175.4 million in cash and was funded with UEC's available liquidity. Amir Adnani , President and CEO, stated: \" The Transaction presents a rare opportunity to acquire U.S. licensed facilities and uranium mining properties from a leading global miner. These assets will significantly enhance and accelerate UEC's production capabilities in Wyoming's Great Divide Basin. The Sweetwater Plant, a 3,000-ton-per-day processing mill with a licensed capacity of 4.1 million pounds U 3 O 8 annually, can also be adapted to recover uranium from loaded resins produced by In-Situ-Recovery (\"ISR\") operations, offering UEC the flexibility to support both ISR and conventional mining . With the addition of the Sweetwater Plant, UEC has the largest licensed production capacity in the U.S. The recent investments in nuclear power by Big Tech companies, including Microsoft, Amazon, Google and Meta, demonstrates unprecedented interest from several of the world's largest and most sophisticated companies in expanding America's nuclear energy baseload capacity. These companies fully realize nuclear power is a key source of highly reliable, clean and safe energy to power the increased energy demands required by AI computing. As the largest U.S.-based uranium company, UEC will play a critical role in supplying the fuel required for today and the future – a point further underscored by Russia's recently announced uranium export restrictions.\" Transaction Highlights: Creates UEC's Third U.S. Hub-and-Spoke Production Platform; Acquisition of a Highly Invested Asset Base with Operating Synergies; Combined U.S. licensed production capacity of 12.1 million pounds of U 3 O 8 per year; Drives Sizeable and Accretive Resource Growth; Unlocks Significant Scarcity Value and Production Optionality; and Adds Extensive Land Package, Geological Data and Exploration Opportunities. The Company's next steps for the acquired asset portfolio include (1) completing a SEC Regulation S-K 1300 (\" S-K 1300 \") technical resource summary report to upgrade and confirm historic estimates, (2) building out a dedicated team to focus on advancing the Sweetwater hub-and-spoke production platform, and (3) refurbishing parts of the Sweetwater Plant and completing equipment modifications for In-Situ Recovery processing. About the Red Desert Uranium Project The Red Desert Project is a development-stage uranium project, encompassing approximately 20,005 acres of exploration and mining rights in the Great Divide Basin, including 17,750 acres of unpatented mining claims, 1,975 acres of patented lands and 1,280 acres of state uranium leases. Between three deposits, historic uranium resources are estimated at approximately 42 million pounds of U 3 O 8 . (1) There is potential for further discoveries, particularly in the shallow mineralization adjacent to the Sweetwater Plant. The deposits are favorable for ISR mining, with uranium hosted below the water table at depths suitable for oxygen dissolution, and in fluvial sands confined by low permeability silts or clays. About the Green Mountain Uranium Project The Green Mountain Project is a development-stage uranium project located 22 miles north of the Sweetwater Plant. The project spans approximately 32,040 acres of exploration and mining rights, including 29,400 acres of unpatented mining claims, 640 acres of patented lands and 2,000 acres of state uranium leases. Between five deposits, historic uranium resources are estimated at approximately133 million pounds of U 3 O 8 . (1) Desert View and Whiskey Peak have large areas that have been identified as having good potential for ISR mining, whereas the other deposits are considered appropriate for conventional mining. About the Sweetwater Plant The Sweetwater Plant is a 3,000 ton per day conventional processing mill with a licensed capacity of 4.1 million pounds of U 3 O 8 . It is located approximately 40 miles northwest of Rawlins and 75 miles northeast of Rock Springs, Wyoming . Access to the mill is via 30 miles of paved road from US Highway 287 to the east of the site. The fully licensed mill operated from 1981 to 1983 and has been kept under diligent care and maintenance since then. It is the only conventional processing mill in Wyoming . The plant has considerable infrastructure in place, including well-maintained buildings and equipment, a wash bay, warehouse, workshop, offices, access road and utilities. There is potential for the plant to be adapted for the recovery of uranium from loaded resins produced by ISR operations, subject to obtaining any necessary modifications to permits and licenses. Note : 1. Based upon internal studies and other historic data prepared by prior owners in regards to the projects and dated between 1984 and 2019. Such estimates are being treated by the Company as historical in nature and a qualified person has not done sufficient work to classify the historical estimates as current mineral resources. The Company is not treating them as current resource estimates and is disclosing these historic estimates for illustrative purposes and to provide readers with relevant information regarding the projects. In addition, such estimates were not prepared under S-K 1300 standards and the results of future estimates by the Company may vary from these historic estimates. Advisors and Counsel Goldman Sachs & Co. LLC and Rothschild & Co acted as financial advisors to UEC in connection with the Transaction. Holland & Hart LLP and McMillan LLP acted as its legal advisors. About Uranium Energy Corp Uranium Energy Corp is America's largest and fastest growing supplier of uranium needed to produce safe, clean, reliable nuclear energy. UEC is advancing the next generation of low-cost, environmentally friendly ISR mining uranium projects in the United States and high-grade conventional projects in Canada. The Company has two production-ready ISR hub and spoke platforms in South Texas and Wyoming . These two production platforms are anchored by fully operational Central Processing Plants (\"CPPs\") and served by seven U.S. ISR uranium projects with all their major permits in place. In August 2024 , production began at the Christensen Ranch project in Wyoming , sending uranium loaded resin to the CPP at Irigaray ( Wyoming hub).  Additionally, the Company has diversified uranium holdings including: (1) one of the largest physical uranium portfolios of U.S. warehoused U 3 O 8 ; (2) a major equity stake in Uranium Royalty Corp., the only royalty company in the sector; and (3) a Western Hemisphere pipeline of resource stage uranium projects. The Company's operations are managed by professionals with decades of hands-on experience in the key facets of uranium exploration, development and mining. Stock Exchange Information: NYSE American: UEC WKN: AØJDRR ISN: US916896103 Safe Harbor Statement Except for the statements of historical fact contained herein, the information presented in this news release constitutes \"forward-looking statements\" as such term is used in applicable United States and Canadian securities laws. These statements relate to analyses and other information that are based on forecasts of future results, estimates of amounts not yet determinable and assumptions of management. Any other statements that express or involve discussions with respect to predictions, expectations, beliefs, plans, projections, objectives, assumptions or future events or performance (often, but not always, using words or phrases such as \"expects\" or \"does not expect\", \"is expected\", \"anticipates\" or \"does not anticipate\", \"plans, \"estimates\" or \"intends\", or stating that certain actions, events or results \"may\", \"could\", \"would\", \"might\" or \"will\" be taken, occur or be achieved) are not statements of historical fact and should be viewed as \"forward-looking statements\". Such forward looking statements involve known and unknown risks, uncertainties and other factors which may cause the actual results, performance or achievements of the Company to be materially different from any future results, performance or achievements expressed or implied by such forward-looking statements. Such risks and other factors include, among others, the actual results of exploration activities, variations in the underlying assumptions associated with the estimation or realization of mineral resources, future mineral resource estimates may vary from historic estimates, the availability of capital to fund programs and the resulting dilution caused by the raising of capital through the sale of shares, accidents, labor disputes and other risks of the mining industry including, without limitation, those associated with the environment, delays in obtaining governmental approvals, permits or financing or in the completion of development or construction activities, title disputes or claims limitations on insurance coverage. Although the Company has attempted to identify important factors that could cause actual actions, events or results to differ materially from those described in forward-looking statements, there may be other factors that cause actions, events or results not to be as anticipated, estimated or intended. Many of these factors are beyond the Company's ability to control or predict. There can be no assurance that such statements will prove to be accurate as actual results and future events could differ materially from those anticipated in such statements. Accordingly, readers should not place undue reliance on forward-looking statements contained in this news release and in any document referred to in this news release. Important factors that may cause actual results to differ materially and that could impact the Company and the statements contained in this news release can be found in the Company's filings with the Securities and Exchange Commission. For forward-looking statements in this news release, the Company claims the protection of the safe harbor for forward-looking statements contained in the Private Securities Litigation Reform Act of 1995. The Company assumes no obligation to update or supplement any forward-looking statements whether as a result of new information, future events or otherwise. This news release shall not constitute an offer to sell or the solicitation of an offer to buy securities. View original content: https://www.prnewswire.com/news-releases/uranium-energy-corp-completes-acquisition-of-rio-tintos-sweetwater-plant-and-wyoming-uranium-assets-302324647.html SOURCE  Uranium Energy Corp",
    "primary_commodity": "U"
  },
  "articleProject": {
    "gid": 8625,
    "project_name": "Sweetwater Plant",
    "location": null
  },
  "articleExchange": "NYSE",
  "articleCompanyId": 1991,
  "articleTicker": "UEC",
  "articleCompanyName": "Uranium Energy Corp",
  "allOtherCompanyProjects": [
    {
      "company_id": 1991,
      "gid": 9859,
      "project_name": "Irigaray CPP (Hub)",
      "location": "Wyoming, United States"
    },
    {
      "company_id": 1991,
      "gid": 3418,
      "project_name": "Reno Creek",
      "location": "Wyoming, United States"
    },
    {
      "company_id": 1991,
      "gid": 5140,
      "project_name": "Palangana",
      "location": "Texas, United States"
    },
    {
      "company_id": 1991,
      "gid": 4253,
      "project_name": "Workman Creek",
      "location": "Arizona, United States"
    },
    {
      "company_id": 1991,
      "gid": 5737,
      "project_name": "Alto Parana",
      "location": "Alto Parana, Paraguay"
    },
    {
      "company_id": 1991,
      "gid": 5139,
      "project_name": "Burke Hollow",
      "location": "Texas, United States"
    },
    {
      "company_id": 1991,
      "gid": 10592,
      "project_name": "Anderson",
      "location": "Arizona, United States"
    },
    {
      "company_id": 1991,
      "gid": 10755,
      "project_name": "Central Lisbon Valley",
      "location": "Utah, United States"
    },
    {
      "company_id": 1991,
      "gid": 5106,
      "project_name": "Christensen Ranch (Willow Creek)",
      "location": "Wyoming, United States"
    },
    {
      "company_id": 1991,
      "gid": 9541,
      "project_name": "Hobson CPP",
      "location": "Texas, United States"
    },
    {
      "company_id": 1991,
      "gid": 9543,
      "project_name": "Salvo",
      "location": "Texas, United States"
    },
    {
      "company_id": 1991,
      "gid": 9544,
      "project_name": "Oviedo",
      "location": "Caaguazu, Paraguay"
    },
    {
      "company_id": 1991,
      "gid": 6298,
      "project_name": "Roughrider",
      "location": "Saskatchewan, Canada"
    },
    {
      "company_id": 1991,
      "gid": 8625,
      "project_name": "Sweetwater Plant",
      "location": null
    },
    {
      "company_id": 1991,
      "gid": 9213,
      "project_name": "Green Mountain",
      "location": "Wyoming, United States"
    }
  ],
  "allOtherCompanyNews": [
    {
      "id": 106515,
      "company_id": 1991,
      "title": "Uranium Energy Corp Files Quarterly Report For the Third Quarter of Fiscal 2025",
      "link": "https://contentapi.cision.com/api/v1.0/releases/20250602C6902",
      "date": "2025-06-02T10:30:00.000Z",
      "hidden": false
    },
    {
      "id": 105872,
      "company_id": 1991,
      "title": "Uranium Energy Corp Applauds Trump Administration's Transformational Executive Orders to Quadruple U.S. Nuclear Capacity and Rebuild Domestic Uranium Fuel Cycle",
      "link": "https://contentapi.cision.com/api/v1.0/releases/20250527VA96214",
      "date": "2025-05-27T11:00:00.000Z",
      "hidden": false
    },
    {
      "id": 103808,
      "company_id": 1991,
      "title": "Uranium Energy Corp and Radiant Industries Announce U.S. Uranium Supply Agreement to Support Deployment of Microreactors, Building the Full Nuclear Power Value Chain in America",
      "link": "https://contentapi.cision.com/api/v1.0/releases/20250507C5925",
      "date": "2025-05-07T11:00:00.000Z",
      "hidden": false
    },
    {
      "id": 100175,
      "company_id": 1991,
      "title": "Uranium Energy Corp President and Chief Executive Officer, Amir Adnani, Appointed to World Nuclear Association Board of Management",
      "link": "https://contentapi.cision.com/api/v1.0/releases/20250417VA66924",
      "date": "2025-04-17T12:30:00.000Z",
      "hidden": false
    },
    {
      "id": 90762,
      "company_id": 1991,
      "title": "Uranium Energy Corp Files Quarterly Report For the Second Quarter of Fiscal 2025",
      "link": "https://contentapi.cision.com/api/v1.0/releases/20250312C4016",
      "date": "2025-03-12T10:30:00.000Z",
      "hidden": false
    },
    {
      "id": 88343,
      "company_id": 1991,
      "title": "Uranium Energy Corp Achieves Key Production Milestone with Drummed Uranium Concentrates at Irigaray Plant",
      "link": "https://contentapi.cision.com/api/v1.0/releases/20250219VA21635",
      "date": "2025-02-19T11:45:00.000Z",
      "hidden": false
    },
    {
      "id": -164572,
      "company_id": 1991,
      "title": "Uranium Energy Corp Increases Holdings in Anfield Energy",
      "link": "https://contentapi.cision.com/api/v1.0/releases/20250115VA97691",
      "date": "2025-01-15T22:53:00.000Z",
      "hidden": false
    },
    {
      "id": 82485,
      "company_id": 1991,
      "title": "Uranium Energy Corp to Speak at Goldman Sachs Energy, CleanTech &amp; Utilities Conference",
      "link": "https://contentapi.cision.com/api/v1.0/releases/20241219C7276",
      "date": "2024-12-19T13:00:00.000Z",
      "hidden": false
    },
    {
      "id": 81156,
      "company_id": 1991,
      "title": "Uranium Energy Corp Completes Acquisition of Rio Tinto's Sweetwater Plant and Wyoming Uranium Assets",
      "link": "https://contentapi.cision.com/api/v1.0/releases/20241206C1321",
      "date": "2024-12-06T11:30:00.000Z",
      "hidden": false
    },
    {
      "id": 81029,
      "company_id": 1991,
      "title": "Uranium Energy Corp Files Quarterly Report For the First Quarter of Fiscal 2025",
      "link": "https://contentapi.cision.com/api/v1.0/releases/20241205VA72594",
      "date": "2024-12-05T11:30:00.000Z",
      "hidden": false
    }
  ]
}
