{
  "article": {
    "id": 87473,
    "link": "https://contentapi.cision.com/api/v1.0/releases/20250211C4113",
    "title": "P2 Gold Makes Final Payment for Acquisition of Gold-Copper Gabbs Project",
    "description": "\n\n<p><span class=\"legendSpanClass\"><span class=\"xn-location\">VANCOUVER, BC</span></span>, <span class=\"legendSpanClass\"><span class=\"xn-chron\">Feb. 11, 2025</span></span> /CNW/ - <b>P2 Gold Inc.</b> (\"P2\" or the \"Company\") (TSXV: PGLD) (OTCQB: PGLDF) reports that it has paid <span class=\"xn-money\">US$100,000</span> to Waterton Nevada Splitter, LLC (\"Splitter\"), an affiliate of Waterton Precious Metals Fund II Cayman, LP, in respect of the final payment due to Splitter relating to the acquisition of the gold-copper Gabbs Project (<i>see P2 news releases of <span class=\"xn-chron\">February 13, 2024</span> and <span class=\"xn-chron\">March 3, 2024</span>)</i>.   </p>\n\n    <div class=\"PRN_ImbeddedAssetReference\" id=\"DivAssetPlaceHolder1\">\n                <p>\n                        <a href=\"https://mma.prnewswire.com/media/2617989/P2_Gold_Inc__P2_Gold_Makes_Final_Payment_for_Acquisition_of_Gold.html\" rel=\"nofollow\" target=\"_blank\">\n                    <img alt=\"P2 Gold Inc. Logo (CNW Group/P2 Gold Inc.)\" src=\"https://mma.prnewswire.com/media/2617989/P2_Gold_Inc__P2_Gold_Makes_Final_Payment_for_Acquisition_of_Gold.jpg\" title=\"P2 Gold Inc. Logo (CNW Group/P2 Gold Inc.)\"></img>\n                        </a>\n                </p>\n\n    </div>\n<p>\"We have now fulfilled all of our obligations to Waterton in respect of the acquisition of Gabbs, and with the payment from the sale of the Ball Creek Claims, we are funded through the coming year and into the next,\" commented <span class=\"xn-person\">Joe Ovsenek</span>, President and CEO of P2.  \"What's more, with the increase in metal prices, under the Company's preliminary economic assessment announced on <span class=\"xn-chron\">May 22, 2024</span> and described in the Gabbs Technical Report dated <span class=\"xn-chron\">May 17, 2024</span> (available under the Company's profile on SEDAR+ at <a href=\"https://c212.net/c/link/?t=0&amp;l=en&amp;o=4360395-1&amp;h=2497773367&amp;u=http%3A%2F%2Fwww.sedarplus.com%2F&amp;a=www.sedarplus.com\" rel=\"nofollow\" target=\"_blank\">www.sedarplus.com</a>), Gabbs has an internal rate of return of 43.3% and net present value at a 5% discount rate of <span class=\"xn-money\">US$1.2 billion</span> at today's spot metal prices of <span class=\"xn-money\">$2,909</span> gold, <span class=\"xn-money\">$32</span> silver and <span class=\"xn-money\">$4.22</span> copper.  We look forward to providing further updates as we advance Gabbs.\"</p>\n<p><b>Qualified Person</b></p>\n<p><span class=\"xn-person\">Ken McNaughton</span>, M.A.Sc., P.Eng., Chief Exploration Officer, P2 Gold, is the Qualified Person, as defined by National Instrument 43-101, responsible for the Gabbs Project.  Mr. McNaughton has reviewed, verified, and approved the scientific and technical information in this news release.</p>\n<p><b>About P2 Gold Inc. </b></p>\n<p>P2 Gold is a mineral exploration and development company focused on advancing its gold-copper Gabbs Project on the Walker Lane Trend in Nevada.  A positive preliminary economic assessment has outlined a long-life, mid-size mine at Gabbs with annual average production of 104,000 ounces gold and 13,500 tonnes copper over a 14.2-year mine life.  The Gabbs Project has excellent infrastructure with access via paved Hwy 361, and power and water on site.  Additional metallurgical testing is commencing shortly, and a water permit is expected in the second quarter of this year.  All zones on the property remain open and additional exploration targets, near surface and at depth, are drill ready.</p>\n<p>Neither the TSX Venture Exchange (the \"Exchange\") nor its Regulation Services Provider (as that term is defined in the policies of the Exchange) accepts responsibility for the adequacy or accuracy of this release.</p>\n<p><b>Forward Looking Information</b></p>\n<p>This press release contains \"forward-looking information\" within the meaning of applicable securities laws that is intended to be covered by the safe harbours created by those laws. \"Forward-looking information\" includes statements that use forward-looking terminology such as \"may\", \"will\", \"expect\", \"anticipate\", \"believe\", \"continue\", \"potential\" or the negative thereof or other variations thereof or comparable terminology. Such forward-looking information includes, without limitation, information with respect to the Company's expectations, strategies and plans for its Gabbs Project including the Company's planned expenditures and exploration activities.</p>\n<p>Forward-looking information is not a guarantee of future performance and is based upon a number of estimates and assumptions of management at the date the statements are made, including without limitation, the estimated internal rate of return and net present value at a 5% discount rate of the Gabbs Project, as well as the other assumptions disclosed in this news release.  Furthermore, such forward-looking information involves a variety of known and unknown risks, uncertainties and other factors which may cause the actual plans, intentions, activities, results, performance or achievements of the Company to be materially different from any future plans, intentions, activities, results, performance or achievements expressed or implied by such forward-looking information, including without limitation, the estimates and assumptions contained in the Gabbs Technical Report dated <span class=\"xn-chron\">May 17, 2024</span>, and risks associated with mineral exploration, including the risk that actual results and timing of exploration and development will be different from those expected by management.  See \"Risk Factors\" in the Company's annual information form for the year ended <span class=\"xn-chron\">December 31, 2023</span>, dated <span class=\"xn-chron\">March 21, 2024</span> filed on SEDAR at <a href=\"http://www.sedar.com\" rel=\"nofollow\">www.sedar.com</a> for a discussion of these risks.</p>\n<p>The Company cautions that there can be no assurance that forward-looking information will prove to be accurate, as actual results and future events could differ materially from those anticipated in such information. Accordingly, investors should not place undue reliance on forward-looking information.</p>\n<p>Except as required by law, the Company does not assume any obligation to release publicly any revisions to forward-looking information contained in this press release to reflect events or circumstances after the date hereof.</p>\n<p>SOURCE  P2 Gold Inc.</p>\n<img alt=\"\" src=\"https://rt.newswire.ca/rt.gif?NewsItemId=C4113&amp;Transmission_Id=202502111421CANADANWCANADAPR_C4113&amp;DateId=20250211\" style=\"border:0px; width:1px; height:1px;\"></img>\n\n",
    "search_terms": "Gabbs,P2 Gold Inc.,PGLD",
    "master_gid": 1003,
    "date": "2025-02-11T19:21:00.000Z",
    "tags": "USA|Nevada||Copper,Gold|Project Acquisition",
    "image_id": null,
    "hidden": false,
    "company_id": 95,
    "provider": "cision",
    "excerpt": "VANCOUVER, BC,Feb. 11, 2025/CNW/ -P2 Gold Inc.(\"P2\" or the \"Company\") (TSXV: PGLD) (OTCQB: PGLDF) reports that it has paidUS$100,000to Waterton Nevada Splitter, LLC (\"Splitter\"), an affiliate of Waterton Precious Metals Fund II Cayman, LP, in respect of the final payment due to Splitter relating to the acquisition of the gold-copper",
    "is_regulatory": false,
    "refined_tags": [],
    "ftp_filename": null,
    "company_name": "P2 Gold Inc.",
    "exchange": "TSXV",
    "root_ticker": "PGLD",
    "project_name": "Gabbs",
    "gid": 1003,
    "location": "Nevada, United States",
    "plan_id": "companytier2",
    "description_text": "VANCOUVER, BC , Feb. 11, 2025 /CNW/ - P2 Gold Inc. (\"P2\" or the \"Company\") (TSXV: PGLD) (OTCQB: PGLDF) reports that it has paid US$100,000 to Waterton Nevada Splitter, LLC (\"Splitter\"), an affiliate of Waterton Precious Metals Fund II Cayman, LP, in respect of the final payment due to Splitter relating to the acquisition of the gold-copper Gabbs Project ( see P2 news releases of February 13, 2024 and March 3, 2024 ) . \"We have now fulfilled all of our obligations to Waterton in respect of the acquisition of Gabbs, and with the payment from the sale of the Ball Creek Claims, we are funded through the coming year and into the next,\" commented Joe Ovsenek , President and CEO of P2.  \"What's more, with the increase in metal prices, under the Company's preliminary economic assessment announced on May 22, 2024 and described in the Gabbs Technical Report dated May 17, 2024 (available under the Company's profile on SEDAR+ at www.sedarplus.com ), Gabbs has an internal rate of return of 43.3% and net present value at a 5% discount rate of US$1.2 billion at today's spot metal prices of $2,909 gold, $32 silver and $4.22 copper.  We look forward to providing further updates as we advance Gabbs.\" Qualified Person Ken McNaughton , M.A.Sc., P.Eng., Chief Exploration Officer, P2 Gold, is the Qualified Person, as defined by National Instrument 43-101, responsible for the Gabbs Project.  Mr. McNaughton has reviewed, verified, and approved the scientific and technical information in this news release. About P2 Gold Inc. P2 Gold is a mineral exploration and development company focused on advancing its gold-copper Gabbs Project on the Walker Lane Trend in Nevada.  A positive preliminary economic assessment has outlined a long-life, mid-size mine at Gabbs with annual average production of 104,000 ounces gold and 13,500 tonnes copper over a 14.2-year mine life.  The Gabbs Project has excellent infrastructure with access via paved Hwy 361, and power and water on site.  Additional metallurgical testing is commencing shortly, and a water permit is expected in the second quarter of this year.  All zones on the property remain open and additional exploration targets, near surface and at depth, are drill ready. Neither the TSX Venture Exchange (the \"Exchange\") nor its Regulation Services Provider (as that term is defined in the policies of the Exchange) accepts responsibility for the adequacy or accuracy of this release. Forward Looking Information This press release contains \"forward-looking information\" within the meaning of applicable securities laws that is intended to be covered by the safe harbours created by those laws. \"Forward-looking information\" includes statements that use forward-looking terminology such as \"may\", \"will\", \"expect\", \"anticipate\", \"believe\", \"continue\", \"potential\" or the negative thereof or other variations thereof or comparable terminology. Such forward-looking information includes, without limitation, information with respect to the Company's expectations, strategies and plans for its Gabbs Project including the Company's planned expenditures and exploration activities. Forward-looking information is not a guarantee of future performance and is based upon a number of estimates and assumptions of management at the date the statements are made, including without limitation, the estimated internal rate of return and net present value at a 5% discount rate of the Gabbs Project, as well as the other assumptions disclosed in this news release.  Furthermore, such forward-looking information involves a variety of known and unknown risks, uncertainties and other factors which may cause the actual plans, intentions, activities, results, performance or achievements of the Company to be materially different from any future plans, intentions, activities, results, performance or achievements expressed or implied by such forward-looking information, including without limitation, the estimates and assumptions contained in the Gabbs Technical Report dated May 17, 2024 , and risks associated with mineral exploration, including the risk that actual results and timing of exploration and development will be different from those expected by management.  See \"Risk Factors\" in the Company's annual information form for the year ended December 31, 2023 , dated March 21, 2024 filed on SEDAR at www.sedar.com for a discussion of these risks. The Company cautions that there can be no assurance that forward-looking information will prove to be accurate, as actual results and future events could differ materially from those anticipated in such information. Accordingly, investors should not place undue reliance on forward-looking information. Except as required by law, the Company does not assume any obligation to release publicly any revisions to forward-looking information contained in this press release to reflect events or circumstances after the date hereof. SOURCE  P2 Gold Inc.",
    "primary_commodity": "Au"
  },
  "articleProject": {
    "gid": 1003,
    "project_name": "Gabbs",
    "location": "Nevada, United States"
  },
  "articleExchange": "TSXV",
  "articleCompanyId": 95,
  "articleTicker": "PGLD",
  "articleCompanyName": "P2 Gold Inc.",
  "allOtherCompanyProjects": [
    {
      "company_id": 95,
      "gid": 447,
      "project_name": "BAM",
      "location": "British Columbia, Canada"
    },
    {
      "company_id": 95,
      "gid": 451,
      "project_name": "Silver Reef",
      "location": "British Columbia, Canada"
    },
    {
      "company_id": 95,
      "gid": 2287,
      "project_name": "Lost Cabin",
      "location": "Oregon, United States"
    },
    {
      "company_id": 95,
      "gid": 1003,
      "project_name": "Gabbs",
      "location": "Nevada, United States"
    },
    {
      "company_id": 95,
      "gid": 4201,
      "project_name": "Bam (Ball Creek)",
      "location": "British Columbia, Canada"
    }
  ],
  "allOtherCompanyNews": [
    {
      "id": 108093,
      "company_id": 95,
      "title": "P2 Gold Announces Positive Interim Metallurgical Results",
      "link": "https://contentapi.cision.com/api/v1.0/releases/20250616C9782",
      "date": "2025-06-16T09:00:00.000Z",
      "hidden": false
    },
    {
      "id": 106004,
      "company_id": 95,
      "title": "P2 Gold Announces Option Grant",
      "link": "https://contentapi.cision.com/api/v1.0/releases/20250527C4984",
      "date": "2025-05-27T23:21:00.000Z",
      "hidden": false
    },
    {
      "id": 104295,
      "company_id": 95,
      "title": "P2 Gold Announces Management, Metallurgical Testwork Updates",
      "link": "https://contentapi.cision.com/api/v1.0/releases/20250512C9838",
      "date": "2025-05-12T08:00:00.000Z",
      "hidden": false
    },
    {
      "id": 98585,
      "company_id": 95,
      "title": "P2 Gold Announces Positive Sullivan Zone Sample Assay Results from Gabbs Project; Commences Further Metallurgical Testwork",
      "link": "https://contentapi.cision.com/api/v1.0/releases/20250403C7742",
      "date": "2025-04-03T09:00:00.000Z",
      "hidden": false
    },
    {
      "id": 87473,
      "company_id": 95,
      "title": "P2 Gold Makes Final Payment for Acquisition of Gold-Copper Gabbs Project",
      "link": "https://contentapi.cision.com/api/v1.0/releases/20250211C4113",
      "date": "2025-02-11T19:21:00.000Z",
      "hidden": false
    },
    {
      "id": -166515,
      "company_id": 95,
      "title": "P2 Gold Closes the Sale of the Ball Creek Claims (BAM Project)",
      "link": "https://contentapi.cision.com/api/v1.0/releases/20250129C2306",
      "date": "2025-01-29T22:05:00.000Z",
      "hidden": false
    },
    {
      "id": 83367,
      "company_id": 95,
      "title": "P2 Gold Announces Convertible Debenture Interest Payment and Conversion Price Increase",
      "link": "https://contentapi.cision.com/api/v1.0/releases/20250107C3546",
      "date": "2025-01-07T10:00:00.000Z",
      "hidden": false
    },
    {
      "id": 83217,
      "company_id": 95,
      "title": "P2 Gold Announces Option Grants",
      "link": "https://contentapi.cision.com/api/v1.0/releases/20250102C4115",
      "date": "2025-01-02T22:30:00.000Z",
      "hidden": false
    },
    {
      "id": 81087,
      "company_id": 95,
      "title": "P2 Gold Announces Sale of Ball Creek (BAM) Claims",
      "link": "https://contentapi.cision.com/api/v1.0/releases/20241205C5068",
      "date": "2024-12-05T13:36:00.000Z",
      "hidden": false
    },
    {
      "id": -153226,
      "company_id": 95,
      "title": "P2 Gold Announces Debt Settlement",
      "link": "https://contentapi.cision.com/api/v1.0/releases/20241108C7077",
      "date": "2024-11-08T22:00:00.000Z",
      "hidden": false
    }
  ]
}
