{
  "article": {
    "id": 87551,
    "link": "https://www.newsfilecorp.com/release/240503/Myriad-Uranium-Issues-Shares-under-Option-to-Acquire-100-of-the-Red-Basin-Uranium-Project-in-New-Mexico-USA",
    "title": "Myriad Uranium Issues Shares under Option to Acquire 100% of the Red Basin Uranium Project in New Mexico, USA",
    "description": "<img src=\"https://api.newsfilecorp.com/newsinfo/240503/367\" id=\"367\" width=\"2\" height=\"2\" style=\"width: 1px;  height: 1px;border: 0px solid;\" /><p>Vancouver, British Columbia--(Newsfile Corp. - February 11, 2025) - <b>Myriad Uranium Corp.</b> (CSE: M) (OTCQB: MYRUF) (FSE: C3Q)  (\"<b>Myriad</b>\" or the \"<b>Company</b>\") is pleased to announce that it has issued 612,164 common shares of Myriad (each, a \"Share\") to FirstAmerican Energy Fuels Ltd. (the \"Optionor\") pursuant to a property option agreement dated as of January 30, 2025 (the \"Option Agreement\") with First American Uranium Inc. (CSE: URM) (\"First American\") and the Optionor respecting the Red Basin Uranium Project (the \"Project\"). The Project is comprised of 86 lode claims in the Red Basin area of the Datil Mountains - Pietown Uranium District, Catron County, New Mexico, USA, covering approximately 1,776 acres (approximately 719 hectares). (see Myriad's news release dated February 4, 2025 respecting the Option Agreement and the Project).</p><p>The Shares were issued at a deemed price of approximately C$0.408 per Share, representing a value of C$250,000 according to a 10-day VWAP for the Shares contemplated by the Option Agreement. Pursuant to applicable securities laws, the Shares are subject to a four month hold period expiring June 12, 2025.</p><p>Myriad's final obligation to exercise the option under the Option Agreement and earn a 100% interest in and to the Project is to conduct a geophysics survey on the Project by no later than January 30, 2026. Myriad will provide further updates respecting the Project in due course. </p><p><b>About Myriad Uranium Corp.</b></p><p>Myriad Uranium Corp. is a uranium exploration company with an earnable 75% interest in the Copper Mountain Uranium Project in Wyoming, USA. To date, Myriad has earned a 50% interest in Copper Mountain. Copper Mountain hosts several known uranium deposits and historical uranium mines, including the Arrowhead Mine which produced 500,000 lbs of eU3O8. Copper Mountain saw extensive drilling and development by Union Pacific during the late 1970s including the development of a mine plan to fuel a planned fleet of California Edison reactors. Operations ceased in 1980 before mining could commence due to falling uranium prices. Approximately 2,000 boreholes have been drilled at Copper Mountain and the Project Area has significant exploration upside. Union Pacific is estimated to have spent C$117 million (2024 dollars) exploring and developing Copper Mountain, generating significant historical resource estimates which are detailed <a href=\"https://api.newsfilecorp.com/redirect/m38WrtXWKp\">here</a>.  Myriad recently concluded a 34-hole maiden drill program in November 2024 which encountered significant high grade uranium mineralisation that exceeded expectations, provided verification of historical exploration work, and encountered mineralisation in deeper zones, which opens exciting new potential for the Copper Mountain Uranium Project.  A comprehensive news release regarding the drilling can be viewed <a href=\"https://api.newsfilecorp.com/redirect/kO7vbCDBjy\">here</a>.  </p><p>A recent detailed update with Crux Investor can be viewed <a href=\"https://api.newsfilecorp.com/redirect/Bpq3riYvEJ\">here</a>.  The Company's presentation can be viewed <a href=\"https://api.newsfilecorp.com/redirect/55BMwuyLqZ\">here</a>.  News releases regarding historical drilling can be viewed <a href=\"https://api.newsfilecorp.com/redirect/LGX2YSxEga\">here</a> and <a href=\"https://api.newsfilecorp.com/redirect/oLNWji72b7\">here</a>.</p><p>For further information, please refer to Myriad's disclosure record on SEDAR+ (<a href=\"https://api.newsfilecorp.com/redirect/O3VxKtGXaD\">www.sedarplus.ca</a>), contact Myriad by telephone at +1.604.418.2877, or refer to Myriad's website at <a href=\"https://api.newsfilecorp.com/redirect/PLzWxiQM8K\">www.myriaduranium.com</a>.</p><div id=\"contactInfo\"><p><b>Myriad Contacts:</b><br />Thomas Lamb<br />President and CEO<br /><a href=\"mailto:tlamb@myriaduranium.com\">tlamb@myriaduranium.com</a></p></div><p><i><b>Forward-Looking Statements</b></i></p><p><i>This news release contains \"forward-looking information\" that is based on the Company's current expectations, estimates, forecasts and projections. This forward-looking information includes, among other things, the Company's business, plans, outlook and business strategy. The words \"may\", \"would\", \"could\", \"should\", \"will\", \"likely\", \"expect,\" \"anticipate,\" \"intend\", \"estimate\", \"plan\", \"forecast\", \"project\" and \"believe\" or other similar words and phrases are intended to identify forward-looking information. The reader is cautioned that assumptions used in the preparation of any forward-looking information may prove to be incorrect, including with respect to the Company's business plans respecting the exploration and development of the Company's mineral properties, the proposed work program on the Company's mineral properties and the potential and economic viability of the Company's mineral properties. Forward-looking information is subject to known and unknown risks, uncertainties and other factors that may cause the Company's actual results, level of activity, performance or achievements to be materially different from those expressed or implied by such forward-looking information. Such factors include, but are not limited to: changes in economic conditions or financial markets; increases in costs; litigation; legislative, environmental and other judicial, regulatory, political and competitive developments; access to minerals where the surface rights above them have not been settled; and technological or operational difficulties. This list is not exhaustive of the factors that may affect our forward-looking information. These and other factors should be considered carefully, and readers should not place undue reliance on such forward-looking information. The Company does not intend, and expressly disclaims any intention or obligation to, update or revise any forward-looking information whether as a result of new information, future events or otherwise, except as required by applicable law.</i></p><p><i>The CSE has not reviewed, approved or disapproved the contents of this news release.</i></p><p id=\"corporateNewsLogoContainer\"><img src=\"https://images.newsfilecorp.com/files/6301/240503_ef6da477b4c6cb0f_logo.jpg\" id=\"corporateNewsLogo\" alt=\"Corporate Logo\" /></p><p id=\"corporateLinkBack\">To view the source version of this press release, please visit <a href=\"https://api.newsfilecorp.com/redirect/wWvMYheZOB\">https://www.newsfilecorp.com/release/240503</a></p>",
    "search_terms": "Red Basin,Myriad Uranium Corp.,M",
    "master_gid": 4242,
    "date": "2025-02-12T00:21:00.000Z",
    "tags": "|||Uranium|Project Acquisition",
    "image_id": null,
    "hidden": false,
    "company_id": 1558,
    "provider": "newsfilecorp",
    "excerpt": "Vancouver, British Columbia--(Newsfile Corp. - February 11, 2025) -Myriad Uranium Corp.(CSE: M) (OTCQB: MYRUF) (FSE: C3Q) (\"Myriad\" or the \"Company\") is pleased to announce that it has issued 612,164 common shares of Myriad (each, a \"Share\") to FirstAmerican Energy Fuels Ltd. (the \"Optionor\") pursuant to a property option agreement dated",
    "is_regulatory": false,
    "refined_tags": null,
    "ftp_filename": null,
    "company_name": "First American Uranium Inc.",
    "exchange": "CSE",
    "root_ticker": "M",
    "project_name": "Red Basin",
    "gid": 4242,
    "location": "New Mexico, United States",
    "plan_id": null,
    "description_text": "Vancouver, British Columbia--(Newsfile Corp. - February 11, 2025) - Myriad Uranium Corp. (CSE: M) (OTCQB: MYRUF) (FSE: C3Q)  (\" Myriad \" or the \" Company \") is pleased to announce that it has issued 612,164 common shares of Myriad (each, a \"Share\") to FirstAmerican Energy Fuels Ltd. (the \"Optionor\") pursuant to a property option agreement dated as of January 30, 2025 (the \"Option Agreement\") with First American Uranium Inc. (CSE: URM) (\"First American\") and the Optionor respecting the Red Basin Uranium Project (the \"Project\"). The Project is comprised of 86 lode claims in the Red Basin area of the Datil Mountains - Pietown Uranium District, Catron County, New Mexico, USA, covering approximately 1,776 acres (approximately 719 hectares). (see Myriad's news release dated February 4, 2025 respecting the Option Agreement and the Project). The Shares were issued at a deemed price of approximately C$0.408 per Share, representing a value of C$250,000 according to a 10-day VWAP for the Shares contemplated by the Option Agreement. Pursuant to applicable securities laws, the Shares are subject to a four month hold period expiring June 12, 2025. Myriad's final obligation to exercise the option under the Option Agreement and earn a 100% interest in and to the Project is to conduct a geophysics survey on the Project by no later than January 30, 2026. Myriad will provide further updates respecting the Project in due course. About Myriad Uranium Corp. Myriad Uranium Corp. is a uranium exploration company with an earnable 75% interest in the Copper Mountain Uranium Project in Wyoming, USA. To date, Myriad has earned a 50% interest in Copper Mountain. Copper Mountain hosts several known uranium deposits and historical uranium mines, including the Arrowhead Mine which produced 500,000 lbs of eU3O8. Copper Mountain saw extensive drilling and development by Union Pacific during the late 1970s including the development of a mine plan to fuel a planned fleet of California Edison reactors. Operations ceased in 1980 before mining could commence due to falling uranium prices. Approximately 2,000 boreholes have been drilled at Copper Mountain and the Project Area has significant exploration upside. Union Pacific is estimated to have spent C$117 million (2024 dollars) exploring and developing Copper Mountain, generating significant historical resource estimates which are detailed here .  Myriad recently concluded a 34-hole maiden drill program in November 2024 which encountered significant high grade uranium mineralisation that exceeded expectations, provided verification of historical exploration work, and encountered mineralisation in deeper zones, which opens exciting new potential for the Copper Mountain Uranium Project.  A comprehensive news release regarding the drilling can be viewed here . A recent detailed update with Crux Investor can be viewed here .  The Company's presentation can be viewed here .  News releases regarding historical drilling can be viewed here and here . For further information, please refer to Myriad's disclosure record on SEDAR+ ( www.sedarplus.ca ), contact Myriad by telephone at +1.604.418.2877, or refer to Myriad's website at www.myriaduranium.com . Myriad Contacts: Thomas Lamb President and CEO tlamb@myriaduranium.com Forward-Looking Statements This news release contains \"forward-looking information\" that is based on the Company's current expectations, estimates, forecasts and projections. This forward-looking information includes, among other things, the Company's business, plans, outlook and business strategy. The words \"may\", \"would\", \"could\", \"should\", \"will\", \"likely\", \"expect,\" \"anticipate,\" \"intend\", \"estimate\", \"plan\", \"forecast\", \"project\" and \"believe\" or other similar words and phrases are intended to identify forward-looking information. The reader is cautioned that assumptions used in the preparation of any forward-looking information may prove to be incorrect, including with respect to the Company's business plans respecting the exploration and development of the Company's mineral properties, the proposed work program on the Company's mineral properties and the potential and economic viability of the Company's mineral properties. Forward-looking information is subject to known and unknown risks, uncertainties and other factors that may cause the Company's actual results, level of activity, performance or achievements to be materially different from those expressed or implied by such forward-looking information. Such factors include, but are not limited to: changes in economic conditions or financial markets; increases in costs; litigation; legislative, environmental and other judicial, regulatory, political and competitive developments; access to minerals where the surface rights above them have not been settled; and technological or operational difficulties. This list is not exhaustive of the factors that may affect our forward-looking information. These and other factors should be considered carefully, and readers should not place undue reliance on such forward-looking information. The Company does not intend, and expressly disclaims any intention or obligation to, update or revise any forward-looking information whether as a result of new information, future events or otherwise, except as required by applicable law. The CSE has not reviewed, approved or disapproved the contents of this news release. To view the source version of this press release, please visit https://www.newsfilecorp.com/release/240503",
    "primary_commodity": "U"
  },
  "articleProject": {
    "gid": 4242,
    "project_name": "Red Basin",
    "location": "New Mexico, United States"
  },
  "articleExchange": "CSE",
  "articleCompanyId": 1558,
  "articleTicker": "M",
  "articleCompanyName": "Myriad Uranium Corp.",
  "allOtherCompanyProjects": [
    {
      "company_id": 1558,
      "gid": 4762,
      "project_name": "Afouday",
      "location": "Niger"
    },
    {
      "company_id": 1558,
      "gid": 4764,
      "project_name": "Tagait 3",
      "location": "Niger"
    },
    {
      "company_id": 1558,
      "gid": 6029,
      "project_name": "Millen Mountain",
      "location": "Nova Scotia, Canada"
    },
    {
      "company_id": 1558,
      "gid": 4761,
      "project_name": "Agebout",
      "location": "Niger"
    },
    {
      "company_id": 1558,
      "gid": 4763,
      "project_name": "Tagait 2",
      "location": "Niger"
    },
    {
      "company_id": 1558,
      "gid": 6775,
      "project_name": "Bonanza-Kermac",
      "location": "Wyoming, United States"
    },
    {
      "company_id": 1558,
      "gid": 6421,
      "project_name": "Knob Claims",
      "location": "Wyoming, United States"
    }
  ],
  "allOtherCompanyNews": [
    {
      "id": 107877,
      "company_id": 1558,
      "title": "Myriad Uranium Announces Private Placement",
      "link": null,
      "date": "2025-06-12T21:25:00.000Z",
      "hidden": false
    },
    {
      "id": 107652,
      "company_id": 1558,
      "title": "Myriad Uranium Reports Final Chemical Assays from Copper Mountain. Grades Up to 60% Higher Than Probe Equivalents, with Positive Implications for Scale and Scope of the Project. Plan of Operations Application Submitted to Drill High Priority Prospects",
      "link": null,
      "date": "2025-06-11T11:30:00.000Z",
      "hidden": false
    },
    {
      "id": 105552,
      "company_id": 1558,
      "title": "Myriad Uranium Corp. Announces Extension of Warrants",
      "link": null,
      "date": "2025-05-22T20:44:00.000Z",
      "hidden": false
    },
    {
      "id": 103827,
      "company_id": 1558,
      "title": "Myriad Uranium Expands its New Mexico Land Position, Now Controls Significant High Grade Historical Resources and Vast Majority of Historical Boreholes at Red Basin",
      "link": null,
      "date": "2025-05-07T11:30:00.000Z",
      "hidden": false
    },
    {
      "id": 102155,
      "company_id": 1558,
      "title": "Myriad Uranium Reports Chemical Assays from Eight More Boreholes at Copper Mountain. Assays Continue to Be up to 50% Higher than Probe Grades Previously Reported.",
      "link": null,
      "date": "2025-04-29T11:30:00.000Z",
      "hidden": false
    },
    {
      "id": 98301,
      "company_id": 1558,
      "title": "Myriad Uranium Appoints Eduards Smirnovs as Industry Advisor",
      "link": null,
      "date": "2025-04-01T11:30:00.000Z",
      "hidden": false
    },
    {
      "id": 91528,
      "company_id": 1558,
      "title": "Myriad Uranium Reports Chemical Assays on 20 Copper Mountain Boreholes. Confirmed U3O8 Grades Are 20% Higher on Average than Previously Reported Gamma Grades. Assays also Reveal the Presence of Extensive Uranium Mineralisation That Could Not Be Detected by the Probe, with Potential Positive Implications for Historical Estimates. Large Number of Additional Intervals to Be Sent for Assay",
      "link": null,
      "date": "2025-03-17T11:30:00.000Z",
      "hidden": false
    },
    {
      "id": 87551,
      "company_id": 1558,
      "title": "Myriad Uranium Issues Shares under Option to Acquire 100% of the Red Basin Uranium Project in New Mexico, USA",
      "link": "https://www.newsfilecorp.com/release/240503/Myriad-Uranium-Issues-Shares-under-Option-to-Acquire-100-of-the-Red-Basin-Uranium-Project-in-New-Mexico-USA",
      "date": "2025-02-12T00:21:00.000Z",
      "hidden": false
    },
    {
      "id": 86759,
      "company_id": 1558,
      "title": "Myriad Uranium Enters into Option to Acquire 100% of the Red Basin Uranium Project in New Mexico, USA",
      "link": "https://www.newsfilecorp.com/release/239518/Myriad-Uranium-Enters-into-Option-to-Acquire-100-of-the-Red-Basin-Uranium-Project-in-New-Mexico-USA",
      "date": "2025-02-04T12:30:00.000Z",
      "hidden": false
    },
    {
      "id": 85660,
      "company_id": 1558,
      "title": "Myriad Uranium Grants Stock Options and RSUs",
      "link": "https://www.newsfilecorp.com/release/238802/Myriad-Uranium-Grants-Stock-Options-and-RSUs",
      "date": "2025-01-29T12:30:00.000Z",
      "hidden": false
    }
  ]
}