{
  "article": {
    "id": 43393,
    "link": "https://www.accesswire.com/viewarticle.aspx?id=798251&lang=en",
    "title": "Lahontan Expands Santa Fe Mine Land Package by Almost 40% to Over 26.4 KM(2)",
    "description": "<p><strong>TORONTO, ON / ACCESSWIRE / November 1, 2023 / Lahontan Gold Corp (TSXV:LG)(OTCQB:LGCXF) </strong>(the &quot;<strong>Company</strong>&quot; or &quot;<strong>Lahontan</strong>&quot;), a fully financed mine development and mineral exploration company, is pleased to announce that it has significantly expanded its land holdings at its flagship Santa Fe Mine project by staking 98 unpatented lode mining claims covering over 7.5 km<sup>2</sup>. The newly staked claims cover possible extensions to the Slab gold and silver resources*, other exploration targets covered by young gravel, and a vast area of flat terrain that could be suitable for mine infrastructure such as heap leach pads and waste rock dumps (please see map below).</p><p>Kimberly Ann, Lahontan Founder, CEO, President, and Director commented: &quot;The opportunistic staking of these claims gives Lahontan needed space for future mine infrastructure as well as covering logical extensions of known gold and silver mineralization in the Slab-Calvada area. While other companies are struggling under the current market conditions, Lahontan is fully financed and taking advantage of opportunities to grow our projects when the situation presents itself. The Santa Fe Mine now covers over 26.4 km<sup>2</sup> adding to the 64.1 km<sup>2</sup> the Company controls in Nevada's prolific Walker Lane. Lahontan will continue preparing its West Santa Fe project for drilling in 2024, completing its Plan of Operation for the Santa Fe Mine, and targeting a PEA for Santa Fe in 2024&quot;.</p><div><figure class=\"image\" style=\"display:table;text-align:center;margin:0.9em auto;\" width=\"100%\"><img src=\"https://www.accesswire.com/users/newswire/images/798251/picture1-1.png\" width=\"100%\" /><figcaption style=\"display:table-caption;caption-side:bottom\">Newly staked unpatented lode mining claims at Lahontan Gold's Santa Fe Mine project, Mineral County, Nevada. The 98 new claims total 7.5 km<sup>2</sup> and cover potential extensions to gold and silver resources in the Slab-Calvada area as well as flat terrain suitable for future mine infrastructure.</figcaption></figure></div><p><i><strong>About Lahontan Gold Corp.</strong></i></p><p>Lahontan Gold Corp. is a fully financed Canadian mine development and mineral exploration company that holds, through its US subsidiaries, four top-tier gold and silver exploration properties in the Walker Lane of mining friendly Nevada. Lahontan's flagship property, the 26.4 km<sup>2</sup> Santa Fe Mine, had past production of 345,000 ounces of gold and 711,000 ounces of silver between 1988 and 1995 from open pit mines utilizing heap-leach processing (Nevada Bureau of Mines and Geology, 1995). The Santa Fe Mine has Canadian National Instrument 43-101 compliant Indicated Mineral Resource of 1,112,000 oz Au Eq<i> </i>(grading 1.14 g/t Au Eq) and an Inferred Mineral Resource of 544,000 oz Au Eq (grading 1.00 g/t Au Eq), all pit constrained (Au Eq is inclusive of recovery, please see Santa Fe Project Technical Report*). The Company will continue to aggressively explore Santa Fe during 2023 and begin the process of evaluating development scenarios to bring the Santa Fe Mine back into production. Anthony Gesualdo, CPG, Consulting Geologist to Lahontan Gold Corp., is the Qualified Person for the Company and approved the technical content of this news release. For more information, please visit our website: <a href=\"https://pr.report/BHsPV8xJ\">www.lahontangoldcorp.com</a></p><p>* Please see the Santa Fe Project Technical Report, Authors: Trevor Rabb and Darcy Baker, P. Geos. Effective Date: December 7, 2022, Report Date: March 2, 2023. The Technical Report is available on the Company's website and SEDAR.</p><p style=\"text-align:center;\"><strong>On behalf of the Board of Directors</strong></p><p style=\"text-align:center;\"><strong>Kimberly Ann</strong><br /><strong>Founder, CEO, President, and Director</strong></p><p style=\"text-align:center;\"><strong>FOR FURTHER INFORMATION, PLEASE CONTACT:</strong></p><p style=\"text-align:center;\"><strong>Lahontan Gold Corp.</strong><br /><strong>Kimberly Ann</strong><br /><strong>Founder, Chief Executive Officer, President, Director</strong></p><p style=\"text-align:center;\">Phone: 1-530-414-4400<br />Email: <a href=\"mailto:Kimberly.ann@lahontangoldcorp.com\">Kimberly.ann@lahontangoldcorp.com</a> <br />Website: <a href=\"https://pr.report/GBzAxPsK\">www.lahontangoldcorp.com</a></p><p><strong>Cautionary Note Regarding Forward-Looking Statements:</strong></p><p><i>Neither TSX Venture Exchange nor its Regulation Services Provider (as that term is defined in policies of the TSX Venture Exchange) accepts responsibility for the adequacy or accuracy of this release. Except for statements of historical fact, this news release contains certain &quot;forward-looking information&quot; within the meaning of applicable securities law. Forward-looking information is frequently characterized by words such as &quot;plan&quot;, &quot;expect&quot;, &quot;project&quot;, &quot;intend&quot;, &quot;believe&quot;, &quot;anticipate&quot;, &quot;estimate&quot; and other similar words, or statements that certain events or conditions &quot;may&quot; or &quot;will&quot; occur. Forward-looking statements are based on the opinions and estimates at the date the statements are made and are subject to a variety of risks and uncertainties and other factors that could cause actual events or results to differ materially from those anticipated in the forward-looking statements including, but not limited to delays or uncertainties with regulatory approvals, including that of the TSXV. There are uncertainties inherent in forward-looking information, including factors beyond the Company's control. The Company undertakes no obligation to update forward-looking information if circumstances or management's estimates or opinions should change except as required by law. The reader is cautioned not to place undue reliance on forward-looking statements. Additional information identifying risks and uncertainties that could affect financial results is contained in the Company's filings with Canadian securities regulators, which filings are available at </i><a href=\"https://pr.report/pUFbh5nO\"><i>www.sedar.com</i></a></p><p><strong>SOURCE:</strong> Lahontan Gold Corp.</p><br><br>View source version on accesswire.com: <br><a href='https://www.accesswire.com/798251/lahontan-expands-santa-fe-mine-land-package-by-almost-40-to-over-264-km2'>https://www.accesswire.com/798251/lahontan-expands-santa-fe-mine-land-package-by-almost-40-to-over-264-km2</a><br><br>",
    "search_terms": "Santa Fe,Lahontan Gold Corp.,LG",
    "master_gid": 2908,
    "date": "2023-11-01T11:30:00.000Z",
    "tags": "|||Gold,Silver|Project Acquisition",
    "image_id": null,
    "hidden": false,
    "company_id": 1952,
    "provider": "accesswire",
    "excerpt": "TORONTO, ON / ACCESSWIRE / November 1, 2023 / Lahontan Gold Corp (TSXV:LG)(OTCQB:LGCXF)(the &quot;Company&quot; or &quot;Lahontan&quot;), a fully financed mine development and mineral exploration company, is pleased to announce that it has significantly expanded its land holdings at its flagship Santa Fe Mine project by staking 98 unpatented lode mining",
    "is_regulatory": false,
    "refined_tags": [
      "Project Acquisition"
    ],
    "ftp_filename": null,
    "company_name": "Lahontan Gold Corp.",
    "exchange": "TSXV",
    "root_ticker": "LG",
    "project_name": "Santa Fe",
    "gid": 2908,
    "location": "Nevada, United States",
    "plan_id": null,
    "description_text": "TORONTO, ON / ACCESSWIRE / November 1, 2023 / Lahontan Gold Corp (TSXV:LG)(OTCQB:LGCXF) (the \" Company \" or \" Lahontan \"), a fully financed mine development and mineral exploration company, is pleased to announce that it has significantly expanded its land holdings at its flagship Santa Fe Mine project by staking 98 unpatented lode mining claims covering over 7.5 km 2 . The newly staked claims cover possible extensions to the Slab gold and silver resources*, other exploration targets covered by young gravel, and a vast area of flat terrain that could be suitable for mine infrastructure such as heap leach pads and waste rock dumps (please see map below). Kimberly Ann, Lahontan Founder, CEO, President, and Director commented: \"The opportunistic staking of these claims gives Lahontan needed space for future mine infrastructure as well as covering logical extensions of known gold and silver mineralization in the Slab-Calvada area. While other companies are struggling under the current market conditions, Lahontan is fully financed and taking advantage of opportunities to grow our projects when the situation presents itself. The Santa Fe Mine now covers over 26.4 km 2 adding to the 64.1 km 2 the Company controls in Nevada's prolific Walker Lane. Lahontan will continue preparing its West Santa Fe project for drilling in 2024, completing its Plan of Operation for the Santa Fe Mine, and targeting a PEA for Santa Fe in 2024\". Newly staked unpatented lode mining claims at Lahontan Gold's Santa Fe Mine project, Mineral County, Nevada. The 98 new claims total 7.5 km 2 and cover potential extensions to gold and silver resources in the Slab-Calvada area as well as flat terrain suitable for future mine infrastructure. About Lahontan Gold Corp. Lahontan Gold Corp. is a fully financed Canadian mine development and mineral exploration company that holds, through its US subsidiaries, four top-tier gold and silver exploration properties in the Walker Lane of mining friendly Nevada. Lahontan's flagship property, the 26.4 km 2 Santa Fe Mine, had past production of 345,000 ounces of gold and 711,000 ounces of silver between 1988 and 1995 from open pit mines utilizing heap-leach processing (Nevada Bureau of Mines and Geology, 1995). The Santa Fe Mine has Canadian National Instrument 43-101 compliant Indicated Mineral Resource of 1,112,000 oz Au Eq (grading 1.14 g/t Au Eq) and an Inferred Mineral Resource of 544,000 oz Au Eq (grading 1.00 g/t Au Eq), all pit constrained (Au Eq is inclusive of recovery, please see Santa Fe Project Technical Report*). The Company will continue to aggressively explore Santa Fe during 2023 and begin the process of evaluating development scenarios to bring the Santa Fe Mine back into production. Anthony Gesualdo, CPG, Consulting Geologist to Lahontan Gold Corp., is the Qualified Person for the Company and approved the technical content of this news release. For more information, please visit our website: www.lahontangoldcorp.com * Please see the Santa Fe Project Technical Report, Authors: Trevor Rabb and Darcy Baker, P. Geos. Effective Date: December 7, 2022, Report Date: March 2, 2023. The Technical Report is available on the Company's website and SEDAR. On behalf of the Board of Directors Kimberly Ann Founder, CEO, President, and Director FOR FURTHER INFORMATION, PLEASE CONTACT: Lahontan Gold Corp. Kimberly Ann Founder, Chief Executive Officer, President, Director Phone: 1-530-414-4400 Email: Kimberly.ann@lahontangoldcorp.com Website: www.lahontangoldcorp.com Cautionary Note Regarding Forward-Looking Statements: Neither TSX Venture Exchange nor its Regulation Services Provider (as that term is defined in policies of the TSX Venture Exchange) accepts responsibility for the adequacy or accuracy of this release. Except for statements of historical fact, this news release contains certain \"forward-looking information\" within the meaning of applicable securities law. Forward-looking information is frequently characterized by words such as \"plan\", \"expect\", \"project\", \"intend\", \"believe\", \"anticipate\", \"estimate\" and other similar words, or statements that certain events or conditions \"may\" or \"will\" occur. Forward-looking statements are based on the opinions and estimates at the date the statements are made and are subject to a variety of risks and uncertainties and other factors that could cause actual events or results to differ materially from those anticipated in the forward-looking statements including, but not limited to delays or uncertainties with regulatory approvals, including that of the TSXV. There are uncertainties inherent in forward-looking information, including factors beyond the Company's control. The Company undertakes no obligation to update forward-looking information if circumstances or management's estimates or opinions should change except as required by law. The reader is cautioned not to place undue reliance on forward-looking statements. Additional information identifying risks and uncertainties that could affect financial results is contained in the Company's filings with Canadian securities regulators, which filings are available at www.sedar.com SOURCE: Lahontan Gold Corp. View source version on accesswire.com: https://www.accesswire.com/798251/lahontan-expands-santa-fe-mine-land-package-by-almost-40-to-over-264-km2",
    "primary_commodity": "Au"
  },
  "articleProject": {
    "gid": 2908,
    "project_name": "Santa Fe",
    "location": "Nevada, United States"
  },
  "articleExchange": "TSXV",
  "articleCompanyId": 1952,
  "articleTicker": "LG",
  "articleCompanyName": "Lahontan Gold Corp.",
  "allOtherCompanyProjects": [
    {
      "company_id": 1952,
      "gid": 4657,
      "project_name": "West Santa Fe",
      "location": "Nevada, United States"
    },
    {
      "company_id": 1952,
      "gid": 3234,
      "project_name": "Redlich",
      "location": "Nevada, United States"
    },
    {
      "company_id": 1952,
      "gid": 2908,
      "project_name": "Santa Fe",
      "location": "Nevada, United States"
    },
    {
      "company_id": 1952,
      "gid": 3233,
      "project_name": "Moho (Excalibur)",
      "location": "Nevada, United States"
    }
  ],
  "allOtherCompanyNews": [
    {
      "id": 107293,
      "company_id": 1952,
      "title": "Lahontan Receives BLM Approval for Additional Santa Fe Drilling",
      "link": null,
      "date": "2025-06-09T11:00:00.000Z",
      "hidden": false
    },
    {
      "id": 106522,
      "company_id": 1952,
      "title": "Lahontan Mobilizes Drill Rig to Santa Fe",
      "link": null,
      "date": "2025-06-02T11:00:00.000Z",
      "hidden": false
    },
    {
      "id": 106071,
      "company_id": 1952,
      "title": "IBN Initiates Coverage of Lahontan Gold Corp.",
      "link": null,
      "date": "2025-05-28T12:30:00.000Z",
      "hidden": false
    },
    {
      "id": 103636,
      "company_id": 1952,
      "title": "Lahontan Submits Notice of Intent for Additional Drilling at Santa Fe",
      "link": null,
      "date": "2025-05-06T11:30:00.000Z",
      "hidden": false
    },
    {
      "id": 102869,
      "company_id": 1952,
      "title": "Lahontan Announces Closing of Upsized Private Placement of Units and Welcomes New Institutional Investor",
      "link": null,
      "date": "2025-04-30T21:00:00.000Z",
      "hidden": false
    },
    {
      "id": 100469,
      "company_id": 1952,
      "title": "Lahontan Announces Upsize to Private Placement of Units",
      "link": null,
      "date": "2025-04-22T21:15:00.000Z",
      "hidden": false
    },
    {
      "id": -189382,
      "company_id": 1952,
      "title": "Canadian Investment Regulatory Organization Trade Resumption - LG",
      "link": "https://contentapi.cision.com/api/v1.0/releases/20250408C6599",
      "date": "2025-04-08T13:25:00.000Z",
      "hidden": false
    },
    {
      "id": 99026,
      "company_id": 1952,
      "title": "Lahontan Announces Private Placement of Units",
      "link": null,
      "date": "2025-04-08T12:55:00.000Z",
      "hidden": false
    },
    {
      "id": -189375,
      "company_id": 1952,
      "title": "Canadian Investment Regulatory Organization Trading Halt - LG",
      "link": "https://contentapi.cision.com/api/v1.0/releases/20250408C8310",
      "date": "2025-04-08T12:52:00.000Z",
      "hidden": false
    },
    {
      "id": 98894,
      "company_id": 1952,
      "title": "Lahontan Revamps Board Of Directors",
      "link": null,
      "date": "2025-04-07T14:10:00.000Z",
      "hidden": false
    }
  ]
}
