{
  "article": {
    "id": 90747,
    "link": "https://clients3.weblink.com.au/Clients/JuniorMining/headline.aspx?id=61255191",
    "title": "Pine Ridge Project Acquisition Presentation",
    "description": "4 Global Uranium 74 and Enrichment al i me - i 3 ' American Uranium Acquisition 4 $) A a q \" § Pine Ridge Project ' Powder River Basin, Wyoming ) ge. = . N\\ . ASX:GUE OTCQB:GUELF 1 F March 2025 Py of Hi Pt for release to US wire services or distribution in the United States  Disclaimer This presentation provides a summary description of Global Uranium and Enrichment Ltd (‘GUE) (‘Company’) and Snow Lake. (“Snow Lake?) In particular, there is a risk that the Company will not be able to expand or upgrade its existing JORC resource. The performance and (together the “Parties”, and, each, a any), each of their respective businesses and the joint venture by which GUE forming a joint venture operations of the Company may be influenced by a number of factors, many of which are outside the control of the Company. No With Sow Lake (the ~Join Venture Entity\") with to acquire the pine Ridge Uranium Project {the ~Transaction). GUE does not ond wil not have representation or warranty, sxpress or implied, s made by the Gormpany, or any of its directors officers, employees, advisers or agents that any interest in Sow Lake ‘of 5 businecass or seers until auch ime as f hs completed tne Tanagekon, Thers no guarantee that dhe. ary mentions, sxpectations of plans will be achieved afar totally or parily o that any particu ate of tur wil be Gohioved. Given fhe Transaction wil ba completa on the torma as set out herein o at al. Tis an Uncertainties that may cause the Company's actual futire results, performand.or achievements to be matsrialy diferent form Those expected, planner of intehdech recipients shoud not place Undue recht on thess Intsndons, expectation, ers pcs setegy and This presentation prepared by the Company does not purport to contain al the information that a prospective investor may require In prospects The Company does not wWarTant of represent tha the actual resus, performance or achievements wil be as expected, planned of Conriection with ay potential FWestTent In the Company. Yed Should not treat the contents of this presentation, o any Information provided Intended. Thess onward-Iooking statements are expressed In good fath and! eleved to hive & redsenabie basis. These Statements reflect in connection wih as financial acide, financial product advice or Gcvics relating to legal taxation of mvestment matters. No representation Curent expectations, ntantions-or stregies 16gorcing he fLture and assumptions based on currently avaliable information. Should one of or warranty, express of Implied, Is made ds to the faiimess, GecLracY, compblaness or correctness of the formation, apinions Gnd more risks or Uncertainties matanalse, or Showed Underlying Gssumptions prove Incorfect, actual fess may vary rom The expectation, Conchieions contain in th prssentation. Ti presentation « provided Sxpraviy on the back that you wil Camry GUE your own dependent intentions and suctegies dsecrioed in i GMnoUNCmaNt. THe fonwerd-ooking statements are made Gs dt the date of the announcement inquires Into the matters contained in the presentation ancl Make your own Independent decisions about he aftr, nancial postion or and the Company dlsckaims any intent or obligation 10 update publicly SUG forward looking statements, whether os he. rast of new Prospects of the Company. The Company fesenies the IGhE to Update, Gand of Superaent the Information at any thre In fs abschte Information, urure events of ORLS o GXherwise, discretion (without incurring any obligation to do 50). To the maximum extent permitted by law, none of the Company its directors, employees or agents, visers, nor any other person acoeprs ary iabity, cluding, What imitation, ny lablty arising rom 4UR of neQigencs on the ) part of any of them or any other person, for any loss arising from the use of this presentation or its contents or otherwise arising in connection ~~ COMPpetent Person's Statement wit it. Tis presentation is not cn offer, invitation, soifttion o cther recommendation with respect to the subscription for pUTChase of Sal Of 1, nformaron in this report that specifically relates to Exploration Results and Exploration Target af the Pine Ridge Project is based on Y Ye Pr ything Y information compiled by Mr Christopher McDowell. Mr McDowell is a Registered Member of the Society of Mining, Metallurgy and Exploration tan offer (Member No. 4311521). Mr McDowell is a professional geologist employed by independent consultant WWC Engineering, which provides services 1016 Company on a contractual basi. Mr McDowell nes suflent experience which is relevant to the silo of nneraksation and &pe of This document is not, and does not constitute, an offer to sell, or the solicitation, invitation or recommendation of an offer to buy, any securities deposit under consideration and to the activity which he is undertaking as a Competent Person as defined in the 2012 Edition of the in any jurisdiction, including the United States, where it would be illegal and neither this document, nor any of the information contained herein, ‘Australasian Code for Reporting of Exploration Results, Mineral Resources and Ore Reserves’. Mr. McDowell consents to the inclusion in the shall form the basis of any contract or commitment. In particular, this presentation may not be released to US wire services or distributed announcement of the matters based on his information in the form and context in which it appears. Mr. McDowell doesn't hold securities in the shal Tor the base of any Company. Refer to ASK announcement dated 12 March 2025 fo ful datas incluing JORG oTmation. The Company confirms that ts not vito of Gy new nforrion of data that materkly afects the Information Inchiced In the original market annouerment This announcement has been prepared fo publication in Australia and may not be released to US wire services of cltrbuted in the Urited States. This announcement does not constitute an offer to sell, or a solicitation of an offer to buy, securities in the United States or any other Information on the Mineral Resources presented on the Tallahassee Uranium Project, together with JORC Table 1 information, is contained in jurisdiction. Any securities described in this announcement have not been, and will not be, registered under the US Securities Act of 1833 and the ASX announcement dated 7 April 2022 and 5 September 2024. Where the Company refers to Mineral Resources in this announcement may not be offered or sold in the United States except in transactions exempt from, or not subject to, the registration requirements of the Us (referencing previous releases made to the ASX), it confirms that it is not aware of any new information or data that materially affects the may hot bo offered of sokd in ihe United States exco information Wcluded In that announcement andl all mateal assumptions and technical parameters underpinning the Minerdl Resource estimate with thot announcement continue to Gppy Gna have not materially changed. The Gompany confirms that the form and context in The distribution of this document in other jurisdictions outside Australia may cso be restricted by law and any such restrictions should be Which the Competent Persons findings are presented have not materially changed from the original announcement Cbesrved Any fale to comply with such resrctions may consitte a violation of GppIable secures knwe, By GCoopting tis document, you Tepresent and warrant that yal, are entitled to receive su2h presentation in Gocordance with the above restrictions and ogres to b6 bound by Refer to the Company's ASX announcement dated 22 & 30 May 2024 and 5 & 19 June 2024 for the ful diiling resus on the Hansen deposit at represent and warrant that you ars entitled to receive such presentation in dccordane with the above restrict The Talldhasses Uranium Project. The Company confirms that I 1s not aware of any new Information or data that material afiects the Information included in the orignal market announcements dated above, Forward Looking statements Refer to the Company's ASX announcement dated 28 August 2024, 24 September 2024, 9 October 2024 and 22 October 2024 for the full drilling This presentation may contain forward looking statements that are subject to risk factors associated with mineral exploration, mining and fesults on the Maybell Uranium Project. The Company confirms that itis not aware of any new information or data that materially affects the production businesses. tis believed that the expectations reflected in these statements are reasonable but they may be affected by a variety information included in the original market announcement Cf variables and changes In underlying Gssamptens wish couKd ace actual results o rons to elffer materoly, ineucing but not Irted to price fluctuations, actual demand, currency fluctuations, driling and production results, reserve estimations, loss of market, industry Refer to the Company's ASX announcement dated © November 202 titled “Okapi to acquire High-Grade Uranium Assets ~ Athabasca Basin competition, environmental risks, physical risks, legislative, fiscal and regulatory changes, economic and financial market conditions in various for the JORC details of the Athabasca Projects and other historical information. The Company confirms that it is not aware of any new Countries and regions, political risks, project delay or advancement, approvals and cost estimates. This presentation also contains reference to information or data that materially affects the information included in the original market announcement of 9 November 202. Certain intentions, expectations, furs plans, sictegy and prospects of the Company. Those Intentions, expectations, furs plans, strategy and prospects may or may not be achieved. They are based on certain assumptions, which may not be met or on which views may differ and ~~ Refer to the Company's ASX announcement dated 15 December 2023 titled \"High Grade Exploration Target at Maybell Project” for the fd gdb ied exploration target anc JORC detals the JORG. tables | and 3. The Company confirms that i 1 nat aware of any now iiormation or data that terial cfock the formation included i the origin market announcement of 15 Deceiver 2023 “% Global Uranium Powering nuclear energy’s global resurgence. | 2 7 and Enrichment",
    "search_terms": "Pine Ridge,Global Uranium And Enrichment Ltd,GUE",
    "master_gid": 9990,
    "date": "2025-03-11T23:11:38.000Z",
    "tags": "Australia,USA|Wyoming||Uranium|Project Acquisition",
    "image_id": null,
    "hidden": false,
    "company_id": 4050,
    "provider": "ASX",
    "excerpt": "Global Uranium And Enrichment Ltd (ASX:GUE)",
    "is_regulatory": false,
    "refined_tags": [
      "Joint Venture",
      "Financials",
      "Production Results",
      "Resource Estimate",
      "Project Update",
      "Metallurgy"
    ],
    "ftp_filename": null,
    "company_name": "Global Uranium And Enrichment Ltd",
    "exchange": "ASX",
    "root_ticker": "GUE",
    "project_name": "Pine Ridge",
    "gid": 9990,
    "location": "Wyoming, United States",
    "plan_id": null,
    "description_text": "4 Global Uranium 74 and Enrichment al i me - i 3 ' American Uranium Acquisition 4 $) A a q \" § Pine Ridge Project ' Powder River Basin, Wyoming ) ge. = . N\\ . ASX:GUE OTCQB:GUELF 1 F March 2025 Py of Hi Pt for release to US wire services or distribution in the United States  Disclaimer This presentation provides a summary description of Global Uranium and Enrichment Ltd (‘GUE) (‘Company’) and Snow Lake. (“Snow Lake?) In particular, there is a risk that the Company will not be able to expand or upgrade its existing JORC resource. The performance and (together the “Parties”, and, each, a any), each of their respective businesses and the joint venture by which GUE forming a joint venture operations of the Company may be influenced by a number of factors, many of which are outside the control of the Company. No With Sow Lake (the ~Join Venture Entity\") with to acquire the pine Ridge Uranium Project {the ~Transaction). GUE does not ond wil not have representation or warranty, sxpress or implied, s made by the Gormpany, or any of its directors officers, employees, advisers or agents that any interest in Sow Lake ‘of 5 businecass or seers until auch ime as f hs completed tne Tanagekon, Thers no guarantee that dhe. ary mentions, sxpectations of plans will be achieved afar totally or parily o that any particu ate of tur wil be Gohioved. Given fhe Transaction wil ba completa on the torma as set out herein o at al. Tis an Uncertainties that may cause the Company's actual futire results, performand.or achievements to be matsrialy diferent form Those expected, planner of intehdech recipients shoud not place Undue recht on thess Intsndons, expectation, ers pcs setegy and This presentation prepared by the Company does not purport to contain al the information that a prospective investor may require In prospects The Company does not wWarTant of represent tha the actual resus, performance or achievements wil be as expected, planned of Conriection with ay potential FWestTent In the Company. Yed Should not treat the contents of this presentation, o any Information provided Intended. Thess onward-Iooking statements are expressed In good fath and! eleved to hive & redsenabie basis. These Statements reflect in connection wih as financial acide, financial product advice or Gcvics relating to legal taxation of mvestment matters. No representation Curent expectations, ntantions-or stregies 16gorcing he fLture and assumptions based on currently avaliable information. Should one of or warranty, express of Implied, Is made ds to the faiimess, GecLracY, compblaness or correctness of the formation, apinions Gnd more risks or Uncertainties matanalse, or Showed Underlying Gssumptions prove Incorfect, actual fess may vary rom The expectation, Conchieions contain in th prssentation. Ti presentation « provided Sxpraviy on the back that you wil Camry GUE your own dependent intentions and suctegies dsecrioed in i GMnoUNCmaNt. THe fonwerd-ooking statements are made Gs dt the date of the announcement inquires Into the matters contained in the presentation ancl Make your own Independent decisions about he aftr, nancial postion or and the Company dlsckaims any intent or obligation 10 update publicly SUG forward looking statements, whether os he. rast of new Prospects of the Company. The Company fesenies the IGhE to Update, Gand of Superaent the Information at any thre In fs abschte Information, urure events of ORLS o GXherwise, discretion (without incurring any obligation to do 50). To the maximum extent permitted by law, none of the Company its directors, employees or agents, visers, nor any other person acoeprs ary iabity, cluding, What imitation, ny lablty arising rom 4UR of neQigencs on the ) part of any of them or any other person, for any loss arising from the use of this presentation or its contents or otherwise arising in connection ~~ COMPpetent Person's Statement wit it. Tis presentation is not cn offer, invitation, soifttion o cther recommendation with respect to the subscription for pUTChase of Sal Of 1, nformaron in this report that specifically relates to Exploration Results and Exploration Target af the Pine Ridge Project is based on Y Ye Pr ything Y information compiled by Mr Christopher McDowell. Mr McDowell is a Registered Member of the Society of Mining, Metallurgy and Exploration tan offer (Member No. 4311521). Mr McDowell is a professional geologist employed by independent consultant WWC Engineering, which provides services 1016 Company on a contractual basi. Mr McDowell nes suflent experience which is relevant to the silo of nneraksation and &pe of This document is not, and does not constitute, an offer to sell, or the solicitation, invitation or recommendation of an offer to buy, any securities deposit under consideration and to the activity which he is undertaking as a Competent Person as defined in the 2012 Edition of the in any jurisdiction, including the United States, where it would be illegal and neither this document, nor any of the information contained herein, ‘Australasian Code for Reporting of Exploration Results, Mineral Resources and Ore Reserves’. Mr. McDowell consents to the inclusion in the shall form the basis of any contract or commitment. In particular, this presentation may not be released to US wire services or distributed announcement of the matters based on his information in the form and context in which it appears. Mr. McDowell doesn't hold securities in the shal Tor the base of any Company. Refer to ASK announcement dated 12 March 2025 fo ful datas incluing JORG oTmation. The Company confirms that ts not vito of Gy new nforrion of data that materkly afects the Information Inchiced In the original market annouerment This announcement has been prepared fo publication in Australia and may not be released to US wire services of cltrbuted in the Urited States. This announcement does not constitute an offer to sell, or a solicitation of an offer to buy, securities in the United States or any other Information on the Mineral Resources presented on the Tallahassee Uranium Project, together with JORC Table 1 information, is contained in jurisdiction. Any securities described in this announcement have not been, and will not be, registered under the US Securities Act of 1833 and the ASX announcement dated 7 April 2022 and 5 September 2024. Where the Company refers to Mineral Resources in this announcement may not be offered or sold in the United States except in transactions exempt from, or not subject to, the registration requirements of the Us (referencing previous releases made to the ASX), it confirms that it is not aware of any new information or data that materially affects the may hot bo offered of sokd in ihe United States exco information Wcluded In that announcement andl all mateal assumptions and technical parameters underpinning the Minerdl Resource estimate with thot announcement continue to Gppy Gna have not materially changed. The Gompany confirms that the form and context in The distribution of this document in other jurisdictions outside Australia may cso be restricted by law and any such restrictions should be Which the Competent Persons findings are presented have not materially changed from the original announcement Cbesrved Any fale to comply with such resrctions may consitte a violation of GppIable secures knwe, By GCoopting tis document, you Tepresent and warrant that yal, are entitled to receive su2h presentation in Gocordance with the above restrictions and ogres to b6 bound by Refer to the Company's ASX announcement dated 22 & 30 May 2024 and 5 & 19 June 2024 for the ful diiling resus on the Hansen deposit at represent and warrant that you ars entitled to receive such presentation in dccordane with the above restrict The Talldhasses Uranium Project. The Company confirms that I 1s not aware of any new Information or data that material afiects the Information included in the orignal market announcements dated above, Forward Looking statements Refer to the Company's ASX announcement dated 28 August 2024, 24 September 2024, 9 October 2024 and 22 October 2024 for the full drilling This presentation may contain forward looking statements that are subject to risk factors associated with mineral exploration, mining and fesults on the Maybell Uranium Project. The Company confirms that itis not aware of any new information or data that materially affects the production businesses. tis believed that the expectations reflected in these statements are reasonable but they may be affected by a variety information included in the original market announcement Cf variables and changes In underlying Gssamptens wish couKd ace actual results o rons to elffer materoly, ineucing but not Irted to price fluctuations, actual demand, currency fluctuations, driling and production results, reserve estimations, loss of market, industry Refer to the Company's ASX announcement dated © November 202 titled “Okapi to acquire High-Grade Uranium Assets ~ Athabasca Basin competition, environmental risks, physical risks, legislative, fiscal and regulatory changes, economic and financial market conditions in various for the JORC details of the Athabasca Projects and other historical information. The Company confirms that it is not aware of any new Countries and regions, political risks, project delay or advancement, approvals and cost estimates. This presentation also contains reference to information or data that materially affects the information included in the original market announcement of 9 November 202. Certain intentions, expectations, furs plans, sictegy and prospects of the Company. Those Intentions, expectations, furs plans, strategy and prospects may or may not be achieved. They are based on certain assumptions, which may not be met or on which views may differ and ~~ Refer to the Company's ASX announcement dated 15 December 2023 titled \"High Grade Exploration Target at Maybell Project” for the fd gdb ied exploration target anc JORC detals the JORG. tables | and 3. The Company confirms that i 1 nat aware of any now iiormation or data that terial cfock the formation included i the origin market announcement of 15 Deceiver 2023 “% Global Uranium Powering nuclear energy’s global resurgence. | 2 7 and Enrichment",
    "primary_commodity": "U"
  },
  "articleProject": {
    "gid": 9990,
    "project_name": "Pine Ridge",
    "location": "Wyoming, United States"
  },
  "articleExchange": "ASX",
  "articleCompanyId": 4050,
  "articleTicker": "GUE",
  "articleCompanyName": "Global Uranium And Enrichment Ltd",
  "allOtherCompanyProjects": [
    {
      "company_id": 4050,
      "gid": 8206,
      "project_name": "Tallahassee",
      "location": null
    },
    {
      "company_id": 4050,
      "gid": 8207,
      "project_name": "High Park",
      "location": null
    },
    {
      "company_id": 4050,
      "gid": 8360,
      "project_name": "Maybell",
      "location": null
    },
    {
      "company_id": 4050,
      "gid": 9643,
      "project_name": "Middle Lake",
      "location": "Saskatchewan, Canada"
    },
    {
      "company_id": 4050,
      "gid": 9644,
      "project_name": "Newnham Lake",
      "location": "Saskatchewan, Canada"
    },
    {
      "company_id": 4050,
      "gid": 9645,
      "project_name": "Perch",
      "location": "Saskatchewan, Canada"
    },
    {
      "company_id": 4050,
      "gid": 9646,
      "project_name": "Lazy Edward Bay",
      "location": "Saskatchewan, Canada"
    },
    {
      "company_id": 4050,
      "gid": 9647,
      "project_name": "Argo",
      "location": "Saskatchewan, Canada"
    },
    {
      "company_id": 4050,
      "gid": 9648,
      "project_name": "Kelic Lake",
      "location": "Saskatchewan, Canada"
    }
  ],
  "allOtherCompanyNews": [
    {
      "id": -202750,
      "company_id": 4050,
      "title": "Section 708A Notice",
      "link": "https://clients3.weblink.com.au/Clients/JuniorMining/headline.aspx?id=61266807",
      "date": "2025-05-30T06:06:00.000Z",
      "hidden": false
    },
    {
      "id": -202747,
      "company_id": 4050,
      "title": "Application for quotation of securities - GUE",
      "link": "https://clients3.weblink.com.au/Clients/JuniorMining/headline.aspx?id=61266806",
      "date": "2025-05-30T06:04:20.000Z",
      "hidden": false
    },
    {
      "id": -200904,
      "company_id": 4050,
      "title": "Change of Director's Interest Notice",
      "link": "https://clients3.weblink.com.au/Clients/JuniorMining/headline.aspx?id=61264759",
      "date": "2025-05-15T06:56:07.000Z",
      "hidden": false
    },
    {
      "id": 104718,
      "company_id": 4050,
      "title": "Exploration Program for the Pine Ridge Uranium Project",
      "link": "https://clients3.weblink.com.au/Clients/JuniorMining/headline.aspx?id=61264695",
      "date": "2025-05-14T22:42:45.000Z",
      "hidden": false
    },
    {
      "id": 103556,
      "company_id": 4050,
      "title": "Positive Scoping Study - Tallahassee Uranium Project",
      "link": "https://clients3.weblink.com.au/Clients/JuniorMining/headline.aspx?id=61263438",
      "date": "2025-05-05T22:12:57.000Z",
      "hidden": false
    },
    {
      "id": -199042,
      "company_id": 4050,
      "title": "Urenco Invests in Ubaryon and Forms Strategic Partnership",
      "link": "https://clients3.weblink.com.au/Clients/JuniorMining/headline.aspx?id=61263234",
      "date": "2025-05-04T22:26:55.000Z",
      "hidden": false
    },
    {
      "id": 102387,
      "company_id": 4050,
      "title": "Quarterly Activities and Cashflow Report",
      "link": "https://clients3.weblink.com.au/Clients/JuniorMining/headline.aspx?id=61262376",
      "date": "2025-04-29T23:01:08.000Z",
      "hidden": false
    },
    {
      "id": 101963,
      "company_id": 4050,
      "title": "Pine Ridge Uranium Project Significantly Expanded",
      "link": "https://clients3.weblink.com.au/Clients/JuniorMining/headline.aspx?id=61261923",
      "date": "2025-04-28T22:49:57.000Z",
      "hidden": false
    },
    {
      "id": -196715,
      "company_id": 4050,
      "title": "Initial Director's Interest Notice",
      "link": "https://clients3.weblink.com.au/Clients/JuniorMining/headline.aspx?id=61261713",
      "date": "2025-04-28T05:32:47.000Z",
      "hidden": false
    },
    {
      "id": -196716,
      "company_id": 4050,
      "title": "Final Director's Interest Notice",
      "link": "https://clients3.weblink.com.au/Clients/JuniorMining/headline.aspx?id=61261712",
      "date": "2025-04-28T05:32:22.000Z",
      "hidden": false
    }
  ]
}
