{
  "article": {
    "id": 93108,
    "link": null,
    "title": "Acquisition of Pine Ridge Uranium Project in Wyoming Supports U.S. National & Energy Security Objectives",
    "description": "<p>Winnipeg, Manitoba--(Newsfile Corp. - March 31, 2025) - &#160;Snow Lake Resources Ltd., d/b/a Snow Lake Energy (NASDAQ: LITM) (\"<b>Snow Lake</b>\"), a uranium exploration and development company, announces that the 50/50 joint venture (the \"<b>Joint Venture</b>\") with Global Uranium and Enrichment Limited (\"<b>GUE</b>\") (ASX: GUE), to acquire 100% of the Pine Ridge Uranium Project (\"<b>Pine Ridge</b>\") in the Powder River Basin in Wyoming, United States, directly supports the United States' national and energy security objectives.</p><p><b>Highlights</b></p><ul style=\"list-style-type: disc;\"><li><b>U.S. National &#38; Energy Security Objectives:</b></li></ul><ul style=\"margin-left: 20px; list-style-type: disc;\"><li>Uranium supply chain vulnerabilities create national and energy security risks for the U.S.</li></ul><ul style=\"margin-left: 20px; list-style-type: disc;\"><li>The U.S. currently produces only 0.02% of global uranium production, and is therefore almost entirely dependent on foreign suppliers of uranium</li></ul><ul style=\"margin-left: 20px; list-style-type: disc;\"><li>The U.S. has only one commercially operating uranium enrichment plant, with limited capacity, resulting in reliance on foreign suppliers</li></ul><ul style=\"margin-left: 20px; list-style-type: disc;\"><li>Next generation advanced nuclear reactors will require fuel enriched to higher concentrations</li></ul><ul style=\"list-style-type: disc;\"><li><b>Pine Ridge Supports U.S. National &#38; Energy Security Objectives:  </b>The acquisition of Pine Ridge by Snow Lake and GUE directly supports U.S. national and energy security objectives by advancing a U.S. domestic uranium project of potentially significant scale through further stages of development:</li></ul><ul style=\"margin-left: 20px; list-style-type: disc;\"><li>Pine Ridge is located in Wyoming's Powder River Basin and is an advanced In-Situ Recovery (ISR) uranium project primed for rapid development</li></ul><ul style=\"margin-left: 20px; list-style-type: disc;\"><li>Wyoming is the leading uranium-producing region in the United States, supported by a favourable regulatory environment and streamlined permitting processes</li></ul><ul style=\"margin-left: 20px; list-style-type: disc;\"><li>Pine Ridge is a uranium project of potential significant scale with a large JORC 2012 exploration target.  For more information on this exploration target see GUE's ASX Announcement dated March 12, 2025</li></ul><ul style=\"margin-left: 20px;\"><li>Pine Ridge is surrounded by global-scale uranium projects held by UEC and Cameco, including Cameco's Smith Ranch Uranium Mill, which is located just 15km away, with a licensed capacity of 5.5M lbs U<sub>3</sub>O<sub>8</sub></li></ul><ul style=\"list-style-type: disc;\"><li><b>Ubaryon Next-Generation Enrichment Technology:  </b>GUE, in which Snow Lake will hold a 19.99% interest, holds a cornerstone position in Ubaryon Pty Ltd, a private Australian company, developing an innovative uranium enrichment technology:<sup>[1]</sup></li></ul><ul style=\"margin-left: 20px; list-style-type: disc;\"><li>100% ownership of an enrichment technology based on the chemical separation of naturally occurring uranium isotopes</li></ul><ul style=\"margin-left: 20px; list-style-type: disc;\"><li>Currently running a structured process to find a potential strategic partner towards securing funding for ongoing development of its business</li></ul><ul style=\"margin-left: 20px; list-style-type: disc;\"><li>Key motivation to secure a strategic partner is to enable future commercialization of the technology in one of the most highly regulated industries in the world</li></ul><ul style=\"margin-left: 20px; list-style-type: disc;\"><li>Government approval received for appropriate security approved independent experts to review the details of the technology</li></ul><p><b>CEO Remarks</b></p><p><i>\"The Trump Administration is focusing on national and energy security, and in particular the vulnerabilities of the uranium supply chain,\" </i>said Frank Wheatley, CEO of Snow Lake<i>.  \"Given the United States is largely dependent on foreign countries for it supply of uranium, the new administration is focusing its efforts on initiatives designed to expand domestic production of uranium in the United States.</i></p><p><i>With the Powder River Basin in Wyoming being one of the preeminent uranium producing regions in the United States, coupled with advanced stage of development of Pine Ridge, we strongly believe that Pine Ridge holds the potential to contribute to U.S. domestic production of uranium.</i></p><p><i>Our strategic 19.99% investment in GUE, coupled with GUE's cornerstone investment in Ubaryon, holds the potential to begin to address the lack of uranium enrichment capacity in the United States, and in particular, the production of high-assay low-enriched uranium required for the next generation of advanced nuclear reactors.\"</i></p><p><b>Uranium Supply Chain</b><sup><b>[2]</b></sup></p><p>The uranium-to-nuclear fuel supply chain in lengthy, complex and full of vulnerabilities from mine to nuclear reactor.</p><p style=\"text-indent: 5%;\"><i><b>Mining:</b></i>  Uranium is mined primarily in Kazakhstan (43%), Canada (15%), Namibia (11%), Australia (9%), Uzbekistan (7%) and Russia (5%).  The United States import 90% of its mined uranium ore requirements.</p><p style=\"text-indent: 5%;\"><i><b>Milling:</b></i>  After mining, the ore is milled into triuranium oxide (U<sub>3</sub>O<sub>8</sub>), referred to as yellow cake.  Global yellow cake production is dominated by Kazakhstan (39%), Canada (20%), Namibia (12%), Australis (9%), Uzbekistan (7%) and Russia (5%).  The United States is 95% dependent on foreign suppliers for yellow cake (U<sub>3</sub>O<sub>8</sub>).</p><p style=\"text-indent: 5%;\"><i><b>Enrichment:</b></i>  Yellow cake is then enriched, and four companies dominate this stage in the nuclear fuel cycle: Rosatom in Russia, CNNC in China, Orano in France and the Urenco Group (British - German-Dutch).  Collectively, they control 62.7% of global commercial uranium enrichment capacity.  Nearly 67% of the United States' enriched uranium needs come from foreign suppliers.</p><p style=\"text-indent: 5%;\"><i><b>United States - Uranium Mining</b></i></p><p>The United States mined 0.02% of global uranium production in 2022.  In order to achieve its objectives of energy security, feed its nuclear energy and defense agendas, and strategic stockpiles of uranium, the United States must ramp up domestic uranium production through policies such as the Trump Administration's Executive Order entitled \"<i>Immediate Measures to Increase American Mineral Production</i>\" dated March 20, 205 (the \"<b>Executive Order</b>\"), designed to support domestic U.S. uranium mining.<sup>[3]</sup></p><p> Snow Lake believes the acquisition and development of Pine Ridge together with GUE, holds the potential to add to U.S. based domestic uranium production, thereby supporting the objectives of the Executive Order.</p><p style=\"text-indent: 5%;\"><i><b>United States - Uranium Enrichment</b></i></p><p>Four non-U.S. companies control 62.7% of the world's commercial uranium enrichment capacity, ensuring tight control of this stage of the nuclear fuel cycle.  The United States has only one commercially operating uranium enrichment plant, with limited capacity, and which is owned by one of these four companies.<sup>[4]</sup></p><p style=\"text-indent: 5%;\"><i><b>Ubaryon Pty Ltd - Next-Generation Uranium Enrichment</b></i></p><p>GUE's holds a cornerstone investment (21.9%) in Ubaryon Pty Ltd, a private Australian company, developing and commercializing a unique uranium enrichment technology based on the chemical separation of naturally occurring isotopes.  This patented, next-generation enrichment technology, offers the potential for lower capital and operating costs in uranium enrichment.  Ubaryon is a member of the World Nuclear Association (WNA), the American Nuclear Society (ANS), and is registered with the U.S.'s Nuclear Energy Institute (NEI).  Ubaryon's operations are located at the Australian Nuclear Science and Technology Organization (ANSTO).<sup>[5]</sup></p><p> Snow Lake believes that as Ubaryon advances the development and commercializing of its enrichment technology, it holds the potential to begin to address the lack of uranium enrichment capacity in the U.S.</p><p><b>About Global Uranium and Enrichment Limited</b></p><p>Global Uranium and Enrichment Limited (GUE) is an Australian public listed company providing unique exposure to not only uranium exploration and development, but to the uranium enrichment space.  Amid a nuclear energy renaissance, GUE is developing a portfolio of advanced, high grade uranium assets in prolific uranium districts in the United States and Canada, and has established a cornerstone position in Ubaryon Pty Ltd, an Australian uranium enrichment technology company.</p><p>For more information on GUE, please refer to their website<sup>[6]</sup>.</p><p><b>Snow Lake Resources Ltd.</b></p><p>Snow Lake Resources Ltd., d/b/a Snow Lake Energy, is a Canadian mineral exploration company listed on (NASDAQ: LITM), with a global portfolio of clean energy mineral projects comprised of three uranium projects and two hard rock lithium projects.  The Engo Valley Uranium Project is an exploration stage project located in the Skeleton Coast of Namibia, the Black Lake Uranium Project is an exploration stage project located in the Athabasca Basin, Saskatchewan, and the Buffalo Uranium Project is an exploration stage project in Wyoming, United States.  The Shatford Lake Project is an exploration stage project located adjacent to the Tanco lithium, cesium and tantalum mine in Southern Manitoba, and the Snow Lake Lithium&#8482; Project is an exploration stage project located in the Snow Lake region of Northern Manitoba.  Learn more at <a href=\"https://api.newsfilecorp.com/redirect/jpy1VcoZaL\">www.snowlakeenergy.com</a>.</p><p><b>Forward-Looking Statements: </b> This press release contains \"forward-looking statements\" within the meaning of Section 27A of the Securities Act of 1933, Section 21E of the Securities Exchange Act of 1934 and the \"safe harbor\" provisions under the Private Securities Litigation Reform Act of 1995 that are subject to substantial risks and uncertainties.  All statements, other than statements of historical fact, contained in this press release are forward-looking statements, including without limitation statements with regard to Snow Lake Resources Ltd. We base these forward-looking statements on our expectations and projections about future events, which we derive from the information currently available to us.  Forward-looking statements contained in this press release may be identified by the use of words such as \"anticipate,\" \"believe,\" \"contemplate,\" \"could,\" \"estimate,\" \"expect,\" \"intend,\" \"seek,\" \"may,\" \"might,\" \"plan,\" \"potential,\" \"predict,\" \"project,\" \"target,\" \"aim,\" \"should,\" \"will,\" \"would,\" or the negative of these words or other similar expressions, although not all forward-looking statements contain these words.  Forward-looking statements are based on Snow Lake Resources Ltd.'s current expectations and are subject to inherent uncertainties, risks and assumptions that are difficult to predict.  Further, certain forward-looking statements are based on assumptions as to future events that may not prove to be accurate. Some of these risks and uncertainties are described more fully in the section titled \"Risk Factors\" in our registration statements and annual reports filed with the Securities and Exchange Commission.  Forward-looking statements contained in this announcement are made as of this date, and Snow Lake Resources Ltd. undertakes no duty to update such information except as required under applicable law.</p><div id=\"contactInfo\"><p><b>Contact and Information</b></p><p>Frank Wheatley, CEO</p><p><b>Investor Relations</b></p><p>Investors:<br /><a href=\"mailto:ir@snowlakelithium.com\">ir@snowlakelithium.com</a></p><p>Website:<br /><a href=\"https://api.newsfilecorp.com/redirect/v1vYRcEqam\">www.snowlakeenergy.com</a></p></div><p><b>Follow us on Social Media</b></p><p>Twitter:<br /><a href=\"https://api.newsfilecorp.com/redirect/JgrmZtGkY7\">www.twitter.com/SnowLakeEnergy</a></p><p>LinkedIn:<br /><a href=\"https://api.newsfilecorp.com/redirect/GmNJOu7gWy\">www.linkedin.com/company/snow-lake-energy</a></p><hr style=\"width: 33%; margin-left: 0px; border-top: 1px solid #000000;\" /><p><sup>[1]</sup> https://wcsecure.weblink.com.au/pdf/GUE/02912046.pdf</p><p><sup>[2]</sup> Centre for Strategic &#38; International Studies - February 5, 2025</p><p><sup>[3]</sup> <a href=\"https://api.newsfilecorp.com/redirect/QOGKrcYApp\">Immediate Measures to Increase American Mineral Production - The White House</a></p><p><sup>[4]</sup> Centre for Strategic &#38; International Studies - February 5, 2025.</p><p><sup>[5]</sup> <a href=\"https://api.newsfilecorp.com/redirect/m3ZwoIXnkM\">https://www.ubaryon.com</a></p><p><sup>[6]</sup> <a href=\"https://api.newsfilecorp.com/redirect/kO12zcD7Q4\">https://globaluranium.com.au</a></p><p id=\"corporateNewsLogoContainer\"><img src=\"https://images.newsfilecorp.com/files/9547/246709_0378c19f94504b01_logo.jpg\" id=\"corporateNewsLogo\" alt=\"Corporate Logo\" /></p><p id=\"corporateLinkBack\">To view the source version of this press release, please visit <a href=\"https://api.newsfilecorp.com/redirect/Bp8VNcYK2D\">https://www.newsfilecorp.com/release/246709</a></p><p><img src=\"https://api.newsfilecorp.com/newsinfo/246709/401\" alt=\"\" /></p>",
    "search_terms": "Pine Ridge,Snow Lake Resources Ltd,LITM",
    "master_gid": 9990,
    "date": "2025-03-31T12:30:00.000Z",
    "tags": "USA|Wyoming||Uranium|Project Acquisition,Project Update",
    "image_id": null,
    "hidden": false,
    "company_id": 2027,
    "provider": "newsfilecorp",
    "excerpt": "Winnipeg, Manitoba--(Newsfile Corp. - March 31, 2025) - Snow Lake Resources Ltd., d/b/a Snow Lake Energy (NASDAQ: LITM) (\"Snow Lake\"), a uranium exploration and development company, announces that the 50/50 joint venture (the \"Joint Venture\") with Global Uranium and Enrichment Limited (\"GUE\") (ASX: GUE), to acquire 100% of the Pine Ridge Uranium Project (\"Pine Ridge\") in the Powder River Basin in Wyoming, United States, directly supports the United States' national and energy security objectives. Highlights * U.S. National & Energy Security Objectives: * Uranium supply chain vulnerabilities create national and energy security risks for the U.S. * The U.S. currently",
    "is_regulatory": false,
    "refined_tags": [
      "Joint Venture"
    ],
    "ftp_filename": "NEWSFILE-246709-401",
    "company_name": "Global Uranium And Enrichment Ltd",
    "exchange": "Nasdaq",
    "root_ticker": "LITM",
    "project_name": "Pine Ridge",
    "gid": 9990,
    "location": "Wyoming, United States",
    "plan_id": null,
    "description_text": "Winnipeg, Manitoba--(Newsfile Corp. - March 31, 2025) -  Snow Lake Resources Ltd., d/b/a Snow Lake Energy (NASDAQ: LITM) (\" Snow Lake \"), a uranium exploration and development company, announces that the 50/50 joint venture (the \" Joint Venture \") with Global Uranium and Enrichment Limited (\" GUE \") (ASX: GUE), to acquire 100% of the Pine Ridge Uranium Project (\" Pine Ridge \") in the Powder River Basin in Wyoming, United States, directly supports the United States' national and energy security objectives. Highlights U.S. National & Energy Security Objectives: Uranium supply chain vulnerabilities create national and energy security risks for the U.S. The U.S. currently produces only 0.02% of global uranium production, and is therefore almost entirely dependent on foreign suppliers of uranium The U.S. has only one commercially operating uranium enrichment plant, with limited capacity, resulting in reliance on foreign suppliers Next generation advanced nuclear reactors will require fuel enriched to higher concentrations Pine Ridge Supports U.S. National & Energy Security Objectives: The acquisition of Pine Ridge by Snow Lake and GUE directly supports U.S. national and energy security objectives by advancing a U.S. domestic uranium project of potentially significant scale through further stages of development: Pine Ridge is located in Wyoming's Powder River Basin and is an advanced In-Situ Recovery (ISR) uranium project primed for rapid development Wyoming is the leading uranium-producing region in the United States, supported by a favourable regulatory environment and streamlined permitting processes Pine Ridge is a uranium project of potential significant scale with a large JORC 2012 exploration target.  For more information on this exploration target see GUE's ASX Announcement dated March 12, 2025 Pine Ridge is surrounded by global-scale uranium projects held by UEC and Cameco, including Cameco's Smith Ranch Uranium Mill, which is located just 15km away, with a licensed capacity of 5.5M lbs U 3 O 8 Ubaryon Next-Generation Enrichment Technology: GUE, in which Snow Lake will hold a 19.99% interest, holds a cornerstone position in Ubaryon Pty Ltd, a private Australian company, developing an innovative uranium enrichment technology: [1] 100% ownership of an enrichment technology based on the chemical separation of naturally occurring uranium isotopes Currently running a structured process to find a potential strategic partner towards securing funding for ongoing development of its business Key motivation to secure a strategic partner is to enable future commercialization of the technology in one of the most highly regulated industries in the world Government approval received for appropriate security approved independent experts to review the details of the technology CEO Remarks \"The Trump Administration is focusing on national and energy security, and in particular the vulnerabilities of the uranium supply chain,\" said Frank Wheatley, CEO of Snow Lake .  \"Given the United States is largely dependent on foreign countries for it supply of uranium, the new administration is focusing its efforts on initiatives designed to expand domestic production of uranium in the United States. With the Powder River Basin in Wyoming being one of the preeminent uranium producing regions in the United States, coupled with advanced stage of development of Pine Ridge, we strongly believe that Pine Ridge holds the potential to contribute to U.S. domestic production of uranium. Our strategic 19.99% investment in GUE, coupled with GUE's cornerstone investment in Ubaryon, holds the potential to begin to address the lack of uranium enrichment capacity in the United States, and in particular, the production of high-assay low-enriched uranium required for the next generation of advanced nuclear reactors.\" Uranium Supply Chain [2] The uranium-to-nuclear fuel supply chain in lengthy, complex and full of vulnerabilities from mine to nuclear reactor. Mining: Uranium is mined primarily in Kazakhstan (43%), Canada (15%), Namibia (11%), Australia (9%), Uzbekistan (7%) and Russia (5%).  The United States import 90% of its mined uranium ore requirements. Milling: After mining, the ore is milled into triuranium oxide (U 3 O 8 ), referred to as yellow cake.  Global yellow cake production is dominated by Kazakhstan (39%), Canada (20%), Namibia (12%), Australis (9%), Uzbekistan (7%) and Russia (5%).  The United States is 95% dependent on foreign suppliers for yellow cake (U 3 O 8 ). Enrichment: Yellow cake is then enriched, and four companies dominate this stage in the nuclear fuel cycle: Rosatom in Russia, CNNC in China, Orano in France and the Urenco Group (British - German-Dutch).  Collectively, they control 62.7% of global commercial uranium enrichment capacity.  Nearly 67% of the United States' enriched uranium needs come from foreign suppliers. United States - Uranium Mining The United States mined 0.02% of global uranium production in 2022.  In order to achieve its objectives of energy security, feed its nuclear energy and defense agendas, and strategic stockpiles of uranium, the United States must ramp up domestic uranium production through policies such as the Trump Administration's Executive Order entitled \" Immediate Measures to Increase American Mineral Production \" dated March 20, 205 (the \" Executive Order \"), designed to support domestic U.S. uranium mining. [3] Snow Lake believes the acquisition and development of Pine Ridge together with GUE, holds the potential to add to U.S. based domestic uranium production, thereby supporting the objectives of the Executive Order. United States - Uranium Enrichment Four non-U.S. companies control 62.7% of the world's commercial uranium enrichment capacity, ensuring tight control of this stage of the nuclear fuel cycle.  The United States has only one commercially operating uranium enrichment plant, with limited capacity, and which is owned by one of these four companies. [4] Ubaryon Pty Ltd - Next-Generation Uranium Enrichment GUE's holds a cornerstone investment (21.9%) in Ubaryon Pty Ltd, a private Australian company, developing and commercializing a unique uranium enrichment technology based on the chemical separation of naturally occurring isotopes.  This patented, next-generation enrichment technology, offers the potential for lower capital and operating costs in uranium enrichment.  Ubaryon is a member of the World Nuclear Association (WNA), the American Nuclear Society (ANS), and is registered with the U.S.'s Nuclear Energy Institute (NEI).  Ubaryon's operations are located at the Australian Nuclear Science and Technology Organization (ANSTO). [5] Snow Lake believes that as Ubaryon advances the development and commercializing of its enrichment technology, it holds the potential to begin to address the lack of uranium enrichment capacity in the U.S. About Global Uranium and Enrichment Limited Global Uranium and Enrichment Limited (GUE) is an Australian public listed company providing unique exposure to not only uranium exploration and development, but to the uranium enrichment space.  Amid a nuclear energy renaissance, GUE is developing a portfolio of advanced, high grade uranium assets in prolific uranium districts in the United States and Canada, and has established a cornerstone position in Ubaryon Pty Ltd, an Australian uranium enrichment technology company. For more information on GUE, please refer to their website [6] . Snow Lake Resources Ltd. Snow Lake Resources Ltd., d/b/a Snow Lake Energy, is a Canadian mineral exploration company listed on (NASDAQ: LITM), with a global portfolio of clean energy mineral projects comprised of three uranium projects and two hard rock lithium projects.  The Engo Valley Uranium Project is an exploration stage project located in the Skeleton Coast of Namibia, the Black Lake Uranium Project is an exploration stage project located in the Athabasca Basin, Saskatchewan, and the Buffalo Uranium Project is an exploration stage project in Wyoming, United States.  The Shatford Lake Project is an exploration stage project located adjacent to the Tanco lithium, cesium and tantalum mine in Southern Manitoba, and the Snow Lake Lithium™ Project is an exploration stage project located in the Snow Lake region of Northern Manitoba.  Learn more at www.snowlakeenergy.com . Forward-Looking Statements: This press release contains \"forward-looking statements\" within the meaning of Section 27A of the Securities Act of 1933, Section 21E of the Securities Exchange Act of 1934 and the \"safe harbor\" provisions under the Private Securities Litigation Reform Act of 1995 that are subject to substantial risks and uncertainties.  All statements, other than statements of historical fact, contained in this press release are forward-looking statements, including without limitation statements with regard to Snow Lake Resources Ltd. We base these forward-looking statements on our expectations and projections about future events, which we derive from the information currently available to us.  Forward-looking statements contained in this press release may be identified by the use of words such as \"anticipate,\" \"believe,\" \"contemplate,\" \"could,\" \"estimate,\" \"expect,\" \"intend,\" \"seek,\" \"may,\" \"might,\" \"plan,\" \"potential,\" \"predict,\" \"project,\" \"target,\" \"aim,\" \"should,\" \"will,\" \"would,\" or the negative of these words or other similar expressions, although not all forward-looking statements contain these words.  Forward-looking statements are based on Snow Lake Resources Ltd.'s current expectations and are subject to inherent uncertainties, risks and assumptions that are difficult to predict.  Further, certain forward-looking statements are based on assumptions as to future events that may not prove to be accurate. Some of these risks and uncertainties are described more fully in the section titled \"Risk Factors\" in our registration statements and annual reports filed with the Securities and Exchange Commission.  Forward-looking statements contained in this announcement are made as of this date, and Snow Lake Resources Ltd. undertakes no duty to update such information except as required under applicable law. Contact and Information Frank Wheatley, CEO Investor Relations Investors: ir@snowlakelithium.com Website: www.snowlakeenergy.com Follow us on Social Media Twitter: www.twitter.com/SnowLakeEnergy LinkedIn: www.linkedin.com/company/snow-lake-energy [1] https://wcsecure.weblink.com.au/pdf/GUE/02912046.pdf [2] Centre for Strategic & International Studies - February 5, 2025 [3] Immediate Measures to Increase American Mineral Production - The White House [4] Centre for Strategic & International Studies - February 5, 2025. [5] https://www.ubaryon.com [6] https://globaluranium.com.au To view the source version of this press release, please visit https://www.newsfilecorp.com/release/246709",
    "primary_commodity": "U"
  },
  "articleProject": {
    "gid": 9990,
    "project_name": "Pine Ridge",
    "location": "Wyoming, United States"
  },
  "articleExchange": "Nasdaq",
  "articleCompanyId": 2027,
  "articleTicker": "LITM",
  "articleCompanyName": "Snow Lake Resources Ltd",
  "allOtherCompanyProjects": [
    {
      "company_id": 2027,
      "gid": 9847,
      "project_name": "Buffalo ",
      "location": "Wyoming, United States"
    },
    {
      "company_id": 2027,
      "gid": 9990,
      "project_name": "Pine Ridge",
      "location": "Wyoming, United States"
    },
    {
      "company_id": 2027,
      "gid": 6352,
      "project_name": "Muskrat Dam",
      "location": "Ontario, Canada"
    },
    {
      "company_id": 2027,
      "gid": 6797,
      "project_name": "Black Lake",
      "location": "Saskatchewan, Canada"
    },
    {
      "company_id": 2027,
      "gid": 6406,
      "project_name": "Engo Valley",
      "location": "Namibia"
    },
    {
      "company_id": 2027,
      "gid": 3005,
      "project_name": "Snow Lake",
      "location": "Manitoba, Canada"
    }
  ],
  "allOtherCompanyNews": [
    {
      "id": 106079,
      "company_id": 2027,
      "title": "Snow Lake and Exodys Energy Collaborate to Support the Formation of a New Nuclear Reactor Development and Deployment Company",
      "link": null,
      "date": "2025-05-28T12:53:00.000Z",
      "hidden": false
    },
    {
      "id": 105864,
      "company_id": 2027,
      "title": "U.S. Administration's Nuclear Executive Orders",
      "link": null,
      "date": "2025-05-27T11:00:00.000Z",
      "hidden": false
    },
    {
      "id": 104751,
      "company_id": 2027,
      "title": "Exploration Program for the Flagship Pine Ridge Uranium Project In Wyoming's Prolific Powder River Basin",
      "link": null,
      "date": "2025-05-15T11:00:00.000Z",
      "hidden": false
    },
    {
      "id": 104452,
      "company_id": 2027,
      "title": "Snow Lake Secures Strategic Stake in North America's Largest Undeveloped Rare Earths Project Amid Global Supply Chain Pressures",
      "link": null,
      "date": "2025-05-13T11:00:00.000Z",
      "hidden": false
    },
    {
      "id": 104084,
      "company_id": 2027,
      "title": "Snow Lake Announces 2025 Annual General & Special Meeting Results",
      "link": null,
      "date": "2025-05-08T21:00:00.000Z",
      "hidden": false
    },
    {
      "id": -199315,
      "company_id": 2027,
      "title": "Tallahassee Uranium Project Scoping Study",
      "link": null,
      "date": "2025-05-06T11:00:00.000Z",
      "hidden": false
    },
    {
      "id": 103441,
      "company_id": 2027,
      "title": "Urenco and Ubaryon to Form Strategic Partnership",
      "link": null,
      "date": "2025-05-05T11:00:00.000Z",
      "hidden": false
    },
    {
      "id": 103151,
      "company_id": 2027,
      "title": "Snow Lake to Participate in a Virtual Critical Minerals Conference Presented by Maxim Group LLC on Tuesday, May 6th at 8:30 a.m. EST",
      "link": null,
      "date": "2025-05-01T17:00:00.000Z",
      "hidden": false
    },
    {
      "id": 102489,
      "company_id": 2027,
      "title": "Snow Lake Announces Reverse Stock Split",
      "link": null,
      "date": "2025-04-30T11:00:00.000Z",
      "hidden": false
    },
    {
      "id": 102104,
      "company_id": 2027,
      "title": "Pine Ridge Project Significantly Expanded",
      "link": null,
      "date": "2025-04-29T11:00:00.000Z",
      "hidden": false
    }
  ]
}