{
  "article": {
    "id": 88581,
    "link": "https://www.newsfilecorp.com/release/241590/Libra-Expands-Kobold-Metals-EarnIn-and-Provides-Update-on-RTO-Transaction",
    "title": "Libra Expands Kobold Metals Earn-In and Provides Update on RTO Transaction",
    "description": "<img src=\"https://api.newsfilecorp.com/newsinfo/241590/367\" id=\"367\" width=\"2\" height=\"2\" style=\"width: 1px;  height: 1px;border: 0px solid;\" /><p style=\"text-align: center;\"><font style=\"font-size: 11px;\">THIS NEWS RELEASE IS NOT FOR DISTRIBUTION TO U.S. NEWSWIRE SERVICES OR FOR DISSEMINATION IN THE UNITED STATES</font></p><p>Toronto, Ontario and Vancouver, British Columbia--(Newsfile Corp. - February 20, 2025) - Libra Lithium Corp. (&#34;<b>Libra</b>&#34;) is pleased to announce, that further to its press release dated December 2, 2024 announcing an earn-in agreement (the &#34;<b>EIA</b>&#34;) with a wholly-owned Canadian subsidiary of KoBold Metals Company (&#34;<b>KoBold</b>&#34;) to jointly explore Libra's Flanders South, Flanders North and Soules Bay-Caron (the &#34;<b>SBC Project</b>&#34;) lithium projects in Ontario, Canada (the &#34;<b>EIA Properties</b>&#34;), that Libra and KoBold have entered into an amending agreement with respect to the EIA to expand the EIA Properties to include certain additional claims recently staked by Libra that are contiguous to the SBC Project. </p><p>Libra is also pleased to announce that PowerStone Metals Corp. (CSE: PS) (&#34;<b>PowerStone</b>&#34; or the &#34;<b>Company</b>&#34;) and Libra have entered into an amending agreement to the definitive agreement dated December 31, 2024 (the &#34;<b>Definitive Agreement</b>&#34;) with respect to the reverse takeover of PowerStone by Libra (the &#34;<b>Transaction</b>&#34;) pursuant to which Libra and the Company have extended the outside date to complete the Transaction to June 30, 2025 to provide Libra and PowerStone with additional time to evaluate and consider merger and acquisition (&#34;<b>M&#38;A</b>&#34;) opportunities in the lithium and broader critical metals sector. </p><p>&#34;<i>We are pleased to have been able to secure these additional claims at the SBC Project and are encouraged to see continued interest from KoBold. We look forward to our continued collaboration with KoBold as we prepare for the next phase of exploration at the SBC Project. We would also like to thank PowerStone for patiently accommodating an extension to the Definitive Agreement, allowing for additional time to facilitate some exciting counter-cyclical M&#38;A targets we are actively evaluating</i>&#34; said Koby Kushner, CEO of Libra.</p><p>PowerStone also announces that it has adjourned its annual general and special shareholders' meeting scheduled for February 28, 2025 to May 14, 2025 for shareholders to consider and approve the Transaction, among other items, as more fully disclosed in the joint Libra-PowerStone press release dated January 2, 2025.</p><p><b>About Libra Lithium Corp.</b></p><p>Libra is a Canadian mineral exploration company focused on the discovery and development of the critical minerals necessary for the green energy transition. Libra's Flanders North, Flanders South, and Soules Bay-Caron projects in Ontario are being explored under a $33M earn-in deal with KoBold Metals Company. In addition, Libra has 100% ownership over its Toivo, Burton, Bitchu, Battery Hill and Kivinen projects in Ontario, Canada and its Nemiscau project in Quebec, Canada. The Libra team comprises a mix of seasoned executives, engineers, and geoscientists, with extensive experience in mining and mineral exploration, capital markets, asset management, energy, and First Nations engagement. In addition to Libra's lithium exploration portfolio, Libra holds 43,865,217 common shares in the capital of Athena Gold Corporation's (CSE: ATHA) (OTCQB: AHNR) (&#34;<b>Athena</b>&#34;) wholly-owned subsidiary, which subject to certain conditions, are exchangeable for no additional consideration into common shares of Athena.</p><p><b>About PowerStone Metals Corp.</b></p><p>PowerStone is a mineral exploration company focused on the identification and exploration of high-quality critical and precious metals assets, in favorable mining jurisdictions. PowerStone is a reporting issuer in the Provinces of Ontario, British Columbia and Alberta, Canada and its common shares are currently listed on the Canadian Securities Exchange. </p><p>All information contained in this news release with respect to Libra was supplied by Libra, and PowerStone and its directors and officers have relied on Libra for such information.</p><p><b>Contact Information</b></p><div id=\"contactInfo\"><table cellspacing=\"0\" cellpadding=\"0\" style=\"text-align: start; width: 100%; border-collapse: collapse;\" border=\"0\"><tbody><tr><td style=\"vertical-align: top;\">Zachary Goldenberg<br />Chief Executive Officer, PowerStone Metals Corp.<br />e: <a href=\"mailto:zach@libertyvp.co\">zach@libertyvp.co</a><br />t: 647-987-5083</td><td style=\"width: 50%; vertical-align: top;\">Koby Kushner<br />Chief Executive Officer, Libra Lithium Corp. <br />e: <a href=\"mailto:kkushner@libralithium.com\">kkushner@libralithium.com</a> <br />t: 416-846-6164</td></tr></tbody></table></div><p>&#160;</p><p><b>Cautionary Note Regarding Forward-Looking Statements</b></p><p>This news release contains forward&#8208;looking statements and forward&#8208;looking information within the meaning of applicable securities laws. These statements relate to future events or future performance. All statements other than statements of historical fact may be forward&#8208;looking statements or information. More particularly and without limitation, this news release contains forward&#8208;looking statements and information relating to the closing of the Transaction, the conditions to completing the Transaction, prospective M&#38;A activities, timing and receipt of regulatory, shareholder and exchange approvals, future plans and business objectives of the resulting public company following closing of the Transaction and other matters. The forward&#8208;looking statements and information are based on certain key expectations and assumptions made by management of the Company. As a result, there can be no assurance that the proposed Transaction or related matters will be completed as proposed or at all. Although management of the Company believe that the expectations and assumptions on which such forward-looking statements and information are based are reasonable, undue reliance should not be placed on the forward&#8208;looking statements and information since no assurance can be given that they will prove to be correct.</p><p>Forward-looking statements and information are provided for the purpose of providing information about the current expectations and plans of management of the Company relating to the future. Readers are cautioned that reliance on such statements and information may not be appropriate for other purposes, such as making investment decisions. Since forward&#8208;looking statements and information address future events and conditions, by their very nature they involve inherent risks and uncertainties. Actual results could differ materially from those currently anticipated due to a number of factors and risks. These include, but are not limited to, the Company's ability to continue operations if the Transaction is not completed, the Company's ability to raise further capital upon terms acceptable to the Company or at all, the Company's ability to obtain regulatory, shareholder and exchange approvals, and the Company's ability to complete the Transaction as currently proposed or at all. Accordingly, readers should not place undue reliance on the forward&#8208;looking statements and information contained in this news release. Readers are cautioned that the foregoing list of factors is not exhaustive. The forward&#8208;looking statements and information contained in this news release are made as of the date hereof and no undertaking is given to update publicly or revise any forward&#8208;looking statements or information, whether as a result of new information, future events or otherwise, unless so required by applicable securities laws. The forward-looking statements or information contained in this news release are expressly qualified by this cautionary statement.</p><p><b>Neither the Canadian Securities Exchange nor its Regulation Services Provider (as that term is defined in the policies of the Canadian Securities Exchange) accepts responsibility for the adequacy or accuracy of this release.</b></p><p><font style=\"font-size: 11px;\">THIS NEWS RELEASE IS NOT FOR DISTRIBUTION TO U.S. NEWSWIRE SERVICES OR FOR DISSEMINATION IN THE UNITED STATES</font></p><p id=\"corporateLinkBack\">To view the source version of this press release, please visit <a href=\"https://api.newsfilecorp.com/redirect/PLzapUQP8N\">https://www.newsfilecorp.com/release/241590</a></p>",
    "search_terms": "Flanders South,PowerStone Metals Corp.,PS",
    "master_gid": 6552,
    "date": "2025-02-20T12:00:00.000Z",
    "tags": "Canada|||Lithium|Project Acquisition",
    "image_id": null,
    "hidden": false,
    "company_id": 2481,
    "provider": "newsfilecorp",
    "excerpt": "THIS NEWS RELEASE IS NOT FOR DISTRIBUTION TO U.S. NEWSWIRE SERVICES OR FOR DISSEMINATION IN THE UNITED STATESToronto, Ontario and Vancouver, British Columbia--(Newsfile Corp. - February 20, 2025) - Libra Lithium Corp. (&#34;Libra&#34;) is pleased to announce, that further to its press release dated December 2, 2024 announcing an earn-in",
    "is_regulatory": false,
    "refined_tags": [],
    "ftp_filename": null,
    "company_name": "KoBold Metals",
    "exchange": "CSE",
    "root_ticker": "PS",
    "project_name": "Flanders South",
    "gid": 6552,
    "location": null,
    "plan_id": null,
    "description_text": "THIS NEWS RELEASE IS NOT FOR DISTRIBUTION TO U.S. NEWSWIRE SERVICES OR FOR DISSEMINATION IN THE UNITED STATES Toronto, Ontario and Vancouver, British Columbia--(Newsfile Corp. - February 20, 2025) - Libra Lithium Corp. (\" Libra \") is pleased to announce, that further to its press release dated December 2, 2024 announcing an earn-in agreement (the \" EIA \") with a wholly-owned Canadian subsidiary of KoBold Metals Company (\" KoBold \") to jointly explore Libra's Flanders South, Flanders North and Soules Bay-Caron (the \" SBC Project \") lithium projects in Ontario, Canada (the \" EIA Properties \"), that Libra and KoBold have entered into an amending agreement with respect to the EIA to expand the EIA Properties to include certain additional claims recently staked by Libra that are contiguous to the SBC Project. Libra is also pleased to announce that PowerStone Metals Corp. (CSE: PS) (\" PowerStone \" or the \" Company \") and Libra have entered into an amending agreement to the definitive agreement dated December 31, 2024 (the \" Definitive Agreement \") with respect to the reverse takeover of PowerStone by Libra (the \" Transaction \") pursuant to which Libra and the Company have extended the outside date to complete the Transaction to June 30, 2025 to provide Libra and PowerStone with additional time to evaluate and consider merger and acquisition (\" M&A \") opportunities in the lithium and broader critical metals sector. \" We are pleased to have been able to secure these additional claims at the SBC Project and are encouraged to see continued interest from KoBold. We look forward to our continued collaboration with KoBold as we prepare for the next phase of exploration at the SBC Project. We would also like to thank PowerStone for patiently accommodating an extension to the Definitive Agreement, allowing for additional time to facilitate some exciting counter-cyclical M&A targets we are actively evaluating \" said Koby Kushner, CEO of Libra. PowerStone also announces that it has adjourned its annual general and special shareholders' meeting scheduled for February 28, 2025 to May 14, 2025 for shareholders to consider and approve the Transaction, among other items, as more fully disclosed in the joint Libra-PowerStone press release dated January 2, 2025. About Libra Lithium Corp. Libra is a Canadian mineral exploration company focused on the discovery and development of the critical minerals necessary for the green energy transition. Libra's Flanders North, Flanders South, and Soules Bay-Caron projects in Ontario are being explored under a $33M earn-in deal with KoBold Metals Company. In addition, Libra has 100% ownership over its Toivo, Burton, Bitchu, Battery Hill and Kivinen projects in Ontario, Canada and its Nemiscau project in Quebec, Canada. The Libra team comprises a mix of seasoned executives, engineers, and geoscientists, with extensive experience in mining and mineral exploration, capital markets, asset management, energy, and First Nations engagement. In addition to Libra's lithium exploration portfolio, Libra holds 43,865,217 common shares in the capital of Athena Gold Corporation's (CSE: ATHA) (OTCQB: AHNR) (\" Athena \") wholly-owned subsidiary, which subject to certain conditions, are exchangeable for no additional consideration into common shares of Athena. About PowerStone Metals Corp. PowerStone is a mineral exploration company focused on the identification and exploration of high-quality critical and precious metals assets, in favorable mining jurisdictions. PowerStone is a reporting issuer in the Provinces of Ontario, British Columbia and Alberta, Canada and its common shares are currently listed on the Canadian Securities Exchange. All information contained in this news release with respect to Libra was supplied by Libra, and PowerStone and its directors and officers have relied on Libra for such information. Contact Information Zachary Goldenberg Chief Executive Officer, PowerStone Metals Corp. e: zach@libertyvp.co t: 647-987-5083 Koby Kushner Chief Executive Officer, Libra Lithium Corp. e: kkushner@libralithium.com t: 416-846-6164 Cautionary Note Regarding Forward-Looking Statements This news release contains forward‐looking statements and forward‐looking information within the meaning of applicable securities laws. These statements relate to future events or future performance. All statements other than statements of historical fact may be forward‐looking statements or information. More particularly and without limitation, this news release contains forward‐looking statements and information relating to the closing of the Transaction, the conditions to completing the Transaction, prospective M&A activities, timing and receipt of regulatory, shareholder and exchange approvals, future plans and business objectives of the resulting public company following closing of the Transaction and other matters. The forward‐looking statements and information are based on certain key expectations and assumptions made by management of the Company. As a result, there can be no assurance that the proposed Transaction or related matters will be completed as proposed or at all. Although management of the Company believe that the expectations and assumptions on which such forward-looking statements and information are based are reasonable, undue reliance should not be placed on the forward‐looking statements and information since no assurance can be given that they will prove to be correct. Forward-looking statements and information are provided for the purpose of providing information about the current expectations and plans of management of the Company relating to the future. Readers are cautioned that reliance on such statements and information may not be appropriate for other purposes, such as making investment decisions. Since forward‐looking statements and information address future events and conditions, by their very nature they involve inherent risks and uncertainties. Actual results could differ materially from those currently anticipated due to a number of factors and risks. These include, but are not limited to, the Company's ability to continue operations if the Transaction is not completed, the Company's ability to raise further capital upon terms acceptable to the Company or at all, the Company's ability to obtain regulatory, shareholder and exchange approvals, and the Company's ability to complete the Transaction as currently proposed or at all. Accordingly, readers should not place undue reliance on the forward‐looking statements and information contained in this news release. Readers are cautioned that the foregoing list of factors is not exhaustive. The forward‐looking statements and information contained in this news release are made as of the date hereof and no undertaking is given to update publicly or revise any forward‐looking statements or information, whether as a result of new information, future events or otherwise, unless so required by applicable securities laws. The forward-looking statements or information contained in this news release are expressly qualified by this cautionary statement. Neither the Canadian Securities Exchange nor its Regulation Services Provider (as that term is defined in the policies of the Canadian Securities Exchange) accepts responsibility for the adequacy or accuracy of this release. THIS NEWS RELEASE IS NOT FOR DISTRIBUTION TO U.S. NEWSWIRE SERVICES OR FOR DISSEMINATION IN THE UNITED STATES To view the source version of this press release, please visit https://www.newsfilecorp.com/release/241590",
    "primary_commodity": "Li"
  },
  "articleProject": {
    "gid": 6552,
    "project_name": "Flanders South",
    "location": null
  },
  "articleExchange": "CSE",
  "articleCompanyId": 2481,
  "articleTicker": "PS",
  "articleCompanyName": "PowerStone Metals Corp.",
  "allOtherCompanyProjects": [],
  "allOtherCompanyNews": [
    {
      "id": 104224,
      "company_id": 2481,
      "title": "PowerStone Metals Corp Provides Updated Disclosure Relating to the May 14, 2025 Shareholders Meeting and Accompanying Circular",
      "link": null,
      "date": "2025-05-10T00:14:00.000Z",
      "hidden": false
    },
    {
      "id": -198178,
      "company_id": 2481,
      "title": "Libra Wins Bernie Schnieders Discovery of the Year Award and Provides Update on RTO with Powerstone",
      "link": "https://app.quotemedia.com/data/downloadFiling?webmasterId=104408&ref=67ff9fc7ca89254a427682b1&type=PDFC&formType=002-002-001089-003001&formDescription=News+release&dateFiled=2025-04-16",
      "date": "2025-04-16T05:17:11.000Z",
      "hidden": false
    },
    {
      "id": 88581,
      "company_id": 2481,
      "title": "Libra Expands Kobold Metals Earn-In and Provides Update on RTO Transaction",
      "link": "https://www.newsfilecorp.com/release/241590/Libra-Expands-Kobold-Metals-EarnIn-and-Provides-Update-on-RTO-Transaction",
      "date": "2025-02-20T12:00:00.000Z",
      "hidden": false
    },
    {
      "id": -163073,
      "company_id": 2481,
      "title": "Canadian Investment Regulatory Organization Trading Halt - PS",
      "link": "https://contentapi.cision.com/api/v1.0/releases/20250102C8998",
      "date": "2025-01-02T12:48:00.000Z",
      "hidden": false
    },
    {
      "id": 83165,
      "company_id": 2481,
      "title": "PowerStone Metals Announces Definitive Agreement for Amalgamation with Libra Lithium",
      "link": "https://www.newsfilecorp.com/release/235702/PowerStone-Metals-Announces-Definitive-Agreement-for-Amalgamation-with-Libra-Lithium",
      "date": "2025-01-02T11:00:00.000Z",
      "hidden": false
    },
    {
      "id": 97828,
      "company_id": 2481,
      "title": "Libra Lithium Announces $33m Earn-In Agreement with Kobold Metals and Announces Go-Public Transaction via Reverse Takeover of PowerStone Metals",
      "link": "https://app.quotemedia.com/data/downloadFiling?webmasterId=104408&ref=674db09ba3815808a04e8f51&type=PDFC&formType=002-002-001089-003001&formDescription=News+release&dateFiled=2024-12-02",
      "date": "2024-12-02T13:05:31.000Z",
      "hidden": false
    },
    {
      "id": 46669,
      "company_id": 2481,
      "title": "PowerStone Provides Update on Option Agreement with CBLT Inc",
      "link": "https://www.newsfilecorp.com/release/192938/PowerStone-Provides-Update-on-Option-Agreement-with-CBLT-Inc",
      "date": "2024-01-02T23:00:00.000Z",
      "hidden": false
    },
    {
      "id": 43851,
      "company_id": 2481,
      "title": "Early Warning Report Issued Pursuant to NI 62-103 - Transaction Involving Common Shares of PowerStone Metals Corp.",
      "link": "https://www.newsfilecorp.com/release/186760/Early-Warning-Report-Issued-Pursuant-to-NI-62103-Transaction-Involving-Common-Shares-of-PowerStone-Metals-Corp.",
      "date": "2023-11-09T04:01:00.000Z",
      "hidden": false
    },
    {
      "id": 38825,
      "company_id": 2481,
      "title": "PowerStone Metals Provides Corporate Update",
      "link": "https://www.newsfilecorp.com/release/175670/PowerStone-Metals-Provides-Corporate-Update",
      "date": "2023-08-02T10:00:00.000Z",
      "hidden": false
    },
    {
      "id": 38031,
      "company_id": 2481,
      "title": "PowerStone Metals Announces Electronic Clearing and Settlement by Depository Trust Company",
      "link": "https://www.newsfilecorp.com/release/173642/PowerStone-Metals-Announces-Electronic-Clearing-and-Settlement-by-Depository-Trust-Company",
      "date": "2023-07-17T09:30:00.000Z",
      "hidden": false
    }
  ]
}