{
  "article": {
    "id": 30031,
    "link": "https://www.thenewswire.com/press-releases?id=1BjjFdXpM",
    "title": "Westward Gold Closes Acquisition of Carlin Trend Claims",
    "description": "<table style='width:fit-content; border: none;'><tr style='background: none;'><td colspan='10' style='padding: 0; margin: 0; border: none; background: none;' valign='bottom'><a target='_blank' href='www.westwardgold.com'><img src=\"https://www.thenewswire.com/data/tnw/clients/logos/1LYzFPXdg.png\" alt=\"Westward Gold Inc.\" /></a></td></tr><tr style='background: none;'><td style='width: 34px; padding: 0; margin: 0; border: none; background: none;' valign='bottom'><a target='_blank' href='https://www.facebook.com/WestwardGold'><img src=\"https://www.thenewswire.com/data/tnw/img/facebook.png\" /></a></td><td style='width: 34px; padding: 0; margin: 0; border: none; background: none;' valign='bottom'><a target='_blank' href='https://twitter.com/WestwardGold'><img src=\"https://www.thenewswire.com/data/tnw/img/twitter.png\" /></a></td><td style='width: 34px; padding: 0; margin: 0; border: none; background: none;' valign='bottom'><a target='_blank' href='https://www.linkedin.com/company/westward-gold-inc'><img src=\"https://www.thenewswire.com/data/tnw/img/linkedIn.png\" /></a></td><td style='width: 34px; padding: 0; margin: 0; border: none; background: none;' valign='bottom'><a target='_blank' href='https://www.youtube.com/channel/UCSpkDfKpbJezJFuUIVSdKEQ'><img src=\"https://www.thenewswire.com/data/tnw/img/youTube.png\" /></a></td><td style='width: 34px; padding: 0; margin: 0; border: none; background: none;' valign='bottom'><a target='_blank' href='https://www.instagram.com/westwardgold/'><img src=\"https://www.thenewswire.com/data/tnw/img/instagram.png\" /></a></td><td style='padding: 0; margin: 0; border: none; background: none;'></td></tr></table>\n<p style='text-align:justify; '>\nVancouver, British Columbia – <span style=''>TheNewswire -</span> January 18, 2023 – Westward Gold Inc. (CSE:WG<span style=''>)</span>, <span style=''>(</span>OTC:WGLIF<span style=''>)</span>, <span style=''>(</span>FSE:IM50) (<span style='font-weight:bold; '>“Westward”</span> or the <span style='font-weight:bold; '>“Company”</span>) is pleased to report that the Company has closed its previously-announced acquisition (the <span style='font-weight:bold; '>“Acquisition”</span>) of the Coyote and Rossi Claim Blocks, located along the Carlin Trend in Elko County, Nevada (each, the <span style='font-weight:bold; '>“Coyote Claims”</span> and <span style='font-weight:bold; '>“Rossi Claims”</span>; collectively, the <span style='font-weight:bold; '>“Carlin Claims”</span>) (<span style='font-style:italic; '>see press release dated October 11, 2022</span>). The Acquisition was effected via a claims acquisition agreement with Fremont Gold Ltd. and its Nevada-based subsidiary, Intermont Exploration Corp. (collectively, <span style='font-weight:bold; '>“Fremont”</span>). Upon closing, ownership of the Carlin Claims was transferred to one of Westward’s wholly-owned Nevada-based subsidiaries, Golden Oasis Exploration.\n</p>\n\n<p style='text-align:center; '>\n<span style='font-weight:bold; '>Figure 1: Location of Carlin Claims &amp; Major Neighbouring Gold Deposits</span>\n</p>\n\n<p style='text-align:center; '>\n<span style='text-align:center; '><a href='https://thenewswire.com/data/tnw/clients/img/8d4456f7f706cf77dbf6d8ceebdb23da.png' target='_blank'><img src=\"https://thenewswire.com/data/tnw/clients/img/8d4456f7f706cf77dbf6d8ceebdb23da_.png\" /></a><br />\nClick Image To View Full Size</span>\n</p>\n \n<p style='text-align:justify; '>\n<span style=''>Carlin Claims - Overview</span>\n</p>\n\n<p style='text-align:justify; '>\nThe Carlin Claims consist of 111 unpatented mining claims (Coyote Claims – 99; Rossi Claims – 12) administered by the Bureau of Land Management (<span style='font-weight:bold; '>“BLM”</span>), covering an area of ~9 km<span style='vertical-align:super; '>2</span> at the northern end of the prolific Carlin Trend. The Carlin Claims are located approximately 6 km north of Nevada Gold Mines’ (<span style='font-weight:bold; '>“NGM”</span>) South Arturo Mine, and 10 km northwest of their Goldstrike Mine; the southern boundary of the Rossi Claims borders land currently owned by NGM. The Carlin Trend is a ~90 km-long gold belt that has been continuously and successfully explored and mined over the last 60 years. Today, the area is dominated by NGM, the joint venture between top global gold producers Barrick Gold and Newmont Corporation. Westward’s flagship property, Toiyabe, is also directly adjacent to a significant land package held by NGM.\n</p>\n\n<p style='text-align:justify; '>\nDave Browning, Westward’s Vice President of Exploration, noted: “We’re seeing more and more historically-underexplored properties (due largely to the lack of traditional host rocks at surface) realize their potential, and these new claim blocks have all the makings of an extension of the mineralized corridor along the Carlin Trend. The low-cost, systematic field work planned for our new land package – Anaconda-style geological mapping, outcrop sampling, hyperspectral and geophysical surveys – will greatly improve targeting and demonstrate the value of Coyote and Rossi. These claims strategically complement our flagship land package on the Cortez Trend, and Westward now controls nearly 50 km<span style='vertical-align:super; '>2</span> of highly-prospective exploration ground on two of North America’s most important gold trends.”\n</p>\n\n<p style='text-align:justify; '>\n<span style=''>Acquisition Terms</span>\n</p>\n\r\n<ul>\r\n<li>\n<p style='text-align:justify; '>\nFremont was paid US$19,647 in cash upon closing, representing a reimbursement of annual BLM claim fees (Carlin Claims are in good standing until September 2023) \n</p>\n</li><li>\n<p style='text-align:justify; '>\nFremont was issued 600,000 common shares of Westward upon closing \n</p>\n\r\n<ul>\r\n<li>\n<p style='text-align:justify; '>\n200,000 shares to be released from escrow on May 18, 2023 \n</p>\n</li><li>\n<p style='text-align:justify; '>\n400,000 shares to be released from escrow on September 17, 2023 \n</p>\n</li>\r\n</ul>\r\n</li><li>\n<p style='text-align:justify; '>\nFremont was granted a 2.0% net smelter return royalty on the Coyote Claims (the <span style='font-weight:bold; '>“Coyote NSR”</span>) upon closing \n</p>\n\r\n<ul>\r\n<li>\n<p style='text-align:justify; '>\nHalf (1.0%) of the Coyote NSR may be repurchased by Westward at any time for a payment of US$2 million in cash \n</p>\n</li>\r\n</ul>\r\n</li><li>\n<p style='text-align:justify; '>\nFremont was granted a 1.0% net smelter return royalty on the Rossi Claims (the <span style='font-weight:bold; '>“Rossi NSR”</span>)* upon closing \n</p>\n\r\n<ul>\r\n<li>\n<p style='text-align:justify; '>\nHalf (0.5%) of the Rossi NSR may be repurchased by Westward at any time for a payment of US$1.5 million in cash \n</p>\n</li>\r\n</ul>\r\n</li>\r\n</ul>\r\n\n<p style='text-align:justify; '>\n<span style='font-style:italic; '>*There is an existing 2.0% net smelter return royalty on the 12 Rossi Claims, held by Nevada Select Royalty, Inc. (</span><span style='font-style:italic; font-weight:bold; '>“NV Select”</span><span style='font-style:italic; '>). Westward must abide by the material terms of the royalty deed entered into by Fremont and NV Select on April 10, 2019.</span>\n</p>\n\n<p style='text-align:justify; '>\n<span style=''>Carlin Claims – Geological Considerations</span>\n</p>\n\n<p style='text-align:justify; '>\nThe major mineralizing fault in the Carlin Trend – the Post-Genesis Fault (<span style='font-weight:bold; '>“PG Fault”</span>) – runs north-south, and indications suggest this structure may continue onto the Carlin Claims. The PG Fault is a significant ore control at major deposits immediately south of the Carlin Claims, including Lantern, Beast, Genesis, Blue Star, Deep Star, Goldstrike, Meikle and Ren<span style='vertical-align:super; '>(1)</span>. Regional-scale gravity surveys support the thesis of on-trend continuation of the PG Fault onto the Carlin Claims, however a more localized gravity survey would improve drill targeting; this is one of the relatively low-cost exploration activities Westward will undertake in the future to advance the property. Exploration on the Carlin Trend in recent years has targeted lower plater carbonate rocks below upper plate rocks.  The suggested gravity survey at Westward Gold’s new property will help identify these targets beneath the upper plate siliceous rocks present at the Carlin Claims, where the lower plate carbonate rocks have yet to be tested.\n</p>\n\n<p style='text-align:justify; '>\nTraditional pathfinder elements for Carlin-type gold deposits are present in soil surveys conducted at the Carlin Claims, with anomalous values detected for arsenic, antimony, mercury, and thallium<span style='vertical-align:super; '>(2)</span>. These geochemical characteristics, along with surface exposures of silicified fault breccia (see Figure 2 below), indicate the potential for a Carlin-type gold system on the property.\n</p>\n\n<p style='text-align:center; '>\n<span style='font-weight:bold; '>Figure 2: Surface Exposures of Silicified Fault Breccia</span>\n</p>\n\n<p style='text-align:center; '>\n<span style='text-align:center; '><a href='https://thenewswire.com/data/tnw/clients/img/b878c4772a42005a876a8187e9b4f061.png' target='_blank'><img src=\"https://thenewswire.com/data/tnw/clients/img/b878c4772a42005a876a8187e9b4f061_.png\" /></a><br />\nClick Image To View Full Size</span>\n</p>\n \n<p style='text-align:justify; '>\n<span style='font-style:italic; '>(1) Readers are cautioned that the resource and reserve estimates relating to adjacent properties in the Carlin Trend do not extend to the Coyote Claims or Rossi Claims. The Company has not independently verified the information with respect to the other properties in the Carlin Complex and it is not necessarily indicative of the mineralization on the Coyote Claims or Rossi Claims.</span>\n</p>\n\n<p style='text-align:justify; '>\n<span style='font-style:italic; '>(2) Source: Fremont Gold Ltd.</span>\n</p>\n\n<p style='text-align:justify; '>\n<span style='font-weight:bold; '>Qualified Person</span>\n</p>\n\n<p style='text-align:left; '>\nThe technical information contained in this news release was reviewed and approved by Steven R. Koehler, Technical Advisor to the Company, who is a Qualified Person under National Instrument 43-101 – <span style='font-style:italic; '>Standards of Disclosure for Mineral Projects. </span>Mr. Koehler is a Certified Professional Geologist (CPG) through the American Institute of Professional Geologists (AIPG).\n</p>\n\n<p style='text-align:justify; '>\n<span style='font-weight:bold; '>About Westward Gold</span>\n</p>\n\n<p style='text-align:justify; '>\nWestward Gold is a mineral exploration company focused on developing the Toiyabe, Turquoise Canyon, and East Saddle Projects located in the Cortez Hills area of Lander County, Nevada, and the Coyote and Rossi Projects located along the Carlin Trend in Elko County, Nevada. From time to time, the Company may also evaluate the acquisition of other mineral exploration assets and opportunities.\n</p>\n\n<p style='text-align:justify; '>\nFor further information contact: \n</p>\n\n<p style='text-align:left; '>\nColin Moore <br />\nPresident, CEO &amp; Director<br />\nWestward Gold Inc. <br />\ncolin@westwardgold.com \n</p>\n\n<p style='text-align:left; '>\nwww.westwardgold.com\n</p>\n\n<p style='text-align:justify; '>\n<span style='font-style:italic; '>The Canadian Securities Exchange has neither approved nor disapproved the contents of this news release. The Canadian Securities Exchange does not accept responsibility for the adequacy or accuracy of this news release.</span>\n</p>\n\n<p style='text-align:justify; '>\n<span style='font-style:italic; '>This news release contains or incorporates by reference “forward-looking statements” and “forward-looking information” as defined under applicable Canadian securities legislation. All statements, other than statements of historical fact, which address events, results, outcomes, or developments that the Company expects to occur are, or may be deemed, to be, forward-looking statements. Forward-looking statements are generally, but not always, identified by the use of forward-looking terminology such as &quot;expect&quot;, &quot;believe&quot;, &quot;anticipate&quot;, &quot;intend&quot;, &quot;estimate”, “potential”, “on track”, “forecast&quot;, &quot;budget&quot;, “target”, “outlook”, “continue”, “plan” or variations of such words and phrases and similar expressions or statements that certain actions, events or results “may”, “could”, “would”, “might” or “will” be taken, occur or be achieved or the negative connotation of such terms.</span>\n</p>\n\n<p style='text-align:justify; '>\n<span style='font-style:italic; '>Such statements include, but may not be limited to, information as to strategy, plans or future financial or operating performance, such as the Company’s expansion plans, project timelines, expected drilling targets, and other statements that express management’s expectations or estimates of future plans and performance.</span>\n</p>\n\n<p style='text-align:justify; '>\n<span style='font-style:italic; '>Forward-looking statements or information are subject to a variety of known and unknown risks, uncertainties and other factors that could cause actual events or results to differ from those reflected in the forward-looking statements or information, including, without limitation, the need for additional capital by the Company through financings, and the risk that such funds may not be raised; the speculative nature of exploration and the stages of the Company’s properties; the effect of changes in commodity prices; regulatory risks that development of the Company’s material properties will not be acceptable for social, environmental or other reasons, availability of equipment (including drills) and personnel to carry out work programs, that each stage of work will be completed within expected time frames, that current geological models and interpretations prove correct, the results of ongoing work programs may lead to a change of exploration priorities, and the efforts and abilities of the senior management team. This list is not exhaustive of the factors that may affect any of the Company’s forward-looking statements or information. These and other factors may cause the Company to change its exploration and work programs, not proceed with work programs, or change the timing or order of planned work programs. Additional risk factors and details with respect to risk factors that may affect the Company’s ability to achieve the expectations set forth in the forward-looking statements contained in this news release are set out in the Company’s latest management discussion and analysis under “Risks and Uncertainties”, which is available under the Company’s SEDAR profile at www.sedar.com. Although the Company has attempted to identify important factors that could cause actual results to differ materially, there may be other factors that cause results not to be as anticipated, estimated, described or intended. Accordingly, readers should not place undue reliance on forward-looking statements or information. The Company’s forward-looking statements and information are based on the assumptions, beliefs, expectations, and opinions of management as of the date of this press release, and other than as required by applicable securities laws, the Company does not assume any obligation to update forward-looking statements and information if circumstances or management’s assumptions, beliefs, expectations or opinions should change, or changes in any other events affecting such statements or information.</span>\n</p>\n \n\n<p>Copyright (c) 2023 TheNewswire - All rights reserved.</p>\n",
    "search_terms": "Rossi,Westward Gold Inc. ,WG",
    "master_gid": 3920,
    "date": "2023-01-18T14:00:00.000Z",
    "tags": "USA|Nevada||Gold|Project Acquisition",
    "image_id": null,
    "hidden": false,
    "company_id": 1857,
    "provider": null,
    "excerpt": "Vancouver, British Columbia –TheNewswire -January 18, 2023 – Westward Gold Inc. (CSE:WG),(OTC:WGLIF),(FSE:IM50) (“Westward”or the“Company”) is pleased to report that the Company has closed its previously-announced acquisition (the“Acquisition”) of the Coyote and Rossi Claim Blocks, located along the Carlin Trend in Elko County, Nevada (each, the“Coyote Claims”and“Rossi Claims”; collectively, the“Carlin Claims”)",
    "is_regulatory": false,
    "refined_tags": [
      "Project Acquisition"
    ],
    "ftp_filename": null,
    "company_name": "Westward Gold Inc.",
    "exchange": "CSE",
    "root_ticker": "WG",
    "project_name": "Rossi",
    "gid": 3920,
    "location": "Nevada, United States",
    "plan_id": null,
    "description_text": "Vancouver, British Columbia – TheNewswire - January 18, 2023 – Westward Gold Inc. (CSE:WG ) , ( OTC:WGLIF ) , ( FSE:IM50) ( “Westward” or the “Company” ) is pleased to report that the Company has closed its previously-announced acquisition (the “Acquisition” ) of the Coyote and Rossi Claim Blocks, located along the Carlin Trend in Elko County, Nevada (each, the “Coyote Claims” and “Rossi Claims” ; collectively, the “Carlin Claims” ) ( see press release dated October 11, 2022 ). The Acquisition was effected via a claims acquisition agreement with Fremont Gold Ltd. and its Nevada-based subsidiary, Intermont Exploration Corp. (collectively, “Fremont” ). Upon closing, ownership of the Carlin Claims was transferred to one of Westward’s wholly-owned Nevada-based subsidiaries, Golden Oasis Exploration. Figure 1: Location of Carlin Claims & Major Neighbouring Gold Deposits Click Image To View Full Size Carlin Claims - Overview The Carlin Claims consist of 111 unpatented mining claims (Coyote Claims – 99; Rossi Claims – 12) administered by the Bureau of Land Management ( “BLM” ), covering an area of ~9 km 2 at the northern end of the prolific Carlin Trend. The Carlin Claims are located approximately 6 km north of Nevada Gold Mines’ ( “NGM” ) South Arturo Mine, and 10 km northwest of their Goldstrike Mine; the southern boundary of the Rossi Claims borders land currently owned by NGM. The Carlin Trend is a ~90 km-long gold belt that has been continuously and successfully explored and mined over the last 60 years. Today, the area is dominated by NGM, the joint venture between top global gold producers Barrick Gold and Newmont Corporation. Westward’s flagship property, Toiyabe, is also directly adjacent to a significant land package held by NGM. Dave Browning, Westward’s Vice President of Exploration, noted: “We’re seeing more and more historically-underexplored properties (due largely to the lack of traditional host rocks at surface) realize their potential, and these new claim blocks have all the makings of an extension of the mineralized corridor along the Carlin Trend. The low-cost, systematic field work planned for our new land package – Anaconda-style geological mapping, outcrop sampling, hyperspectral and geophysical surveys – will greatly improve targeting and demonstrate the value of Coyote and Rossi. These claims strategically complement our flagship land package on the Cortez Trend, and Westward now controls nearly 50 km 2 of highly-prospective exploration ground on two of North America’s most important gold trends.” Acquisition Terms Fremont was paid US$19,647 in cash upon closing, representing a reimbursement of annual BLM claim fees (Carlin Claims are in good standing until September 2023) Fremont was issued 600,000 common shares of Westward upon closing 200,000 shares to be released from escrow on May 18, 2023 400,000 shares to be released from escrow on September 17, 2023 Fremont was granted a 2.0% net smelter return royalty on the Coyote Claims (the “Coyote NSR” ) upon closing Half (1.0%) of the Coyote NSR may be repurchased by Westward at any time for a payment of US$2 million in cash Fremont was granted a 1.0% net smelter return royalty on the Rossi Claims (the “Rossi NSR” )* upon closing Half (0.5%) of the Rossi NSR may be repurchased by Westward at any time for a payment of US$1.5 million in cash *There is an existing 2.0% net smelter return royalty on the 12 Rossi Claims, held by Nevada Select Royalty, Inc. ( “NV Select” ). Westward must abide by the material terms of the royalty deed entered into by Fremont and NV Select on April 10, 2019. Carlin Claims – Geological Considerations The major mineralizing fault in the Carlin Trend – the Post-Genesis Fault ( “PG Fault” ) – runs north-south, and indications suggest this structure may continue onto the Carlin Claims. The PG Fault is a significant ore control at major deposits immediately south of the Carlin Claims, including Lantern, Beast, Genesis, Blue Star, Deep Star, Goldstrike, Meikle and Ren (1) . Regional-scale gravity surveys support the thesis of on-trend continuation of the PG Fault onto the Carlin Claims, however a more localized gravity survey would improve drill targeting; this is one of the relatively low-cost exploration activities Westward will undertake in the future to advance the property. Exploration on the Carlin Trend in recent years has targeted lower plater carbonate rocks below upper plate rocks.  The suggested gravity survey at Westward Gold’s new property will help identify these targets beneath the upper plate siliceous rocks present at the Carlin Claims, where the lower plate carbonate rocks have yet to be tested. Traditional pathfinder elements for Carlin-type gold deposits are present in soil surveys conducted at the Carlin Claims, with anomalous values detected for arsenic, antimony, mercury, and thallium (2) . These geochemical characteristics, along with surface exposures of silicified fault breccia (see Figure 2 below), indicate the potential for a Carlin-type gold system on the property. Figure 2: Surface Exposures of Silicified Fault Breccia Click Image To View Full Size (1) Readers are cautioned that the resource and reserve estimates relating to adjacent properties in the Carlin Trend do not extend to the Coyote Claims or Rossi Claims. The Company has not independently verified the information with respect to the other properties in the Carlin Complex and it is not necessarily indicative of the mineralization on the Coyote Claims or Rossi Claims. (2) Source: Fremont Gold Ltd. Qualified Person The technical information contained in this news release was reviewed and approved by Steven R. Koehler, Technical Advisor to the Company, who is a Qualified Person under National Instrument 43-101 – Standards of Disclosure for Mineral Projects. Mr. Koehler is a Certified Professional Geologist (CPG) through the American Institute of Professional Geologists (AIPG). About Westward Gold Westward Gold is a mineral exploration company focused on developing the Toiyabe, Turquoise Canyon, and East Saddle Projects located in the Cortez Hills area of Lander County, Nevada, and the Coyote and Rossi Projects located along the Carlin Trend in Elko County, Nevada. From time to time, the Company may also evaluate the acquisition of other mineral exploration assets and opportunities. For further information contact: Colin Moore President, CEO & Director Westward Gold Inc. colin@westwardgold.com www.westwardgold.com The Canadian Securities Exchange has neither approved nor disapproved the contents of this news release. The Canadian Securities Exchange does not accept responsibility for the adequacy or accuracy of this news release. This news release contains or incorporates by reference “forward-looking statements” and “forward-looking information” as defined under applicable Canadian securities legislation. All statements, other than statements of historical fact, which address events, results, outcomes, or developments that the Company expects to occur are, or may be deemed, to be, forward-looking statements. Forward-looking statements are generally, but not always, identified by the use of forward-looking terminology such as \"expect\", \"believe\", \"anticipate\", \"intend\", \"estimate”, “potential”, “on track”, “forecast\", \"budget\", “target”, “outlook”, “continue”, “plan” or variations of such words and phrases and similar expressions or statements that certain actions, events or results “may”, “could”, “would”, “might” or “will” be taken, occur or be achieved or the negative connotation of such terms. Such statements include, but may not be limited to, information as to strategy, plans or future financial or operating performance, such as the Company’s expansion plans, project timelines, expected drilling targets, and other statements that express management’s expectations or estimates of future plans and performance. Forward-looking statements or information are subject to a variety of known and unknown risks, uncertainties and other factors that could cause actual events or results to differ from those reflected in the forward-looking statements or information, including, without limitation, the need for additional capital by the Company through financings, and the risk that such funds may not be raised; the speculative nature of exploration and the stages of the Company’s properties; the effect of changes in commodity prices; regulatory risks that development of the Company’s material properties will not be acceptable for social, environmental or other reasons, availability of equipment (including drills) and personnel to carry out work programs, that each stage of work will be completed within expected time frames, that current geological models and interpretations prove correct, the results of ongoing work programs may lead to a change of exploration priorities, and the efforts and abilities of the senior management team. This list is not exhaustive of the factors that may affect any of the Company’s forward-looking statements or information. These and other factors may cause the Company to change its exploration and work programs, not proceed with work programs, or change the timing or order of planned work programs. Additional risk factors and details with respect to risk factors that may affect the Company’s ability to achieve the expectations set forth in the forward-looking statements contained in this news release are set out in the Company’s latest management discussion and analysis under “Risks and Uncertainties”, which is available under the Company’s SEDAR profile at www.sedar.com. Although the Company has attempted to identify important factors that could cause actual results to differ materially, there may be other factors that cause results not to be as anticipated, estimated, described or intended. Accordingly, readers should not place undue reliance on forward-looking statements or information. The Company’s forward-looking statements and information are based on the assumptions, beliefs, expectations, and opinions of management as of the date of this press release, and other than as required by applicable securities laws, the Company does not assume any obligation to update forward-looking statements and information if circumstances or management’s assumptions, beliefs, expectations or opinions should change, or changes in any other events affecting such statements or information. Copyright (c) 2023 TheNewswire - All rights reserved.",
    "primary_commodity": "Au"
  },
  "articleProject": {
    "gid": 3920,
    "project_name": "Rossi",
    "location": "Nevada, United States"
  },
  "articleExchange": "CSE",
  "articleCompanyId": 1857,
  "articleTicker": "WG",
  "articleCompanyName": "Westward Gold Inc. ",
  "allOtherCompanyProjects": [
    {
      "company_id": 1857,
      "gid": 2703,
      "project_name": "East Saddle",
      "location": "Nevada"
    },
    {
      "company_id": 1857,
      "gid": 2706,
      "project_name": "Turquoise Canyon",
      "location": "Nevada"
    },
    {
      "company_id": 1857,
      "gid": 3919,
      "project_name": "Coyote",
      "location": "Nevada, United States"
    },
    {
      "company_id": 1857,
      "gid": 3920,
      "project_name": "Rossi",
      "location": "Nevada, United States"
    },
    {
      "company_id": 1857,
      "gid": 2705,
      "project_name": "Toiyabe",
      "location": null
    }
  ],
  "allOtherCompanyNews": [
    {
      "id": 105924,
      "company_id": 1857,
      "title": "Westward Gold Breaks Ground at Campfire Target & Details Additional Exploration Activities at Toiyabe Hills",
      "link": "https://www.thenewswire.com/press-releases?id=1Bb4FRnJj",
      "date": "2025-05-27T13:00:00.000Z",
      "hidden": false
    },
    {
      "id": 104511,
      "company_id": 1857,
      "title": "Westward Gold Appoints Dr. Quinton Hennigh as Chairman of the Board of Directors",
      "link": "https://www.thenewswire.com/press-releases?id=1A0vFxxY6",
      "date": "2025-05-13T13:00:00.000Z",
      "hidden": false
    },
    {
      "id": 99131,
      "company_id": 1857,
      "title": "Westward Gold Announces Closing of Oversubscribed Non-Brokered Private Placement Financing; Strategic Investor Crescat Capital LLC Acquires 10.3% Stake",
      "link": "https://www.thenewswire.com/press-releases?id=1AD4FQZdR",
      "date": "2025-04-08T20:05:00.000Z",
      "hidden": false
    },
    {
      "id": 98639,
      "company_id": 1857,
      "title": "Westward Gold Announces Exercise of Crescat's Over-Allotment Option, Increasing Its Total Investment to C$1.5M",
      "link": "https://www.thenewswire.com/press-releases?id=1AMqFemnv",
      "date": "2025-04-03T13:00:00.000Z",
      "hidden": false
    },
    {
      "id": 92676,
      "company_id": 1857,
      "title": "Westward Gold Announces Upsizing of Crescat-Led Non-Brokered Private Placement Financing to C$3.6M",
      "link": "https://www.thenewswire.com/press-releases?id=1kZaFqPQ5",
      "date": "2025-03-26T20:50:00.000Z",
      "hidden": false
    },
    {
      "id": 91832,
      "company_id": 1857,
      "title": "Westward Gold Announces Non-Brokered Private Placement Financing with $1M Lead Order from Crescat Capital LLC",
      "link": "https://www.thenewswire.com/press-releases?id=1AqRF4QVp",
      "date": "2025-03-19T13:00:00.000Z",
      "hidden": false
    },
    {
      "id": 90656,
      "company_id": 1857,
      "title": "Westward Gold Welcomes Dr. John-Mark Staude as Newest Strategic Advisor",
      "link": "https://www.thenewswire.com/press-releases?id=1AD4FzMw5",
      "date": "2025-03-11T13:00:00.000Z",
      "hidden": false
    },
    {
      "id": 89490,
      "company_id": 1857,
      "title": "Westward Gold Outlines 2025 Exploration Program for the Toiyabe Hills Project, Cortez Trend, Nevada",
      "link": "https://www.thenewswire.com/press-releases?id=1k3wFlrd2",
      "date": "2025-02-27T14:00:00.000Z",
      "hidden": false
    },
    {
      "id": 84452,
      "company_id": 1857,
      "title": "Westward Gold Appoints Mr. J. Kelly Cluer to Board of Directors",
      "link": "https://www.thenewswire.com/press-releases?id=1k98F1Gq6",
      "date": "2025-01-17T14:00:00.000Z",
      "hidden": false
    },
    {
      "id": 84174,
      "company_id": 1857,
      "title": "Westward Gold Announces Expansion of Toiyabe Hills Property Footprint",
      "link": "https://www.thenewswire.com/press-releases?id=1k3wFlj06",
      "date": "2025-01-15T14:00:00.000Z",
      "hidden": false
    }
  ]
}