{
  "article": {
    "id": 54375,
    "link": "https://www.thenewswire.com/press-releases?id=1kVGFqZnl",
    "title": "Manning Ventures Stakes Additional Claims Adjacent to the Copper Hill Project, Nevada, USA",
    "description": "<table style='width:fit-content; border: none;'><tr style='background: none;'><td colspan='10' style='padding: 0; margin: 0; border: none; background: none;' valign='bottom'><a target='_blank' href='https://manning-ventures.com/'><img src=\"https://www.thenewswire.com/data/tnw/clients/logos/1A8vF1gol.png?t=1712005048\" alt=\"Manning Ventures Inc.\" /></a></td></tr><tr style='background: none;'><td style='padding: 0; margin: 0; border: none; background: none;'></td></tr></table>\n  \n\n<p style='text-align:justify; '>\n<span style='font-weight:bold; '>Vancouver, British Columbia, May 23, 2024</span><span style=''> – </span><span style=''>TheNewswire – </span><span style=''>Manning Ventures Inc. (the “</span><span style='font-weight:bold; '>Company</span><span style=''>” or “</span><span style='font-weight:bold; '>Manning</span><span style=''>”) (CSE: MANN; Frankfurt: 1H5) is pleased to announce </span><a href='' target='_blank'></a>that it has staked an additional forty-two (42) new unpatented lode mining claims (351.2 Ha/868 acres) adjacent to the claim block at Copper Hill. The Project is now comprised of 108 unpatented lode claims that cover 896.3 Ha (2,215 acres). \n</p>\n\n \n\n<p style='text-align:justify; '>\nThe claim block was expanded to cover newly identified target zones from geologic mapping that is in-progress, recent gravity survey results, recent soil geochemical results, and new U.S. Geological Survey regional magnetic data.\n</p>\n\n \n\n<p style='text-align:justify; '>\nCurrent surface mapping in-progress by Manning has identified geologic controls for copper-bearing skarn mineralization, zoning of the skarn mineralization, and alteration veining in the Jurassic Granodiorite and Feldspar Porphyry.\n</p>\n\n \n\n<p style='text-align:justify; '>\nThe recent gravity survey identified strong indicators for copper in skarn that would be expected around a porphyry copper deposit, previously unrecognized fault trends, and geology that is favorable for copper target zones beneath post-mineral volcanic rocks that has never been drill tested. \n</p>\n\n \n\n<p style='text-align:justify; '>\nRecent soil geochemical results correspond with known copper mineralization, skarn zoning, and trends that highlight the skarn/geology mapping correlations.  In addition, it corresponds with skarn zoning and gravity indications of skarn, and correlates/aligns with gravity-based fault trends.  U.S. Geological Survey Magnetic data is sufficiently detailed to highlight several trends in the Project ground magnetic data.\n</p>\n\n \n\n\n<p style='text-align:justify; '>\n\n\n<span style='text-align:center; '><a href='https://www.thenewswire.com/data/tnw/clients/img/ffab40b0cc4b69681d6d0c7896f7deb5.png' target='_blank'><img src=\"https://www.thenewswire.com/data/tnw/clients/img/ffab40b0cc4b69681d6d0c7896f7deb5_.png\" /></a><br />\nClick Image To View Full Size</span>\n</p>\n\n\n\n<p style='text-align:left; '>\n<span style='font-style:italic; '>Image 1: Copper Hill Project with New Claims and Generalized Geology and Magnetic Interpretation</span>\n</p>\n\n \n\n<p style='text-align:justify; '>\nThe Company is currently consolidating all data to identify first phase drill targets at Copper Hill and anticipates releasing details once the data compilation and targeting is complete.\n</p>\n\n \n\n\n<p style='text-align:center; '>\n\n\n<span style='text-align:center; '><a href='https://www.thenewswire.com/data/tnw/clients/img/c48aec62276e2c96e83c60d2649a46cf.png' target='_blank'><img src=\"https://www.thenewswire.com/data/tnw/clients/img/c48aec62276e2c96e83c60d2649a46cf_.png\" /></a><br />\nClick Image To View Full Size</span>\n</p>\n\n\n\n<p style='text-align:left; '>\n<span style='font-style:italic; '>Image 2: Location of Copper Hill, Walker Lane Trend, Nevada, USA</span>\n</p>\n\n\n\n\n\n<p style='text-align:justify; '>\n<span style=''><span style='font-weight:bold; '>About the Copper Hill Project</span></span>\n</p>\n\n \n\n<p style='text-align:justify; '>\nLocated within the prolific Walker Lane trend in southern Nevada, Copper Hill is situated one of the premier jurisdictions for precious metals mining in the world.  Historic endowment within Walker Lane includes 50Moz Au, 700Moz Ag, and 4Mt Cu.  Copper Hill hosts copper-gold-molybdenum mineralization in both porphyry and skarn styled deposits in Mineral County, Nevada. The property consists of 66 mineral claims covering an area of 2.3 miles. The property is located 22 miles north of Hawthorne, Nevada and is accessible using well-maintained County Roads. \n</p>\n\n \n\n<p style='text-align:justify; '>\nThe Project is centered on a Jurassic Age quartz monzonite porphyry intruding Triassic age Luning Limestone. The claims cover 2.3 sq miles and are 33 miles east of the Yerington Copper District which hosts the Yerington Copper Mine (Anaconda 1952-1978), Ann Mason Deposit, Bear Deposit, MacArthur Deposit, and the Pumpkin Hollow Mine. \n</p>\n\n \n\n<p style='text-align:justify; '>\nHistorically at Copper Hill, reported high-grade copper was mined from underground shafts from skarn and porphyry-copper styled mineralization at the Copper Mountain Mine.   Between 1914 to 1926 mining from the “Copper Mountain Mine” produced an estimated 1,000,000 pounds of copper from shallow underground workings. Historic reporting from the period of production describes ore zones of contact skarn- type and porphyry-type mineralization with shipping grades ranging from 3.5 to 11.0% copper*. \n</p>\n\n \n\n<p style='text-align:justify; '>\n<span style='font-style:italic; '>*Historic Mining information was summarized from an “Unpublished Report on the Carson Sink Area, Nevada by F.C. Schrader, U.S. Geological Survey (Field work 1911-1920) 1947”.  </span><span style='font-style:italic; '>Manning Ventures cautions investors that the historic exploration and production information is believed to be accurate but has not been verified by a qualified person.  </span>\n</p>\n\n \n\n<p style='text-align:justify; '>\nThe <span style=''>Copper Hill mineralizing system forms a </span>topographic high surrounded and partially covered by younger volcanic rocks. Mineralization identified at Copper Hill are bornite, chalcocite, chalcopyrite, chrysocolla, copper-native, covellite, cuprite, gold, malachite, molybdenite, silver, sphalerite (rare), and tetrahedrite.\n</p>\n\n \n\n<p style='text-align:justify; '>\nThe Copper Mountain area was explored between 1959 to 1979 by Idaho Minning Corp. and Walker-Martel who conducted ground geophysics, underground mapping, prospecting and reported 6000 feet of Rotary drilling.  Since that time ground magnetics were conducted in 2007.   \n</p>\n\n\n\n<p style='text-align:justify; '>\nRock sampling collected at this time returned values from select samples of 7.2% and 12.7% copper and 1.06 g/t gold and 1.19 g/t gold respectively.\n</p>\n\n \n\n<p style='text-align:justify; '>\nThe target being sought at Copper Hill is a porphyry styled copper-molybdenum-gold deposit.  \n</p>\n\n\n\n<p style='text-align:justify; '>\n<span style=''>Warren Robb P.Geo., is the designated Qualified Person as defined by National Instrument 43-101 and is responsible for the technical information contained in this release.</span>\n</p>\n\n\n\n<p style='text-align:justify; '>\n<span style=''><span style='font-weight:bold; '>About Manning</span></span>\n</p>\n\n\n\n<p style='text-align:justify; '>\n<span style=''>Manning Ventures is a mineral exploration and development company focused metals and materials critical to the growing Energy Metals space. Manning’s project portfolio is focused on Copper in Nevada, Lithium/Copper in Ontario and Quebec, and multiple Iron Ore projects in Quebec.</span>\n</p>\n\n\n\n\n\n<p style='text-align:justify; '>\n<span style=''><span style='font-weight:bold; '>For further information contact:</span></span>\n</p>\n\n\n\n\n\n<p style='text-align:justify; '>\n<span style=''><span style=''>Manning Ventures Inc.</span></span>\n</p>\n\n\n\n<p style='text-align:justify; '>\n<span style=''><span style=''>Alex Klenman - CEO</span></span>\n</p>\n\n\n\n<p style='text-align:justify; '>\n<span style=''><span style=''>Email: </span></span><span style=''>info@manning-ventures.com</span>\n</p>\n\n\n\n<p style='text-align:justify; '>\n<span style=''><span style=''>Telephone: (604) 681-0084</span></span>\n</p>\n\n\n\n<p style='text-align:justify; '>\n<span style=''><span style=''>www.manning-ventures.com</span></span>\n</p>\n\n\n \n\n\n<p style='text-align:justify; '>\n<span style=''><span style='font-style:italic; font-weight:bold; '>FORWARD LOOKING STATEMENTS: </span></span>\n</p>\n\n \n\n<p style='text-align:justify; '>\n<span style='font-style:italic; '>The Canadian Securities Exchange does not accept responsibility for the adequacy or accuracy of this news release.</span>\n</p>\n\n \n\n<p style='text-align:justify; '>\n<span style='font-style:italic; '>Certain statements in this press release may contain forward-looking information (within the meaning of Canadian securities legislation), including, without limitation, the Company’s payment of the Exercise Price during the Option Term, the granting of the net smelter return royalty to the Optionor, and the Company’s payment of the annual minimum payments to the Optionor. These statements address future events and conditions and, as such, involve known and unknown risks, uncertainties, and other factors, which may cause the actual results, performance, or achievements to be materially different from any future results, performance, or achievements expressed or implied by the statements. Forward-looking statements speak only as of the date those statements are made. Although the Company believes the expectations expressed in such forward-looking statements are based on reasonable assumptions, such statements are not guarantees of future performance and actual results may differ materially from those in the forward-looking statements. Factors that could cause the actual results to differ materially from those in forward-looking statements include regulatory actions, market prices, and continued availability of capital and financing, and general economic, market or business conditions. Investors are cautioned that any such statements are not guarantees of future performance and actual results or developments may differ materially from those projected in the forward-looking statements. Forward-looking statements are based on the beliefs, estimates and opinions of the Company's management on the date the statements are </span><span style='font-style:italic; '>made. Except as required by applicable law, the Company assumes no obligation to update or to publicly announce the results of any change to any forward-looking statement contained or incorporated by reference herein to reflect actual results, future events or developments, changes in assumptions, or changes in other factors affecting the forward-looking statements. If the Company updates any forward-looking statement(s), no inference should be drawn that it will make additional updates with respect to those or other forward-looking statements.</span>\n</p>\n\n\n\n\n\n<p>Copyright (c) 2024 TheNewswire - All rights reserved.</p>\n",
    "search_terms": "Copper Hill,Manning Ventures Inc.,MANN",
    "master_gid": 6588,
    "date": "2024-05-23T12:00:00.000Z",
    "tags": "|||Copper|Project Acquisition",
    "image_id": null,
    "hidden": false,
    "company_id": 1501,
    "provider": "thenewswire",
    "excerpt": "Vancouver, British Columbia, May 23, 2024–TheNewswire –Manning Ventures Inc. (the “Company” or “Manning”) (CSE: MANN; Frankfurt: 1H5) is pleased to announcethat it has staked an additional forty-two (42) new unpatented lode mining claims (351.2 Ha/868 acres) adjacent to the claim block at Copper Hill. The Project is now comprised of",
    "is_regulatory": false,
    "refined_tags": [
      "Project Acquisition"
    ],
    "ftp_filename": null,
    "company_name": "Manning Ventures Inc.",
    "exchange": "CSE",
    "root_ticker": "MANN",
    "project_name": "Copper Hill",
    "gid": 6588,
    "location": null,
    "plan_id": null,
    "description_text": "Vancouver, British Columbia, May 23, 2024 – TheNewswire – Manning Ventures Inc. (the “ Company ” or “ Manning ”) (CSE: MANN; Frankfurt: 1H5) is pleased to announce that it has staked an additional forty-two (42) new unpatented lode mining claims (351.2 Ha/868 acres) adjacent to the claim block at Copper Hill. The Project is now comprised of 108 unpatented lode claims that cover 896.3 Ha (2,215 acres). The claim block was expanded to cover newly identified target zones from geologic mapping that is in-progress, recent gravity survey results, recent soil geochemical results, and new U.S. Geological Survey regional magnetic data. Current surface mapping in-progress by Manning has identified geologic controls for copper-bearing skarn mineralization, zoning of the skarn mineralization, and alteration veining in the Jurassic Granodiorite and Feldspar Porphyry. The recent gravity survey identified strong indicators for copper in skarn that would be expected around a porphyry copper deposit, previously unrecognized fault trends, and geology that is favorable for copper target zones beneath post-mineral volcanic rocks that has never been drill tested. Recent soil geochemical results correspond with known copper mineralization, skarn zoning, and trends that highlight the skarn/geology mapping correlations.  In addition, it corresponds with skarn zoning and gravity indications of skarn, and correlates/aligns with gravity-based fault trends.  U.S. Geological Survey Magnetic data is sufficiently detailed to highlight several trends in the Project ground magnetic data. Click Image To View Full Size Image 1: Copper Hill Project with New Claims and Generalized Geology and Magnetic Interpretation The Company is currently consolidating all data to identify first phase drill targets at Copper Hill and anticipates releasing details once the data compilation and targeting is complete. Click Image To View Full Size Image 2: Location of Copper Hill, Walker Lane Trend, Nevada, USA About the Copper Hill Project Located within the prolific Walker Lane trend in southern Nevada, Copper Hill is situated one of the premier jurisdictions for precious metals mining in the world.  Historic endowment within Walker Lane includes 50Moz Au, 700Moz Ag, and 4Mt Cu.  Copper Hill hosts copper-gold-molybdenum mineralization in both porphyry and skarn styled deposits in Mineral County, Nevada. The property consists of 66 mineral claims covering an area of 2.3 miles. The property is located 22 miles north of Hawthorne, Nevada and is accessible using well-maintained County Roads. The Project is centered on a Jurassic Age quartz monzonite porphyry intruding Triassic age Luning Limestone. The claims cover 2.3 sq miles and are 33 miles east of the Yerington Copper District which hosts the Yerington Copper Mine (Anaconda 1952-1978), Ann Mason Deposit, Bear Deposit, MacArthur Deposit, and the Pumpkin Hollow Mine. Historically at Copper Hill, reported high-grade copper was mined from underground shafts from skarn and porphyry-copper styled mineralization at the Copper Mountain Mine.   Between 1914 to 1926 mining from the “Copper Mountain Mine” produced an estimated 1,000,000 pounds of copper from shallow underground workings. Historic reporting from the period of production describes ore zones of contact skarn- type and porphyry-type mineralization with shipping grades ranging from 3.5 to 11.0% copper*. *Historic Mining information was summarized from an “Unpublished Report on the Carson Sink Area, Nevada by F.C. Schrader, U.S. Geological Survey (Field work 1911-1920) 1947”. Manning Ventures cautions investors that the historic exploration and production information is believed to be accurate but has not been verified by a qualified person. The Copper Hill mineralizing system forms a topographic high surrounded and partially covered by younger volcanic rocks. Mineralization identified at Copper Hill are bornite, chalcocite, chalcopyrite, chrysocolla, copper-native, covellite, cuprite, gold, malachite, molybdenite, silver, sphalerite (rare), and tetrahedrite. The Copper Mountain area was explored between 1959 to 1979 by Idaho Minning Corp. and Walker-Martel who conducted ground geophysics, underground mapping, prospecting and reported 6000 feet of Rotary drilling.  Since that time ground magnetics were conducted in 2007. Rock sampling collected at this time returned values from select samples of 7.2% and 12.7% copper and 1.06 g/t gold and 1.19 g/t gold respectively. The target being sought at Copper Hill is a porphyry styled copper-molybdenum-gold deposit. Warren Robb P.Geo., is the designated Qualified Person as defined by National Instrument 43-101 and is responsible for the technical information contained in this release. About Manning Manning Ventures is a mineral exploration and development company focused metals and materials critical to the growing Energy Metals space. Manning’s project portfolio is focused on Copper in Nevada, Lithium/Copper in Ontario and Quebec, and multiple Iron Ore projects in Quebec. For further information contact: Manning Ventures Inc. Alex Klenman - CEO Email: info@manning-ventures.com Telephone: (604) 681-0084 www.manning-ventures.com FORWARD LOOKING STATEMENTS: The Canadian Securities Exchange does not accept responsibility for the adequacy or accuracy of this news release. Certain statements in this press release may contain forward-looking information (within the meaning of Canadian securities legislation), including, without limitation, the Company’s payment of the Exercise Price during the Option Term, the granting of the net smelter return royalty to the Optionor, and the Company’s payment of the annual minimum payments to the Optionor. These statements address future events and conditions and, as such, involve known and unknown risks, uncertainties, and other factors, which may cause the actual results, performance, or achievements to be materially different from any future results, performance, or achievements expressed or implied by the statements. Forward-looking statements speak only as of the date those statements are made. Although the Company believes the expectations expressed in such forward-looking statements are based on reasonable assumptions, such statements are not guarantees of future performance and actual results may differ materially from those in the forward-looking statements. Factors that could cause the actual results to differ materially from those in forward-looking statements include regulatory actions, market prices, and continued availability of capital and financing, and general economic, market or business conditions. Investors are cautioned that any such statements are not guarantees of future performance and actual results or developments may differ materially from those projected in the forward-looking statements. Forward-looking statements are based on the beliefs, estimates and opinions of the Company's management on the date the statements are made. Except as required by applicable law, the Company assumes no obligation to update or to publicly announce the results of any change to any forward-looking statement contained or incorporated by reference herein to reflect actual results, future events or developments, changes in assumptions, or changes in other factors affecting the forward-looking statements. If the Company updates any forward-looking statement(s), no inference should be drawn that it will make additional updates with respect to those or other forward-looking statements. Copyright (c) 2024 TheNewswire - All rights reserved.",
    "primary_commodity": "Cu"
  },
  "articleProject": {
    "gid": 6588,
    "project_name": "Copper Hill",
    "location": null
  },
  "articleExchange": "CSE",
  "articleCompanyId": 1501,
  "articleTicker": "MANN",
  "articleCompanyName": "Manning Ventures Inc.",
  "allOtherCompanyProjects": [
    {
      "company_id": 1501,
      "gid": 4019,
      "project_name": "Dipole Lithium",
      "location": "Newfoundland and Labrador, Canada"
    },
    {
      "company_id": 1501,
      "gid": 5337,
      "project_name": "Leaf River",
      "location": "Quebec, Canada"
    },
    {
      "company_id": 1501,
      "gid": 6588,
      "project_name": "Copper Hill",
      "location": null
    },
    {
      "company_id": 1501,
      "gid": 3494,
      "project_name": "Bounty",
      "location": "Quebec, Canada"
    },
    {
      "company_id": 1501,
      "gid": 4688,
      "project_name": "Kaba",
      "location": "Ontario, Canada"
    }
  ],
  "allOtherCompanyNews": [
    {
      "id": 89447,
      "company_id": 1501,
      "title": "Manning Ventures Completes Drill Program at the Copper Hill Project, Nevada, USA",
      "link": "https://www.thenewswire.com/press-releases?id=1AG9F2D2R",
      "date": "2025-02-27T13:00:00.000Z",
      "hidden": false
    },
    {
      "id": 84009,
      "company_id": 1501,
      "title": "Manning Ventures Receives Initial Results and Resumes Drill Program at the Copper Hill Project, Nevada, USA",
      "link": "https://www.thenewswire.com/press-releases?id=1AdyFDNYq",
      "date": "2025-01-14T13:30:00.000Z",
      "hidden": false
    },
    {
      "id": 82370,
      "company_id": 1501,
      "title": "Manning Ventures Continues Drilling at the Copper Hill Project, Nevada, USA",
      "link": "https://www.thenewswire.com/press-releases?id=1kVGF5Yoo",
      "date": "2024-12-18T14:25:00.000Z",
      "hidden": false
    },
    {
      "id": 81489,
      "company_id": 1501,
      "title": "Manning Ventures Completes First Two Drill Holes at the Copper Hill Project, Nevada, USA",
      "link": "https://www.thenewswire.com/press-releases?id=1LaPF03n9",
      "date": "2024-12-10T13:30:00.000Z",
      "hidden": false
    },
    {
      "id": 80774,
      "company_id": 1501,
      "title": "Manning Ventures Commences Drill Program at the Copper Hill Project, Nevada, USA",
      "link": "https://www.thenewswire.com/press-releases?id=1BjjFK0zq",
      "date": "2024-12-03T13:30:00.000Z",
      "hidden": false
    },
    {
      "id": 80175,
      "company_id": 1501,
      "title": "Manning Ventures Mobilizes Crew and Equipment for Upcoming Drill Program at the Copper Hill Project, Nevada, USA",
      "link": "https://www.thenewswire.com/press-releases?id=1k98F1oxp",
      "date": "2024-11-27T13:30:00.000Z",
      "hidden": false
    },
    {
      "id": 78812,
      "company_id": 1501,
      "title": "Manning Ventures Hires Driller For Upcoming Drill Program At The Copper Hill Project, Nevada, USA",
      "link": "https://www.thenewswire.com/press-releases?id=1LPRFXw22",
      "date": "2024-11-14T13:30:00.000Z",
      "hidden": false
    },
    {
      "id": 75915,
      "company_id": 1501,
      "title": "Manning Ventures Receives Drill Permit For The Copper Hill Project, Nevada, USA",
      "link": "https://www.thenewswire.com/press-releases?id=1BKRFp4JP",
      "date": "2024-10-24T12:30:00.000Z",
      "hidden": false
    },
    {
      "id": 73565,
      "company_id": 1501,
      "title": "Manning Ventures Submits Drill Plan For The Copper Hill Project, Nevada, USA",
      "link": "https://www.thenewswire.com/press-releases?id=1LymF7YYY",
      "date": "2024-10-02T12:30:00.000Z",
      "hidden": false
    },
    {
      "id": 68834,
      "company_id": 1501,
      "title": "Manning Ventures Provides Drilling Update For Its Copper Hill Project, Nevada, USA",
      "link": "https://www.thenewswire.com/press-releases?id=1k98FGmOZ",
      "date": "2024-08-20T12:00:00.000Z",
      "hidden": false
    }
  ]
}
