{
  "article": {
    "id": 80298,
    "link": "https://contentapi.cision.com/api/v1.0/releases/20241127C4236",
    "title": "Stuhini Announces Option of Jersey Valley Gold Property",
    "description": "\n\n<p><span class=\"legendSpanClass\"><span class=\"xn-location\">VANCOUVER, BC</span></span>, <span class=\"legendSpanClass\"><span class=\"xn-chron\">Nov. 27, 2024</span></span> /CNW/ - Stuhini Exploration Ltd. (\"<b>Stuhini</b>\" or the \"<b>Company</b>\") (TSXV: STU) (OTCQB: STXPF) is pleased to announce that it has entered into an option agreement (the \"<b>Agreement</b>\") with Goodsprings Exploration LLC and others with an effective date of <span class=\"xn-chron\">November 15, 2024</span> (the \"<b>Effective Date</b>\") whereby Stuhini can acquire a 100% interest in the Jersey Valley Property (\"<b>Jersey Valley</b>\", \"<b>Project</b>\", or the \"<b>Property</b>\"), located in <span class=\"xn-location\">Pershing County, Nevada</span> (the \"<b>Option</b>\").</p>\n<p>The Jersey Valley Property is a gold exploration project located in the well-known <span class=\"xn-location\">Battle Mountain</span> area of <span class=\"xn-location\">Nevada</span>. The Property comprises 143 unpatented lode claims, covering 2954.5 acres (1195.7 hectares) and is located in a favourable structural and lithostratigraphic setting. Access to the Property from <span class=\"xn-location\">Battle Mountain</span> is approximately 70 kilometres (\"km\") by paved and gravel roads.</p>\n<div class=\"PRN_ImbeddedAssetReference\" id=\"DivAssetPlaceHolder8731\"><p><a href=\"https://mma.prnewswire.com/media/2569043/Stuhini_Exploration_Ltd__Stuhini%C2%A0Announces%C2%A0Option_of_Jersey_Vall.html\" rel=\"nofollow\" target=\"_blank\"><img alt=\"Figure 1. A map of the Project location southwest of Battle Mountain, Nevada. (CNW Group/Stuhini Exploration Ltd.)\" src=\"https://mma.prnewswire.com/media/2569043/Stuhini_Exploration_Ltd__Stuhini%C2%A0Announces%C2%A0Option_of_Jersey_Vall.jpg?p=original\" title=\"Figure 1. A map of the Project location southwest of Battle Mountain, Nevada. (CNW Group/Stuhini Exploration Ltd.)\"></img></a></p>\n</div><p>The lithostratigraphic units of the Project area include calcareous siltstones and sandstones of the Havallah Formation, which have been strongly silicified. The Havallah is the primary host rock at the nearby Buffalo Valley and <span class=\"xn-person\">Lone Tree</span> gold mines. Outcrops of the Havallah on the Jersey Valley Property include jasperoids, iron-oxide-stained fractured calcareous siltstones, and acid-leached siltstone breccias - see photos in Figure 1. Rock samples have returned anomalous values of pathfinder elements, such as arsenic – 2100 ppm, antimony – 266 ppm, mercury – 21 ppm, silver – 4 ppm and gold values up to 75 ppb. This anomalous geochemistry combined with the acid-leaching of the calcareous units within the Havallah exposed on the Property are interpreted to be the result of strong vapour-phase alteration associated with a lithocap.</p>\n<div class=\"PRN_ImbeddedAssetReference\" id=\"DivAssetPlaceHolder1917\"><p><a href=\"https://mma.prnewswire.com/media/2569042/Stuhini_Exploration_Ltd__Stuhini%C2%A0Announces%C2%A0Option_of_Jersey_Vall.html\" rel=\"nofollow\" target=\"_blank\"><img alt=\"Figure 2. A selection of the rocks found on the Property. A) Iron-oxide stained jasperoid, B) Fractured calcareous siltstone C) Acid-leached siltstone breccia. (CNW Group/Stuhini Exploration Ltd.)\" src=\"https://mma.prnewswire.com/media/2569042/Stuhini_Exploration_Ltd__Stuhini%C2%A0Announces%C2%A0Option_of_Jersey_Vall.jpg?p=original\" title=\"Figure 2. A selection of the rocks found on the Property. A) Iron-oxide stained jasperoid, B) Fractured calcareous siltstone C) Acid-leached siltstone breccia. (CNW Group/Stuhini Exploration Ltd.)\"></img></a></p>\n</div><p>There is evidence of very limited work by two companies on the Property in the 1990s. This work included a small trenching program conducted by <span class=\"xn-person\">Barrick Gold</span>. Sampling results from both work programs are unknown. Uranerz Exploration and Mining Limited also drilled two west-directed drill holes in the southern area of the Property and three holes in the northern area. Efforts have been made to track down this historical data but were unsuccessful. At the time of the drilling, 300-foot-deep holes were typical for exploration programs and may not have tested the potential for deeper mineralization.</p>\n<p>Stuhini President and CEO <span class=\"xn-person\">Dave O'Brien</span> commented: \"We are excited to obtain an option on the Jersey Valley Property on reasonable and non-dilutive terms. The Property represents an opportunity for us to explore in a jurisdiction known for being well endowed with precious metals and hosting several large mines over the years.\"</p>\n<p>During the 30-year term of the Agreement, Stuhini must make the following minimum payments (until the commencement of commercial production on the Property) (the \"<b>Minimum Payments</b>\") to keep the Option in good standing:</p>\n<div><table border=\"0\" cellpadding=\"1\" cellspacing=\"0\" class=\"prnbcc\"><tr><td class=\"prngen2\" colspan=\"1\" nowrap=\"nowrap\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\"><b>Minimum Payments</b></span></p>\n</td><td class=\"prngen2\" colspan=\"1\" nowrap=\"nowrap\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\"><b>Payment Dates</b></span></p>\n</td></tr><tr><td class=\"prngen2\" colspan=\"1\" nowrap=\"nowrap\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\">On signing the Agreement</span></p>\n</td><td class=\"prngen2\" colspan=\"1\" nowrap=\"nowrap\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\">U.S.$7,500 plus reimbursement of Owner's <br></br>payment of the BLM mining claim maintenance <br></br>fees and Nevada mining claim fees for the Property <br></br>in the amount of U.S.$2,000.00</span></p>\n</td></tr><tr><td class=\"prngen2\" colspan=\"1\" nowrap=\"nowrap\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\">1st anniversary of Effective Date</span></p>\n</td><td class=\"prngen2\" colspan=\"1\" nowrap=\"nowrap\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\">U.S.$7,500</span></p>\n</td></tr><tr><td class=\"prngen2\" colspan=\"1\" nowrap=\"nowrap\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\">2nd anniversary of Effective Date</span></p>\n</td><td class=\"prngen2\" colspan=\"1\" nowrap=\"nowrap\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\">U.S.$10,000</span></p>\n</td></tr><tr><td class=\"prngen2\" colspan=\"1\" nowrap=\"nowrap\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\">3rd anniversary</span></p>\n</td><td class=\"prngen2\" colspan=\"1\" nowrap=\"nowrap\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\">U.S.$15,000</span></p>\n</td></tr><tr><td class=\"prngen2\" colspan=\"1\" nowrap=\"nowrap\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\">4th and each succeeding <br></br>anniversary of the Effective Date <br></br>until the Commencement of <br></br>Commercial Production of <br></br>Minerals from the Property, as <br></br>adjusted for inflation <br></br>commencing on the sixth <br></br>anniversary of the Effective Date</span></p>\n</td><td class=\"prngen2\" colspan=\"1\" nowrap=\"nowrap\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\">U.S.$25,000</span></p>\n</td></tr></table></div><p>There are no work commitments associated with the Option and the only committed obligation is the <span class=\"xn-money\">US$7,500</span> cash payment on signing.  The balance of the Minimum Payments are all at the Company's election should it wish to maintain the Option after year 1.</p>\n<p>Stuhini may exercise the Option at any time by making a cash payment of <span class=\"xn-money\">US$300,000</span> (in addition to any Minimum Payments already made).  Upon exercise of the Option, Stuhini will grant a 2.0% gross returns royalty (the \"<b>Royalty</b>\") on the Property, subject to Stuhini's right to purchase 50% of the Royalty (representing 1.0% of the gross returns) for <span class=\"xn-money\">US$2,000,000</span> within 30 days of commencement of commercial production.  Minimum Payments made after the exercise of the Option shall be credited against the Royalty payments. </p>\n<p>The technical disclosures contained in this news release have been approved by Ehsan Salmabadi, P.Geo., and VP Exploration and Project Development for Stuhini, who is a \"Qualified Person\" for the purposes of National Instrument 43‑101 ‑ <i>Standards of Disclosure for Mineral Projects</i>. </p>\n<p><b>About Stuhini Exploration Ltd.<br></br></b>Stuhini is a mineral exploration company focused on exploration and development of precious and base metals properties in western <span class=\"xn-location\">Canada</span> and the southwest <span class=\"xn-location\">United States</span>. The Company's portfolio of exploration properties includes the flagship Ruby Creek Property, 14 km east of <span class=\"xn-location\">Atlin, BC</span>; the Que Project, 70 km north of Johnson's Crossing, <span class=\"xn-location\">Yukon</span>; the South Thompson Nickel Project, 35 km northwest of <span class=\"xn-location\">Grand Rapids, Manitoba</span>; the Big Ledge Property, 57 km south of <span class=\"xn-location\">Revelstoke, BC</span>; the Red Hills Project in northeast <span class=\"xn-location\">Nevada</span>, the Jersey Valley Property in northwest <span class=\"xn-location\">Nevada</span> and the Lindsay Project in southeast <span class=\"xn-location\">Arizona</span>.</p>\n<p><b>Forward-Looking Statements<br></br></b>This news release contains \"forward–looking information\" within the meaning of Canadian securities laws, which may include, but are not limited to statements relating to the Jersey Valley Option Agreement, the exercise of the Option, future exploration plans and the ability to fund these plans, the prospective nature of the Property and the market outlook for gold and mineral exploration projects. All statements in this release, other than statements of historical facts, that address events or developments that the Company expects to occur, are forward-looking statements. Although the Company believes the expectations expressed in such forward-looking statements are based on reasonable assumptions, such statements are not guarantees of future performance and actual results may differ materially from those in the forward-looking statements. Factors that could cause the actual results to differ materially from those in forward-looking statements include regulatory actions, fluctuations in metal and commodity prices, changes in US Canadian currency exchange rates, market prices, failure to obtain permits, and continued availability of capital and financing, and general economic, market or business conditions. In particular, there is no guarantee that exploration work, as proposed, or otherwise, will be completed on the Property or that the Option will be exercised. Such forward-looking information reflects the Company's views with respect to future events and is subject to risks, uncertainties and assumptions, including those set out in the Company's quarterly and annual management discussion and analysis. Investors are cautioned that any such statements are not guarantees of future performance and actual results or developments may differ materially from those projected in the forward-looking statements. There can be no assurance that any forward-looking statements or information will prove to be accurate as actual results, and future events could differ materially from those anticipated in such statements or information. Accordingly, readers should not place undue reliance on forward-looking statements or information. Except as required by applicable securities laws, the Company undertakes no obligation to update these forward-looking statements in the event that management's beliefs, estimates or opinions, or other factors, should change.</p>\n<p><i>Neither the TSX Venture Exchange nor its Regulation Services Provider (as that term is defined in the policies of the TSX Venture Exchange) accepts responsibility for the adequacy or accuracy of this release.</i></p>\n\n<div class=\"PRN_ImbeddedAssetReference\" id=\"DivAssetPlaceHolder0\">\n                    <p>\n                            <a href=\"https://mma.prnewswire.com/media/2569027/Stuhini_Exploration_Ltd__Stuhini%C2%A0Announces%C2%A0Option_of_Jersey_Vall.html\" rel=\"nofollow\" target=\"_blank\">\n                        <img alt=\"Stuhini Exploration Ltd. logo (CNW Group/Stuhini Exploration Ltd.)\" src=\"https://mma.prnewswire.com/media/2569027/Stuhini_Exploration_Ltd__Stuhini%C2%A0Announces%C2%A0Option_of_Jersey_Vall.jpg\" title=\"Stuhini Exploration Ltd. logo (CNW Group/Stuhini Exploration Ltd.)\"></img>\n                            </a>\n                    </p>\n\n</div>\n<p>SOURCE  Stuhini Exploration Ltd.</p>\n<img alt=\"\" src=\"https://rt.newswire.ca/rt.gif?NewsItemId=C4236&amp;Transmission_Id=202411272250CANADANWCANADAPR_C4236&amp;DateId=20241127\" style=\"border:0px; width:1px; height:1px;\"></img>\n\n",
    "search_terms": "Jersey Valley,Stuhini Exploration Ltd.,STU",
    "master_gid": 9139,
    "date": "2024-11-28T03:50:00.000Z",
    "tags": "USA|Nevada||Gold|Project Acquisition",
    "image_id": null,
    "hidden": false,
    "company_id": 330,
    "provider": "cision",
    "excerpt": "VANCOUVER, BC,Nov. 27, 2024/CNW/ - Stuhini Exploration Ltd. (\"Stuhini\" or the \"Company\") (TSXV: STU) (OTCQB: STXPF) is pleased to announce that it has entered into an option agreement (the \"Agreement\") with Goodsprings Exploration LLC and others with an effective date ofNovember 15, 2024(the \"Effective Date\") whereby Stuhini can acquire a 100% interest in",
    "is_regulatory": false,
    "refined_tags": null,
    "ftp_filename": null,
    "company_name": "Stuhini Exploration Ltd.",
    "exchange": "TSXV",
    "root_ticker": "STU",
    "project_name": "Jersey Valley",
    "gid": 9139,
    "location": "Nevada, United States",
    "plan_id": null,
    "description_text": "VANCOUVER, BC , Nov. 27, 2024 /CNW/ - Stuhini Exploration Ltd. (\" Stuhini \" or the \" Company \") (TSXV: STU) (OTCQB: STXPF) is pleased to announce that it has entered into an option agreement (the \" Agreement \") with Goodsprings Exploration LLC and others with an effective date of November 15, 2024 (the \" Effective Date \") whereby Stuhini can acquire a 100% interest in the Jersey Valley Property (\" Jersey Valley \", \" Project \", or the \" Property \"), located in Pershing County, Nevada (the \" Option \"). The Jersey Valley Property is a gold exploration project located in the well-known Battle Mountain area of Nevada . The Property comprises 143 unpatented lode claims, covering 2954.5 acres (1195.7 hectares) and is located in a favourable structural and lithostratigraphic setting. Access to the Property from Battle Mountain is approximately 70 kilometres (\"km\") by paved and gravel roads. The lithostratigraphic units of the Project area include calcareous siltstones and sandstones of the Havallah Formation, which have been strongly silicified. The Havallah is the primary host rock at the nearby Buffalo Valley and Lone Tree gold mines. Outcrops of the Havallah on the Jersey Valley Property include jasperoids, iron-oxide-stained fractured calcareous siltstones, and acid-leached siltstone breccias - see photos in Figure 1. Rock samples have returned anomalous values of pathfinder elements, such as arsenic – 2100 ppm, antimony – 266 ppm, mercury – 21 ppm, silver – 4 ppm and gold values up to 75 ppb. This anomalous geochemistry combined with the acid-leaching of the calcareous units within the Havallah exposed on the Property are interpreted to be the result of strong vapour-phase alteration associated with a lithocap. There is evidence of very limited work by two companies on the Property in the 1990s. This work included a small trenching program conducted by Barrick Gold . Sampling results from both work programs are unknown. Uranerz Exploration and Mining Limited also drilled two west-directed drill holes in the southern area of the Property and three holes in the northern area. Efforts have been made to track down this historical data but were unsuccessful. At the time of the drilling, 300-foot-deep holes were typical for exploration programs and may not have tested the potential for deeper mineralization. Stuhini President and CEO Dave O'Brien commented: \"We are excited to obtain an option on the Jersey Valley Property on reasonable and non-dilutive terms. The Property represents an opportunity for us to explore in a jurisdiction known for being well endowed with precious metals and hosting several large mines over the years.\" During the 30-year term of the Agreement, Stuhini must make the following minimum payments (until the commencement of commercial production on the Property) (the \" Minimum Payments \") to keep the Option in good standing: Minimum Payments Payment Dates On signing the Agreement U.S.$7,500 plus reimbursement of Owner's payment of the BLM mining claim maintenance fees and Nevada mining claim fees for the Property in the amount of U.S.$2,000.00 1st anniversary of Effective Date U.S.$7,500 2nd anniversary of Effective Date U.S.$10,000 3rd anniversary U.S.$15,000 4th and each succeeding anniversary of the Effective Date until the Commencement of Commercial Production of Minerals from the Property, as adjusted for inflation commencing on the sixth anniversary of the Effective Date U.S.$25,000 There are no work commitments associated with the Option and the only committed obligation is the US$7,500 cash payment on signing.  The balance of the Minimum Payments are all at the Company's election should it wish to maintain the Option after year 1. Stuhini may exercise the Option at any time by making a cash payment of US$300,000 (in addition to any Minimum Payments already made).  Upon exercise of the Option, Stuhini will grant a 2.0% gross returns royalty (the \" Royalty \") on the Property, subject to Stuhini's right to purchase 50% of the Royalty (representing 1.0% of the gross returns) for US$2,000,000 within 30 days of commencement of commercial production.  Minimum Payments made after the exercise of the Option shall be credited against the Royalty payments. The technical disclosures contained in this news release have been approved by Ehsan Salmabadi, P.Geo., and VP Exploration and Project Development for Stuhini, who is a \"Qualified Person\" for the purposes of National Instrument 43‑101 ‑ Standards of Disclosure for Mineral Projects . About Stuhini Exploration Ltd. Stuhini is a mineral exploration company focused on exploration and development of precious and base metals properties in western Canada and the southwest United States . The Company's portfolio of exploration properties includes the flagship Ruby Creek Property, 14 km east of Atlin, BC ; the Que Project, 70 km north of Johnson's Crossing, Yukon ; the South Thompson Nickel Project, 35 km northwest of Grand Rapids, Manitoba ; the Big Ledge Property, 57 km south of Revelstoke, BC ; the Red Hills Project in northeast Nevada , the Jersey Valley Property in northwest Nevada and the Lindsay Project in southeast Arizona . Forward-Looking Statements This news release contains \"forward–looking information\" within the meaning of Canadian securities laws, which may include, but are not limited to statements relating to the Jersey Valley Option Agreement, the exercise of the Option, future exploration plans and the ability to fund these plans, the prospective nature of the Property and the market outlook for gold and mineral exploration projects. All statements in this release, other than statements of historical facts, that address events or developments that the Company expects to occur, are forward-looking statements. Although the Company believes the expectations expressed in such forward-looking statements are based on reasonable assumptions, such statements are not guarantees of future performance and actual results may differ materially from those in the forward-looking statements. Factors that could cause the actual results to differ materially from those in forward-looking statements include regulatory actions, fluctuations in metal and commodity prices, changes in US Canadian currency exchange rates, market prices, failure to obtain permits, and continued availability of capital and financing, and general economic, market or business conditions. In particular, there is no guarantee that exploration work, as proposed, or otherwise, will be completed on the Property or that the Option will be exercised. Such forward-looking information reflects the Company's views with respect to future events and is subject to risks, uncertainties and assumptions, including those set out in the Company's quarterly and annual management discussion and analysis. Investors are cautioned that any such statements are not guarantees of future performance and actual results or developments may differ materially from those projected in the forward-looking statements. There can be no assurance that any forward-looking statements or information will prove to be accurate as actual results, and future events could differ materially from those anticipated in such statements or information. Accordingly, readers should not place undue reliance on forward-looking statements or information. Except as required by applicable securities laws, the Company undertakes no obligation to update these forward-looking statements in the event that management's beliefs, estimates or opinions, or other factors, should change. Neither the TSX Venture Exchange nor its Regulation Services Provider (as that term is defined in the policies of the TSX Venture Exchange) accepts responsibility for the adequacy or accuracy of this release. SOURCE  Stuhini Exploration Ltd.",
    "primary_commodity": "Au"
  },
  "articleProject": {
    "gid": 9139,
    "project_name": "Jersey Valley",
    "location": "Nevada, United States"
  },
  "articleExchange": "TSXV",
  "articleCompanyId": 330,
  "articleTicker": "STU",
  "articleCompanyName": "Stuhini Exploration Ltd.",
  "allOtherCompanyProjects": [
    {
      "company_id": 330,
      "gid": 6336,
      "project_name": "Big Ledge",
      "location": "British Columbia, Canada"
    },
    {
      "company_id": 330,
      "gid": 9934,
      "project_name": "Red Hills",
      "location": "Nevada, United States"
    },
    {
      "company_id": 330,
      "gid": 549,
      "project_name": "Ruby Creek",
      "location": "British Columbia, Canada"
    },
    {
      "company_id": 330,
      "gid": 9139,
      "project_name": "Jersey Valley",
      "location": "Nevada, United States"
    },
    {
      "company_id": 330,
      "gid": 6337,
      "project_name": "South Thompson",
      "location": "Manitoba, Canada"
    }
  ],
  "allOtherCompanyNews": [
    {
      "id": 106585,
      "company_id": 330,
      "title": "Stuhini Exploration Appoints Meredith Eades as President and Chief Executive Officer; Appoints David O'Brien as Board Chair; Announces other Corporate Updates",
      "link": "https://contentapi.cision.com/api/v1.0/releases/20250602C6154",
      "date": "2025-06-02T12:30:00.000Z",
      "hidden": false
    },
    {
      "id": 98779,
      "company_id": 330,
      "title": "Stuhini Announces Corporate Changes",
      "link": "https://contentapi.cision.com/api/v1.0/releases/20250404C4823",
      "date": "2025-04-05T01:26:00.000Z",
      "hidden": false
    },
    {
      "id": 90363,
      "company_id": 330,
      "title": "Stuhini Proposes to Extend Warrants, Announces Que Option Termination",
      "link": "https://contentapi.cision.com/api/v1.0/releases/20250307C9589",
      "date": "2025-03-08T02:41:00.000Z",
      "hidden": false
    },
    {
      "id": -171876,
      "company_id": 330,
      "title": "Stuhini to attend PDAC, Outlines Exploration Plans and Current Targets at Red Hills Silver Project",
      "link": "https://contentapi.cision.com/api/v1.0/releases/20250228C8775",
      "date": "2025-02-28T21:35:00.000Z",
      "hidden": false
    },
    {
      "id": 84100,
      "company_id": 330,
      "title": "Stuhini Exploration Grants Stock Options",
      "link": "https://contentapi.cision.com/api/v1.0/releases/20250114C2047",
      "date": "2025-01-15T04:55:00.000Z",
      "hidden": false
    },
    {
      "id": -158920,
      "company_id": 330,
      "title": "Stuhini Announces Intention to Extend Warrant Expiry Dates",
      "link": "https://contentapi.cision.com/api/v1.0/releases/20241205C3223",
      "date": "2024-12-05T21:15:00.000Z",
      "hidden": false
    },
    {
      "id": -158766,
      "company_id": 330,
      "title": "Stuhini Announces Annual General Meeting Voting Results",
      "link": "https://contentapi.cision.com/api/v1.0/releases/20241204C1219",
      "date": "2024-12-05T01:25:00.000Z",
      "hidden": false
    },
    {
      "id": 80298,
      "company_id": 330,
      "title": "Stuhini Announces Option of Jersey Valley Gold Property",
      "link": "https://contentapi.cision.com/api/v1.0/releases/20241127C4236",
      "date": "2024-11-28T03:50:00.000Z",
      "hidden": false
    },
    {
      "id": -154898,
      "company_id": 330,
      "title": "Stuhini Stakes New Ground at Red Hills Silver Property, Nevada",
      "link": "https://contentapi.cision.com/api/v1.0/releases/20241119C7144",
      "date": "2024-11-19T13:30:00.000Z",
      "hidden": false
    },
    {
      "id": 76741,
      "company_id": 330,
      "title": "Stuhini to Present at the Emerging Growth Conference on Oct 31st",
      "link": "https://contentapi.cision.com/api/v1.0/releases/20241030C1140",
      "date": "2024-10-30T04:38:00.000Z",
      "hidden": false
    }
  ]
}
