{
  "article": {
    "id": 42456,
    "link": "https://www.newsfilecorp.com/release/183981/Golden-Independence-Announces-Option-to-Acquire-Wrey-Mesa-Uranium-Project",
    "title": "Golden Independence Announces Option to Acquire Wrey Mesa Uranium Project",
    "description": "<img src=\"https://api.newsfilecorp.com/newsinfo/183981/367\" id=\"367\" width=\"2\" height=\"2\" style=\"width: 1px;  height: 1px;border: 0px solid;\" /><p>Vancouver, British Columbia--(Newsfile Corp. - October 16, 2023) - Golden Independence Mining Corp. (CSE: IGLD) (OTCQB: GIDMF) (FSE: 6NNA) (the \"<b>Company</b>\" or \"<b>Golden Independence</b>\") is pleased to announce it has entered into an option agreement (the \"<b>Option Agreement</b>\") to acquire up to a 90%-interest in the Wray Mesa uranium project in Utah, USA.</p><p>The Wray Mesa project is comprised of 308 unpatented lode claims totalling 6,282 acres located in San Juan County, Utah. The property is accessible via Utah State Highway 46 and unpaved Forest Service Roads, with access to power, water and proximal to the town of La Sal. The property is contiguous to and adjoins Energy Fuel Inc.'s fully-permitted and production-ready La Sal project which includes a number of past-producing uranium and vanadium mines (production of 550,000 lbs U3O8 in 2012). The La Sal project is host to Measured &#38; Indicated resources of 4.1 Mlb of uranium (U3O8) plus 21.5 Mlb of vanadium (V2O5) plus Inferred resources of 0.4 Mlb of uranium plus 1.9 Mlb of vanadium (source: Technical Report on the La Sal District Project, prepared for Energy Fuels Inc. by D.C. Peters and dated March 25, 2014.). The Company cautions investors that the presence of mineralization at the La Sal project is not necessarily indicative of similar mineralization at the Wray Mesa project.</p><p>\"With the recent resurgence of uranium prices to over US$70 per pound, representing 10-year highs, and the global push towards clean energy, this has created a resurgence in the prospectivity of conventional uranium deposits within the USA that had been overlooked during a depressed spot price environment,\" commented Jeremy Poirier, CEO of Golden Independence. \"The ability to acquire a majority interest in an advanced-stage uranium project which has benefited from extensive past exploration and drilling located within a Tier-1 jurisdiction provides an exciting opportunity for shareholders to gain exposure to the growing energy trend while maintaining a Tier-1 portfolio for both gold and uranium.\"</p><p>\"With Basin Uranium's focus firmly shifted towards it's Chord project in South Dakota, this agreement allows the project to advance while still providing the Company exposure to an exciting uranium district in Utah,\" commented Michael Blady, CEO of Basin Uranium. \"We look forward to working with the Golden Independence team as the project operator under the initial earn-in agreement to advance the understanding of the project and better define the areas of historical mineralization. Given the significant appetite for advanced-stage uranium assets in safe jurisdictions combined with support from the US Government in advancing clean energy security, this allows both companies to benefit from this pivotal time in the global energy transition.\"</p><p><b>Wray Mesa Project Overview</b></p><ul style=\"list-style-type: disc;\"><li>Uranium and vanadium production in the district dates back to the early 1900's with the majority of the production derived from the Upper Salt Wash Member of the Morrison Formation (the 'Formation'). </li><li>Work by previous operators discovered multiple areas of uranium-vanadium mineralization in the same geologic formation that accounted for the majority of production in the district (Upper Salt Wash Member of the Morrison Formation). </li><li>Mineralization on the property occurs at depths of 500 to 750 feet with the drill-defined mineralization ranging from 25 to 75 feet. Mineralization is typical sandstone-hosted tabular deposits wherein the uranium occurs in reduced and altered sandstones and sandstone-mudstones in major stream channels in the Formation.</li><li>Historical work dates back to Atlas Minerals and Pioneer Uravan in 1976 to 1983, who drilled a total of 495 exploration holes (of which logs for 193 holes totaling 137,510 feet or 41,913 metres were preserved), and Homeland Uranium in 2007-2008 who drilled 15 holes. Note: some of the historical drilling was on 3rd party claims not currently owned.</li><li>Past exploration was primarily focused on the Dylan, Ajax, Whiskey and Carlin targets. All of the mineralized areas are open to expansion. Historic drill data is not available for Carlin:<ul style=\"list-style-type: circle;\"><li>Ajax: most heavily drilled and tightest spacings with some holes 25 to 50 feet apart. A total of 164 historic holes drilled which defined mineralization a 1,200 by 25-75 metre area. Thirty (30) holes returned grades in excess of 0.1% eU3O8.</li><li>Dylan: best defined with drilling on a 100 by 100-foot grid. Thirty-nine holes were drilled in 1976 to 1983 with follow-up drilling in 2007 which defined mineralization over a 500 by 40-100 metre area. Seven (7) holes returned grades in excess of 0.2% eU3O8, with highlight grades of 2.5% eU3O8 over 2.6 feet.</li><li>Whiskey: A total of 29 holes drilled at 100-foot spacings with a number of holes intersecting significant mineralization and defining an area of 400 by 10-70 metres. Highlights of drilling included 0.98% eU3O8 over 5 feet. Further follow-up and more systematic drilling is required.</li><li>Carlin: While complete historical records are unavailable, based on limited data mineralization was defined over a 150 by 20-70 metre area.</li></ul></li></ul><p style=\"text-align: center;\"><a rel=\"nofollow\" href=\"https://images.newsfilecorp.com/files/7273/183981_c3013d29144458f0_001full.jpg\"><img src=\"https://images.newsfilecorp.com/files/7273/183981_c3013d29144458f0_001.jpg\" style=\"border-width: 0px;\" alt=\"Cannot view this image? Visit: https://images.newsfilecorp.com/files/7273/183981_c3013d29144458f0_001.jpg\" /></a><br /><br /><u>Figure 1: Wray Mesa Property Map</u></p><p style=\"text-align: center;\">To view an enhanced version of this graphic, please visit:<br /><a rel=\"nofollow\" href=\"https://images.newsfilecorp.com/files/7273/183981_c3013d29144458f0_001full.jpg\">https://images.newsfilecorp.com/files/7273/183981_c3013d29144458f0_001full.jpg</a></p><p><b>Transaction Terms</b></p><p>Under the terms of the Option Agreement between the Company and Basin Uranium Corp. (CSE: NCLR), the Company will have the right to acquire up to a 90%-interest in the project through staged cash, share and work commitments. To earn an initial 51% interest in the project, the Company must pay C$50,000 in cash and issue 300,000 shares within five days of approval of the Canadian Securities Exchange and incur US$250,000 in exploration within the first year, in addition to paying C$100,000 in cash, issuing C$250,000 worth of stock and incurring US$500,000 of exploration by the end of the second year. Once the 51% earn-in has been completed, the Company has the option to earn an additional 20% interest (for a total of 71%) through an additional payment of C$75,000 in cash plus issuing C$250,000 worth of stock and incurring US$1,000,000 in exploration by the end of the third year. Assuming the completion of a 71% earn-in, the Company can earn a further 19% interest (for a total of 90%) through the payment of C$75,000 in cash plus issuing C$250,000 worth of stock and incurring US$1,000,000 in exploration by the end of the fourth year. Once the Company has earned a 90% interest in the project, Basin Uranium Corp. will have a free carried 10% interest in the project.</p><p>The technical content of this news release has been reviewed and approved by R. Tim Henneberry, P.Geo. (BC), a Director and President of Golden Independence Mining Corp. and a Qualified Person under National Instrument 43-101.</p><p><b>About Golden Independence Mining Corp.</b></p><p>Golden Independence Mining is a development company currently focused on the development-stage Independence project located adjacent to Nevada Gold mine's Phoenix-Fortitude mine in the Battle Mountain-Cortez trend of Nevada in addition to the wholly owned Napoleon gold project located in the Kamloops mining division of British Columbia. The Independence project hosts an M&#38;I (measured and indicated) resource of 334,300 ounces of gold (28M tonnes at 0.41 g/t gold) and an inferred resource of 847,000 ounces (9M tonnes at 3.22 g/t gold) of gold with a substantial silver credit. A 2021 preliminary economic assessment (PEA) outlined a low-cost heap leach operation focusing on the near-surface resource with total production of 195,443 ounces of gold at an all-in sustaining cost of $1,078 (U.S.) per ounce of gold. The Napoleon project comprises over 1,000 hectares and prospective for multiple forms of gold mineralization, with exploration in the area dating back to the 1970s with the discovery of high-grade gold.</p><p>Golden Independence cautions investors the preliminary economic assessment is preliminary in nature, it includes inferred mineral resources that are considered too speculative geologically to have the economic considerations applied to them that would enable them to be categorized as mineral reserves, and there is no certainty that the preliminary economic assessment will be realized. Golden Independence further cautions investors Mineral Resources which are not Mineral Reserves do not have demonstrated economic viability and further cautions investors the quantity and grade of the reported inferred Mineral Resources are uncertain in nature &#8206;and there has been insufficient exploration to define these inferred Mineral Resources as &#8206;indicated Mineral Resources.</p><p>The Napoleon project is comprised of over 1,000 hectares and prospective for multiple forms of gold mineralization, with exploration in the area dating back to the 1970's with the discovery of high-grade gold.</p><p><b>FOR FURTHER INFORMATION PLEASE CONTACT: </b></p><p>Jeremy Poirier, Chief Executive Officer<br />Telephone: 1.604.722.9842  Email: <a href=\"mailto:info@goldenindependence.co\">info@goldenindependence.co</a></p><p><i>This press release contains forward-looking information (within the meaning of applicable Canadian securities legislation) that involves various risks and uncertainties regarding future events. Such forward-looking information includes statements based on current expectations of management made in light of management's experience and perception of historical trends, current conditions and expected future developments. Forward-looking information is subject to a number of risks and uncertainties and, as such, forward-looking statements are not guarantees of future performance of the Company. Forward-looking information in this news release includes, without limitation, statements regarding the exercise of the option under the Option Agreement and the future exploration and development potential of the Wray Mesa project. There are numerous risks and uncertainties that could cause actual results to differ materially from those expressed in the forward-looking information in this news release, including without limitation, inherent risks associated with the mining industry and the results of exploration activities and development of mineral properties, stock market volatility and capital market fluctuations, general market and industry conditions, as well as those risk factors discussed in the Company's most recently filed management's discussion &#38; analysis. Actual results and future events could differ materially from those anticipated in such information. This forward-looking information is based on estimates and opinions of management on the date hereof and is expressly qualified by this notice. Risks and uncertainties about the Company's business are more fully discussed in the Company's disclosure materials filed with the securities regulatory authorities in Canada at www.sedar.com. The Company assumes no obligation to update any forward-looking information or to update the reasons why actual results could differ from such information unless required by applicable law.</i></p><p id=\"corporateLinkBack\">To view the source version of this press release, please visit <a href=\"https://api.newsfilecorp.com/redirect/gOQx2Cm3wG\">https://www.newsfilecorp.com/release/183981</a></p>",
    "search_terms": "Wray Mesa,Nexus Uranium Corp.,IGLD",
    "master_gid": 3522,
    "date": "2023-10-16T12:30:00.000Z",
    "tags": "USA|Utah||Uranium|Project Acquisition",
    "image_id": null,
    "hidden": false,
    "company_id": 200,
    "provider": null,
    "excerpt": "Vancouver, British Columbia--(Newsfile Corp. - October 16, 2023) - Golden Independence Mining Corp. (CSE: IGLD) (OTCQB: GIDMF) (FSE: 6NNA) (the \"Company\" or \"Golden Independence\") is pleased to announce it has entered into an option agreement (the \"Option Agreement\") to acquire up to a 90%-interest in the Wray Mesa uranium project",
    "is_regulatory": false,
    "refined_tags": [
      "Project Acquisition"
    ],
    "ftp_filename": null,
    "company_name": "Nexus Uranium Corp.",
    "exchange": "CSE",
    "root_ticker": "NEXU",
    "project_name": "Wray Mesa",
    "gid": 3522,
    "location": "Utah, United States",
    "plan_id": null,
    "description_text": "Vancouver, British Columbia--(Newsfile Corp. - October 16, 2023) - Golden Independence Mining Corp. (CSE: IGLD) (OTCQB: GIDMF) (FSE: 6NNA) (the \" Company \" or \" Golden Independence \") is pleased to announce it has entered into an option agreement (the \" Option Agreement \") to acquire up to a 90%-interest in the Wray Mesa uranium project in Utah, USA. The Wray Mesa project is comprised of 308 unpatented lode claims totalling 6,282 acres located in San Juan County, Utah. The property is accessible via Utah State Highway 46 and unpaved Forest Service Roads, with access to power, water and proximal to the town of La Sal. The property is contiguous to and adjoins Energy Fuel Inc.'s fully-permitted and production-ready La Sal project which includes a number of past-producing uranium and vanadium mines (production of 550,000 lbs U3O8 in 2012). The La Sal project is host to Measured & Indicated resources of 4.1 Mlb of uranium (U3O8) plus 21.5 Mlb of vanadium (V2O5) plus Inferred resources of 0.4 Mlb of uranium plus 1.9 Mlb of vanadium (source: Technical Report on the La Sal District Project, prepared for Energy Fuels Inc. by D.C. Peters and dated March 25, 2014.). The Company cautions investors that the presence of mineralization at the La Sal project is not necessarily indicative of similar mineralization at the Wray Mesa project. \"With the recent resurgence of uranium prices to over US$70 per pound, representing 10-year highs, and the global push towards clean energy, this has created a resurgence in the prospectivity of conventional uranium deposits within the USA that had been overlooked during a depressed spot price environment,\" commented Jeremy Poirier, CEO of Golden Independence. \"The ability to acquire a majority interest in an advanced-stage uranium project which has benefited from extensive past exploration and drilling located within a Tier-1 jurisdiction provides an exciting opportunity for shareholders to gain exposure to the growing energy trend while maintaining a Tier-1 portfolio for both gold and uranium.\" \"With Basin Uranium's focus firmly shifted towards it's Chord project in South Dakota, this agreement allows the project to advance while still providing the Company exposure to an exciting uranium district in Utah,\" commented Michael Blady, CEO of Basin Uranium. \"We look forward to working with the Golden Independence team as the project operator under the initial earn-in agreement to advance the understanding of the project and better define the areas of historical mineralization. Given the significant appetite for advanced-stage uranium assets in safe jurisdictions combined with support from the US Government in advancing clean energy security, this allows both companies to benefit from this pivotal time in the global energy transition.\" Wray Mesa Project Overview Uranium and vanadium production in the district dates back to the early 1900's with the majority of the production derived from the Upper Salt Wash Member of the Morrison Formation (the 'Formation'). Work by previous operators discovered multiple areas of uranium-vanadium mineralization in the same geologic formation that accounted for the majority of production in the district (Upper Salt Wash Member of the Morrison Formation). Mineralization on the property occurs at depths of 500 to 750 feet with the drill-defined mineralization ranging from 25 to 75 feet. Mineralization is typical sandstone-hosted tabular deposits wherein the uranium occurs in reduced and altered sandstones and sandstone-mudstones in major stream channels in the Formation. Historical work dates back to Atlas Minerals and Pioneer Uravan in 1976 to 1983, who drilled a total of 495 exploration holes (of which logs for 193 holes totaling 137,510 feet or 41,913 metres were preserved), and Homeland Uranium in 2007-2008 who drilled 15 holes. Note: some of the historical drilling was on 3rd party claims not currently owned. Past exploration was primarily focused on the Dylan, Ajax, Whiskey and Carlin targets. All of the mineralized areas are open to expansion. Historic drill data is not available for Carlin: Ajax: most heavily drilled and tightest spacings with some holes 25 to 50 feet apart. A total of 164 historic holes drilled which defined mineralization a 1,200 by 25-75 metre area. Thirty (30) holes returned grades in excess of 0.1% eU3O8. Dylan: best defined with drilling on a 100 by 100-foot grid. Thirty-nine holes were drilled in 1976 to 1983 with follow-up drilling in 2007 which defined mineralization over a 500 by 40-100 metre area. Seven (7) holes returned grades in excess of 0.2% eU3O8, with highlight grades of 2.5% eU3O8 over 2.6 feet. Whiskey: A total of 29 holes drilled at 100-foot spacings with a number of holes intersecting significant mineralization and defining an area of 400 by 10-70 metres. Highlights of drilling included 0.98% eU3O8 over 5 feet. Further follow-up and more systematic drilling is required. Carlin: While complete historical records are unavailable, based on limited data mineralization was defined over a 150 by 20-70 metre area. Figure 1: Wray Mesa Property Map To view an enhanced version of this graphic, please visit: https://images.newsfilecorp.com/files/7273/183981_c3013d29144458f0_001full.jpg Transaction Terms Under the terms of the Option Agreement between the Company and Basin Uranium Corp. (CSE: NCLR), the Company will have the right to acquire up to a 90%-interest in the project through staged cash, share and work commitments. To earn an initial 51% interest in the project, the Company must pay C$50,000 in cash and issue 300,000 shares within five days of approval of the Canadian Securities Exchange and incur US$250,000 in exploration within the first year, in addition to paying C$100,000 in cash, issuing C$250,000 worth of stock and incurring US$500,000 of exploration by the end of the second year. Once the 51% earn-in has been completed, the Company has the option to earn an additional 20% interest (for a total of 71%) through an additional payment of C$75,000 in cash plus issuing C$250,000 worth of stock and incurring US$1,000,000 in exploration by the end of the third year. Assuming the completion of a 71% earn-in, the Company can earn a further 19% interest (for a total of 90%) through the payment of C$75,000 in cash plus issuing C$250,000 worth of stock and incurring US$1,000,000 in exploration by the end of the fourth year. Once the Company has earned a 90% interest in the project, Basin Uranium Corp. will have a free carried 10% interest in the project. The technical content of this news release has been reviewed and approved by R. Tim Henneberry, P.Geo. (BC), a Director and President of Golden Independence Mining Corp. and a Qualified Person under National Instrument 43-101. About Golden Independence Mining Corp. Golden Independence Mining is a development company currently focused on the development-stage Independence project located adjacent to Nevada Gold mine's Phoenix-Fortitude mine in the Battle Mountain-Cortez trend of Nevada in addition to the wholly owned Napoleon gold project located in the Kamloops mining division of British Columbia. The Independence project hosts an M&I (measured and indicated) resource of 334,300 ounces of gold (28M tonnes at 0.41 g/t gold) and an inferred resource of 847,000 ounces (9M tonnes at 3.22 g/t gold) of gold with a substantial silver credit. A 2021 preliminary economic assessment (PEA) outlined a low-cost heap leach operation focusing on the near-surface resource with total production of 195,443 ounces of gold at an all-in sustaining cost of $1,078 (U.S.) per ounce of gold. The Napoleon project comprises over 1,000 hectares and prospective for multiple forms of gold mineralization, with exploration in the area dating back to the 1970s with the discovery of high-grade gold. Golden Independence cautions investors the preliminary economic assessment is preliminary in nature, it includes inferred mineral resources that are considered too speculative geologically to have the economic considerations applied to them that would enable them to be categorized as mineral reserves, and there is no certainty that the preliminary economic assessment will be realized. Golden Independence further cautions investors Mineral Resources which are not Mineral Reserves do not have demonstrated economic viability and further cautions investors the quantity and grade of the reported inferred Mineral Resources are uncertain in nature ‎and there has been insufficient exploration to define these inferred Mineral Resources as ‎indicated Mineral Resources. The Napoleon project is comprised of over 1,000 hectares and prospective for multiple forms of gold mineralization, with exploration in the area dating back to the 1970's with the discovery of high-grade gold. FOR FURTHER INFORMATION PLEASE CONTACT: Jeremy Poirier, Chief Executive Officer Telephone: 1.604.722.9842  Email: info@goldenindependence.co This press release contains forward-looking information (within the meaning of applicable Canadian securities legislation) that involves various risks and uncertainties regarding future events. Such forward-looking information includes statements based on current expectations of management made in light of management's experience and perception of historical trends, current conditions and expected future developments. Forward-looking information is subject to a number of risks and uncertainties and, as such, forward-looking statements are not guarantees of future performance of the Company. Forward-looking information in this news release includes, without limitation, statements regarding the exercise of the option under the Option Agreement and the future exploration and development potential of the Wray Mesa project. There are numerous risks and uncertainties that could cause actual results to differ materially from those expressed in the forward-looking information in this news release, including without limitation, inherent risks associated with the mining industry and the results of exploration activities and development of mineral properties, stock market volatility and capital market fluctuations, general market and industry conditions, as well as those risk factors discussed in the Company's most recently filed management's discussion & analysis. Actual results and future events could differ materially from those anticipated in such information. This forward-looking information is based on estimates and opinions of management on the date hereof and is expressly qualified by this notice. Risks and uncertainties about the Company's business are more fully discussed in the Company's disclosure materials filed with the securities regulatory authorities in Canada at www.sedar.com. The Company assumes no obligation to update any forward-looking information or to update the reasons why actual results could differ from such information unless required by applicable law. To view the source version of this press release, please visit https://www.newsfilecorp.com/release/183981",
    "primary_commodity": "U"
  },
  "articleProject": {
    "gid": 3522,
    "project_name": "Wray Mesa",
    "location": "Utah, United States"
  },
  "articleExchange": "CSE",
  "articleCompanyId": 200,
  "articleTicker": "NEXU",
  "articleCompanyName": "Nexus Uranium Corp.",
  "allOtherCompanyProjects": [
    {
      "company_id": 200,
      "gid": 6222,
      "project_name": "Cree East",
      "location": "Saskatchewan, Canada"
    },
    {
      "company_id": 200,
      "gid": 276,
      "project_name": "Champ",
      "location": "British Columbia, Canada"
    },
    {
      "company_id": 200,
      "gid": 2462,
      "project_name": "Fraser Lake",
      "location": "British Columbia"
    },
    {
      "company_id": 200,
      "gid": 1021,
      "project_name": "Independence",
      "location": "Nevada, USA"
    },
    {
      "company_id": 200,
      "gid": 4436,
      "project_name": "Napoleon",
      "location": "British Columbia, Canada"
    }
  ],
  "allOtherCompanyNews": [
    {
      "id": 107053,
      "company_id": 200,
      "title": "Nexus Uranium Comments on Recent Uranium Market Developments",
      "link": null,
      "date": "2025-06-05T10:00:00.000Z",
      "hidden": false
    },
    {
      "id": 102099,
      "company_id": 200,
      "title": "Nexus Uranium Completes Winter Drill Program at Cree East",
      "link": null,
      "date": "2025-04-29T10:00:00.000Z",
      "hidden": false
    },
    {
      "id": 90988,
      "company_id": 200,
      "title": "Nexus Uranium Provides Interim Drill Results from Cree East Project",
      "link": null,
      "date": "2025-03-13T12:00:00.000Z",
      "hidden": false
    },
    {
      "id": 86575,
      "company_id": 200,
      "title": "Nexus Uranium Commences Drill Program at Large Cree East Project",
      "link": "https://www.newsfilecorp.com/release/239226/Nexus-Uranium-Commences-Drill-Program-at-Large-Cree-East-Project",
      "date": "2025-02-03T11:00:00.000Z",
      "hidden": false
    },
    {
      "id": -165787,
      "company_id": 200,
      "title": "Nexus Announces Option Agreement and Issuance of Shares for Debt",
      "link": "https://www.newsfilecorp.com/release/238531/Nexus-Announces-Option-Agreement-and-Issuance-of-Shares-for-Debt",
      "date": "2025-01-27T14:25:00.000Z",
      "hidden": false
    },
    {
      "id": 103088,
      "company_id": 200,
      "title": "Nexus Announces Non-Brokered Financing Of FT Units",
      "link": "https://app.quotemedia.com/data/downloadFiling?webmasterId=104408&ref=67901f73965f0b6e85142490&type=PDFC&formType=002-002-001089-003001&formDescription=News+release&dateFiled=2025-01-21",
      "date": "2025-01-21T14:28:03.000Z",
      "hidden": false
    },
    {
      "id": 84690,
      "company_id": 200,
      "title": "Nexus Uranium Mobilizes to Cree East Ahead of Drilling Program",
      "link": "https://www.newsfilecorp.com/release/237874/Nexus-Uranium-Mobilizes-to-Cree-East-Ahead-of-Drilling-Program",
      "date": "2025-01-21T11:00:00.000Z",
      "hidden": false
    },
    {
      "id": 83348,
      "company_id": 200,
      "title": "Nexus Uranium Provides Update on Upcoming Winter Drill Program",
      "link": "https://www.newsfilecorp.com/release/236214/Nexus-Uranium-Provides-Update-on-Upcoming-Winter-Drill-Program",
      "date": "2025-01-07T11:00:00.000Z",
      "hidden": false
    },
    {
      "id": 82441,
      "company_id": 200,
      "title": "Nexus Uranium Announces Commencement of Winter Access Road Construction to Cree East Project",
      "link": "https://www.newsfilecorp.com/release/234428/Nexus-Uranium-Announces-Commencement-of-Winter-Access-Road-Construction-to-Cree-East-Project",
      "date": "2024-12-19T11:00:00.000Z",
      "hidden": false
    },
    {
      "id": 82026,
      "company_id": 200,
      "title": "Nexus Uranium Announces Expanded Winter Drill Program at Cree East",
      "link": "https://www.newsfilecorp.com/release/233806/Nexus-Uranium-Announces-Expanded-Winter-Drill-Program-at-Cree-East",
      "date": "2024-12-16T11:00:00.000Z",
      "hidden": false
    }
  ]
}
