{
  "article": {
    "id": 74216,
    "link": "https://www.globenewswire.com/news-release/2024/10/09/2960378/0/en/Stallion-Uranium-Signs-Binding-LOI-for-up-to-2-2M-for-Horse-Heaven-Gold-and-Antimony-Project.html",
    "title": "Stallion Uranium Signs Binding LOI for up to $2.2M for Horse Heaven Gold and Antimony Project",
    "description": "<p align=\"justify\">VANCOUVER, British Columbia, Oct.  09, 2024  (GLOBE NEWSWIRE) -- Stallion Uranium Corp. (the <strong>\"Company\" </strong>or <strong>\"Stallion\"</strong>) (TSX-V: STUD; OTCQB: STLNF; FSE: FE0) is pleased to announce that the Company has entered into a binding letter of intent (the “<strong>LOI</strong>”) with an arm’s-length party (the “<strong>Optionor</strong>”), under which the Company has granted the Optionor the option to acquire an 80% interest in its Horse Heaven Gold and Antimony project consisting of 699 mineral claims covering over 5,817 ha located in Idaho, United States (the “<strong>Property</strong>”).<br /></p>  <p align=\"justify\">\"The signing of this option agreement creates the opportunity for Stallion to maximize the value of its Horse Heaven project. Antimony, a critical mineral, has become even more vital as China restricts exports, highlighting the pressing need for the US to secure a domestic supply. Horse Heaven's high-grade antimony target with historical production presents an invaluable asset for advancing domestic supply,\" said Drew Zimmerman, CEO. \"The LOI will drive the advancement of the Horse Heaven project, creating substantial value for all stakeholders involved.\"</p>  <p align=\"justify\">Pursuant to the LOI, the Optionor may acquire eighty percent (80%) of the issued and outstanding common shares (the “<strong>Horse Heaven Parent Shares</strong>”) of 1262446 B.C Ltd. (“<strong>Horse Heaven Parent</strong>”), a wholly owned subsidiary of the Company, which holds an undivided 100% legal, beneficial and registerable interest in the Property, in consideration of the following to the Company:</p>  <ol style=\"list-style-type:lower-roman;\"><li style=\"text-align:justify;\">$200,000 in cash on the date that the LOI is executed;</li><li style=\"text-align:justify;\">$200,000 in cash on the date in which a definitive agreement (the “<strong>Definitive Agreemen</strong>t”) is entered into;</li><li style=\"text-align:justify;\">$300,000 in common shares of Privco (“<strong>Privco Shares</strong>”) at a deemed price per Privco Share equal to $0.18 per Privco Share on the effective date of the Definitive Agreement;</li><li style=\"text-align:justify;\">$50,000 in cash and $200,000 in Privco Shares at a deemed price per Privco Share equal to the price of the underlying securities sold in Privco’s most recently completed equity financing at the date of issuance (the “<strong>Financing Price</strong>”) on the first anniversary of the effective date of the Definitive Agreement;</li><li style=\"text-align:justify;\">$50,000 in cash and $200,000 in Optionor Shares at the Financing Price on the second anniversary of the effective date of the Definitive Agreement;</li><li style=\"text-align:justify;\">$50,000 in cash and $200,000 in Optionor Shares at the Financing Price on the third anniversary of the effective date of the Definitive Agreement; and</li><li style=\"text-align:justify;\">$50,000 in cash and $200,000 in Optionor Shares at the Financing Price on the fourth anniversary of the effective date of the Definitive Agreement.<br /></li></ol>  <p align=\"justify\">In addition, the Optionor must complete an aggregate of $1,000,000 in exploration expenditures to advance the Property prior to the first anniversary of the effective date of the Definitive Agreement (the “<strong>Expiry Date</strong>”) and completing an additional $4,000,000 in exploration expenditures within the next three (3) years from the Expiry Date to advance the Property.</p>  <p align=\"justify\">The Company shall also be eligible to receive the following milestone payments:</p>  <ol style=\"list-style-type:lower-roman;\"><li style=\"text-align:justify;\">If Horse Heaven Parent receives a drill permit for Antimony Ridge drill from the United States Forest Service, the Optionor shall pay the Company $250,000, which shall be payable in cash or in Optionor Shares (at the Financing Price), at the Optionor’s sole discretion.</li><li style=\"text-align:justify;\">If Horse Heaven Parent receives funding from the United States Government in excess of USD $5,000,000, the Optionor shall pay the Company $250,000, which shall be payable in cash or in Optionor Shares (at the Financing Price), at the Optionor’s sole discretion.</li></ol>  <p align=\"justify\">The LOI shall terminate if the parties have not entered into a definitive agreement by October 30, 2024. The definitive agreement is subject to the receipt of any third-party consents or regulatory approvals, including but not limited to any necessary stock exchange approvals required by the Company or the Optionor, respectively.</p>  <p align=\"justify\"><strong><u>Horse Heaven Overview</u></strong></p>  <p align=\"justify\">The Horse Heaven Project is located 212 kilometers northeast of Boise, Idaho, in Valley County. The Horse Heaven Project comprises 699 unpatented federal mining claims, covering 5,817 hectares, and shares its eastern boundary with Perpetua Resource's Stibnite Gold Project, a project expected to be the only near-term domestic supply of antimony in the United States. At Horse Heaven the focus of historical mining and recent exploration programs have been on the Golden Gate Fault Zone and Antimony Ridge.</p>  <p><strong>Golden Gate Fault Zone</strong><br /></p>  <p align=\"justify\">The Golden Gate Mine historically produced approximately 8,000 tons of tungsten between the 1960s and 1980. Mapping of the Golden Gate Shear Zone has identified a 3-kilometer strike length with structurally controlled gold, antimony, and tungsten mineralization. Stallion’s soil sampling along the shear zone returned strong results of 1.99 ppm gold, 5.5 ppm silver, 137 ppm antimony, 230 ppm tungsten. Rock sampling also showed strong results of 4.3 ppm gold, 132 ppm silver, 724 ppm antimony, 180 ppm tungsten.</p>  <p align=\"justify\">In 2022, a ground geophysical Controlled Source Audio-frequency Magneto-telluric (CSAMT) survey was conducted over the Golden Gate Shear Zone, confirming the presence of the shear zone at depth. Stallion has a pending Categorical Exclusions drill permit from the Boise National Forest, with the aim of testing mineralization at depth along the Golden Gate Shear Zone.</p>  <p><strong>Antimony Ridge</strong><br /></p>  <p align=\"justify\">Historically, Antimony Ridge was a significant source of antimony, having produced 60 rail cars of antimony during World War I, World War II, and up until its last recorded production in 1952. Mineralization at Antimony Ridge is distributed across approximately 700 meters by 50 meters of open cuts. Recent rock sampling conducted by Stallion returned notable assay results of 5.9 g/t gold, 19.5% antimony, 367 ppm silver.</p>  <p align=\"justify\">Structural mapping has delineated over 0.7 kilometers of high-grade antimony veins, many of which were historically mined during wartime. Follow-up work is planned to better define the high-grade antimony and precious metal mineralization in this zone.</p>  <p align=\"justify\"><strong>Qualifying Statement:</strong></p>  <p align=\"justify\">William Breen, (Registered Member 04203997 of SME), is the Qualified Person as defined by NI 43-101, Standards of Disclosure for Mineral Projects, who has reviewed and approved the scientific and technical content of this press release. Mr. Breen is an officer of the Company.</p>  <p align=\"justify\"><strong>About Stallion Uranium</strong></p>  <p align=\"justify\">Stallion Uranium is working to ‘Fuel the Future with Uranium’ through the exploration of roughly 3,000 sq/km in the Athabasca Basin, home to the largest high-grade uranium deposits in the world. The company, with JV partner Atha Energy holds the largest contiguous project in the Western Athabasca Basin adjacent to multiple high-grade discovery zones.</p>  <p align=\"justify\">Our leadership and advisory teams are comprised of uranium and precious metals exploration experts with the capital markets experience and the technical talent for acquiring and exploring early-stage properties.</p>  <p align=\"justify\">Stallion offers optionality with the Horse Heaven gold project in Idaho that neighbours the world class Stibnite Gold deposit held by Perpetua Resources, offering exposure to upside potential from district advancement with limited capital expenditures.</p>  <p>For more information visit <a href=\"https://www.globenewswire.com/Tracker?data=X3DX90x820rceYOQxcmJF6d5_6B-ly1xdHWFqBqcOBedFc3dM5PTSVzKm-bfG5_kgKzQHXZdpC0c2jJy0XnDOEp8Mzwu1xJxG36CFajl3fE=\" rel=\"nofollow\" target=\"_blank\" title=\"stallionuranium.com\">stallionuranium.com</a> or contact: </p>  <p>Drew Zimmerman<br />Chief Executive Officer<br />778-686-0973<br />info@stallionuranium.com</p>  <p><em>Neither the TSX Venture Exchange nor its Regulation Services Provider (as that term is defined in the policies of the TSX Venture Exchange) accepts responsibility for the adequacy or accuracy of this release. </em></p>  <p align=\"justify\"><em>This news release contains forward-looking statements and forward-looking information within the meaning of Canadian securities legislation (collectively, “forward-looking statements”) that relate to the Company’s current expectations and views of future events. Any statements that express, or involve discussions as to, expectations, beliefs, plans, objectives, assumptions or future events or performance (often, but not always, through the use of words or phrases such as “will likely result”, “are expected to”, “expects”, “will continue”, “is anticipated”, “anticipates”, “believes”, “estimated”, “intends”, “plans”, “forecast”, “projection”, “strategy”, “objective” and “outlook”) are not historical facts and may be forward-looking statements and may involve estimates, assumptions and uncertainties which could cause actual results or outcomes to differ materially from those expressed in such forward-looking statements. No assurance can be given that these expectations will prove to be correct and such forward-looking statements included in this material change report should not be unduly relied upon. These statements speak only as of the date they are made. </em></p>  <p align=\"justify\"><em>Forward-looking statements are based on a number of assumptions and are subject to a number of risks and uncertainties, many of which are beyond the Company’s control, which could cause actual results and events to differ materially from those that are disclosed in or implied by such forward-looking statements. The Company undertakes no obligation to update or revise any forward-looking statements, whether as a result of new information, future events or otherwise, except as may be required by law. New factors emerge from time to time, and it is not possible for the Company to predict all of them, or assess the impact of each such factor or the extent to which any factor, or combination of factors, may cause results to differ materially from those contained in any forward-looking statement. Any forward-looking statements contained in this presentation are expressly qualified in their entirety by this cautionary statement.</em></p>  <br /><img src='https://ml.globenewswire.com/media/YWE1N2RlN2UtNTljMS00ZjAxLWI4ZDctMTNiZGExMDJhMzllLTExMzIzOTU=/tiny/Stallion-Uranium-Corp-.png' referrerpolicy='no-referrer-when-downgrade' />",
    "search_terms": "Horse Heaven,Stallion Uranium Corp.,STUD",
    "master_gid": 4751,
    "date": "2024-10-09T11:00:00.000Z",
    "tags": "|||Gold,Uranium|Project Acquisition",
    "image_id": null,
    "hidden": false,
    "company_id": 1757,
    "provider": "globenewswire",
    "excerpt": "VANCOUVER, British Columbia, Oct. 09, 2024 (GLOBE NEWSWIRE) -- Stallion Uranium Corp. (the\"Company\"or\"Stallion\") (TSX-V: STUD; OTCQB: STLNF; FSE: FE0) is pleased to announce that the Company has entered into a binding letter of intent (the “LOI”) with an arm’s-length party (the “Optionor”), under which the Company has granted the Optionor",
    "is_regulatory": false,
    "refined_tags": null,
    "ftp_filename": null,
    "company_name": "Unknown",
    "exchange": "TSXV",
    "root_ticker": "STUD",
    "project_name": "Horse Heaven",
    "gid": 4751,
    "location": "Idaho, United States",
    "plan_id": "companytier2",
    "description_text": "VANCOUVER, British Columbia, Oct.  09, 2024  (GLOBE NEWSWIRE) -- Stallion Uranium Corp. (the \"Company\" or \"Stallion\" ) (TSX-V: STUD; OTCQB: STLNF; FSE: FE0) is pleased to announce that the Company has entered into a binding letter of intent (the “ LOI ”) with an arm’s-length party (the “ Optionor ”), under which the Company has granted the Optionor the option to acquire an 80% interest in its Horse Heaven Gold and Antimony project consisting of 699 mineral claims covering over 5,817 ha located in Idaho, United States (the “ Property ”). \"The signing of this option agreement creates the opportunity for Stallion to maximize the value of its Horse Heaven project. Antimony, a critical mineral, has become even more vital as China restricts exports, highlighting the pressing need for the US to secure a domestic supply. Horse Heaven's high-grade antimony target with historical production presents an invaluable asset for advancing domestic supply,\" said Drew Zimmerman, CEO. \"The LOI will drive the advancement of the Horse Heaven project, creating substantial value for all stakeholders involved.\" Pursuant to the LOI, the Optionor may acquire eighty percent (80%) of the issued and outstanding common shares (the “ Horse Heaven Parent Shares ”) of 1262446 B.C Ltd. (“ Horse Heaven Parent ”), a wholly owned subsidiary of the Company, which holds an undivided 100% legal, beneficial and registerable interest in the Property, in consideration of the following to the Company: $200,000 in cash on the date that the LOI is executed; $200,000 in cash on the date in which a definitive agreement (the “ Definitive Agreemen t”) is entered into; $300,000 in common shares of Privco (“ Privco Shares ”) at a deemed price per Privco Share equal to $0.18 per Privco Share on the effective date of the Definitive Agreement; $50,000 in cash and $200,000 in Privco Shares at a deemed price per Privco Share equal to the price of the underlying securities sold in Privco’s most recently completed equity financing at the date of issuance (the “ Financing Price ”) on the first anniversary of the effective date of the Definitive Agreement; $50,000 in cash and $200,000 in Optionor Shares at the Financing Price on the second anniversary of the effective date of the Definitive Agreement; $50,000 in cash and $200,000 in Optionor Shares at the Financing Price on the third anniversary of the effective date of the Definitive Agreement; and $50,000 in cash and $200,000 in Optionor Shares at the Financing Price on the fourth anniversary of the effective date of the Definitive Agreement. In addition, the Optionor must complete an aggregate of $1,000,000 in exploration expenditures to advance the Property prior to the first anniversary of the effective date of the Definitive Agreement (the “ Expiry Date ”) and completing an additional $4,000,000 in exploration expenditures within the next three (3) years from the Expiry Date to advance the Property. The Company shall also be eligible to receive the following milestone payments: If Horse Heaven Parent receives a drill permit for Antimony Ridge drill from the United States Forest Service, the Optionor shall pay the Company $250,000, which shall be payable in cash or in Optionor Shares (at the Financing Price), at the Optionor’s sole discretion. If Horse Heaven Parent receives funding from the United States Government in excess of USD $5,000,000, the Optionor shall pay the Company $250,000, which shall be payable in cash or in Optionor Shares (at the Financing Price), at the Optionor’s sole discretion. The LOI shall terminate if the parties have not entered into a definitive agreement by October 30, 2024. The definitive agreement is subject to the receipt of any third-party consents or regulatory approvals, including but not limited to any necessary stock exchange approvals required by the Company or the Optionor, respectively. Horse Heaven Overview The Horse Heaven Project is located 212 kilometers northeast of Boise, Idaho, in Valley County. The Horse Heaven Project comprises 699 unpatented federal mining claims, covering 5,817 hectares, and shares its eastern boundary with Perpetua Resource's Stibnite Gold Project, a project expected to be the only near-term domestic supply of antimony in the United States. At Horse Heaven the focus of historical mining and recent exploration programs have been on the Golden Gate Fault Zone and Antimony Ridge. Golden Gate Fault Zone The Golden Gate Mine historically produced approximately 8,000 tons of tungsten between the 1960s and 1980. Mapping of the Golden Gate Shear Zone has identified a 3-kilometer strike length with structurally controlled gold, antimony, and tungsten mineralization. Stallion’s soil sampling along the shear zone returned strong results of 1.99 ppm gold, 5.5 ppm silver, 137 ppm antimony, 230 ppm tungsten. Rock sampling also showed strong results of 4.3 ppm gold, 132 ppm silver, 724 ppm antimony, 180 ppm tungsten. In 2022, a ground geophysical Controlled Source Audio-frequency Magneto-telluric (CSAMT) survey was conducted over the Golden Gate Shear Zone, confirming the presence of the shear zone at depth. Stallion has a pending Categorical Exclusions drill permit from the Boise National Forest, with the aim of testing mineralization at depth along the Golden Gate Shear Zone. Antimony Ridge Historically, Antimony Ridge was a significant source of antimony, having produced 60 rail cars of antimony during World War I, World War II, and up until its last recorded production in 1952. Mineralization at Antimony Ridge is distributed across approximately 700 meters by 50 meters of open cuts. Recent rock sampling conducted by Stallion returned notable assay results of 5.9 g/t gold, 19.5% antimony, 367 ppm silver. Structural mapping has delineated over 0.7 kilometers of high-grade antimony veins, many of which were historically mined during wartime. Follow-up work is planned to better define the high-grade antimony and precious metal mineralization in this zone. Qualifying Statement: William Breen, (Registered Member 04203997 of SME), is the Qualified Person as defined by NI 43-101, Standards of Disclosure for Mineral Projects, who has reviewed and approved the scientific and technical content of this press release. Mr. Breen is an officer of the Company. About Stallion Uranium Stallion Uranium is working to ‘Fuel the Future with Uranium’ through the exploration of roughly 3,000 sq/km in the Athabasca Basin, home to the largest high-grade uranium deposits in the world. The company, with JV partner Atha Energy holds the largest contiguous project in the Western Athabasca Basin adjacent to multiple high-grade discovery zones. Our leadership and advisory teams are comprised of uranium and precious metals exploration experts with the capital markets experience and the technical talent for acquiring and exploring early-stage properties. Stallion offers optionality with the Horse Heaven gold project in Idaho that neighbours the world class Stibnite Gold deposit held by Perpetua Resources, offering exposure to upside potential from district advancement with limited capital expenditures. For more information visit stallionuranium.com or contact: Drew Zimmerman Chief Executive Officer 778-686-0973 info@stallionuranium.com Neither the TSX Venture Exchange nor its Regulation Services Provider (as that term is defined in the policies of the TSX Venture Exchange) accepts responsibility for the adequacy or accuracy of this release. This news release contains forward-looking statements and forward-looking information within the meaning of Canadian securities legislation (collectively, “forward-looking statements”) that relate to the Company’s current expectations and views of future events. Any statements that express, or involve discussions as to, expectations, beliefs, plans, objectives, assumptions or future events or performance (often, but not always, through the use of words or phrases such as “will likely result”, “are expected to”, “expects”, “will continue”, “is anticipated”, “anticipates”, “believes”, “estimated”, “intends”, “plans”, “forecast”, “projection”, “strategy”, “objective” and “outlook”) are not historical facts and may be forward-looking statements and may involve estimates, assumptions and uncertainties which could cause actual results or outcomes to differ materially from those expressed in such forward-looking statements. No assurance can be given that these expectations will prove to be correct and such forward-looking statements included in this material change report should not be unduly relied upon. These statements speak only as of the date they are made. Forward-looking statements are based on a number of assumptions and are subject to a number of risks and uncertainties, many of which are beyond the Company’s control, which could cause actual results and events to differ materially from those that are disclosed in or implied by such forward-looking statements. The Company undertakes no obligation to update or revise any forward-looking statements, whether as a result of new information, future events or otherwise, except as may be required by law. New factors emerge from time to time, and it is not possible for the Company to predict all of them, or assess the impact of each such factor or the extent to which any factor, or combination of factors, may cause results to differ materially from those contained in any forward-looking statement. Any forward-looking statements contained in this presentation are expressly qualified in their entirety by this cautionary statement.",
    "primary_commodity": "Au"
  },
  "articleProject": {
    "gid": 4751,
    "project_name": "Horse Heaven",
    "location": "Idaho, United States"
  },
  "articleExchange": "TSXV",
  "articleCompanyId": 1757,
  "articleTicker": "STUD",
  "articleCompanyName": "Stallion Uranium Corp.",
  "allOtherCompanyProjects": [
    {
      "company_id": 1757,
      "gid": 5281,
      "project_name": "Richmond Mountain",
      "location": "Nevada, United States"
    },
    {
      "company_id": 1757,
      "gid": 8602,
      "project_name": "Stone Island",
      "location": "Saskatchewan, Canada"
    },
    {
      "company_id": 1757,
      "gid": 4751,
      "project_name": "Horse Heaven",
      "location": "Idaho, United States"
    },
    {
      "company_id": 1757,
      "gid": 5233,
      "project_name": "Coffer",
      "location": "Saskatchewan, Canada"
    },
    {
      "company_id": 1757,
      "gid": 4677,
      "project_name": "Western Athabasca",
      "location": "Saskatchewan, Canada"
    },
    {
      "company_id": 1757,
      "gid": 5349,
      "project_name": "Borderline",
      "location": "Saskatchewan, Canada"
    },
    {
      "company_id": 1757,
      "gid": 5350,
      "project_name": "Newlands",
      "location": "Saskatchewan, Canada"
    },
    {
      "company_id": 1757,
      "gid": 5348,
      "project_name": "Sandy Lake",
      "location": "Saskatchewan, Canada"
    },
    {
      "company_id": 1757,
      "gid": 5235,
      "project_name": "Gunter Lake",
      "location": "Saskatchewan, Canada"
    },
    {
      "company_id": 1757,
      "gid": 6439,
      "project_name": "Upper Mirror River",
      "location": "Saskatchewan, Canada"
    }
  ],
  "allOtherCompanyNews": [
    {
      "id": 105393,
      "company_id": 1757,
      "title": "Stallion Uranium Provides Corporate Update",
      "link": null,
      "date": "2025-05-21T20:58:11.000Z",
      "hidden": false
    },
    {
      "id": -200749,
      "company_id": 1757,
      "title": "Stallion Uranium Announces Failure to File Cease Trade Order",
      "link": null,
      "date": "2025-05-14T11:30:00.000Z",
      "hidden": false
    },
    {
      "id": -199879,
      "company_id": 1757,
      "title": "Canadian Investment Regulatory Organization Trading Halt - STUD",
      "link": "https://contentapi.cision.com/api/v1.0/releases/20250508C2292",
      "date": "2025-05-08T12:35:00.000Z",
      "hidden": false
    },
    {
      "id": 102527,
      "company_id": 1757,
      "title": "Stallion Uranium Announces Completion of Ground Gravity Survey over Coyote Target",
      "link": null,
      "date": "2025-04-30T11:30:00.000Z",
      "hidden": false
    },
    {
      "id": 100790,
      "company_id": 1757,
      "title": "Stallion Uranium Closes $1.45 million Private Placement",
      "link": null,
      "date": "2025-04-24T11:00:00.000Z",
      "hidden": false
    },
    {
      "id": 99100,
      "company_id": 1757,
      "title": "Stallion Uranium Increases Private Placement to $1.45 Million",
      "link": null,
      "date": "2025-04-09T04:34:32.000Z",
      "hidden": false
    },
    {
      "id": 98351,
      "company_id": 1757,
      "title": "Stallion Uranium Announces C$1.2 Million Private Placement",
      "link": null,
      "date": "2025-04-01T19:08:34.000Z",
      "hidden": false
    },
    {
      "id": -171334,
      "company_id": 1757,
      "title": "Stallion Uranium Announces Effective Date Of Consolidation",
      "link": "https://www.globenewswire.com/news-release/2025/02/26/3033272/0/en/Stallion-Uranium-Announces-Effective-Date-Of-Consolidation.html",
      "date": "2025-02-26T19:36:00.000Z",
      "hidden": false
    },
    {
      "id": 88156,
      "company_id": 1757,
      "title": "Stallion Uranium Announces New Consolidation Ratio",
      "link": "https://www.globenewswire.com/news-release/2025/02/18/3027720/0/en/Stallion-Uranium-Announces-New-Consolidation-Ratio.html",
      "date": "2025-02-18T12:30:00.000Z",
      "hidden": false
    },
    {
      "id": 86909,
      "company_id": 1757,
      "title": "Stallion Uranium Commences Ground Electromagnetic Survey on High Priority Drill Targets",
      "link": "https://www.globenewswire.com/news-release/2025/02/05/3021077/0/en/Stallion-Uranium-Commences-Ground-Electromagnetic-Survey-on-High-Priority-Drill-Targets.html",
      "date": "2025-02-05T12:30:00.000Z",
      "hidden": false
    }
  ]
}