{
  "article": {
    "id": 77020,
    "link": "https://www.globenewswire.com/news-release/2024/10/30/2972190/0/en/Stallion-Uranium-Announces-Extension-of-LOI.html",
    "title": "Stallion Uranium Announces Extension of LOI",
    "description": "<p align=\"justify\">VANCOUVER, British Columbia, Oct.  30, 2024  (GLOBE NEWSWIRE) -- Stallion Uranium Corp. (the “<strong>Company</strong>” or “<strong>Stallion</strong>”) (TSX-V: STUD; OTCQB: STLNF; FSE: FE0) announces that, further to its news release of October 9, 2024 in which the Company announced the signing of a binding letter of intent (the “<strong>LOI</strong>”) with an arm’s-length party (the “<strong>Optionor</strong>”) under which the Company has granted the Optionor the option to acquire an 80% interest in its Horse Heaven Gold and Antimony project located in Idaho, United States, the deadline to enter into a definitive agreement has been extended to November 8, 2024, failing which the LOI may be terminated.</p>  <p align=\"justify\"><strong>About Stallion Uranium</strong></p>  <p align=\"justify\">Stallion Uranium is working to ‘Fuel the Future with Uranium’ through the exploration of roughly 3,000 sq/km in the Athabasca Basin, home to the largest high-grade uranium deposits in the world. The company, with JV partner Atha Energy holds the largest contiguous project in the Western Athabasca Basin adjacent to multiple high-grade discovery zones.</p>  <p align=\"justify\">Our leadership and advisory teams are comprised of uranium and precious metals exploration experts with the capital markets experience and the technical talent for acquiring and exploring early-stage properties.</p>  <p align=\"justify\">Stallion offers optionality with the Horse Heaven gold project in Idaho that neighbours the world class Stibnite Gold deposit held by Perpetua Resources, offering exposure to upside potential from district advancement with limited capital expenditures.</p>  <p align=\"justify\">For more information visit <a href=\"https://www.globenewswire.com/Tracker?data=R7ffQQrbMmIXgtoHZ1ae0pqFvahBsH3-6MSMykdkf_vhAH95syB5LU0Il0LHd5iw_O18yJPZKCQeyXu7eN3zC0EQ-lLFzCXyBHnh-tC3n1G_PdetUNt80wUjSfxaz5V_F0EOe2roKMjiS7Jz8tZlMRiCxBYxMEZWZiwgBuvZqpzmyoTyL81yvvEV_eA3bTXGVZq50s3hJJq3b-5e0aSbYNDpR2-saoSfq7P1vU4kX_d0X6ScfBIu--dub0_JlHBeCPFfA5t-tNb_V6nXaDm9ew==\" rel=\"nofollow\" target=\"_blank\" title=\"stallionuranium.com\">stallionuranium.com</a> or contact: </p>  <p>Drew Zimmerman<br />Chief Executive Officer<br />778-686-0973</p>  <p align=\"justify\">info@stallionuranium.com</p>  <p><em>Neither the TSX Venture Exchange nor its Regulation Services Provider (as that term is defined in the policies of the TSX Venture Exchange) accepts responsibility for the adequacy or accuracy of this release. </em></p>  <p align=\"justify\"><em>This news release contains forward-looking statements and forward-looking information within the meaning of Canadian securities legislation (collectively, “forward-looking statements”) that relate to the Company’s current expectations and views of future events. Any statements that express, or involve discussions as to, expectations, beliefs, plans, objectives, assumptions or future events or performance (often, but not always, through the use of words or phrases such as “will likely result”, “are expected to”, “expects”, “will continue”, “is anticipated”, “anticipates”, “believes”, “estimated”, “intends”, “plans”, “forecast”, “projection”, “strategy”, “objective” and “outlook”) are not historical facts and may be forward-looking statements and may involve estimates, assumptions and uncertainties which could cause actual results or outcomes to differ materially from those expressed in such forward-looking statements. No assurance can be given that these expectations will prove to be correct and such forward-looking statements included in this material change report should not be unduly relied upon. These statements speak only as of the date they are made. </em></p>  <p align=\"justify\"><em>Forward-looking statements are based on a number of assumptions and are subject to a number of risks and uncertainties, many of which are beyond the Company’s control, which could cause actual results and events to differ materially from those that are disclosed in or implied by such forward-looking statements. The Company undertakes no obligation to update or revise any forward-looking statements, whether as a result of new information, future events or otherwise, except as may be required by law. New factors emerge from time to time, and it is not possible for the Company to predict all of them, or assess the impact of each such factor or the extent to which any factor, or combination of factors, may cause results to differ materially from those contained in any forward-looking statement. Any forward-looking statements contained in this presentation are expressly qualified in their entirety by this cautionary statement.</em></p>  <br /><img src='https://ml.globenewswire.com/media/YjFmNWEyNDMtNDc5NS00YWM1LWFhNDEtNTEzZDgzYjcxMmU4LTExMzIzOTU=/tiny/Stallion-Uranium-Corp-.png' referrerpolicy='no-referrer-when-downgrade' />",
    "search_terms": "Horse Heaven,Stallion Uranium Corp.,STUD",
    "master_gid": 4751,
    "date": "2024-10-30T22:18:00.000Z",
    "tags": "USA|Idaho||Gold,Uranium|Project Acquisition",
    "image_id": null,
    "hidden": false,
    "company_id": 1757,
    "provider": "globenewswire",
    "excerpt": "VANCOUVER, British Columbia, Oct. 30, 2024 (GLOBE NEWSWIRE) -- Stallion Uranium Corp. (the “Company” or “Stallion”) (TSX-V: STUD; OTCQB: STLNF; FSE: FE0) announces that, further to its news release of October 9, 2024 in which the Company announced the signing of a binding letter of intent (the “LOI”) with an",
    "is_regulatory": false,
    "refined_tags": [],
    "ftp_filename": null,
    "company_name": "Unknown",
    "exchange": "TSXV",
    "root_ticker": "STUD",
    "project_name": "Horse Heaven",
    "gid": 4751,
    "location": "Idaho, United States",
    "plan_id": "companytier2",
    "description_text": "VANCOUVER, British Columbia, Oct.  30, 2024  (GLOBE NEWSWIRE) -- Stallion Uranium Corp. (the “ Company ” or “ Stallion ”) (TSX-V: STUD; OTCQB: STLNF; FSE: FE0) announces that, further to its news release of October 9, 2024 in which the Company announced the signing of a binding letter of intent (the “ LOI ”) with an arm’s-length party (the “ Optionor ”) under which the Company has granted the Optionor the option to acquire an 80% interest in its Horse Heaven Gold and Antimony project located in Idaho, United States, the deadline to enter into a definitive agreement has been extended to November 8, 2024, failing which the LOI may be terminated. About Stallion Uranium Stallion Uranium is working to ‘Fuel the Future with Uranium’ through the exploration of roughly 3,000 sq/km in the Athabasca Basin, home to the largest high-grade uranium deposits in the world. The company, with JV partner Atha Energy holds the largest contiguous project in the Western Athabasca Basin adjacent to multiple high-grade discovery zones. Our leadership and advisory teams are comprised of uranium and precious metals exploration experts with the capital markets experience and the technical talent for acquiring and exploring early-stage properties. Stallion offers optionality with the Horse Heaven gold project in Idaho that neighbours the world class Stibnite Gold deposit held by Perpetua Resources, offering exposure to upside potential from district advancement with limited capital expenditures. For more information visit stallionuranium.com or contact: Drew Zimmerman Chief Executive Officer 778-686-0973 info@stallionuranium.com Neither the TSX Venture Exchange nor its Regulation Services Provider (as that term is defined in the policies of the TSX Venture Exchange) accepts responsibility for the adequacy or accuracy of this release. This news release contains forward-looking statements and forward-looking information within the meaning of Canadian securities legislation (collectively, “forward-looking statements”) that relate to the Company’s current expectations and views of future events. Any statements that express, or involve discussions as to, expectations, beliefs, plans, objectives, assumptions or future events or performance (often, but not always, through the use of words or phrases such as “will likely result”, “are expected to”, “expects”, “will continue”, “is anticipated”, “anticipates”, “believes”, “estimated”, “intends”, “plans”, “forecast”, “projection”, “strategy”, “objective” and “outlook”) are not historical facts and may be forward-looking statements and may involve estimates, assumptions and uncertainties which could cause actual results or outcomes to differ materially from those expressed in such forward-looking statements. No assurance can be given that these expectations will prove to be correct and such forward-looking statements included in this material change report should not be unduly relied upon. These statements speak only as of the date they are made. Forward-looking statements are based on a number of assumptions and are subject to a number of risks and uncertainties, many of which are beyond the Company’s control, which could cause actual results and events to differ materially from those that are disclosed in or implied by such forward-looking statements. The Company undertakes no obligation to update or revise any forward-looking statements, whether as a result of new information, future events or otherwise, except as may be required by law. New factors emerge from time to time, and it is not possible for the Company to predict all of them, or assess the impact of each such factor or the extent to which any factor, or combination of factors, may cause results to differ materially from those contained in any forward-looking statement. Any forward-looking statements contained in this presentation are expressly qualified in their entirety by this cautionary statement.",
    "primary_commodity": "Au"
  },
  "articleProject": {
    "gid": 4751,
    "project_name": "Horse Heaven",
    "location": "Idaho, United States"
  },
  "articleExchange": "TSXV",
  "articleCompanyId": 1757,
  "articleTicker": "STUD",
  "articleCompanyName": "Stallion Uranium Corp.",
  "allOtherCompanyProjects": [
    {
      "company_id": 1757,
      "gid": 5281,
      "project_name": "Richmond Mountain",
      "location": "Nevada, United States"
    },
    {
      "company_id": 1757,
      "gid": 8602,
      "project_name": "Stone Island",
      "location": "Saskatchewan, Canada"
    },
    {
      "company_id": 1757,
      "gid": 4751,
      "project_name": "Horse Heaven",
      "location": "Idaho, United States"
    },
    {
      "company_id": 1757,
      "gid": 5233,
      "project_name": "Coffer",
      "location": "Saskatchewan, Canada"
    },
    {
      "company_id": 1757,
      "gid": 4677,
      "project_name": "Western Athabasca",
      "location": "Saskatchewan, Canada"
    },
    {
      "company_id": 1757,
      "gid": 5349,
      "project_name": "Borderline",
      "location": "Saskatchewan, Canada"
    },
    {
      "company_id": 1757,
      "gid": 5350,
      "project_name": "Newlands",
      "location": "Saskatchewan, Canada"
    },
    {
      "company_id": 1757,
      "gid": 5348,
      "project_name": "Sandy Lake",
      "location": "Saskatchewan, Canada"
    },
    {
      "company_id": 1757,
      "gid": 5235,
      "project_name": "Gunter Lake",
      "location": "Saskatchewan, Canada"
    },
    {
      "company_id": 1757,
      "gid": 6439,
      "project_name": "Upper Mirror River",
      "location": "Saskatchewan, Canada"
    }
  ],
  "allOtherCompanyNews": [
    {
      "id": 105393,
      "company_id": 1757,
      "title": "Stallion Uranium Provides Corporate Update",
      "link": null,
      "date": "2025-05-21T20:58:11.000Z",
      "hidden": false
    },
    {
      "id": -200749,
      "company_id": 1757,
      "title": "Stallion Uranium Announces Failure to File Cease Trade Order",
      "link": null,
      "date": "2025-05-14T11:30:00.000Z",
      "hidden": false
    },
    {
      "id": -199879,
      "company_id": 1757,
      "title": "Canadian Investment Regulatory Organization Trading Halt - STUD",
      "link": "https://contentapi.cision.com/api/v1.0/releases/20250508C2292",
      "date": "2025-05-08T12:35:00.000Z",
      "hidden": false
    },
    {
      "id": 102527,
      "company_id": 1757,
      "title": "Stallion Uranium Announces Completion of Ground Gravity Survey over Coyote Target",
      "link": null,
      "date": "2025-04-30T11:30:00.000Z",
      "hidden": false
    },
    {
      "id": 100790,
      "company_id": 1757,
      "title": "Stallion Uranium Closes $1.45 million Private Placement",
      "link": null,
      "date": "2025-04-24T11:00:00.000Z",
      "hidden": false
    },
    {
      "id": 99100,
      "company_id": 1757,
      "title": "Stallion Uranium Increases Private Placement to $1.45 Million",
      "link": null,
      "date": "2025-04-09T04:34:32.000Z",
      "hidden": false
    },
    {
      "id": 98351,
      "company_id": 1757,
      "title": "Stallion Uranium Announces C$1.2 Million Private Placement",
      "link": null,
      "date": "2025-04-01T19:08:34.000Z",
      "hidden": false
    },
    {
      "id": -171334,
      "company_id": 1757,
      "title": "Stallion Uranium Announces Effective Date Of Consolidation",
      "link": "https://www.globenewswire.com/news-release/2025/02/26/3033272/0/en/Stallion-Uranium-Announces-Effective-Date-Of-Consolidation.html",
      "date": "2025-02-26T19:36:00.000Z",
      "hidden": false
    },
    {
      "id": 88156,
      "company_id": 1757,
      "title": "Stallion Uranium Announces New Consolidation Ratio",
      "link": "https://www.globenewswire.com/news-release/2025/02/18/3027720/0/en/Stallion-Uranium-Announces-New-Consolidation-Ratio.html",
      "date": "2025-02-18T12:30:00.000Z",
      "hidden": false
    },
    {
      "id": 86909,
      "company_id": 1757,
      "title": "Stallion Uranium Commences Ground Electromagnetic Survey on High Priority Drill Targets",
      "link": "https://www.globenewswire.com/news-release/2025/02/05/3021077/0/en/Stallion-Uranium-Commences-Ground-Electromagnetic-Survey-on-High-Priority-Drill-Targets.html",
      "date": "2025-02-05T12:30:00.000Z",
      "hidden": false
    }
  ]
}