{
  "article": {
    "id": 78207,
    "link": "https://www.globenewswire.com/news-release/2024/11/08/2977907/0/en/Stallion-Uranium-Announces-2-6M-Definitive-Option-Agreement-for-Horse-Heaven-Gold-and-Antimony-Project.html",
    "title": "Stallion Uranium Announces $2.6M Definitive Option Agreement for Horse Heaven Gold and Antimony Project",
    "description": "<p align=\"justify\">VANCOUVER, British Columbia, Nov.  08, 2024  (GLOBE NEWSWIRE) -- Stallion Uranium Corp. (the “<strong>Company</strong>” or “<strong>Stallion</strong>”) (TSX-V: STUD; OTCQB: STLNF; FSE: FE0) announces that, further to its news release of October 9, 2024 and October 30, 2024, the Company has entered into a definitive agreement (the “<strong>Option Agreement</strong>”) with 1503571 B.C. Ltd. (the “<strong>Optionor</strong>”), an arm’s-length party, on revised terms pursuant to which the Company has granted the Optionor the option to acquire a 100% interest (the “<strong>Option</strong>”) in its Horse Heaven Gold and Antimony project consisting of 699 mineral claims covering 5,817 ha located in Idaho, United States (the “<strong>Property</strong>”).</p>          <p align=\"justify\">Pursuant to the terms of the Option Agreement, the Optionor may acquire 100% of the issued and outstanding common shares (the “<strong>Horse Heaven Parent Shares</strong>”) of 1262446 B.C. Ltd. (“<strong>Horse Heaven Parent</strong>”), a wholly owned subsidiary of the Company, which holds an undivided 100% legal and beneficial interest in the Property, in consideration of the following to the Company:</p>          <ol style=\"list-style-type:lower-roman;\"><li style=\"margin-bottom:12pt; text-align:justify;\">$200,000 in cash on the signing of the binding letter of intent (paid);</li><li style=\"margin-bottom:12pt; text-align:justify;\">$200,000 in cash on the effective date of the Option Agreement;</li><li style=\"margin-bottom:12pt; text-align:justify;\">$2,000,000 in common shares of the Optionor at a deemed price of $0.18 per share on the effective date of the Option Agreement; and</li><li style=\"margin-bottom:12pt; text-align:justify;\">$200,000 in cash on the first anniversary of the effective date of the Option Agreement.</li></ol>          <p align=\"justify\">During the option period, the Optionor will be the operator of the Property. The Optionor is not required to incur any exploration expenditures to advance the Property. </p>          <p align=\"justify\">“This definitive agreement allows Stallion to monetize a portion of the value of the Horse Heaven project while maintaining upside exposure through a sizeable equity ownership. Antimony scarcity, especially in the United States, where they have no domestic production, will be a key driver of value of the project moving forward. Having a new company focused on advancing that project will allow that value to be realized. Stallion is now squarely focused on its vision of making the next big uranium discovery in the Athabasca basin,” said Drew Zimmerman, CEO. </p>          <p align=\"justify\">The Option is subject to acceptance by the TSX Venture Exchange. </p>          <p align=\"justify\"><strong>About Stallion Uranium</strong></p>          <p align=\"justify\">Stallion Uranium is working to ‘Fuel the Future with Uranium’ through the exploration of roughly 3,000 sq/km in the Athabasca Basin, home to the largest high-grade uranium deposits in the world. The company, with JV partner Atha Energy holds the largest contiguous project in the Western Athabasca Basin adjacent to multiple high-grade discovery zones. </p>    <p align=\"justify\">Our leadership and advisory teams are comprised of uranium and precious metals exploration experts with the capital markets experience and the technical talent for acquiring and exploring early-stage properties. </p>          <p align=\"justify\">For more information visit <a href=\"https://www.globenewswire.com/Tracker?data=HGLY3Sa76w_hzh1v1w3eNee0FuY56SfQH3QOQ4uFeIlWs5GVfO4mXVgc31TkBM8D9lq4Yfmji8Xc6_wSozlBPX_M_Srjd5OVuDY9rJqLonCuR6NsHafZSZ__h_JFBsjLv32y9kQZzXdknEDRuK9AXuEOCJXJmCY6Ceewq_NB-ArWk23h5cKaxeHCiNOH-1GcNfjPUaVrj1o6RJJ1OA8fVPmHiOZEHtFx4L3vtyksbrAUi1nPEPT8cX5oC5NDcqpJulTyBj-39L3qBP31XXjqYQ==\" rel=\"nofollow\" target=\"_blank\" title=\"stallionuranium.com\">stallionuranium.com</a> or contact: </p>          <p align=\"justify\">Drew Zimmerman<br />Chief Executive Officer<br />778-686-0973<br />info@stallionuranium.com</p>          <p align=\"justify\"><strong><em>Neither the TSX Venture Exchange nor its Regulation Services Provider (as that term is defined in the policies of the TSX Venture Exchange) accepts responsibility for the adequacy or accuracy of this release.</em></strong></p>          <p align=\"justify\"> <strong><u>Cautionary Note Regarding Forward-Looking Statements</u></strong> </p>          <p align=\"justify\"><em>This news release includes certain statements and information that may constitute forward-looking information within the meaning of applicable Canadian securities laws. Forward-looking statements relate to future events or future performance and reflect the expectations or beliefs of management of the Company regarding future events. Generally, forward-looking statements and information can be identified by the use of forward-looking terminology such as “intends” or “expects”, or variations of such words and phrases or statements that certain actions, events or results “may”, “could”, “should”, “would” or “occur”. This information and these statements, referred to herein as \"forward‐looking statements\", are not historical facts, are made as of the date of this news release and include without limitation, statements regarding discussions of future plans, estimates and forecasts and statements as to management's expectations and intentions with respect to, among other things, exercise of the Option.</em></p>          <p align=\"justify\"> <em>These forward‐looking statements involve numerous risks and uncertainties and actual results might differ materially from results suggested in any forward-looking statements. These risks and uncertainties include, among other things, that the Company will not receive TSX Venture Exchange acceptance and that the Option will not be exercised. In making the forward-looking statements in this news release, the Company has applied several material assumptions, including without limitation, that the Company will receive TSX Venture Exchange acceptance and that the Option will be exercised.</em> </p>          <p align=\"justify\"><em>Although management of the Company has attempted to identify important factors that could cause actual results to differ materially from those contained in forward-looking statements or forward-looking information, there may be other factors that cause results not to be as anticipated, estimated or intended. There can be no assurance that such statements will prove to be accurate, as actual results and future events could differ materially from those anticipated in such statements. Accordingly, readers should not place undue reliance on forward-looking statements and forward-looking information. Readers are cautioned that reliance on such information may not be appropriate for other purposes. The Company does not undertake to update any forward-looking statement, forward-looking information or financial out-look that are incorporated by reference herein, except in accordance with applicable securities laws. We seek safe harbor.</em></p>  <br /><img src='https://ml.globenewswire.com/media/MTI2OGE3MGQtYzA4MC00NDQ0LTk5YTktZjE0ZjcwOThlMWQ0LTExMzIzOTU=/tiny/Stallion-Uranium-Corp-.png' referrerpolicy='no-referrer-when-downgrade' />",
    "search_terms": "Horse Heaven,Stallion Uranium Corp.,STUD",
    "master_gid": 4751,
    "date": "2024-11-08T22:21:00.000Z",
    "tags": "|||Uranium|Project Acquisition",
    "image_id": null,
    "hidden": false,
    "company_id": 1757,
    "provider": "globenewswire",
    "excerpt": "VANCOUVER, British Columbia, Nov. 08, 2024 (GLOBE NEWSWIRE) -- Stallion Uranium Corp. (the “Company” or “Stallion”) (TSX-V: STUD; OTCQB: STLNF; FSE: FE0) announces that, further to its news release of October 9, 2024 and October 30, 2024, the Company has entered into a definitive agreement (the “Option Agreement”) with 1503571",
    "is_regulatory": false,
    "refined_tags": [],
    "ftp_filename": null,
    "company_name": "Unknown",
    "exchange": "TSXV",
    "root_ticker": "STUD",
    "project_name": "Horse Heaven",
    "gid": 4751,
    "location": "Idaho, United States",
    "plan_id": "companytier2",
    "description_text": "VANCOUVER, British Columbia, Nov.  08, 2024  (GLOBE NEWSWIRE) -- Stallion Uranium Corp. (the “ Company ” or “ Stallion ”) (TSX-V: STUD; OTCQB: STLNF; FSE: FE0) announces that, further to its news release of October 9, 2024 and October 30, 2024, the Company has entered into a definitive agreement (the “ Option Agreement ”) with 1503571 B.C. Ltd. (the “ Optionor ”), an arm’s-length party, on revised terms pursuant to which the Company has granted the Optionor the option to acquire a 100% interest (the “ Option ”) in its Horse Heaven Gold and Antimony project consisting of 699 mineral claims covering 5,817 ha located in Idaho, United States (the “ Property ”). Pursuant to the terms of the Option Agreement, the Optionor may acquire 100% of the issued and outstanding common shares (the “ Horse Heaven Parent Shares ”) of 1262446 B.C. Ltd. (“ Horse Heaven Parent ”), a wholly owned subsidiary of the Company, which holds an undivided 100% legal and beneficial interest in the Property, in consideration of the following to the Company: $200,000 in cash on the signing of the binding letter of intent (paid); $200,000 in cash on the effective date of the Option Agreement; $2,000,000 in common shares of the Optionor at a deemed price of $0.18 per share on the effective date of the Option Agreement; and $200,000 in cash on the first anniversary of the effective date of the Option Agreement. During the option period, the Optionor will be the operator of the Property. The Optionor is not required to incur any exploration expenditures to advance the Property. “This definitive agreement allows Stallion to monetize a portion of the value of the Horse Heaven project while maintaining upside exposure through a sizeable equity ownership. Antimony scarcity, especially in the United States, where they have no domestic production, will be a key driver of value of the project moving forward. Having a new company focused on advancing that project will allow that value to be realized. Stallion is now squarely focused on its vision of making the next big uranium discovery in the Athabasca basin,” said Drew Zimmerman, CEO. The Option is subject to acceptance by the TSX Venture Exchange. About Stallion Uranium Stallion Uranium is working to ‘Fuel the Future with Uranium’ through the exploration of roughly 3,000 sq/km in the Athabasca Basin, home to the largest high-grade uranium deposits in the world. The company, with JV partner Atha Energy holds the largest contiguous project in the Western Athabasca Basin adjacent to multiple high-grade discovery zones. Our leadership and advisory teams are comprised of uranium and precious metals exploration experts with the capital markets experience and the technical talent for acquiring and exploring early-stage properties. For more information visit stallionuranium.com or contact: Drew Zimmerman Chief Executive Officer 778-686-0973 info@stallionuranium.com Neither the TSX Venture Exchange nor its Regulation Services Provider (as that term is defined in the policies of the TSX Venture Exchange) accepts responsibility for the adequacy or accuracy of this release. Cautionary Note Regarding Forward-Looking Statements This news release includes certain statements and information that may constitute forward-looking information within the meaning of applicable Canadian securities laws. Forward-looking statements relate to future events or future performance and reflect the expectations or beliefs of management of the Company regarding future events. Generally, forward-looking statements and information can be identified by the use of forward-looking terminology such as “intends” or “expects”, or variations of such words and phrases or statements that certain actions, events or results “may”, “could”, “should”, “would” or “occur”. This information and these statements, referred to herein as \"forward‐looking statements\", are not historical facts, are made as of the date of this news release and include without limitation, statements regarding discussions of future plans, estimates and forecasts and statements as to management's expectations and intentions with respect to, among other things, exercise of the Option. These forward‐looking statements involve numerous risks and uncertainties and actual results might differ materially from results suggested in any forward-looking statements. These risks and uncertainties include, among other things, that the Company will not receive TSX Venture Exchange acceptance and that the Option will not be exercised. In making the forward-looking statements in this news release, the Company has applied several material assumptions, including without limitation, that the Company will receive TSX Venture Exchange acceptance and that the Option will be exercised. Although management of the Company has attempted to identify important factors that could cause actual results to differ materially from those contained in forward-looking statements or forward-looking information, there may be other factors that cause results not to be as anticipated, estimated or intended. There can be no assurance that such statements will prove to be accurate, as actual results and future events could differ materially from those anticipated in such statements. Accordingly, readers should not place undue reliance on forward-looking statements and forward-looking information. Readers are cautioned that reliance on such information may not be appropriate for other purposes. The Company does not undertake to update any forward-looking statement, forward-looking information or financial out-look that are incorporated by reference herein, except in accordance with applicable securities laws. We seek safe harbor.",
    "primary_commodity": "Au"
  },
  "articleProject": {
    "gid": 4751,
    "project_name": "Horse Heaven",
    "location": "Idaho, United States"
  },
  "articleExchange": "TSXV",
  "articleCompanyId": 1757,
  "articleTicker": "STUD",
  "articleCompanyName": "Stallion Uranium Corp.",
  "allOtherCompanyProjects": [
    {
      "company_id": 1757,
      "gid": 5281,
      "project_name": "Richmond Mountain",
      "location": "Nevada, United States"
    },
    {
      "company_id": 1757,
      "gid": 8602,
      "project_name": "Stone Island",
      "location": "Saskatchewan, Canada"
    },
    {
      "company_id": 1757,
      "gid": 4751,
      "project_name": "Horse Heaven",
      "location": "Idaho, United States"
    },
    {
      "company_id": 1757,
      "gid": 5233,
      "project_name": "Coffer",
      "location": "Saskatchewan, Canada"
    },
    {
      "company_id": 1757,
      "gid": 4677,
      "project_name": "Western Athabasca",
      "location": "Saskatchewan, Canada"
    },
    {
      "company_id": 1757,
      "gid": 5349,
      "project_name": "Borderline",
      "location": "Saskatchewan, Canada"
    },
    {
      "company_id": 1757,
      "gid": 5350,
      "project_name": "Newlands",
      "location": "Saskatchewan, Canada"
    },
    {
      "company_id": 1757,
      "gid": 5348,
      "project_name": "Sandy Lake",
      "location": "Saskatchewan, Canada"
    },
    {
      "company_id": 1757,
      "gid": 5235,
      "project_name": "Gunter Lake",
      "location": "Saskatchewan, Canada"
    },
    {
      "company_id": 1757,
      "gid": 6439,
      "project_name": "Upper Mirror River",
      "location": "Saskatchewan, Canada"
    }
  ],
  "allOtherCompanyNews": [
    {
      "id": 105393,
      "company_id": 1757,
      "title": "Stallion Uranium Provides Corporate Update",
      "link": null,
      "date": "2025-05-21T20:58:11.000Z",
      "hidden": false
    },
    {
      "id": -200749,
      "company_id": 1757,
      "title": "Stallion Uranium Announces Failure to File Cease Trade Order",
      "link": null,
      "date": "2025-05-14T11:30:00.000Z",
      "hidden": false
    },
    {
      "id": -199879,
      "company_id": 1757,
      "title": "Canadian Investment Regulatory Organization Trading Halt - STUD",
      "link": "https://contentapi.cision.com/api/v1.0/releases/20250508C2292",
      "date": "2025-05-08T12:35:00.000Z",
      "hidden": false
    },
    {
      "id": 102527,
      "company_id": 1757,
      "title": "Stallion Uranium Announces Completion of Ground Gravity Survey over Coyote Target",
      "link": null,
      "date": "2025-04-30T11:30:00.000Z",
      "hidden": false
    },
    {
      "id": 100790,
      "company_id": 1757,
      "title": "Stallion Uranium Closes $1.45 million Private Placement",
      "link": null,
      "date": "2025-04-24T11:00:00.000Z",
      "hidden": false
    },
    {
      "id": 99100,
      "company_id": 1757,
      "title": "Stallion Uranium Increases Private Placement to $1.45 Million",
      "link": null,
      "date": "2025-04-09T04:34:32.000Z",
      "hidden": false
    },
    {
      "id": 98351,
      "company_id": 1757,
      "title": "Stallion Uranium Announces C$1.2 Million Private Placement",
      "link": null,
      "date": "2025-04-01T19:08:34.000Z",
      "hidden": false
    },
    {
      "id": -171334,
      "company_id": 1757,
      "title": "Stallion Uranium Announces Effective Date Of Consolidation",
      "link": "https://www.globenewswire.com/news-release/2025/02/26/3033272/0/en/Stallion-Uranium-Announces-Effective-Date-Of-Consolidation.html",
      "date": "2025-02-26T19:36:00.000Z",
      "hidden": false
    },
    {
      "id": 88156,
      "company_id": 1757,
      "title": "Stallion Uranium Announces New Consolidation Ratio",
      "link": "https://www.globenewswire.com/news-release/2025/02/18/3027720/0/en/Stallion-Uranium-Announces-New-Consolidation-Ratio.html",
      "date": "2025-02-18T12:30:00.000Z",
      "hidden": false
    },
    {
      "id": 86909,
      "company_id": 1757,
      "title": "Stallion Uranium Commences Ground Electromagnetic Survey on High Priority Drill Targets",
      "link": "https://www.globenewswire.com/news-release/2025/02/05/3021077/0/en/Stallion-Uranium-Commences-Ground-Electromagnetic-Survey-on-High-Priority-Drill-Targets.html",
      "date": "2025-02-05T12:30:00.000Z",
      "hidden": false
    }
  ]
}