{
  "article": {
    "id": 27700,
    "link": "https://contentapi.cision.com/api/v1.0/releases/20221114C0234",
    "title": "ENCORE ANNOUNCES AGREEMENT TO ACQUIRE ALTA MESA URANIUM PROJECT IN SOUTH TEXAS AND BOUGHT DEAL FINANCING",
    "description": "\n\n<p class=\"prntac\"><i>/NOT FOR DISTRIBUTION TO <span class=\"xn-location\">UNITED STATES</span> NEWSWIRE SERVICES OR DISSEMINATION IN <span class=\"xn-location\">THE UNITED STATES</span>/</i></p>\n<p class=\"prntac\"><i>FUELING THE FUTURE IN <span class=\"xn-location\">THE UNITED STATES</span></i></p>\n<p class=\"prntar\"><b>TSX.V: EU<br></br></b><b>OTCQB: ENCUF<br></br></b><b><a href=\"https://c212.net/c/link/?t=0&amp;l=en&amp;o=3708002-1&amp;h=3968017370&amp;u=http%3A%2F%2Fwww.encoreuranium.com%2F&amp;a=www.encoreuranium.com\" rel=\"nofollow\" target=\"_blank\">www.encoreuranium.com</a></b></p>\n<p><span class=\"legendSpanClass\"><span class=\"xn-location\">CORPUS CHRISTI, Texas</span></span>, <span class=\"legendSpanClass\"><span class=\"xn-chron\">Nov. 14, 2022</span></span> /CNW/ - enCore Energy Corp. (TSXV: EU) (OTCQB: ENCUF) (\"<b>enCore</b>\") is pleased to announce that it has entered into a definitive agreement (the \"<b>Agreement</b>\") to acquire the Alta Mesa In-Situ Recovery (\"<b>ISR</b>\") uranium project (\"<b>Alta Mesa</b>\") from Energy Fuels Inc. (the \"<b>Transaction</b>\") for total consideration of <span class=\"xn-money\">US$120 million</span> (the \"<b>Consideration</b>\"). The Transaction will position enCore  as a leading US-focused ISR uranium company with the proven management expertise required to advance multiple production opportunities within its portfolio.</p>\n<div aria-level=\"3\" class=\"wcag-arialevel-3\" role=\"heading\" style=\"display: block; font-size: 1.17em; margin-block-start: 1em; margin-block-end: 1em; margin-inline-start: 0px; margin-inline-end: 0px; font-weight: bold;\"><b>Transaction Highlights</b></div><p>Alta Mesa includes a fully-licensed and constructed ISR processing facility that has an operating capacity of 1.5 million pounds of uranium per year. Between Alta Mesa, Rosita and Kingsville Dome, all fully licensed for production, enCore's existing processing capacity will reach 3.6 million pounds of uranium per year.</p>\n<ul type=\"disc\"><li>Alta Mesa is host to measured and indicated resources of 3.41 million lbs U<sub>3</sub>O<sub>8</sub> (1.57 million tons at an average grade of 0.109% U<sub>3</sub>O<sub>8</sub>) plus inferred resources of 16.79 million lbs U<sub>3</sub>O<sub>8</sub> (7.0 million tons at an average grade of 0.120% U<sub>3</sub>O<sub>8</sub>). Abundant exploration upside exists within the Alta Mesa land package around the existing defined resource areas, which enCore will prioritize.</li><li>Alta Mesa will diversify enCore's <span class=\"xn-location\">South Texas</span> operations into a 3<sup>rd</sup> fully licensed production facility, along with Rosita and Kingsville Dome, all located in the business-friendly state of <span class=\"xn-location\">Texas</span>. enCore' mid- and long-term production potential is further fueled by a pipeline of projects with Dewey-Burdock in <span class=\"xn-location\">South Dakota</span>, Gas Hills in <span class=\"xn-location\">Wyoming</span> and additional projects in <span class=\"xn-location\">New Mexico</span>. There are only 11 licensed production facilities in <span class=\"xn-location\">the United States</span>;</li><li>Alta Mesa is currently on standby and ready to resume production, as market conditions warrant. It can reach commercial production levels with limited required capital within 10 months of a production decision.</li><li>Control of a large private land package totaling 195,501 contiguous acres, including 4,575-acres currently under a lease and mining permit and 190,926-acres under a lease-option and exploration/testing permit.</li><li>The acquisition will further cement enCore Energy's position as a dominant ISR uranium developer and future producer in the US.</li><li>Alta Mesa's operations are located on private land, with 100% of minerals privately owned, and in a supportive jurisdiction with primary regulatory authority residing with the <span class=\"xn-location\">State of Texas</span>.</li><li>The Alta Mesa ISR processing facility is a fully permitted and constructed past-producing In-Situ Recovery operation, with a well-established track record of lower cost uranium production. It currently has fully permitted resources that, with the installation of production patterns, can be put into production with no additional permitting required.</li><li>Alta Mesa has extensive exploration results, with underexplored potential, across the area that have identified significant uranium resources that enCore expects can be recovered at lower costs, as market conditions warrant.</li><li>Alta Mesa produced a total of 4.6 million pounds of uranium between <span class=\"xn-chron\">October 2005</span> and <span class=\"xn-chron\">November 2013</span>, including 1 million pounds of uranium per year over a two-year period.</li><li>With low holding costs, Alta Mesa provides fully permitted lower-cost production scalability that can be brought into production quickly to provide a domestic energy source for <span class=\"xn-location\">the United States</span>.</li></ul><p><b>Conference Call:</b> The Company will host an online conference call on <span class=\"xn-chron\">Monday, November 14, 2022</span> at <span class=\"xn-chron\">8:00 AM ET</span>. To join the online call and presentation please log in at: <a href=\"https://c212.net/c/link/?t=0&amp;l=en&amp;o=3708002-1&amp;h=109225653&amp;u=https%3A%2F%2Fus02web.zoom.us%2Fj%2F89072489639%3Fpwd%3DejFhU3FWTkpRRUkwakFJUEd1SFV0Zz09&amp;a=https%3A%2F%2Fus02web.zoom.us%2Fj%2F89072489639%3Fpwd%3DejFhU3FWTkpRRUkwakFJUEd1SFV0Zz09\" rel=\"nofollow\" target=\"_blank\">https://us02web.zoom.us/j/89072489639?pwd=ejFhU3FWTkpRRUkwakFJUEd1SFV0Zz09</a>.</p>\n<p>To view the Alta Mesa project maps and enCore Energy's <span class=\"xn-location\">South Texas</span> projects please visit: <a href=\"https://c212.net/c/link/?t=0&amp;l=en&amp;o=3708002-1&amp;h=2900225747&amp;u=https%3A%2F%2Fbit.ly%2F3fV9fTg&amp;a=https%3A%2F%2Fbit.ly%2F3fV9fTg\" rel=\"nofollow\" target=\"_blank\">https://bit.ly/3fV9fTg</a></p>\n<p><b><span class=\"xn-person\">William M. Sheriff</span>, Executive Chairman of enCore</b>, commented: \"This transaction exceeds enCore's long stated requirement for any major acquisition to be accretive to shareholders in not only production capacity but also cost and timelines to production and an asset we secure at a compelling valuation. In addition, this acquisition further cements enCore's commitment to near-term US-based uranium production with our initial focus on <span class=\"xn-location\">South Texas</span>. Alta Mesa will immediately become a flagship asset amongst our large project portfolio, including our licensed and past-producing Rosita ISR production plant in <span class=\"xn-location\">South Texas</span>, our development-stage Dewey-Burdock and Gas Hills projects in <span class=\"xn-location\">South Dakota</span> and <span class=\"xn-location\">Wyoming</span>, respectively, along with a large resource portfolio in <span class=\"xn-location\">New Mexico</span>. enCore is committed to developing a reliable domestic source of energy.\"</p>\n<p><b><span class=\"xn-person\">Paul Goranson</span>, CEO and Director of enCore</b>, further added: \"As the previous Vice President of Mesteña Uranium, LLC, which owned and operated the Alta Mesa project, we generated substantial cash flow during the last cycle of elevated uranium prices, and established the project as a leading US ISR uranium producer. Combined with our <span class=\"xn-location\">South Texas</span> operations that are anchored around our Rosita project, this acquisition puts us in an exceptionally strong position to advance towards being a long-term sustainable source of uranium production to fuel clean nuclear energy that will benefit our local communities, the state of <span class=\"xn-location\">Texas</span>, and <span class=\"xn-location\">the United States</span>.\"</p>\n<div aria-level=\"3\" class=\"wcag-arialevel-3\" role=\"heading\" style=\"display: block; font-size: 1.17em; margin-block-start: 1em; margin-block-end: 1em; margin-inline-start: 0px; margin-inline-end: 0px; font-weight: bold;\"><b>Alta Mesa</b></div><p>The Alta Mesa project is a fully licensed and constructed ISR project and central processing facility currently on standby, located on almost 200,000 acres of private land in the state of <span class=\"xn-location\">Texas</span>. Total operating capacity is 1.5 million lbs U<sub>3</sub>O<sub>8</sub> per year. Alta Mesa historically produced nearly 5 million lbs U<sub>3</sub>O<sub>8</sub> between 2005 and 2013, when full production was curtailed as a result of low uranium prices at the time. enCore will immediately pursue the resumption of operations following completion of the Transaction.</p>\n<div aria-level=\"3\" class=\"wcag-arialevel-3\" role=\"heading\" style=\"display: block; font-size: 1.17em; margin-block-start: 1em; margin-block-end: 1em; margin-inline-start: 0px; margin-inline-end: 0px; font-weight: bold;\"><b>Details of the Transaction</b></div><p>Pursuant to the terms of the Agreement, enCore, through its wholly owned subsidiary enCore Energy US Corp., will acquire all of the limited liability company membership interests in each of the three <span class=\"xn-location\">Texas</span> limited liability companies which collectively own and control Alta Mesa, being EFR Alta Mesa LLC, <span class=\"xn-person\">Leoncito Plant</span>, LLC and Leoncito Project, LLC from EFR White Canyon Corp. (\"<b>EFR White Canyon</b>\"), a wholly owned subsidiary of Energy Fuels. enCore will additionally assume the reclamation obligations and surety bonds associated with Alta Mesa in exchange for paying to Energy Fuels the cash equivalent of the existing collateral.</p>\n<p>The Consideration payable to Energy Fuels consists of <span class=\"xn-money\">US$60 million</span> in cash and a <span class=\"xn-money\">US$60 million</span> secured vendor take-back convertible promissory note (the \"<b>Note</b>\") with EFR White Canyon. The Note will have a two (2) year term and will bear interest at a rate of 8% per annum payable on <span class=\"xn-chron\">June 30</span><sup>th</sup> and <span class=\"xn-chron\">December 31</span><sup>st</sup> of each year during the term. The Note will be convertible at the election of the holder, to acquire common shares of enCore at a price equal to a 20% premium to the volume weighted average price of the enCore shares for the 10 consecutive trading days immediately prior to the closing of the Transaction. Energy Fuels has agreed not to transact with the common shares of enCore received on conversion of the Note, including hedging and short sales, with exceptions for sale transactions of up to <span class=\"xn-money\">US$10 million</span> in value in any 30-day period, block trades and underwritten distributions. In addition, Energy Fuels has agreed to standard standstill provisions restricting additional acquisitions of enCore securities.</p>\n<p>The board of directors of enCore (the \"<b>Board</b>\"), after consultation with its financial and legal advisors, and after receiving a unanimous recommendation from a special committee of the Board comprised of independent directors (the \"<b>Special Committee</b>\"), has unanimously approved the Transaction. The Board, in conducting its review of the Transaction, was advised by Haywood Securities Inc. (\"<b>Haywood</b>\") and received a fairness opinion from Haywood which determined that, in <span class=\"xn-location\">Haywood's</span> opinion, based upon and subject to the assumptions, limitations and qualifications set out therein, the consideration to be paid by enCore in connection with the Transaction is fair to enCore. The Special Committee, in its review and evaluation of the Transaction, additionally received its own separate fairness opinion from Clarus Securities Inc. (\"<b>Clarus</b>\") which determined that, in Clarus's opinion, based upon and subject to the assumptions, limitations and qualifications set out therein, the consideration to be paid by enCore in connection with the Transaction is fair to enCore. Hunton Andrews Kurth LLP and Morton Law LLP are acting as legal advisors to enCore in connection with the Transaction.</p>\n<p>The Transaction is subject to customary closing conditions, including enCore completing a financing to fund the cash portion of the purchase price and approval by the TSX Venture Exchange (the \"<b>Exchange</b>\"), and available funds.</p>\n<div aria-level=\"3\" class=\"wcag-arialevel-3\" role=\"heading\" style=\"display: block; font-size: 1.17em; margin-block-start: 1em; margin-block-end: 1em; margin-inline-start: 0px; margin-inline-end: 0px; font-weight: bold;\"><b>Equity Financing</b></div><p>In connection  with the Transaction, enCore has entered into an agreement with Canaccord Genuity Corp. (the \"<b>Lead Underwriter</b>\"), on behalf of a syndicate of underwriters (together with the Lead Underwriter, the \"<b>Underwriters</b>\"), pursuant to which the Underwriters have agreed to purchase, on a \"bought deal\" private placement basis 20,000,000 subscription receipts (the \"<b>Subscription Receipts</b>\") of enCore at a price of <span class=\"xn-money\">C$3.00</span> per Subscription Receipt (the \"<b>Issue Price</b>\") for aggregate gross proceeds to enCore of  <span class=\"xn-money\">C$60 million</span> (the \"<b>Offering</b>\").</p>\n<p>enCore has granted the Underwriters an over-allotment option exercisable, in whole or in part, at the sole discretion of the Underwriters, to purchase up to an additional 3,000,000 Subscription Receipts at the Issue Price until 48 hours prior to the closing of the Offering.</p>\n<p>The net proceeds of the Offering will be used to partially fund the cash portion of the Consideration payable to Energy Fuels pursuant to the Transaction.</p>\n<p>The Subscription Receipts will be issued pursuant to a subscription receipt agreement (the \"<b>Subscription Receipt Agreement</b>\") to be entered into by enCore, the Lead Underwriter, on behalf of the Underwriters, and a licensed Canadian trust company as Subscription Receipt agent to be agreed upon. Pursuant to the Subscription Receipt Agreement, the gross proceeds from the Offering (less 50% of the Underwriters' cash commission and  the Underwriters' expenses) (the \"<b>Escrowed Funds</b>\") will be held in escrow pending satisfaction of certain conditions, including, amongst others, (a) the satisfaction of each of the conditions precedent to the Transaction (other than the payment of the cash portion of the Consideration); and (b) the receipt of all required approvals in connection with the Transaction and the Offering, including, without limitation, conditional approval of the Exchange (collectively, the \"<b>Escrow Release Conditions</b>\").</p>\n<p>Upon satisfaction of the Escrow Release Conditions, each of the Subscription Receipts will automatically convert into one unit (a \"<b>Unit</b>\") of enCore. Each Unit will be comprised of one common share of enCore (a \"<b>Common Share</b>\") and one Common Share purchase warrant (a \"<b>Warrant</b>\"), with each Warrant entitling the holder thereof to acquire one Common Share (a \"<b>Warrant Share</b>\") at a price of <span class=\"xn-money\">C$3.75</span> for a period of 3 years following the satisfaction of the Escrow Release Conditions. If the Escrow Release Conditions have not been satisfied on or prior to <span class=\"xn-chron\">February 14, 2023</span>, the Escrow Agent shall return the Issue Price plus any interest earned on the Escrowed Funds, to the holders of Subscription Receipts and the Subscription Receipts shall be cancelled.</p>\n<p>Closing of the Offering is expected to occur on or about <span class=\"xn-chron\">December 6, 2022</span> and is subject to certain customary conditions, including, but not limited to, the receipt of all necessary regulatory approvals and acceptance of the Exchange.</p>\n<p>The Subscription Receipts to be issued under the Offering will be offered in each of the provinces of <span class=\"xn-location\">Canada</span> on a private placement basis, to investors in <span class=\"xn-location\">the United States</span> pursuant to available exemptions from the registration requirements of the United States Securities Act of 1933, and in those jurisdictions outside of <span class=\"xn-location\">Canada</span> and <span class=\"xn-location\">the United States</span> which are agreed to by enCore and the Underwriters.</p>\n<p>The securities have not been, and will not be, registered under the United States Securities Act of 1933, as amended (the \"<b>US Securities Act</b>\"), or any US state securities laws, and may not be offered or sold in <span class=\"xn-location\">the United States</span> without registration under the US Securities Act and all applicable state securities laws or compliance with the requirements of an applicable exemption therefrom. This press release shall not constitute an offer to sell or the solicitation of an offer to buy securities in <span class=\"xn-location\">the United States</span>, nor shall there be any sale of these securities in any jurisdiction in which such offer, solicitation or sale would be unlawful.</p>\n<div aria-level=\"3\" class=\"wcag-arialevel-3\" role=\"heading\" style=\"display: block; font-size: 1.17em; margin-block-start: 1em; margin-block-end: 1em; margin-inline-start: 0px; margin-inline-end: 0px; font-weight: bold;\"><b>Qualified Persons</b></div><p><span class=\"xn-person\">John M. Seeley</span>, Ph.D., P.G., enCore's Manager of Geology and Exploration, and a Qualified Person under NI 43-101, has reviewed and approved the technical disclosure in this news release on behalf of enCore.</p>\n<div aria-level=\"3\" class=\"wcag-arialevel-3\" role=\"heading\" style=\"display: block; font-size: 1.17em; margin-block-start: 1em; margin-block-end: 1em; margin-inline-start: 0px; margin-inline-end: 0px; font-weight: bold;\"><b>Technical Disclosure</b></div><p>The technical information in this presentation regarding the Alta Mesa ISR project is based on a technical report entitled \"Technical Report Summary for the Alta Mesa Uranium Project, <span class=\"xn-location\">Brooks</span> and <span class=\"xn-location\">Jim Hogg</span> Counties, <span class=\"xn-location\">Texas, USA</span>\", dated <span class=\"xn-chron\">December 31, 2021</span>, authored by <span class=\"xn-person\">Travis Boam</span>, P.G., of Energy Fuels and Douglas L. Beahm, P.E., P.G. of BRS Engineering, prepared for Energy Fuels, a copy of which has been filed on SEDAR. Mineral resources have been estimated for both the Alta Mesa and Mesteña Grande areas in accordance with CIM standards and definitions and are summarized in the table below.</p>\n<div><table border=\"0\" cellpadding=\"0\" cellspacing=\"0\" class=\"prnbcc\"><tr><td class=\"prngen2\" colspan=\"1\" nowrap=\"nowrap\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\"><b>Alta Mesa &amp; Mesteña Grande Mineral <br></br>Resource Summary (0.30 GT cut-off)</b></span></p>\n</td><td class=\"prngen2\" colspan=\"1\" nowrap=\"nowrap\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\"><b>Tons</b></span></p>\n<p class=\"prnml4\"><span class=\"prnews_span\"><b>('000)</b></span></p>\n</td><td class=\"prngen2\" colspan=\"1\" nowrap=\"nowrap\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\"><b>Avg. Grade</b></span></p>\n<p class=\"prnml4\"><span class=\"prnews_span\"><b>(% U<sub>3</sub>O<sub>8</sub>)</b></span></p>\n</td><td class=\"prngen2\" colspan=\"1\" nowrap=\"nowrap\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\"><b>Pounds</b></span></p>\n<p class=\"prnml4\"><span class=\"prnews_span\"><b>('000)</b></span></p>\n</td></tr><tr><td class=\"prngen3\" colspan=\"1\" nowrap=\"nowrap\" rowspan=\"1\"><p class=\"prnml10\"><span class=\"prnews_span\">Total Measured Mineral Resource<sup>1</sup></span></p>\n</td><td class=\"prngen4\" colspan=\"1\" nowrap=\"nowrap\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\">54</span></p>\n</td><td class=\"prngen5\" colspan=\"1\" nowrap=\"nowrap\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\">0.152</span></p>\n</td><td class=\"prngen5\" colspan=\"1\" nowrap=\"nowrap\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\">164</span></p>\n</td></tr><tr><td class=\"prngen3\" colspan=\"1\" nowrap=\"nowrap\" rowspan=\"1\"><p class=\"prnml10\"><span class=\"prnews_span\">Alta Mesa Indicated Mineral Resource</span></p>\n</td><td class=\"prngen4\" colspan=\"1\" nowrap=\"nowrap\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\">1,397</span></p>\n</td><td class=\"prngen5\" colspan=\"1\" nowrap=\"nowrap\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\">0.106</span></p>\n</td><td class=\"prngen5\" colspan=\"1\" nowrap=\"nowrap\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\">2,959</span></p>\n</td></tr><tr><td class=\"prngen3\" colspan=\"1\" nowrap=\"nowrap\" rowspan=\"1\"><p class=\"prnml10\"><span class=\"prnews_span\">Mesteña Grande Indicated Mineral Resource</span></p>\n</td><td class=\"prngen4\" colspan=\"1\" nowrap=\"nowrap\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\">119</span></p>\n</td><td class=\"prngen5\" colspan=\"1\" nowrap=\"nowrap\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\">0.120</span></p>\n</td><td class=\"prngen5\" colspan=\"1\" nowrap=\"nowrap\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\">287</span></p>\n</td></tr><tr><td class=\"prngen3\" colspan=\"1\" nowrap=\"nowrap\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\"><b>Total Measured &amp; Indicated Resources</b></span></p>\n</td><td class=\"prngen4\" colspan=\"1\" nowrap=\"nowrap\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\"><b>1,570</b></span></p>\n</td><td class=\"prngen5\" colspan=\"1\" nowrap=\"nowrap\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\"><b>0.109</b></span></p>\n</td><td class=\"prngen5\" colspan=\"1\" nowrap=\"nowrap\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\"><b>3,410</b></span></p>\n</td></tr><tr><td class=\"prngen3\" colspan=\"1\" nowrap=\"nowrap\" rowspan=\"1\"><p class=\"prnml10\"><span class=\"prnews_span\">Alta Mesa Inferred Mineral Resource</span></p>\n</td><td class=\"prngen4\" colspan=\"1\" nowrap=\"nowrap\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\">1,263</span></p>\n</td><td class=\"prngen5\" colspan=\"1\" nowrap=\"nowrap\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\">0.126</span></p>\n</td><td class=\"prngen5\" colspan=\"1\" nowrap=\"nowrap\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\">3,192</span></p>\n</td></tr><tr><td class=\"prngen3\" colspan=\"1\" nowrap=\"nowrap\" rowspan=\"1\"><p class=\"prnml10\"><span class=\"prnews_span\">Mesteña Grande Inferred Mineral Resource</span></p>\n</td><td class=\"prngen4\" colspan=\"1\" nowrap=\"nowrap\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\">5,733</span></p>\n</td><td class=\"prngen5\" colspan=\"1\" nowrap=\"nowrap\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\">0.119</span></p>\n</td><td class=\"prngen5\" colspan=\"1\" nowrap=\"nowrap\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\">13,601</span></p>\n</td></tr><tr><td class=\"prngen3\" colspan=\"1\" nowrap=\"nowrap\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\"><b>Total Inferred Resources</b></span></p>\n</td><td class=\"prngen4\" colspan=\"1\" nowrap=\"nowrap\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\"><b>6,996</b></span></p>\n</td><td class=\"prngen5\" colspan=\"1\" nowrap=\"nowrap\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\"><b>0.120</b></span></p>\n</td><td class=\"prngen5\" colspan=\"1\" nowrap=\"nowrap\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\"><b>16,793</b></span></p>\n</td></tr></table></div><div><table border=\"0\" cellpadding=\"0\" cellspacing=\"0\" class=\"prnbcc\"><tr><td class=\"prnpr2 prnpl2 prnvat prntal prnsbtb1 prnrbrb1 prnsbbb1 prnsblb1\" colspan=\"1\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\"><i><sup>1</sup></i> </span></p>\n</td><td class=\"prngen3\" colspan=\"1\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\"><i>Represents that portion of the in-place mineral resource that are estimated to be recoverable within existing wellfields. Wellfield recovery factors have not been applied to indicated and inferred mineral resources.</i></span></p>\n</td></tr></table></div><p>Note: Mineral resources are not mineral reserves and do not have demonstrated economic viability in accordance with CIM standards. Inferred mineral resources are too speculative to have the economic considerations applied to them which would enable them to be categorized as mineral reserves.</p>\n<div aria-level=\"3\" class=\"wcag-arialevel-3\" role=\"heading\" style=\"display: block; font-size: 1.17em; margin-block-start: 1em; margin-block-end: 1em; margin-inline-start: 0px; margin-inline-end: 0px; font-weight: bold;\"><b>About enCore Energy Corp.</b></div><p>enCore is the most diversified In-Situ Recovery uranium development company in <span class=\"xn-location\">the United States</span>. enCore is focused on becoming the next uranium producer from its licensed and past-producing South Texas Rosita Processing Plant by 2023. The <span class=\"xn-location\">South Dakota</span>-based Dewey-Burdock project and the Wyoming Gas Hills project offer mid-term production opportunities, with significant <span class=\"xn-location\">New Mexico</span> uranium resource endowments providing long-term opportunities. The enCore team is led by industry experts with extensive knowledge and experience in all aspects of ISR uranium operations and the nuclear fuel cycle. enCore is committed to engaging and working with local communities and indigenous governments to create positive impact from corporate developments.</p>\n<p><a href=\"https://c212.net/c/link/?t=0&amp;l=en&amp;o=3708002-1&amp;h=3968017370&amp;u=http%3A%2F%2Fwww.encoreuranium.com%2F&amp;a=www.encoreuranium.com\" rel=\"nofollow\" target=\"_blank\">www.encoreuranium.com</a></p>\n<p><b>Neither the TSX Venture Exchange nor its Regulation Services Provider (as that term is defined in the policies of the TSX Venture Exchange) accepts responsibility for the adequacy or accuracy of this release.</b></p>\n<p><b><i>Cautionary Note Regarding Forward-Looking Statements: </i></b><i>Certain information contained in this news release, including: any information relating to the Company being a leading uranium company; the Company's expectations as to longer term fundamentals in the market and price projections; scalability, and the Company's ability to be able to restart or increase production at Alta Mesa as market conditions warrant; the ability of the Company to complete the acquisition of Alta Mesa and to realize the expected benefits of the acquisition; statements relating to the intended use of the net proceeds of the Offering and the completion of the Transaction and the Offering; the expected timelines for the development and recommencement of production at the Alta Mesa Project; estimates relating to current mineral resources; expectations regarding exploration potential; and any other statements regarding future expectations, beliefs, goals or prospects; constitute forward-looking information within the meaning of applicable securities legislation (collectively, \"forward-looking statements\"). All statements in this news release that are not statements of historical fact (including statements containing the words \"expects\", \"does not expect\", \"plans\", \"anticipates\", \"does not anticipate\", \"believes\", \"intends\", \"estimates\", \"projects\", \"potential\", \"scheduled\", \"forecast\", \"budget\" and similar expressions) should be considered forward-looking statements. All such forward-looking statements are subject to important risk factors and uncertainties, many of which are beyond the companies' ability to control or predict. Forward-looking statements necessarily involve known and unknown risks, including, without limitation, risks associated with general economic conditions; adverse industry events; future legislative and regulatory developments; inability to access additional capital; the ability of enCore to implement its business strategies; and other risks. A number of important factors could cause actual results or events to differ materially from those indicated or implied by such forward-looking statements, including without limitation factors relating to forward looking statements listed above which include risks as disclosed in the companies' annual information form filings. Each of the above companies assumes no obligation to update the information in this communication, except as required by law. Additional information identifying risks and uncertainties is contained in filings by the above companies with the various securities commissions which are available online at</i><a href=\"http://www.sec.gov\" rel=\"nofollow\">www.sec.gov</a> <i>and <a href=\"http://www.sedar.com\" rel=\"nofollow\">www.sedar.com</a>. Forward-looking statements are provided for the purpose of providing information about the current expectations, beliefs and plans of management. Such statements may not be appropriate for other purposes and readers should not place undue reliance on these forward-looking statements, that speak only as of the date hereof,</i> <i>as there can be no assurance that the plans, intentions or expectations upon which they are placed will occur. Such information, although considered reasonable by management at the time of preparation, may prove to be incorrect and actual results may differ materially from those anticipated. Forward-looking statements contained in this news release are expressly qualified by this cautionary statement.</i></p>\n<p>SOURCE  enCore Energy Corp.</p>\n<img alt=\"\" src=\"https://rt.newswire.ca/rt.gif?NewsItemId=C0234&amp;Transmission_Id=202211140715CANADANWCANADAPR_C0234&amp;DateId=20221114\" style=\"border:0px; width:1px; height:1px;\"></img>\n\n",
    "search_terms": "Alta Mesa ISR,enCore Energy Corp.,EU",
    "master_gid": 3736,
    "date": "2022-11-14T12:15:00.000Z",
    "tags": "USA|Texas||Uranium|Financials,Project Acquisition",
    "image_id": null,
    "hidden": false,
    "company_id": 1279,
    "provider": null,
    "excerpt": "/NOT FOR DISTRIBUTION TOUNITED STATESNEWSWIRE SERVICES OR DISSEMINATION INTHE UNITED STATES/FUELING THE FUTURE INTHE UNITED STATESTSX.V: EUOTCQB: ENCUFwww.encoreuranium.comCORPUS CHRISTI, Texas,Nov. 14, 2022/CNW/ - enCore Energy Corp. (TSXV: EU) (OTCQB: ENCUF) (\"enCore\") is pleased to announce that it has entered into a definitive agreement (the \"Agreement\") to acquire the Alta Mesa In-Situ",
    "is_regulatory": false,
    "refined_tags": [
      "Project Acquisition",
      "Financials"
    ],
    "ftp_filename": null,
    "company_name": "Boss Energy Ltd",
    "exchange": "TSXV",
    "root_ticker": "EU",
    "project_name": "Alta Mesa ISR",
    "gid": 3736,
    "location": "Texas, United States",
    "plan_id": null,
    "description_text": "/NOT FOR DISTRIBUTION TO UNITED STATES NEWSWIRE SERVICES OR DISSEMINATION IN THE UNITED STATES / FUELING THE FUTURE IN THE UNITED STATES TSX.V: EU OTCQB: ENCUF www.encoreuranium.com CORPUS CHRISTI, Texas , Nov. 14, 2022 /CNW/ - enCore Energy Corp. (TSXV: EU) (OTCQB: ENCUF) (\" enCore \") is pleased to announce that it has entered into a definitive agreement (the \" Agreement \") to acquire the Alta Mesa In-Situ Recovery (\" ISR \") uranium project (\" Alta Mesa \") from Energy Fuels Inc. (the \" Transaction \") for total consideration of US$120 million (the \" Consideration \"). The Transaction will position enCore  as a leading US-focused ISR uranium company with the proven management expertise required to advance multiple production opportunities within its portfolio. Transaction Highlights Alta Mesa includes a fully-licensed and constructed ISR processing facility that has an operating capacity of 1.5 million pounds of uranium per year. Between Alta Mesa, Rosita and Kingsville Dome, all fully licensed for production, enCore's existing processing capacity will reach 3.6 million pounds of uranium per year. Alta Mesa is host to measured and indicated resources of 3.41 million lbs U 3 O 8 (1.57 million tons at an average grade of 0.109% U 3 O 8 ) plus inferred resources of 16.79 million lbs U 3 O 8 (7.0 million tons at an average grade of 0.120% U 3 O 8 ). Abundant exploration upside exists within the Alta Mesa land package around the existing defined resource areas, which enCore will prioritize. Alta Mesa will diversify enCore's South Texas operations into a 3 rd fully licensed production facility, along with Rosita and Kingsville Dome, all located in the business-friendly state of Texas . enCore' mid- and long-term production potential is further fueled by a pipeline of projects with Dewey-Burdock in South Dakota , Gas Hills in Wyoming and additional projects in New Mexico . There are only 11 licensed production facilities in the United States ; Alta Mesa is currently on standby and ready to resume production, as market conditions warrant. It can reach commercial production levels with limited required capital within 10 months of a production decision. Control of a large private land package totaling 195,501 contiguous acres, including 4,575-acres currently under a lease and mining permit and 190,926-acres under a lease-option and exploration/testing permit. The acquisition will further cement enCore Energy's position as a dominant ISR uranium developer and future producer in the US. Alta Mesa's operations are located on private land, with 100% of minerals privately owned, and in a supportive jurisdiction with primary regulatory authority residing with the State of Texas . The Alta Mesa ISR processing facility is a fully permitted and constructed past-producing In-Situ Recovery operation, with a well-established track record of lower cost uranium production. It currently has fully permitted resources that, with the installation of production patterns, can be put into production with no additional permitting required. Alta Mesa has extensive exploration results, with underexplored potential, across the area that have identified significant uranium resources that enCore expects can be recovered at lower costs, as market conditions warrant. Alta Mesa produced a total of 4.6 million pounds of uranium between October 2005 and November 2013 , including 1 million pounds of uranium per year over a two-year period. With low holding costs, Alta Mesa provides fully permitted lower-cost production scalability that can be brought into production quickly to provide a domestic energy source for the United States . Conference Call: The Company will host an online conference call on Monday, November 14, 2022 at 8:00 AM ET . To join the online call and presentation please log in at: https://us02web.zoom.us/j/89072489639?pwd=ejFhU3FWTkpRRUkwakFJUEd1SFV0Zz09 . To view the Alta Mesa project maps and enCore Energy's South Texas projects please visit: https://bit.ly/3fV9fTg William M. Sheriff , Executive Chairman of enCore , commented: \"This transaction exceeds enCore's long stated requirement for any major acquisition to be accretive to shareholders in not only production capacity but also cost and timelines to production and an asset we secure at a compelling valuation. In addition, this acquisition further cements enCore's commitment to near-term US-based uranium production with our initial focus on South Texas . Alta Mesa will immediately become a flagship asset amongst our large project portfolio, including our licensed and past-producing Rosita ISR production plant in South Texas , our development-stage Dewey-Burdock and Gas Hills projects in South Dakota and Wyoming , respectively, along with a large resource portfolio in New Mexico . enCore is committed to developing a reliable domestic source of energy.\" Paul Goranson , CEO and Director of enCore , further added: \"As the previous Vice President of Mesteña Uranium, LLC, which owned and operated the Alta Mesa project, we generated substantial cash flow during the last cycle of elevated uranium prices, and established the project as a leading US ISR uranium producer. Combined with our South Texas operations that are anchored around our Rosita project, this acquisition puts us in an exceptionally strong position to advance towards being a long-term sustainable source of uranium production to fuel clean nuclear energy that will benefit our local communities, the state of Texas , and the United States .\" Alta Mesa The Alta Mesa project is a fully licensed and constructed ISR project and central processing facility currently on standby, located on almost 200,000 acres of private land in the state of Texas . Total operating capacity is 1.5 million lbs U 3 O 8 per year. Alta Mesa historically produced nearly 5 million lbs U 3 O 8 between 2005 and 2013, when full production was curtailed as a result of low uranium prices at the time. enCore will immediately pursue the resumption of operations following completion of the Transaction. Details of the Transaction Pursuant to the terms of the Agreement, enCore, through its wholly owned subsidiary enCore Energy US Corp., will acquire all of the limited liability company membership interests in each of the three Texas limited liability companies which collectively own and control Alta Mesa, being EFR Alta Mesa LLC, Leoncito Plant , LLC and Leoncito Project, LLC from EFR White Canyon Corp. (\" EFR White Canyon \"), a wholly owned subsidiary of Energy Fuels. enCore will additionally assume the reclamation obligations and surety bonds associated with Alta Mesa in exchange for paying to Energy Fuels the cash equivalent of the existing collateral. The Consideration payable to Energy Fuels consists of US$60 million in cash and a US$60 million secured vendor take-back convertible promissory note (the \" Note \") with EFR White Canyon. The Note will have a two (2) year term and will bear interest at a rate of 8% per annum payable on June 30 th and December 31 st of each year during the term. The Note will be convertible at the election of the holder, to acquire common shares of enCore at a price equal to a 20% premium to the volume weighted average price of the enCore shares for the 10 consecutive trading days immediately prior to the closing of the Transaction. Energy Fuels has agreed not to transact with the common shares of enCore received on conversion of the Note, including hedging and short sales, with exceptions for sale transactions of up to US$10 million in value in any 30-day period, block trades and underwritten distributions. In addition, Energy Fuels has agreed to standard standstill provisions restricting additional acquisitions of enCore securities. The board of directors of enCore (the \" Board \"), after consultation with its financial and legal advisors, and after receiving a unanimous recommendation from a special committee of the Board comprised of independent directors (the \" Special Committee \"), has unanimously approved the Transaction. The Board, in conducting its review of the Transaction, was advised by Haywood Securities Inc. (\" Haywood \") and received a fairness opinion from Haywood which determined that, in Haywood's opinion, based upon and subject to the assumptions, limitations and qualifications set out therein, the consideration to be paid by enCore in connection with the Transaction is fair to enCore. The Special Committee, in its review and evaluation of the Transaction, additionally received its own separate fairness opinion from Clarus Securities Inc. (\" Clarus \") which determined that, in Clarus's opinion, based upon and subject to the assumptions, limitations and qualifications set out therein, the consideration to be paid by enCore in connection with the Transaction is fair to enCore. Hunton Andrews Kurth LLP and Morton Law LLP are acting as legal advisors to enCore in connection with the Transaction. The Transaction is subject to customary closing conditions, including enCore completing a financing to fund the cash portion of the purchase price and approval by the TSX Venture Exchange (the \" Exchange \"), and available funds. Equity Financing In connection  with the Transaction, enCore has entered into an agreement with Canaccord Genuity Corp. (the \" Lead Underwriter \"), on behalf of a syndicate of underwriters (together with the Lead Underwriter, the \" Underwriters \"), pursuant to which the Underwriters have agreed to purchase, on a \"bought deal\" private placement basis 20,000,000 subscription receipts (the \" Subscription Receipts \") of enCore at a price of C$3.00 per Subscription Receipt (the \" Issue Price \") for aggregate gross proceeds to enCore of C$60 million (the \" Offering \"). enCore has granted the Underwriters an over-allotment option exercisable, in whole or in part, at the sole discretion of the Underwriters, to purchase up to an additional 3,000,000 Subscription Receipts at the Issue Price until 48 hours prior to the closing of the Offering. The net proceeds of the Offering will be used to partially fund the cash portion of the Consideration payable to Energy Fuels pursuant to the Transaction. The Subscription Receipts will be issued pursuant to a subscription receipt agreement (the \" Subscription Receipt Agreement \") to be entered into by enCore, the Lead Underwriter, on behalf of the Underwriters, and a licensed Canadian trust company as Subscription Receipt agent to be agreed upon. Pursuant to the Subscription Receipt Agreement, the gross proceeds from the Offering (less 50% of the Underwriters' cash commission and  the Underwriters' expenses) (the \" Escrowed Funds \") will be held in escrow pending satisfaction of certain conditions, including, amongst others, (a) the satisfaction of each of the conditions precedent to the Transaction (other than the payment of the cash portion of the Consideration); and (b) the receipt of all required approvals in connection with the Transaction and the Offering, including, without limitation, conditional approval of the Exchange (collectively, the \" Escrow Release Conditions \"). Upon satisfaction of the Escrow Release Conditions, each of the Subscription Receipts will automatically convert into one unit (a \" Unit \") of enCore. Each Unit will be comprised of one common share of enCore (a \" Common Share \") and one Common Share purchase warrant (a \" Warrant \"), with each Warrant entitling the holder thereof to acquire one Common Share (a \" Warrant Share \") at a price of C$3.75 for a period of 3 years following the satisfaction of the Escrow Release Conditions. If the Escrow Release Conditions have not been satisfied on or prior to February 14, 2023 , the Escrow Agent shall return the Issue Price plus any interest earned on the Escrowed Funds, to the holders of Subscription Receipts and the Subscription Receipts shall be cancelled. Closing of the Offering is expected to occur on or about December 6, 2022 and is subject to certain customary conditions, including, but not limited to, the receipt of all necessary regulatory approvals and acceptance of the Exchange. The Subscription Receipts to be issued under the Offering will be offered in each of the provinces of Canada on a private placement basis, to investors in the United States pursuant to available exemptions from the registration requirements of the United States Securities Act of 1933, and in those jurisdictions outside of Canada and the United States which are agreed to by enCore and the Underwriters. The securities have not been, and will not be, registered under the United States Securities Act of 1933, as amended (the \" US Securities Act \"), or any US state securities laws, and may not be offered or sold in the United States without registration under the US Securities Act and all applicable state securities laws or compliance with the requirements of an applicable exemption therefrom. This press release shall not constitute an offer to sell or the solicitation of an offer to buy securities in the United States , nor shall there be any sale of these securities in any jurisdiction in which such offer, solicitation or sale would be unlawful. Qualified Persons John M. Seeley , Ph.D., P.G., enCore's Manager of Geology and Exploration, and a Qualified Person under NI 43-101, has reviewed and approved the technical disclosure in this news release on behalf of enCore. Technical Disclosure The technical information in this presentation regarding the Alta Mesa ISR project is based on a technical report entitled \"Technical Report Summary for the Alta Mesa Uranium Project, Brooks and Jim Hogg Counties, Texas, USA \", dated December 31, 2021 , authored by Travis Boam , P.G., of Energy Fuels and Douglas L. Beahm, P.E., P.G. of BRS Engineering, prepared for Energy Fuels, a copy of which has been filed on SEDAR. Mineral resources have been estimated for both the Alta Mesa and Mesteña Grande areas in accordance with CIM standards and definitions and are summarized in the table below. Alta Mesa & Mesteña Grande Mineral Resource Summary (0.30 GT cut-off) Tons ('000) Avg. Grade (% U 3 O 8 ) Pounds ('000) Total Measured Mineral Resource 1 54 0.152 164 Alta Mesa Indicated Mineral Resource 1,397 0.106 2,959 Mesteña Grande Indicated Mineral Resource 119 0.120 287 Total Measured & Indicated Resources 1,570 0.109 3,410 Alta Mesa Inferred Mineral Resource 1,263 0.126 3,192 Mesteña Grande Inferred Mineral Resource 5,733 0.119 13,601 Total Inferred Resources 6,996 0.120 16,793 1 Represents that portion of the in-place mineral resource that are estimated to be recoverable within existing wellfields. Wellfield recovery factors have not been applied to indicated and inferred mineral resources. Note: Mineral resources are not mineral reserves and do not have demonstrated economic viability in accordance with CIM standards. Inferred mineral resources are too speculative to have the economic considerations applied to them which would enable them to be categorized as mineral reserves. About enCore Energy Corp. enCore is the most diversified In-Situ Recovery uranium development company in the United States . enCore is focused on becoming the next uranium producer from its licensed and past-producing South Texas Rosita Processing Plant by 2023. The South Dakota -based Dewey-Burdock project and the Wyoming Gas Hills project offer mid-term production opportunities, with significant New Mexico uranium resource endowments providing long-term opportunities. The enCore team is led by industry experts with extensive knowledge and experience in all aspects of ISR uranium operations and the nuclear fuel cycle. enCore is committed to engaging and working with local communities and indigenous governments to create positive impact from corporate developments. www.encoreuranium.com Neither the TSX Venture Exchange nor its Regulation Services Provider (as that term is defined in the policies of the TSX Venture Exchange) accepts responsibility for the adequacy or accuracy of this release. Cautionary Note Regarding Forward-Looking Statements: Certain information contained in this news release, including: any information relating to the Company being a leading uranium company; the Company's expectations as to longer term fundamentals in the market and price projections; scalability, and the Company's ability to be able to restart or increase production at Alta Mesa as market conditions warrant; the ability of the Company to complete the acquisition of Alta Mesa and to realize the expected benefits of the acquisition; statements relating to the intended use of the net proceeds of the Offering and the completion of the Transaction and the Offering; the expected timelines for the development and recommencement of production at the Alta Mesa Project; estimates relating to current mineral resources; expectations regarding exploration potential; and any other statements regarding future expectations, beliefs, goals or prospects; constitute forward-looking information within the meaning of applicable securities legislation (collectively, \"forward-looking statements\"). All statements in this news release that are not statements of historical fact (including statements containing the words \"expects\", \"does not expect\", \"plans\", \"anticipates\", \"does not anticipate\", \"believes\", \"intends\", \"estimates\", \"projects\", \"potential\", \"scheduled\", \"forecast\", \"budget\" and similar expressions) should be considered forward-looking statements. All such forward-looking statements are subject to important risk factors and uncertainties, many of which are beyond the companies' ability to control or predict. Forward-looking statements necessarily involve known and unknown risks, including, without limitation, risks associated with general economic conditions; adverse industry events; future legislative and regulatory developments; inability to access additional capital; the ability of enCore to implement its business strategies; and other risks. A number of important factors could cause actual results or events to differ materially from those indicated or implied by such forward-looking statements, including without limitation factors relating to forward looking statements listed above which include risks as disclosed in the companies' annual information form filings. Each of the above companies assumes no obligation to update the information in this communication, except as required by law. Additional information identifying risks and uncertainties is contained in filings by the above companies with the various securities commissions which are available online at www.sec.gov and www.sedar.com . Forward-looking statements are provided for the purpose of providing information about the current expectations, beliefs and plans of management. Such statements may not be appropriate for other purposes and readers should not place undue reliance on these forward-looking statements, that speak only as of the date hereof, as there can be no assurance that the plans, intentions or expectations upon which they are placed will occur. Such information, although considered reasonable by management at the time of preparation, may prove to be incorrect and actual results may differ materially from those anticipated. Forward-looking statements contained in this news release are expressly qualified by this cautionary statement. SOURCE  enCore Energy Corp.",
    "primary_commodity": "U"
  },
  "articleProject": {
    "gid": 3736,
    "project_name": "Alta Mesa ISR",
    "location": "Texas, United States"
  },
  "articleExchange": "TSXV",
  "articleCompanyId": 1279,
  "articleTicker": "EU",
  "articleCompanyName": "enCore Energy Corp.",
  "allOtherCompanyProjects": [
    {
      "company_id": 1279,
      "gid": 5529,
      "project_name": "Crownpoint & Hosta Butte",
      "location": "New Mexico, United States"
    },
    {
      "company_id": 1279,
      "gid": 5530,
      "project_name": "Juniper Ridge",
      "location": "Wyoming, United States"
    },
    {
      "company_id": 1279,
      "gid": 5531,
      "project_name": "Aladdin",
      "location": "Wyoming, United States"
    },
    {
      "company_id": 1279,
      "gid": 5526,
      "project_name": "Rosita CPP & Wellfield",
      "location": "Texas, United States"
    },
    {
      "company_id": 1279,
      "gid": 4873,
      "project_name": "Marquez-Juan Tafoya",
      "location": "New Mexico, United States"
    },
    {
      "company_id": 1279,
      "gid": 10569,
      "project_name": "Upper Spring Creek In-Situ Recovery",
      "location": "Texas, United States"
    },
    {
      "company_id": 1279,
      "gid": 5527,
      "project_name": "Gas Hills",
      "location": "Wyoming, United States"
    },
    {
      "company_id": 1279,
      "gid": 3736,
      "project_name": "Alta Mesa ISR",
      "location": "Texas, United States"
    },
    {
      "company_id": 1279,
      "gid": 10630,
      "project_name": "Centennial",
      "location": "Colorado, United States"
    },
    {
      "company_id": 1279,
      "gid": 10026,
      "project_name": "Nose Rock",
      "location": "New Mexico, United States"
    },
    {
      "company_id": 1279,
      "gid": 10027,
      "project_name": "West Largo",
      "location": "New Mexico, United States"
    },
    {
      "company_id": 1279,
      "gid": 10028,
      "project_name": "Ambrosia Lake – Treeline",
      "location": "New Mexico, United States"
    },
    {
      "company_id": 1279,
      "gid": 4267,
      "project_name": "Dewey Burdock",
      "location": "South Dakota, United States"
    },
    {
      "company_id": 1279,
      "gid": 5528,
      "project_name": "Kingsville Dome",
      "location": "Texas, United States"
    }
  ],
  "allOtherCompanyNews": [
    {
      "id": 106213,
      "company_id": 1279,
      "title": "enCore Energy Receives Radioactive Materials License for Upper Spring Creek ISR Uranium Project, South Texas; Commences Construction",
      "link": "https://contentapi.cision.com/api/v1.0/releases/20250529C2211",
      "date": "2025-05-29T11:00:00.000Z",
      "hidden": false
    },
    {
      "id": 104470,
      "company_id": 1279,
      "title": "enCore Energy Reports Q1 2025 Financial Results Highlighted by Reduced Uranium Extraction Costs",
      "link": "https://contentapi.cision.com/api/v1.0/releases/20250512VA85953",
      "date": "2025-05-12T20:05:00.000Z",
      "hidden": false
    },
    {
      "id": 100407,
      "company_id": 1279,
      "title": "enCore Energy Continues Wellfield Expansion at the Alta Mesa Uranium Project; Announces Senior Vice President of Operations",
      "link": "https://contentapi.cision.com/api/v1.0/releases/20250422C2286",
      "date": "2025-04-22T11:00:00.000Z",
      "hidden": false
    },
    {
      "id": 99788,
      "company_id": 1279,
      "title": "enCore Energy Appoints Mr. Nathan Tewalt to the Board of Directors",
      "link": "https://contentapi.cision.com/api/v1.0/releases/20250415VA64714",
      "date": "2025-04-15T11:00:00.000Z",
      "hidden": false
    },
    {
      "id": -189658,
      "company_id": 1279,
      "title": "enCore Completes Sale of New Mexico Assets to Verdera Energy Corp.",
      "link": "https://contentapi.cision.com/api/v1.0/releases/20250409VA60810",
      "date": "2025-04-09T11:00:00.000Z",
      "hidden": false
    },
    {
      "id": 98850,
      "company_id": 1279,
      "title": "enCore Energy Increases Uranium Extraction at Alta Mesa ISR Uranium Central Processing Plant; Appoints Director and Site Management",
      "link": "https://contentapi.cision.com/api/v1.0/releases/20250407VA58762",
      "date": "2025-04-07T11:00:00.000Z",
      "hidden": false
    },
    {
      "id": -188811,
      "company_id": 1279,
      "title": "enCore Energy Education Society and Texas A&amp;M University-Kingsville Establish the Dr. Dennis Stover Fellowship; Investing in the Next Generation",
      "link": "https://contentapi.cision.com/api/v1.0/releases/20250403C7692",
      "date": "2025-04-03T11:00:00.000Z",
      "hidden": false
    },
    {
      "id": 91668,
      "company_id": 1279,
      "title": "enCore Energy Enters Definitive Agreement for Sale of New Mexico Assets; Plans to Distribute Consideration Shares to enCore Shareholders",
      "link": "https://contentapi.cision.com/api/v1.0/releases/20250318C1074",
      "date": "2025-03-18T11:00:00.000Z",
      "hidden": false
    },
    {
      "id": 90976,
      "company_id": 1279,
      "title": "enCore Energy Expands Uranium Extraction Capacity at Alta Mesa; Accelerated Wellfield Development Underway",
      "link": "https://contentapi.cision.com/api/v1.0/releases/20250313VA40438",
      "date": "2025-03-13T11:00:00.000Z",
      "hidden": false
    },
    {
      "id": 90197,
      "company_id": 1279,
      "title": "enCore Energy Corp. Provides Initial Corporate Update",
      "link": "https://contentapi.cision.com/api/v1.0/releases/20250306VA34993",
      "date": "2025-03-06T12:00:00.000Z",
      "hidden": false
    }
  ]
}