{
  "article": {
    "id": 39178,
    "link": "https://thunderbirdminerals.ca/thunderbird-minerals-corp-options-the-apache-copper-gold-property-in-kern-county-ca-usa/",
    "title": "Thunderbird Minerals Corp. Options the Apache Copper-Gold Property in Kern County, CA, USA",
    "description": "<p>Vancouver, <strong>August 8<sup>th</sup>, 2023 – Thunderbird Minerals Corp. (TSXV: BIRD) </strong>(“Thunderbird” or the “Company”) is pleased to announce that the Company has signed a mineral lease and&nbsp; option agreement dated July 24, 2023 with Bull Mountain Resources, LLC (“BMR”), for the Apache property, California (the “Apache Project”), whereby Thunderbird has been granted the exploration and development rights for the Apache Project for a minimum of 50 years as long as preproduction payments are maintained and then for an indefinite period of time thereafter as long as mining operations are continued.&nbsp;</p>\n\n\n\n<p>California ranks as one of the premier gold districts, with historic production of approximately 140 million ounces of gold from lode and placer sources (Knopf 1929; Clark 1992, Bohlke 1999, Walker 2001). The Apache Project is located in the mineral-rich Mojave Desert region of Southern California (Figure 1). The southern California desert is host to multiple active mines, including: Equinox Gold’s Castle Mountain and Mesquite mines, Rio Tinto’s Boron Mine complex, and Golden Queen Mining’s Soledad Mountain Project. In addition, Apollo Gold and Silver owns the Calico silver-barite project, which hosts one of the largest undeveloped silver deposits in the western US (Figure 2). Kern County, where the Apache Project is located, has a long history of supporting responsible resource development.</p>\n\n\n\n<p>The Apache Project consists of 152 unpatented lode mining claims (approximately 1,200 hectares) surrounded by numerous historic and active small placer gold mining pits and digs. The Apache property shows no evidence of historic drilling and overlies only a few hardrock prospect pits, shafts, and tunnels. Mineralization within the Apache property is primarily hosted in Paleozoic calcareous sediments and meta-sediments within a structural corridor that has strong similarities to other districts in the Sierra Foothills Metamorphic (California) and Walker Lane (Nevada) mineral belts.</p>\n\n\n\n<p>The claims overlay a 3.0 km x 1.2 km alteration footprint with significant quartz-sericite-pyrite (QSP), silicification and argillization of the meta-sediments and intrusive host rocks. Rock chip sampling revealed widespread gold (Au) and copper (Cu) anomalies with grades up to 7.46 g/t Au and 4.34% Cu (see Figure 3, 4 and 5). Sulfide minerals, however, have typically been leached from surface exposures. This target is interpreted to be the high-level exposure of an extensive Cu-Au porphyry system further defined by geophysical magnetic and electro-magnetic (EM) anomalies consistent with porphyry systems. Additionally, there are several outlying target zones also marked by magnetic, gravity and EM anomalies with similar characteristics to other oxide-gold and Cu-Au porphyry systems in the region.</p>\n\n\n\n<p><em>John Newell, President and CEO of Thunderbird, states: &nbsp;</em></p>\n\n\n\n<p class=\"is-style-default has-tertiary-color has-text-color\"><em>The management of Thunderbird Minerals is thrilled to have the opportunity to advance the year-round Apache Project in Kern County, California. “The Apache Project was discovered by Mr. Perry Durning and Mr. Bud Hillemeyer, the principals of BMR, both having a wealth of experience in mineral exploration. They are excellent grassroots explorationists renowned for mineral discoveries, and mine and project development. The geological team at Thunderbird looks forward to the prospect of adding another potential deposit to the pair’s impressive list of discoveries.”</em></p>\n\n\n\n<p><strong><u>About Bull Mountain Resources</u></strong></p>\n\n\n\n<p>Bull Mountain Resources, whose principals are Perry Durning, Frank (Bud) Hillemeyer, and Nick Hillemeyer, was formed in 2020. Durning and Hillemeyer, who originally operated under La Cuesta International, Inc. (LCI), received the PDAC Thayer Lindsley International Mineral Discoveries Award in 2010 jointly, in recognition of their outstanding record of grassroots discoveries in&nbsp;Mexico. The coveted Thayer Lindsley International Mineral Discoveries Award is presented annually by the PDAC in memory of Thayer Lindsley, one of the Canada’s greatest mine-finders. Additionally, Perry Durning and Frank Hillemeyer discovered the Los Gatos silver-base-metal deposit after receiving the&nbsp;Thayer Lindsley&nbsp;Award. In total, Durning and Hillemeyer have discovered over 820 million ounces of silver, 14.3 million ounces of gold and nearly 9 billion pounds of copper, lead, and zinc (Total past production and all resource categories for deposits attributed to their discoveries).&nbsp;</p>\n\n\n\n<p><strong><u>Apache Project Highlights</u></strong></p>\n\n\n\n<ul>\n<li>The Apache Project is located at the intersection of major northwest and northeast trending fault systems that have likely concentrated magmatic activity in the area. These structures typically act as conduits for mineralized fluids. The property has strong potential to host economic low- and high-sulphidation gold systems and Cu-Au porphyry systems.</li>\n\n\n\n<li>Two targets have been delineated on the property to date. The Apache target is a high-level porphyry target with multiple intrusive stocks with a strong gold-copper association. The Garlock target is an exposed porphyry copper stock with significant skarn alteration within host meta-sedimentary rocks. Over 500 rock chip samples have been collected on the property to help define specific target areas.</li>\n\n\n\n<li>Anomalous gold and copper assays in the Apache target vicinity occur within a 3.0 x 1.2 km area with grades up to 7.46 g/t Au and 4.63% Cu (Figure 3).&nbsp;</li>\n\n\n\n<li>Anomalous gold and copper assays in the Garlock target area extend over a 1.2 x 0.75 km area with grades up to 4.63 g/t Au and 7.82% Cu (Figures 6 and 7).</li>\n\n\n\n<li>Multiple drainages were tested by stream silt sampling. Of 45 drainages sampled, 28 returned values of 20 ppb Au or higher, and 8 returned values greater than 100 ppb Au with a high of 1,085 ppb Au (1.085 g/t Au). Not all anomalies have been followed-up by ground-based exploration.</li>\n\n\n\n<li>No verified historical drilling has been recorded; therefore, geochemical and geophysical anomalies remain untested.</li>\n</ul>\n\n\n\n<p><strong><u>Transaction Details</u></strong></p>\n\n\n\n<p>Under the terms of the mineral lease and option agreement, Thunderbird has the rights&nbsp; to&nbsp; the Apache Project for exploration and mining for a minimum of 50 years provided it continues to make the following preproduction payments:</p>\n\n\n\n<ul>\n<li>US$28,000 upon signing of the agreement (the “Effective Date”).</li>\n\n\n\n<li>US$10,000 6-months after the Effective Date;</li>\n\n\n\n<li>US$10,000 12-months after the Effective Date;&nbsp;</li>\n\n\n\n<li>US$15,000 18-months after the Effective Date;</li>\n\n\n\n<li>US$15,000 24-months after the Effective Date;</li>\n\n\n\n<li>US$20,000 30-months after the Effective Date and every 6 months thereafter.&nbsp;</li>\n</ul>\n\n\n\n<p>Thunderbird is also obligated to fulfill the following minimum work commitments (comprised of exploration, development or mining expenditures) on the Apache Project as follows:</p>\n\n\n\n<ul>\n<li>$50,000 in Year 1;</li>\n\n\n\n<li>$50,000 in Year 2;</li>\n\n\n\n<li>$50,000 in Year 3;</li>\n\n\n\n<li>$100,000 in Year 4 and every year thereafter.</li>\n</ul>\n\n\n\n<p>On achievement of production on the Apache Project, a production royalty of 2% of net smelter returns is payable on claims owned by BMR and newly located claims by Thunderbird within the area of interest. Also, 0.5% of net smelter returns is payable on third party claims and claims acquired from third parties within the area of influence, provided that a minimum production royalty of&nbsp;US$20,000&nbsp;is payable quarterly.&nbsp; On payment to BMR of&nbsp;US$10,000,000&nbsp;in any combination of pre-production payments, production royalties and minimum royalties, the production royalty on claims owned by BMR reduces to 1%, and on third-party claims and claims acquired from third parties within the area of influence, the royalty reduces to 0.25%.</p>\n\n\n\n<figure class=\"wp-block-image aligncenter size-large is-resized\"><img decoding=\"async\" src=\"https://wp-thunderbirdminerals-2023.s3.ca-central-1.amazonaws.com/media/2023/08/08173236/2023-08-08-bird-nrm1-914x1024.jpg\" alt=\"Figure 1\" class=\"wp-image-695\" width=\"914\" height=\"1024\" srcset=\"https://wp-thunderbirdminerals-2023.s3.ca-central-1.amazonaws.com/media/2023/08/08173236/2023-08-08-bird-nrm1-914x1024.jpg 914w, https://wp-thunderbirdminerals-2023.s3.ca-central-1.amazonaws.com/media/2023/08/08173236/2023-08-08-bird-nrm1-268x300.jpg 268w, https://wp-thunderbirdminerals-2023.s3.ca-central-1.amazonaws.com/media/2023/08/08173236/2023-08-08-bird-nrm1-768x860.jpg 768w, https://wp-thunderbirdminerals-2023.s3.ca-central-1.amazonaws.com/media/2023/08/08173236/2023-08-08-bird-nrm1.jpg 1009w\" sizes=\"(max-width: 914px) 100vw, 914px\" /><figcaption class=\"wp-element-caption\">Figure 1: Location of the Apache Project with regard to regional geology. Sierra Nevada Metamorphic Belt rocks, which underlie the project area, were intruded by the younger Sierra Nevada Batholith. Figure is modified after Irwin, 1999.</figcaption></figure>\n\n\n\n<figure class=\"wp-block-image aligncenter size-large\"><img decoding=\"async\" loading=\"lazy\" width=\"1024\" height=\"791\" src=\"https://wp-thunderbirdminerals-2023.s3.ca-central-1.amazonaws.com/media/2023/08/08173307/2023-08-08-bird-nrm2-1024x791.jpg\" alt=\"Figure 2\" class=\"wp-image-707\" srcset=\"https://wp-thunderbirdminerals-2023.s3.ca-central-1.amazonaws.com/media/2023/08/08173307/2023-08-08-bird-nrm2-1024x791.jpg 1024w, https://wp-thunderbirdminerals-2023.s3.ca-central-1.amazonaws.com/media/2023/08/08173307/2023-08-08-bird-nrm2-300x232.jpg 300w, https://wp-thunderbirdminerals-2023.s3.ca-central-1.amazonaws.com/media/2023/08/08173307/2023-08-08-bird-nrm2-768x593.jpg 768w, https://wp-thunderbirdminerals-2023.s3.ca-central-1.amazonaws.com/media/2023/08/08173307/2023-08-08-bird-nrm2.jpg 1451w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><figcaption class=\"wp-element-caption\">Figure 2: The Apache Project location is within the mineral-rich Mojave Desert region of Southern California.</figcaption></figure>\n\n\n\n<figure class=\"wp-block-image aligncenter size-large\"><img decoding=\"async\" loading=\"lazy\" width=\"1024\" height=\"661\" src=\"https://wp-thunderbirdminerals-2023.s3.ca-central-1.amazonaws.com/media/2023/08/08173302/2023-08-08-bird-nrm3-1024x661.jpg\" alt=\"Figure 3\" class=\"wp-image-705\" srcset=\"https://wp-thunderbirdminerals-2023.s3.ca-central-1.amazonaws.com/media/2023/08/08173302/2023-08-08-bird-nrm3-1024x661.jpg 1024w, https://wp-thunderbirdminerals-2023.s3.ca-central-1.amazonaws.com/media/2023/08/08173302/2023-08-08-bird-nrm3-300x194.jpg 300w, https://wp-thunderbirdminerals-2023.s3.ca-central-1.amazonaws.com/media/2023/08/08173302/2023-08-08-bird-nrm3-768x495.jpg 768w, https://wp-thunderbirdminerals-2023.s3.ca-central-1.amazonaws.com/media/2023/08/08173302/2023-08-08-bird-nrm3-1536x991.jpg 1536w, https://wp-thunderbirdminerals-2023.s3.ca-central-1.amazonaws.com/media/2023/08/08173302/2023-08-08-bird-nrm3.jpg 1744w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><figcaption class=\"wp-element-caption\">Figure 3: Several exposure levels of the porphyry system are interpreted across the ~3 km trend of alteration and mineralization at the Apache Target.</figcaption></figure>\n\n\n\n<figure class=\"wp-block-image aligncenter size-large\"><img decoding=\"async\" loading=\"lazy\" width=\"1024\" height=\"575\" src=\"https://wp-thunderbirdminerals-2023.s3.ca-central-1.amazonaws.com/media/2023/08/08173257/2023-08-08-bird-nrm4-1024x575.jpg\" alt=\"Figure 4\" class=\"wp-image-703\" srcset=\"https://wp-thunderbirdminerals-2023.s3.ca-central-1.amazonaws.com/media/2023/08/08173257/2023-08-08-bird-nrm4-1024x575.jpg 1024w, https://wp-thunderbirdminerals-2023.s3.ca-central-1.amazonaws.com/media/2023/08/08173257/2023-08-08-bird-nrm4-300x169.jpg 300w, https://wp-thunderbirdminerals-2023.s3.ca-central-1.amazonaws.com/media/2023/08/08173257/2023-08-08-bird-nrm4-768x431.jpg 768w, https://wp-thunderbirdminerals-2023.s3.ca-central-1.amazonaws.com/media/2023/08/08173257/2023-08-08-bird-nrm4-1536x863.jpg 1536w, https://wp-thunderbirdminerals-2023.s3.ca-central-1.amazonaws.com/media/2023/08/08173257/2023-08-08-bird-nrm4.jpg 1586w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><figcaption class=\"wp-element-caption\">Figure 4: Photo of the NW zone of elevated Cu-Au values in close proximity to mapped altered dikes.</figcaption></figure>\n\n\n\n<figure class=\"wp-block-image aligncenter size-large\"><img decoding=\"async\" loading=\"lazy\" width=\"1024\" height=\"576\" src=\"https://wp-thunderbirdminerals-2023.s3.ca-central-1.amazonaws.com/media/2023/08/08173252/2023-08-08-bird-nrm5-1024x576.jpg\" alt=\"Figure 5\" class=\"wp-image-701\" srcset=\"https://wp-thunderbirdminerals-2023.s3.ca-central-1.amazonaws.com/media/2023/08/08173252/2023-08-08-bird-nrm5-1024x576.jpg 1024w, https://wp-thunderbirdminerals-2023.s3.ca-central-1.amazonaws.com/media/2023/08/08173252/2023-08-08-bird-nrm5-300x169.jpg 300w, https://wp-thunderbirdminerals-2023.s3.ca-central-1.amazonaws.com/media/2023/08/08173252/2023-08-08-bird-nrm5-768x432.jpg 768w, https://wp-thunderbirdminerals-2023.s3.ca-central-1.amazonaws.com/media/2023/08/08173252/2023-08-08-bird-nrm5-1536x864.jpg 1536w, https://wp-thunderbirdminerals-2023.s3.ca-central-1.amazonaws.com/media/2023/08/08173252/2023-08-08-bird-nrm5.jpg 1968w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><figcaption class=\"wp-element-caption\">Figure 5: Photo of the southeast zone of elevated Au values that are potentially outlining a higher-level exposure of a porphyry system.</figcaption></figure>\n\n\n\n<figure class=\"wp-block-image aligncenter size-large\"><img decoding=\"async\" loading=\"lazy\" width=\"1024\" height=\"661\" src=\"https://wp-thunderbirdminerals-2023.s3.ca-central-1.amazonaws.com/media/2023/08/08173246/2023-08-08-bird-nrm6-1024x661.jpg\" alt=\"Figure 6\" class=\"wp-image-699\" srcset=\"https://wp-thunderbirdminerals-2023.s3.ca-central-1.amazonaws.com/media/2023/08/08173246/2023-08-08-bird-nrm6-1024x661.jpg 1024w, https://wp-thunderbirdminerals-2023.s3.ca-central-1.amazonaws.com/media/2023/08/08173246/2023-08-08-bird-nrm6-300x194.jpg 300w, https://wp-thunderbirdminerals-2023.s3.ca-central-1.amazonaws.com/media/2023/08/08173246/2023-08-08-bird-nrm6-768x495.jpg 768w, https://wp-thunderbirdminerals-2023.s3.ca-central-1.amazonaws.com/media/2023/08/08173246/2023-08-08-bird-nrm6-1536x991.jpg 1536w, https://wp-thunderbirdminerals-2023.s3.ca-central-1.amazonaws.com/media/2023/08/08173246/2023-08-08-bird-nrm6.jpg 1744w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><figcaption class=\"wp-element-caption\">Figure 6: The Garlock target overlies a USGS mapped granodiorite porphyry that is closely associated with significant copper and gold mineralization.</figcaption></figure>\n\n\n\n<figure class=\"wp-block-image aligncenter size-large\"><img decoding=\"async\" loading=\"lazy\" width=\"1024\" height=\"556\" src=\"https://wp-thunderbirdminerals-2023.s3.ca-central-1.amazonaws.com/media/2023/08/08173241/2023-08-08-bird-nrm7-1024x556.jpg\" alt=\"Figure 7\" class=\"wp-image-697\" srcset=\"https://wp-thunderbirdminerals-2023.s3.ca-central-1.amazonaws.com/media/2023/08/08173241/2023-08-08-bird-nrm7-1024x556.jpg 1024w, https://wp-thunderbirdminerals-2023.s3.ca-central-1.amazonaws.com/media/2023/08/08173241/2023-08-08-bird-nrm7-300x163.jpg 300w, https://wp-thunderbirdminerals-2023.s3.ca-central-1.amazonaws.com/media/2023/08/08173241/2023-08-08-bird-nrm7-768x417.jpg 768w, https://wp-thunderbirdminerals-2023.s3.ca-central-1.amazonaws.com/media/2023/08/08173241/2023-08-08-bird-nrm7-1536x835.jpg 1536w, https://wp-thunderbirdminerals-2023.s3.ca-central-1.amazonaws.com/media/2023/08/08173241/2023-08-08-bird-nrm7.jpg 1982w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><figcaption class=\"wp-element-caption\">Figure 7: Rock sample examples from the Garlock Target. Note: unidirectional solidification textures (UST).</figcaption></figure>\n\n\n\n<p><strong><u>About Thunderbird Minerals Corp.</u></strong></p>\n\n\n\n<p>Thunderbird is a junior grassroots explorer focused on the discovery of new precious metal and copper projects through systematic exploration of metal-endowed terranes located in Tier-one mining jurisdictions in North America. Thunderbird’s focus is on development of its portfolio of projects to the mineral resource stage. Thunderbird’s projects include its flagship Bullseye property in the Wels District of the Yukon Territory. Thunderbird’s other properties include the Eagle Mountain gold property in the Cassiar Gold District in northern British Columbia, the Argo copper and gold property near Quesnel B.C., and the Apache copper and gold property in Kern County, California. Thunderbird continues to look for attractive properties throughout North America to add to its early-stage project pipeline.</p>\n\n\n\n<p>More information can be found at the Company’s website at <a href=\"http://www.thunderbirdminerals.ca\">www.thunderbirdminerals.ca</a></p>\n\n\n\n<p><strong>ON BEHALF OF THE BOARD</strong></p>\n\n\n\n<p>John Newell, President and Chief Executive Officer</p>\n\n\n\n<p>Carl Schulze, P. Geo., Consulting Geologist with Aurora Geosciences Ltd, is a qualified person as defined by National Instrument 43-101 for Thunderbird’s exploration projects and has reviewed and approved the technical information in this release.</p>\n\n\n\n<p>For new information about the Company&#8217;s programs, please visit Thunderbird&#8217;s website at <a href=\"http://www.thunderbirdminerals.ca\">www.thunderbirdminerals.ca</a> or contact John Newell by telephone (604) 568-8807 or by email at <a href=\"mailto:info@thunderbirdminerals.ca\">info@thunderbirdminerals.ca</a>&nbsp; or <a href=\"mailto:john.newell@thunderbirdminerals.c\">john.newell@thunderbirdminerals.c</a>a.</p>\n\n\n\n<p>Neither the TSX Venture Exchange nor its Regulation Services Provider (as that term is defined in the policies of the TSX Venture Exchange) accepts responsibility for the adequacy or accuracy of this release.&nbsp;</p>\n\n\n\n<p><strong>Cautionary Statement Regarding Forward-Looking Information</strong></p>\n\n\n\n<p>Certain information contained in this news release constitutes “forward-looking information” or “forward-looking statements” (collectively, “forward-looking information”). Without limiting the foregoing, such forward-looking information includes statements regarding the process and completion of the Offering, the use of proceeds of the Offering and any statements regarding the Company’s business plans, expectations and objectives. In this news release, words such as “may”, “would”, “could”, “will”, “likely”, “believe”, “expect”, “anticipate”, “intend”, “plan”, “estimate” and similar words and the negative form thereof are used to identify forward-looking information. Forward-looking information should not be read as guarantees of future performance or results, and will not necessarily be accurate indications of whether, or the times at or by which, such future performance will be achieved. Forward-looking information is based on information available at the time and/or the Company management’s good faith belief with respect to future events and is subject to known or unknown risks, uncertainties, assumptions and other unpredictable factors, many of which are beyond the Company’s control. The forward-looking information set forth herein reflects the Company’s expectations as at the date of this news release and is subject to change after such date. The Company disclaims any intention or obligation to update or revise any forward-looking information, whether as a result of new information, future events or otherwise, other than as required by law.</p>\n\n\t",
    "search_terms": "Apache,Thunderbird Minerals Corp.,BIRD",
    "master_gid": 5237,
    "date": "2023-08-10T02:29:00.000Z",
    "tags": "||||Project Acquisition",
    "image_id": null,
    "hidden": false,
    "company_id": 2586,
    "provider": null,
    "excerpt": "Vancouver,August 8th, 2023 – Thunderbird Minerals Corp. (TSXV: BIRD)(“Thunderbird” or the “Company”) is pleased to announce that the Company has signed a mineral lease and&nbsp; option agreement dated July 24, 2023 with Bull Mountain Resources, LLC (“BMR”), for the Apache property, California (the “Apache Project”), whereby Thunderbird has been granted",
    "is_regulatory": false,
    "refined_tags": [
      "Project Acquisition"
    ],
    "ftp_filename": null,
    "company_name": "Bull Mountain Resources, LLC",
    "exchange": "TSXV",
    "root_ticker": "BIRD",
    "project_name": "Apache",
    "gid": 5237,
    "location": "California, United States",
    "plan_id": "companytier2",
    "description_text": "Vancouver, August 8 th , 2023 – Thunderbird Minerals Corp. (TSXV: BIRD) (“Thunderbird” or the “Company”) is pleased to announce that the Company has signed a mineral lease and  option agreement dated July 24, 2023 with Bull Mountain Resources, LLC (“BMR”), for the Apache property, California (the “Apache Project”), whereby Thunderbird has been granted the exploration and development rights for the Apache Project for a minimum of 50 years as long as preproduction payments are maintained and then for an indefinite period of time thereafter as long as mining operations are continued. California ranks as one of the premier gold districts, with historic production of approximately 140 million ounces of gold from lode and placer sources (Knopf 1929; Clark 1992, Bohlke 1999, Walker 2001). The Apache Project is located in the mineral-rich Mojave Desert region of Southern California (Figure 1). The southern California desert is host to multiple active mines, including: Equinox Gold’s Castle Mountain and Mesquite mines, Rio Tinto’s Boron Mine complex, and Golden Queen Mining’s Soledad Mountain Project. In addition, Apollo Gold and Silver owns the Calico silver-barite project, which hosts one of the largest undeveloped silver deposits in the western US (Figure 2). Kern County, where the Apache Project is located, has a long history of supporting responsible resource development. The Apache Project consists of 152 unpatented lode mining claims (approximately 1,200 hectares) surrounded by numerous historic and active small placer gold mining pits and digs. The Apache property shows no evidence of historic drilling and overlies only a few hardrock prospect pits, shafts, and tunnels. Mineralization within the Apache property is primarily hosted in Paleozoic calcareous sediments and meta-sediments within a structural corridor that has strong similarities to other districts in the Sierra Foothills Metamorphic (California) and Walker Lane (Nevada) mineral belts. The claims overlay a 3.0 km x 1.2 km alteration footprint with significant quartz-sericite-pyrite (QSP), silicification and argillization of the meta-sediments and intrusive host rocks. Rock chip sampling revealed widespread gold (Au) and copper (Cu) anomalies with grades up to 7.46 g/t Au and 4.34% Cu (see Figure 3, 4 and 5). Sulfide minerals, however, have typically been leached from surface exposures. This target is interpreted to be the high-level exposure of an extensive Cu-Au porphyry system further defined by geophysical magnetic and electro-magnetic (EM) anomalies consistent with porphyry systems. Additionally, there are several outlying target zones also marked by magnetic, gravity and EM anomalies with similar characteristics to other oxide-gold and Cu-Au porphyry systems in the region. John Newell, President and CEO of Thunderbird, states: The management of Thunderbird Minerals is thrilled to have the opportunity to advance the year-round Apache Project in Kern County, California. “The Apache Project was discovered by Mr. Perry Durning and Mr. Bud Hillemeyer, the principals of BMR, both having a wealth of experience in mineral exploration. They are excellent grassroots explorationists renowned for mineral discoveries, and mine and project development. The geological team at Thunderbird looks forward to the prospect of adding another potential deposit to the pair’s impressive list of discoveries.” About Bull Mountain Resources Bull Mountain Resources, whose principals are Perry Durning, Frank (Bud) Hillemeyer, and Nick Hillemeyer, was formed in 2020. Durning and Hillemeyer, who originally operated under La Cuesta International, Inc. (LCI), received the PDAC Thayer Lindsley International Mineral Discoveries Award in 2010 jointly, in recognition of their outstanding record of grassroots discoveries in Mexico. The coveted Thayer Lindsley International Mineral Discoveries Award is presented annually by the PDAC in memory of Thayer Lindsley, one of the Canada’s greatest mine-finders. Additionally, Perry Durning and Frank Hillemeyer discovered the Los Gatos silver-base-metal deposit after receiving the Thayer Lindsley Award. In total, Durning and Hillemeyer have discovered over 820 million ounces of silver, 14.3 million ounces of gold and nearly 9 billion pounds of copper, lead, and zinc (Total past production and all resource categories for deposits attributed to their discoveries). Apache Project Highlights The Apache Project is located at the intersection of major northwest and northeast trending fault systems that have likely concentrated magmatic activity in the area. These structures typically act as conduits for mineralized fluids. The property has strong potential to host economic low- and high-sulphidation gold systems and Cu-Au porphyry systems. Two targets have been delineated on the property to date. The Apache target is a high-level porphyry target with multiple intrusive stocks with a strong gold-copper association. The Garlock target is an exposed porphyry copper stock with significant skarn alteration within host meta-sedimentary rocks. Over 500 rock chip samples have been collected on the property to help define specific target areas. Anomalous gold and copper assays in the Apache target vicinity occur within a 3.0 x 1.2 km area with grades up to 7.46 g/t Au and 4.63% Cu (Figure 3). Anomalous gold and copper assays in the Garlock target area extend over a 1.2 x 0.75 km area with grades up to 4.63 g/t Au and 7.82% Cu (Figures 6 and 7). Multiple drainages were tested by stream silt sampling. Of 45 drainages sampled, 28 returned values of 20 ppb Au or higher, and 8 returned values greater than 100 ppb Au with a high of 1,085 ppb Au (1.085 g/t Au). Not all anomalies have been followed-up by ground-based exploration. No verified historical drilling has been recorded; therefore, geochemical and geophysical anomalies remain untested. Transaction Details Under the terms of the mineral lease and option agreement, Thunderbird has the rights  to  the Apache Project for exploration and mining for a minimum of 50 years provided it continues to make the following preproduction payments: US$28,000 upon signing of the agreement (the “Effective Date”). US$10,000 6-months after the Effective Date; US$10,000 12-months after the Effective Date; US$15,000 18-months after the Effective Date; US$15,000 24-months after the Effective Date; US$20,000 30-months after the Effective Date and every 6 months thereafter. Thunderbird is also obligated to fulfill the following minimum work commitments (comprised of exploration, development or mining expenditures) on the Apache Project as follows: $50,000 in Year 1; $50,000 in Year 2; $50,000 in Year 3; $100,000 in Year 4 and every year thereafter. On achievement of production on the Apache Project, a production royalty of 2% of net smelter returns is payable on claims owned by BMR and newly located claims by Thunderbird within the area of interest. Also, 0.5% of net smelter returns is payable on third party claims and claims acquired from third parties within the area of influence, provided that a minimum production royalty of US$20,000 is payable quarterly.  On payment to BMR of US$10,000,000 in any combination of pre-production payments, production royalties and minimum royalties, the production royalty on claims owned by BMR reduces to 1%, and on third-party claims and claims acquired from third parties within the area of influence, the royalty reduces to 0.25%. Figure 1: Location of the Apache Project with regard to regional geology. Sierra Nevada Metamorphic Belt rocks, which underlie the project area, were intruded by the younger Sierra Nevada Batholith. Figure is modified after Irwin, 1999. Figure 2: The Apache Project location is within the mineral-rich Mojave Desert region of Southern California. Figure 3: Several exposure levels of the porphyry system are interpreted across the ~3 km trend of alteration and mineralization at the Apache Target. Figure 4: Photo of the NW zone of elevated Cu-Au values in close proximity to mapped altered dikes. Figure 5: Photo of the southeast zone of elevated Au values that are potentially outlining a higher-level exposure of a porphyry system. Figure 6: The Garlock target overlies a USGS mapped granodiorite porphyry that is closely associated with significant copper and gold mineralization. Figure 7: Rock sample examples from the Garlock Target. Note: unidirectional solidification textures (UST). About Thunderbird Minerals Corp. Thunderbird is a junior grassroots explorer focused on the discovery of new precious metal and copper projects through systematic exploration of metal-endowed terranes located in Tier-one mining jurisdictions in North America. Thunderbird’s focus is on development of its portfolio of projects to the mineral resource stage. Thunderbird’s projects include its flagship Bullseye property in the Wels District of the Yukon Territory. Thunderbird’s other properties include the Eagle Mountain gold property in the Cassiar Gold District in northern British Columbia, the Argo copper and gold property near Quesnel B.C., and the Apache copper and gold property in Kern County, California. Thunderbird continues to look for attractive properties throughout North America to add to its early-stage project pipeline. More information can be found at the Company’s website at www.thunderbirdminerals.ca ON BEHALF OF THE BOARD John Newell, President and Chief Executive Officer Carl Schulze, P. Geo., Consulting Geologist with Aurora Geosciences Ltd, is a qualified person as defined by National Instrument 43-101 for Thunderbird’s exploration projects and has reviewed and approved the technical information in this release. For new information about the Company’s programs, please visit Thunderbird’s website at www.thunderbirdminerals.ca or contact John Newell by telephone (604) 568-8807 or by email at info@thunderbirdminerals.ca or john.newell@thunderbirdminerals.c a. Neither the TSX Venture Exchange nor its Regulation Services Provider (as that term is defined in the policies of the TSX Venture Exchange) accepts responsibility for the adequacy or accuracy of this release. Cautionary Statement Regarding Forward-Looking Information Certain information contained in this news release constitutes “forward-looking information” or “forward-looking statements” (collectively, “forward-looking information”). Without limiting the foregoing, such forward-looking information includes statements regarding the process and completion of the Offering, the use of proceeds of the Offering and any statements regarding the Company’s business plans, expectations and objectives. In this news release, words such as “may”, “would”, “could”, “will”, “likely”, “believe”, “expect”, “anticipate”, “intend”, “plan”, “estimate” and similar words and the negative form thereof are used to identify forward-looking information. Forward-looking information should not be read as guarantees of future performance or results, and will not necessarily be accurate indications of whether, or the times at or by which, such future performance will be achieved. Forward-looking information is based on information available at the time and/or the Company management’s good faith belief with respect to future events and is subject to known or unknown risks, uncertainties, assumptions and other unpredictable factors, many of which are beyond the Company’s control. The forward-looking information set forth herein reflects the Company’s expectations as at the date of this news release and is subject to change after such date. The Company disclaims any intention or obligation to update or revise any forward-looking information, whether as a result of new information, future events or otherwise, other than as required by law.",
    "primary_commodity": "Au"
  },
  "articleProject": {
    "gid": 5237,
    "project_name": "Apache",
    "location": "California, United States"
  },
  "articleExchange": "TSXV",
  "articleCompanyId": 2586,
  "articleTicker": "BIRD",
  "articleCompanyName": "Thunderbird Minerals Corp.",
  "allOtherCompanyProjects": [
    {
      "company_id": 2586,
      "gid": 5237,
      "project_name": "Apache",
      "location": "California, United States"
    },
    {
      "company_id": 2586,
      "gid": 740,
      "project_name": "Bullseye",
      "location": "Yukon, Canada"
    },
    {
      "company_id": 2586,
      "gid": 719,
      "project_name": "Argo ",
      "location": "British Columbia, Canada"
    }
  ],
  "allOtherCompanyNews": [
    {
      "id": 107956,
      "company_id": 2586,
      "title": "Thunderbird Minerals Appoints Executive Chairman and Director",
      "link": "https://app.quotemedia.com/data/downloadFiling?webmasterId=104408&ref=684b15fdcd671077f625b561&type=PDFC&formType=002-002-001089-003001&formDescription=News+release&dateFiled=2025-06-12",
      "date": "2025-06-12T18:01:33.000Z",
      "hidden": false
    },
    {
      "id": 104994,
      "company_id": 2586,
      "title": "Thunderbird Minerals Appoints New Director",
      "link": "https://app.quotemedia.com/data/downloadFiling?webmasterId=104408&ref=6827c44f07412a0c1a463614&type=PDFC&formType=002-002-001089-003001&formDescription=News+release&dateFiled=2025-05-16",
      "date": "2025-05-16T23:03:43.000Z",
      "hidden": false
    },
    {
      "id": -198440,
      "company_id": 2586,
      "title": "Thunderbird Minerals Corp. Announces Director Changes",
      "link": "https://app.quotemedia.com/data/downloadFiling?webmasterId=104408&ref=67edd485cf7ba75e466d46b1&type=PDFC&formType=002-002-001089-003001&formDescription=News+release&dateFiled=2025-04-02",
      "date": "2025-04-02T17:21:25.000Z",
      "hidden": false
    },
    {
      "id": 97869,
      "company_id": 2586,
      "title": "Thunderbird Minerals Amends Share Purchase Warrants",
      "link": "https://app.quotemedia.com/data/downloadFiling?webmasterId=104408&ref=67474e41b6b751527e4985e8&type=PDFC&formType=002-002-001089-003001&formDescription=News+release&dateFiled=2024-11-27",
      "date": "2024-11-27T16:52:17.000Z",
      "hidden": false
    },
    {
      "id": 97870,
      "company_id": 2586,
      "title": "Thunderbird Minerals Corp. Grants Incentive Stock Options",
      "link": "https://app.quotemedia.com/data/downloadFiling?webmasterId=104408&ref=67362122f20b2340343d1761&type=PDFC&formType=002-002-001089-003001&formDescription=News+release&dateFiled=2024-11-14",
      "date": "2024-11-14T16:11:14.000Z",
      "hidden": false
    },
    {
      "id": 78473,
      "company_id": 2586,
      "title": "Thunderbird Minerals Corp. Expands the Argo Copper-Gold Project",
      "link": "https://www.globenewswire.com/news-release/2024/11/12/2979111/0/en/Thunderbird-Minerals-Corp-Expands-the-Argo-Copper-Gold-Project.html",
      "date": "2024-11-12T13:00:00.000Z",
      "hidden": false
    },
    {
      "id": 97868,
      "company_id": 2586,
      "title": "Thunderbird Minerals Amends Agreement for Apache Property",
      "link": "https://app.quotemedia.com/data/downloadFiling?webmasterId=104408&ref=66a25e5b7db6005b6a09fee4&type=PDFC&formType=002-002-001089-003001&formDescription=News+release&dateFiled=2024-07-25",
      "date": "2024-07-25T14:16:59.000Z",
      "hidden": false
    },
    {
      "id": 63111,
      "company_id": 2586,
      "title": "Thunderbird Minerals Files NI 43-101 Technical Report for Eagle Mountain Property, Cassiar Gold District, British Columbia",
      "link": "https://thunderbirdminerals.ca/thunderbird-minerals-files-ni-43-101-technical-report-for-eagle-mountain-property-cassiar-gold-district-british-columbia/",
      "date": "2023-12-07T18:34:00.000Z",
      "hidden": false
    },
    {
      "id": -109372,
      "company_id": 2586,
      "title": "Thunderbird Minerals Corp. Grants Charitable Stock Options to The Singh Foundation",
      "link": "https://thunderbirdminerals.ca/thunderbird-minerals-corp-grants-charitable-stock-options-to-the-singh-foundation/",
      "date": "2023-08-15T17:32:00.000Z",
      "hidden": false
    },
    {
      "id": -109371,
      "company_id": 2586,
      "title": "Thunderbird Minerals Corp. Grants Incentive Stock Options ",
      "link": "https://thunderbirdminerals.ca/thunderbird-minerals-corp-grants-incentive-stock-options/",
      "date": "2023-08-11T17:30:00.000Z",
      "hidden": false
    }
  ]
}