{
  "article": {
    "id": 82134,
    "link": "https://www.globenewswire.com/news-release/2024/12/16/2997947/0/en/GFG-Closes-Sale-of-its-Rattlesnake-Hills-Gold-Project-with-Patriot-Gold.html",
    "title": "GFG Closes Sale of its Rattlesnake Hills Gold Project with Patriot Gold",
    "description": "<p align=\"justify\">SASKATOON, Saskatchewan, Dec.  16, 2024  (GLOBE NEWSWIRE) -- <strong>GFG Resources Inc. (TSXV: GFG) (OTCQB: GFGSF) </strong>(“<strong>GFG</strong>” or the “<strong>Company</strong>”) announces the closing of the sale (the “<strong>Transaction</strong>”) of its 100% owned Rattlesnake Hills Gold Project (the “<strong>Project</strong>”) to Patriot Gold Vault Ltd., (“<strong>Patriot</strong>”) a wholly owned subsidiary of Axcap Ventures Inc. (“<strong>Axcap</strong>”). Under the terms of the Transaction, Patriot will pay GFG an aggregate consideration of approximately C$3.3 million.</p>  <p align=\"justify\">“We are pleased to finalize the sale of our Rattlesnake Hills Gold Project as part of our strategy and commitment to maximize value for our shareholders”, stated Brian Skanderbeg, President and CEO of GFG. “This transaction not only provides GFG with exposure to future exploration success on the property through equity and milestone payments, but also allows us to benefit from the majority of the compensation being in cash. Coupled with our recent warrant exercise, this deal significantly bolsters our balance sheet, enabling us to continue our aggressive exploration programs in Timmins at both the Aljo and Muskego targets.”</p>  <p align=\"justify\"><strong><u>Transaction Terms</u></strong><br />Patriot has acquired 100% interest in the Project on the following terms:</p>  <ul type=\"disc\"><li style=\"margin-bottom:6pt; text-align:justify;\">Made a cash payment of C$250,000 to GFG on signing of the binding letter of intent (“<strong>LOI</strong>”);</li><li style=\"margin-bottom:6pt; text-align:justify;\">Made a cash payment of C$250,000 to GFG upon the execution and delivery of a definitive agreement;</li><li style=\"margin-bottom:6pt; text-align:justify;\">On closing of the Transaction, Patriot: <ul type=\"circle\"><li style=\"margin-bottom:6pt; text-align:justify;\">Made a cash payment of C$1,200,000 to GFG; and</li><li style=\"margin-bottom:6pt; text-align:justify;\">Issued to GFG 3,061,224 common shares of Axcap (the “<strong>Consideration Shares</strong>”<sup>1</sup>); and</li></ul> </li><li style=\"margin-bottom:6pt; text-align:justify;\">Patriot will pay to GFG an additional cash payment of C$1,000,000 on December 16, 2025.</li></ul>  <p align=\"justify\"><strong><u>Additional Terms</u></strong></p>  <ul type=\"disc\"><li style=\"margin-bottom:6pt; text-align:justify;\">Subsequent to closing, Patriot will assume environmental liability for the Project and take necessary steps to have GFG’s US$219,000 reclamation bond refunded.</li><li style=\"margin-bottom:6pt; text-align:justify;\">If a National Instrument 43-101 resource estimate in the Project reveals a mineral resource of greater than 3,000,000 ounces of gold in a Measured and Indicated or Inferred category, Patriot will pay to GFG a further C$1 per total mineral resource ounce in cash or common shares of Axcap, at the election of Patriot.</li><li style=\"margin-bottom:6pt; text-align:justify;\">Patriot will reimburse GFG for all costs and expenses relating to the Project incurred from the date of the signed LOI to December 16, 2024.<br /></li></ul>  <p align=\"justify\" style=\"padding-left:30px;\"><sup>(</sup><sup>1</sup><sup>)</sup> <em>The Consideration Shares are subject to a statutory hold period of four months and one day in accordance with applicable securities laws. In addition, the Consideration Shares are subject to contractual resale restrictions whereby one-sixth of the Consideration Shares will be released from resale restrictions every three months, starting on the date of issuance and continuing over 15 months thereafter.</em></p>  <p align=\"justify\"><strong><u>About GFG Resources Inc.</u></strong> <br />GFG is a North American precious metals exploration company focused on district scale gold projects in tier one mining jurisdictions. The Company operates three gold projects, each hosting large and highly prospective gold properties within the prolific gold district of Timmins, Ontario, Canada. The projects have similar geological settings that host most of the gold deposits found in the Timmins Gold Camp which have produced over 70 million ounces of gold.</p>  <p><strong><em>For further information, please contact: </em></strong><br />Brian Skanderbeg, President &amp; CEO<br />or <br />Marc Lepage, Vice President, Business Development <br />Phone: (306) 931-0930 <br />Email: <a href=\"https://www.globenewswire.com/Tracker?data=W6KYTnDkBdTNXfaG16m_NFLVvk6tEoq18u6YN6R56sDUTQJ4j0yF1q2C73zTu5Y6Xow11tbROYpItBSjVuP7NN4AsF9nxO0MJNqyRoSVS5o=\" rel=\"nofollow\" target=\"_blank\" title=\"info@gfgresources.com\">info@gfgresources.com</a><br />Website: <a href=\"https://www.globenewswire.com/Tracker?data=3nJVG4oRYe3GmbdrzM0i3iaU5iCLLlHHjml9Cgv6yEyE-T1XpU7SQDE_QkIGMNH1StV8z1rlphZIeYKzj_-goQ7qwCEYNHP1p5y9pg5dWsA=\" rel=\"nofollow\" target=\"_blank\" title=\"www.gfgresources.com\">www.gfgresources.com</a>  </p>  <p><strong>Stay Connected with Us</strong><br />Twitter: <a href=\"https://www.globenewswire.com/Tracker?data=OdrX-2uWgau2GN0wvUMBOjvVWGkr0yZx7fprqMiPak2drPFXs3K6ZsTApVV4WhifCqlh2y37s-0z1WfzNdMuuoQIrLLERd8Zzj3gNfDG0gI=\" rel=\"nofollow\" target=\"_blank\" title=\"@gfgresources\">@gfgresources</a><br />LinkedIn: <a href=\"https://www.globenewswire.com/Tracker?data=VAO7xjzfFZFTI_g0LIrhgRvt2zkIdmmT8xaQyG6dtWPxxgeZzr0mMU45fQmGg3XC_n7RfcxIjw0CrJk_cJMFVtTDERqmkZz5uOTuMbiDlYNvIw2K_pRDmdqTswyZA-Y3DY45t4o-WlBwt9zOBWP1KNi59UmDu4x1iHwamubEZFk=\" rel=\"nofollow\" target=\"_blank\" title=\"\">https://www.linkedin.com/company/gfgresources/</a><br />Facebook: <a href=\"https://www.globenewswire.com/Tracker?data=VAO7xjzfFZFTI_g0LIrhgdsGgV5O0PD2yPcCdM-A9hul5_Vm3K8r-n2GB7_iFFQGdxmayYaPyGqrt5TkwLBXKqFhfnHKxEKlQJpkKd-RPuctDoV36c6acj6FUNG_DSORw9xbceY9m_K-CqM3F6co2A==\" rel=\"nofollow\" target=\"_blank\" title=\"\">https://www.facebook.com/GFGResourcesInc/</a></p>  <p align=\"justify\"><em>Neither TSX Venture Exchange nor its Regulation Services Provider (as that term is defined in the policies of the TSX Venture Exchange) accepts responsibility for the adequacy or accuracy of this release.</em></p>  <p><strong>CAUTION REGARDING FORWARD-LOOKING INFORMATION</strong></p>  <p align=\"justify\">All statements, other than statements of historical fact, contained in this news release constitute “forward-looking information” within the meaning of applicable Canadian securities laws and “forward-looking statements” within the meaning of the United States Private Securities Litigation Reform Act of 1995 (referred to herein as “forward-looking statements”). Forward-looking statements include, but are not limited to, disclosure regarding possible events, exploration plans and expected results, conditions or financial performance that is based on assumptions about future economic conditions and courses of action, planned use of proceeds, expenditures and budgets and the execution thereof. Generally, these forward-looking statements can be identified by the use of forward-looking terminology such as “plans”, “expects” or “does not expect”, “is expected”, “budget”, “scheduled”, “estimates”, “forecasts”, “intends”, “anticipates” or “does not anticipate” or “believes”, or the negative connotation thereof or variations of such words and phrases or state that certain actions, events or results, “may”, “could”, “would”, “will”, “might” or “will be taken”, “occur” or “be achieved” or the negative connotation thereof.</p>  <p align=\"justify\">All forward-looking statements are based on various assumptions, including, without limitation, the expectations and beliefs of management, the assumed long-term price of gold, that the current exploration and other objectives concerning its mineral projects can be achieved and that its other corporate activities will proceed as expected; that the current price and demand for gold will be sustained or will improve; the continuity of the price of gold and other metals, economic and political conditions and operations; and that general business and economic conditions will not change in a materially adverse manner.</p>  <p align=\"justify\">Forward-looking statements are subject to known and unknown risks, uncertainties and other factors that may cause the actual results, level of activity, performance or achievements of GFG to be materially different from those expressed or implied by such forward-looking statements, including but not limited to: risks and uncertainties related to the actual results of current exploration activities; environmental risks; future prices of gold; operating risks; accidents, labour issues and other risks of the mining industry; delays in obtaining government approvals or financing; and other risks and uncertainties. These risks and uncertainties are not, and should not be construed as being, exhaustive.</p>  <p align=\"justify\">Although GFG has attempted to identify important factors that could cause actual results to differ materially from those contained in forward-looking statements, there may be other factors that cause results not to be as anticipated, estimated or intended. There can be no assurance that such statements will prove to be accurate, as actual results and future events could differ materially from those anticipated in such statements. In addition, forward-looking statements are provided solely for the purpose of providing information about management’s current expectations and plans and allowing investors and others to get a better understanding of our operating environment. Accordingly, readers should not place undue reliance on forward-looking statements.</p>  <p align=\"justify\">Forward-looking statements in this news release are made as of the date hereof and GFG assume no obligation to update any forward-looking statements, except as required by applicable laws.</p>  <br /><img alt=\"\" src='https://ml.globenewswire.com/media/Nzc5MjI0YzEtOTlmYS00YmVkLTg5ZTAtZTcxMzZjZTA3Mzk3LTExMDUzMzE=/tiny/GFG-Resources-Inc-.png' referrerpolicy='no-referrer-when-downgrade' />",
    "search_terms": "Rattlesnake,GFG Resources Inc.,GFG",
    "master_gid": 5991,
    "date": "2024-12-16T23:00:00.000Z",
    "tags": "|||Gold|Project Acquisition",
    "image_id": null,
    "hidden": false,
    "company_id": 879,
    "provider": "globenewswire",
    "excerpt": "SASKATOON, Saskatchewan, Dec. 16, 2024 (GLOBE NEWSWIRE) --GFG Resources Inc. (TSXV: GFG) (OTCQB: GFGSF)(“GFG” or the “Company”) announces the closing of the sale (the “Transaction”) of its 100% owned Rattlesnake Hills Gold Project (the “Project”) to Patriot Gold Vault Ltd., (“Patriot”) a wholly owned subsidiary of Axcap Ventures Inc. (“Axcap”). Under the",
    "is_regulatory": false,
    "refined_tags": [],
    "ftp_filename": null,
    "company_name": "Axcap Ventures Inc.",
    "exchange": "TSXV",
    "root_ticker": "GFG",
    "project_name": "Rattlesnake",
    "gid": 5991,
    "location": "Wyoming, United States",
    "plan_id": null,
    "description_text": "SASKATOON, Saskatchewan, Dec.  16, 2024  (GLOBE NEWSWIRE) -- GFG Resources Inc. (TSXV: GFG) (OTCQB: GFGSF) (“ GFG ” or the “ Company ”) announces the closing of the sale (the “ Transaction ”) of its 100% owned Rattlesnake Hills Gold Project (the “ Project ”) to Patriot Gold Vault Ltd., (“ Patriot ”) a wholly owned subsidiary of Axcap Ventures Inc. (“ Axcap ”). Under the terms of the Transaction, Patriot will pay GFG an aggregate consideration of approximately C$3.3 million. “We are pleased to finalize the sale of our Rattlesnake Hills Gold Project as part of our strategy and commitment to maximize value for our shareholders”, stated Brian Skanderbeg, President and CEO of GFG. “This transaction not only provides GFG with exposure to future exploration success on the property through equity and milestone payments, but also allows us to benefit from the majority of the compensation being in cash. Coupled with our recent warrant exercise, this deal significantly bolsters our balance sheet, enabling us to continue our aggressive exploration programs in Timmins at both the Aljo and Muskego targets.” Transaction Terms Patriot has acquired 100% interest in the Project on the following terms: Made a cash payment of C$250,000 to GFG on signing of the binding letter of intent (“ LOI ”); Made a cash payment of C$250,000 to GFG upon the execution and delivery of a definitive agreement; On closing of the Transaction, Patriot: Made a cash payment of C$1,200,000 to GFG; and Issued to GFG 3,061,224 common shares of Axcap (the “ Consideration Shares ” 1 ); and Patriot will pay to GFG an additional cash payment of C$1,000,000 on December 16, 2025. Additional Terms Subsequent to closing, Patriot will assume environmental liability for the Project and take necessary steps to have GFG’s US$219,000 reclamation bond refunded. If a National Instrument 43-101 resource estimate in the Project reveals a mineral resource of greater than 3,000,000 ounces of gold in a Measured and Indicated or Inferred category, Patriot will pay to GFG a further C$1 per total mineral resource ounce in cash or common shares of Axcap, at the election of Patriot. Patriot will reimburse GFG for all costs and expenses relating to the Project incurred from the date of the signed LOI to December 16, 2024. ( 1 ) The Consideration Shares are subject to a statutory hold period of four months and one day in accordance with applicable securities laws. In addition, the Consideration Shares are subject to contractual resale restrictions whereby one-sixth of the Consideration Shares will be released from resale restrictions every three months, starting on the date of issuance and continuing over 15 months thereafter. About GFG Resources Inc. GFG is a North American precious metals exploration company focused on district scale gold projects in tier one mining jurisdictions. The Company operates three gold projects, each hosting large and highly prospective gold properties within the prolific gold district of Timmins, Ontario, Canada. The projects have similar geological settings that host most of the gold deposits found in the Timmins Gold Camp which have produced over 70 million ounces of gold. For further information, please contact: Brian Skanderbeg, President & CEO or Marc Lepage, Vice President, Business Development Phone: (306) 931-0930 Email: info@gfgresources.com Website: www.gfgresources.com Stay Connected with Us Twitter: @gfgresources LinkedIn: https://www.linkedin.com/company/gfgresources/ Facebook: https://www.facebook.com/GFGResourcesInc/ Neither TSX Venture Exchange nor its Regulation Services Provider (as that term is defined in the policies of the TSX Venture Exchange) accepts responsibility for the adequacy or accuracy of this release. CAUTION REGARDING FORWARD-LOOKING INFORMATION All statements, other than statements of historical fact, contained in this news release constitute “forward-looking information” within the meaning of applicable Canadian securities laws and “forward-looking statements” within the meaning of the United States Private Securities Litigation Reform Act of 1995 (referred to herein as “forward-looking statements”). Forward-looking statements include, but are not limited to, disclosure regarding possible events, exploration plans and expected results, conditions or financial performance that is based on assumptions about future economic conditions and courses of action, planned use of proceeds, expenditures and budgets and the execution thereof. Generally, these forward-looking statements can be identified by the use of forward-looking terminology such as “plans”, “expects” or “does not expect”, “is expected”, “budget”, “scheduled”, “estimates”, “forecasts”, “intends”, “anticipates” or “does not anticipate” or “believes”, or the negative connotation thereof or variations of such words and phrases or state that certain actions, events or results, “may”, “could”, “would”, “will”, “might” or “will be taken”, “occur” or “be achieved” or the negative connotation thereof. All forward-looking statements are based on various assumptions, including, without limitation, the expectations and beliefs of management, the assumed long-term price of gold, that the current exploration and other objectives concerning its mineral projects can be achieved and that its other corporate activities will proceed as expected; that the current price and demand for gold will be sustained or will improve; the continuity of the price of gold and other metals, economic and political conditions and operations; and that general business and economic conditions will not change in a materially adverse manner. Forward-looking statements are subject to known and unknown risks, uncertainties and other factors that may cause the actual results, level of activity, performance or achievements of GFG to be materially different from those expressed or implied by such forward-looking statements, including but not limited to: risks and uncertainties related to the actual results of current exploration activities; environmental risks; future prices of gold; operating risks; accidents, labour issues and other risks of the mining industry; delays in obtaining government approvals or financing; and other risks and uncertainties. These risks and uncertainties are not, and should not be construed as being, exhaustive. Although GFG has attempted to identify important factors that could cause actual results to differ materially from those contained in forward-looking statements, there may be other factors that cause results not to be as anticipated, estimated or intended. There can be no assurance that such statements will prove to be accurate, as actual results and future events could differ materially from those anticipated in such statements. In addition, forward-looking statements are provided solely for the purpose of providing information about management’s current expectations and plans and allowing investors and others to get a better understanding of our operating environment. Accordingly, readers should not place undue reliance on forward-looking statements. Forward-looking statements in this news release are made as of the date hereof and GFG assume no obligation to update any forward-looking statements, except as required by applicable laws.",
    "primary_commodity": "Au"
  },
  "articleProject": {
    "gid": 5991,
    "project_name": "Rattlesnake",
    "location": "Wyoming, United States"
  },
  "articleExchange": "TSXV",
  "articleCompanyId": 879,
  "articleTicker": "GFG",
  "articleCompanyName": "GFG Resources Inc.",
  "allOtherCompanyProjects": [
    {
      "company_id": 879,
      "gid": 5991,
      "project_name": "Rattlesnake",
      "location": "Wyoming, United States"
    },
    {
      "company_id": 879,
      "gid": 2620,
      "project_name": "Goldarm",
      "location": "Ontario"
    },
    {
      "company_id": 879,
      "gid": 1558,
      "project_name": "Pen Gold",
      "location": "Ontario, Canada"
    },
    {
      "company_id": 879,
      "gid": 2621,
      "project_name": "Montclerg",
      "location": "Ontario"
    },
    {
      "company_id": 879,
      "gid": 2619,
      "project_name": "Dore Gold",
      "location": "Ontario, Canada"
    }
  ],
  "allOtherCompanyNews": [
    {
      "id": 106534,
      "company_id": 879,
      "title": "GFG Announces Encouraging Phase 1 Drill Results from Pen Gold Project, Ontario",
      "link": null,
      "date": "2025-06-02T10:23:00.000Z",
      "hidden": false
    },
    {
      "id": 104314,
      "company_id": 879,
      "title": "GFG Discovers New Gold Zone in Footwall and Extends Mineralization to Near-Surface at Aljo Gold Project, Timmins, ON",
      "link": null,
      "date": "2025-05-12T09:00:00.000Z",
      "hidden": false
    },
    {
      "id": 103338,
      "company_id": 879,
      "title": "GFG Closes Oversubscribed Financing",
      "link": null,
      "date": "2025-05-02T19:42:27.000Z",
      "hidden": false
    },
    {
      "id": 99796,
      "company_id": 879,
      "title": "GFG Issues Shares to IEP Pursuant to WWCC Gold Property Option Agreement",
      "link": null,
      "date": "2025-04-14T22:35:00.000Z",
      "hidden": false
    },
    {
      "id": 99471,
      "company_id": 879,
      "title": "GFG Upsizes and Amends Previously Announced Flow-Through Private Placement",
      "link": null,
      "date": "2025-04-11T10:30:00.000Z",
      "hidden": false
    },
    {
      "id": 98607,
      "company_id": 879,
      "title": "GFG Announces C$2.5 Million Flow-Through Private Placement",
      "link": null,
      "date": "2025-04-03T10:30:00.000Z",
      "hidden": false
    },
    {
      "id": 92115,
      "company_id": 879,
      "title": "GFG Acquires Claims at Pen Gold Project and Provides Corporate Update",
      "link": null,
      "date": "2025-03-21T18:59:28.000Z",
      "hidden": false
    },
    {
      "id": 91513,
      "company_id": 879,
      "title": "GFG Drills High-Grade Gold at Aljo including 6.62 g/t Gold over 11.2 m Confirms Continuity and Expands HW Zone at Depth",
      "link": null,
      "date": "2025-03-17T08:00:00.000Z",
      "hidden": false
    },
    {
      "id": 90188,
      "company_id": 879,
      "title": "GFG Signs Exploration Agreement with Apitipi Anicinapek Nation",
      "link": "https://www.globenewswire.com/news-release/2025/03/06/3038043/0/en/GFG-Signs-Exploration-Agreement-with-Apitipi-Anicinapek-Nation.html",
      "date": "2025-03-06T11:30:00.000Z",
      "hidden": false
    },
    {
      "id": 82134,
      "company_id": 879,
      "title": "GFG Closes Sale of its Rattlesnake Hills Gold Project with Patriot Gold",
      "link": "https://www.globenewswire.com/news-release/2024/12/16/2997947/0/en/GFG-Closes-Sale-of-its-Rattlesnake-Hills-Gold-Project-with-Patriot-Gold.html",
      "date": "2024-12-16T23:00:00.000Z",
      "hidden": false
    }
  ]
}