{
  "article": {
    "id": 73419,
    "link": "https://www.newsfilecorp.com/release/225197/Global-Copper-Corp-Initiates-Soil-Rock-Geochemical-Sampling-Survey-on-its-100owned-Northern-Lights-Copper-Project-and-Announces-Option-Agreement-to-Acquire-CopperSilver-Property-located-in-British-Colombia",
    "title": "Global Copper Corp Initiates Soil & Rock Geochemical Sampling Survey on its 100%-owned, Northern Lights Copper Project and Announces Option Agreement to Acquire Copper/Silver Property located in British Colombia",
    "description": "<img src=\"https://api.newsfilecorp.com/newsinfo/225197/367\" id=\"367\" width=\"2\" height=\"2\" style=\"width: 1px;  height: 1px;border: 0px solid;\" /><ul style=\"list-style-type: disc;\"><li>Initiates soil &#38; rock sampling on 100% Owned Northern Lights Copper </li><li>Northern Lights' historic reports document copper mineralization grading 3% to 12% Cu</li><li>Recent sampling confirms copper mineralization (1% to 19% Cu) over widths up to 4 meters at the surface</li><li>Company adds to its copper-focused portfolio with option agreement on British Columbia copper/silver property</li></ul><p>Toronto, Ontario--(Newsfile Corp. - October 1, 2024) - Global Copper Corp. (TSXV: CUCU) (FSE: WD9) (\"<b>Global Copper</b>\" or the \"<b>Company</b>\") is pleased to announce that it has initiated a property-wide soil and rock geochemical sampling survey on its 100%-owned, 485 hectare Northern Lights Copper Project (the \"<b>Project</b>) in Nevada. The program is designed to test for and expand on the copper skarn mineralization that occurs on the property.   Results from the survey will be used to identify zones to be tested by diamond and or reverse circulation drilling in the coming months. The objective of the Company is to confirm the deposit model with additional surface exploration work following by drilling to define a mineable high-grade copper deposit.  The project is currently in the early exploration phase but planned drilling will confirm the grade, thickness and downdip extent of the mineralization confirmed at the surface.  More details on the Company's flagship Northern Lights copper project are as set out below.</p><p>The Company is also pleased to announce that on September 25, 2024, the Company and an arm's length party (the \"<b>Optionor</b>\") entered into a property option and joint venture agreement (the \"<b>Agreement</b>\") pursuant to which the Optionor granted the Company an option (the \"<b>Option</b>\") to acquire several mineral titles located in British Columbia (the \"<b>Silver Vista</b> <b>Property</b>\"). In order to exercise the Option, the Company shall make the following payments: </p><ol style=\"list-style-type: decimal;\"><li>Upon receipt of approval from the TSX Venture Exchange for the Option (the \"<b>Approval Date</b>\"), the Company shall pay the Optionor $10,000 and shall issue the Optionor 4,000,000 common share (the \"<b>Common Shares</b>\") in the capital of the Company at a deemed price of $0.05 per Common Share;</li><li>On or before the date that is the sixth month anniversary of the Approval Date, the Company shall pay the Optionor $10,000;</li><li>On or before December 31, 2025, the Company must incur $100,000 in expenditures on the Property and pay $20,000 to the Optionor;  </li><li>On or before December 31, 2026, the Company shall pay $30,000 to the Optionor; and </li><li>On or before December 31, 2027 the Company shall pay $40,000 to the Optionor. </li></ol><p>The Property is subject to a 2% net smelter return royalty (the \"<b>NSR</b>\") held by Amarc Resources Corp. (\"<b>Amarc</b>\") subject to the ability of the Company to purchase 1% of the NSR (resulting in the remaining NSR being 1%) for a purchase price of $1,000,000 at any time.</p><p>The Silver Vista property is located in northcentral BC, approximately 55 air kilometres ('<b>km</b>') northeast of the town of Smithers and 300 km NW of northern B.C.'s regional hub city of Prince George.</p><p>The Silver Vista property is comprised of approximately 48 square km (4,839.2 hectares) and was recently drilled in 2021 (9 holes over 1,507 metres). Drill hole SV21-07 intersected a continuous 0.62 per cent copper and 46-metre-long zone from 106 metres averages 48 grams per tonne silver. This zone included a 17-metre section containing 1.34 per cent copper and 94 grams per tonne silver. Along this zone as well, the highest copper grade of 2.57 per cent (112 to 113 metres) and the highest silver grade of 431 grams per tonne (121 to 122 metres) were assayed.</p><p>Stephen Dunn, President and Chief Executive Officer of Li3 Lithium, commented: \"<i>This acquisition adds to the Company's existing flagship Northern Lights Copper Project and furthers the Company's new strategy of focusing globally on copper exploration and project development.  We see the energy transition to a net-zero carbon world as opportunity for mineral explorers to focus on the growth anticipated in demand for copper</i>.\"</p><p><b>Nevada - Northern Lights Copper Project</b></p><p>Global Copper's 100%-owned Northern Lights Copper Project is located in the central portion of Nevada's well-known Walker Lane Trend about 25 kilometers (15 air miles) southeast of Yerington, Nevada (See Figure 2 below). The property consists of 58 lode mining claims covering 1200 acres (485 hectares) and is in close proximity to Nevada Copper Corporation's producing Pumpkin Hollow copper mine which has total resources in excess of 6.5 million lbs of copper equivalent.  There are also several active copper exploration projects underway in close proximity to the property.  </p><p style=\"text-align: center;\"><a rel=\"nofollow\" href=\"https://images.newsfilecorp.com/files/5472/225197_bcd410a59470ea36_001full.jpg\"><img src=\"https://images.newsfilecorp.com/files/5472/225197_bcd410a59470ea36_001.jpg\" style=\"border-width: 0px;\" alt=\"Cannot view this image? Visit: https://images.newsfilecorp.com/files/5472/225197_bcd410a59470ea36_001.jpg\" /></a><br />Figure 2: Northern Lights Copper Project Location Map<br /><br />To view an enhanced version of this graphic, please visit:<br /><a rel=\"nofollow\" href=\"https://images.newsfilecorp.com/files/5472/225197_bcd410a59470ea36_001full.jpg\">https://images.newsfilecorp.com/files/5472/225197_bcd410a59470ea36_001full.jpg</a></p><p>The Pumpkin Hollow ore deposit is characterized by an intense magnetic high as shown in Figure 3, which uses the same base map as Figure 2.  The Northern Lights project is located between two magnetic highs in the eastern portion of the map (see Figure 3 below).</p><p style=\"text-align: center;\"><a rel=\"nofollow\" href=\"https://images.newsfilecorp.com/files/5472/225197_bcd410a59470ea36_002full.jpg\"><img src=\"https://images.newsfilecorp.com/files/5472/225197_bcd410a59470ea36_002.jpg\" style=\"border-width: 0px;\" alt=\"Cannot view this image? Visit: https://images.newsfilecorp.com/files/5472/225197_bcd410a59470ea36_002.jpg\" /></a><br /><br />Figure 3: Regional Aeromag Map<br /><br />To view an enhanced version of this graphic, please visit:<br /><a rel=\"nofollow\" href=\"https://images.newsfilecorp.com/files/5472/225197_bcd410a59470ea36_002full.jpg\">https://images.newsfilecorp.com/files/5472/225197_bcd410a59470ea36_002full.jpg</a></p><p>Mineralization observed on the property consists of: 1) massive magnetite, goethite, hematite, chalcopyrite replacement zones in the Triassic limestone and siltstone; 2) smaller, fracture- controlled zones of magnetite, goethite, hematite with copper oxide; and 3) disseminated pyrite, chalcopyrite, and copper oxides in sedimentary rocks as well as altered dacite porphyry. Visible copper oxide mineralization occurs in a northwest-trending zone approximately 1,500 meters long and 100 meters wide (5,000ft x 330ft).  This replacement-skarn style of mineralization (deposit type) is similar to the nearby copper deposit at Pumpkin Hollow, currently in production by Nevada Copper Corporation.</p><p>Detailed geologic mapping by the Company and surface rock geochemical results confirm that Northern Lights has copper mineralization (1% to 19% Cu) over widths up to 4 meters at the surface.  Review of historic reports dating back to the 1910 to 1920 era suggests that copper mineralization grading 3% to 12% Cu at an average width of 1 to 2 meters (2 to 6 feet) extends to a depth of 100 meters (325 feet). Underground workings are not accessible, and these grades cannot be confirmed without drilling.</p><p>The objective of the Company is to confirm the deposit model with additional surface exploration work following by drilling to define a mineable high-grade copper deposit.  The project is currently in the early exploration phase but planned drilling will confirm the grade, thickness and downdip extent of the mineralization confirmed at the surface.</p><p><b>Technical information</b><br />Quality Assurance and Quality Control of Global Copper's programs are under the control of the Company's geological employees and are consistent with industry best practices.  </p><p><b>Qualified Person</b><br />Nathan Chutas is the non-independent qualified person as defined by National Instrument 43-101 - <i>Standards of Disclosure for Mineral Projects</i> for the technical disclosure contained in this news release.  Mr. Chutas has reviewed and approved the technical disclosure contained in this news release. Also, mineralization hosted on adjacent and/or nearby properties, particularly with respect to neighbouring mineral resources, is not necessarily indicative of mineralization hosted on the Company's Project. </p><p><b>About Global Copper Corp.</b><br />Global Copper Corp is focused on its 100% owned Northern Lights Copper Project in Nevada. The Northern Lights Copper Project is located in the central portion of Nevada's well-known Walker Lane Trend about 25 km southeast of Yerington, Nevada. The property covers 1,200 acres (485 hectares) and is in close proximity to Nevada Copper Corporation's producing Pumpkin Hollow copper mine.  There are also several active copper exploration projects underway in close proximity to the property.  Global Copper Corp plans to confirm the deposit model with additional surface exploration work following by drilling to define a mineable high-grade copper deposit.</p><div id=\"contactInfo\"><p><b>Contact Information</b>:<br />Global Copper Corp. <br />Stephen Dunn, CEO and Director<br />Tel: 416-361-2827<br />Email: <a href=\"mailto:steve@crownminingcorp.com\">steve@crownminingcorp.com</a></p></div><p><b>CAUTIONARY STATEMENT:</b><br /><i>Neither the TSXV nor its Regulation Services Provider (as that term is defined in the policies of the TSXV) accepts responsibility for the adequacy or accuracy of this release.</i></p><p><i>This news release contains certain \"forward-looking information\" within the meaning of applicable securities laws. Forward looking information is frequently characterized by words such as \"plan\", \"expect\", \"project\", \"intend\", \"believe\", \"anticipate\", \"estimate\", \"may\", \"will\", \"would\", \"potential\", \"proposed\" and other </i></p><p><i>similar words, or statements that certain events or conditions \"may\" or \"will\" occur. These statements are only predictions. Forward-looking information is based on the opinions and estimates of management at the date the information is provided, and is subject to a variety of risks and uncertainties and other factors that could cause </i></p><p><i>actual events or results to differ materially from those projected in the forward- looking information. For a description of the risks and uncertainties facing the Company and its business and affairs, readers should refer to the Company's Management's Discussion and Analysis. The Company undertakes no obligation to update forward-looking information if circumstances or management's estimates or opinions should change, unless required by law. The reader is cautioned not to place undue reliance on forward-looking information.</i></p><p id=\"corporateLinkBack\">To view the source version of this press release, please visit <a href=\"https://api.newsfilecorp.com/redirect/AMYQ2hqmeK\">https://www.newsfilecorp.com/release/225197</a></p>",
    "search_terms": "Northern Lights,Global Copper Corp.,CUCU",
    "master_gid": 5937,
    "date": "2024-10-01T11:30:00.000Z",
    "tags": "Canada,Colombia,USA|Nevada||Copper|Exploration update,Project Acquisition",
    "image_id": null,
    "hidden": false,
    "company_id": 2268,
    "provider": "newsfilecorp",
    "excerpt": "Initiates soil &#38; rock sampling on 100% Owned Northern Lights CopperNorthern Lights' historic reports document copper mineralization grading 3% to 12% CuRecent sampling confirms copper mineralization (1% to 19% Cu) over widths up to 4 meters at the surfaceCompany adds to its copper-focused portfolio with option agreement on British Columbia",
    "is_regulatory": false,
    "refined_tags": null,
    "ftp_filename": null,
    "company_name": "Global Copper Corp.",
    "exchange": "TSXV",
    "root_ticker": "CUCU",
    "project_name": "Northern Lights",
    "gid": 5937,
    "location": "Nevada, United States",
    "plan_id": null,
    "description_text": "Initiates soil & rock sampling on 100% Owned Northern Lights Copper Northern Lights' historic reports document copper mineralization grading 3% to 12% Cu Recent sampling confirms copper mineralization (1% to 19% Cu) over widths up to 4 meters at the surface Company adds to its copper-focused portfolio with option agreement on British Columbia copper/silver property Toronto, Ontario--(Newsfile Corp. - October 1, 2024) - Global Copper Corp. (TSXV: CUCU) (FSE: WD9) (\" Global Copper \" or the \" Company \") is pleased to announce that it has initiated a property-wide soil and rock geochemical sampling survey on its 100%-owned, 485 hectare Northern Lights Copper Project (the \" Project ) in Nevada. The program is designed to test for and expand on the copper skarn mineralization that occurs on the property.   Results from the survey will be used to identify zones to be tested by diamond and or reverse circulation drilling in the coming months. The objective of the Company is to confirm the deposit model with additional surface exploration work following by drilling to define a mineable high-grade copper deposit.  The project is currently in the early exploration phase but planned drilling will confirm the grade, thickness and downdip extent of the mineralization confirmed at the surface.  More details on the Company's flagship Northern Lights copper project are as set out below. The Company is also pleased to announce that on September 25, 2024, the Company and an arm's length party (the \" Optionor \") entered into a property option and joint venture agreement (the \" Agreement \") pursuant to which the Optionor granted the Company an option (the \" Option \") to acquire several mineral titles located in British Columbia (the \" Silver Vista Property \"). In order to exercise the Option, the Company shall make the following payments: Upon receipt of approval from the TSX Venture Exchange for the Option (the \" Approval Date \"), the Company shall pay the Optionor $10,000 and shall issue the Optionor 4,000,000 common share (the \" Common Shares \") in the capital of the Company at a deemed price of $0.05 per Common Share; On or before the date that is the sixth month anniversary of the Approval Date, the Company shall pay the Optionor $10,000; On or before December 31, 2025, the Company must incur $100,000 in expenditures on the Property and pay $20,000 to the Optionor; On or before December 31, 2026, the Company shall pay $30,000 to the Optionor; and On or before December 31, 2027 the Company shall pay $40,000 to the Optionor. The Property is subject to a 2% net smelter return royalty (the \" NSR \") held by Amarc Resources Corp. (\" Amarc \") subject to the ability of the Company to purchase 1% of the NSR (resulting in the remaining NSR being 1%) for a purchase price of $1,000,000 at any time. The Silver Vista property is located in northcentral BC, approximately 55 air kilometres (' km ') northeast of the town of Smithers and 300 km NW of northern B.C.'s regional hub city of Prince George. The Silver Vista property is comprised of approximately 48 square km (4,839.2 hectares) and was recently drilled in 2021 (9 holes over 1,507 metres). Drill hole SV21-07 intersected a continuous 0.62 per cent copper and 46-metre-long zone from 106 metres averages 48 grams per tonne silver. This zone included a 17-metre section containing 1.34 per cent copper and 94 grams per tonne silver. Along this zone as well, the highest copper grade of 2.57 per cent (112 to 113 metres) and the highest silver grade of 431 grams per tonne (121 to 122 metres) were assayed. Stephen Dunn, President and Chief Executive Officer of Li3 Lithium, commented: \" This acquisition adds to the Company's existing flagship Northern Lights Copper Project and furthers the Company's new strategy of focusing globally on copper exploration and project development.  We see the energy transition to a net-zero carbon world as opportunity for mineral explorers to focus on the growth anticipated in demand for copper .\" Nevada - Northern Lights Copper Project Global Copper's 100%-owned Northern Lights Copper Project is located in the central portion of Nevada's well-known Walker Lane Trend about 25 kilometers (15 air miles) southeast of Yerington, Nevada (See Figure 2 below). The property consists of 58 lode mining claims covering 1200 acres (485 hectares) and is in close proximity to Nevada Copper Corporation's producing Pumpkin Hollow copper mine which has total resources in excess of 6.5 million lbs of copper equivalent.  There are also several active copper exploration projects underway in close proximity to the property. Figure 2: Northern Lights Copper Project Location Map To view an enhanced version of this graphic, please visit: https://images.newsfilecorp.com/files/5472/225197_bcd410a59470ea36_001full.jpg The Pumpkin Hollow ore deposit is characterized by an intense magnetic high as shown in Figure 3, which uses the same base map as Figure 2.  The Northern Lights project is located between two magnetic highs in the eastern portion of the map (see Figure 3 below). Figure 3: Regional Aeromag Map To view an enhanced version of this graphic, please visit: https://images.newsfilecorp.com/files/5472/225197_bcd410a59470ea36_002full.jpg Mineralization observed on the property consists of: 1) massive magnetite, goethite, hematite, chalcopyrite replacement zones in the Triassic limestone and siltstone; 2) smaller, fracture- controlled zones of magnetite, goethite, hematite with copper oxide; and 3) disseminated pyrite, chalcopyrite, and copper oxides in sedimentary rocks as well as altered dacite porphyry. Visible copper oxide mineralization occurs in a northwest-trending zone approximately 1,500 meters long and 100 meters wide (5,000ft x 330ft).  This replacement-skarn style of mineralization (deposit type) is similar to the nearby copper deposit at Pumpkin Hollow, currently in production by Nevada Copper Corporation. Detailed geologic mapping by the Company and surface rock geochemical results confirm that Northern Lights has copper mineralization (1% to 19% Cu) over widths up to 4 meters at the surface.  Review of historic reports dating back to the 1910 to 1920 era suggests that copper mineralization grading 3% to 12% Cu at an average width of 1 to 2 meters (2 to 6 feet) extends to a depth of 100 meters (325 feet). Underground workings are not accessible, and these grades cannot be confirmed without drilling. The objective of the Company is to confirm the deposit model with additional surface exploration work following by drilling to define a mineable high-grade copper deposit.  The project is currently in the early exploration phase but planned drilling will confirm the grade, thickness and downdip extent of the mineralization confirmed at the surface. Technical information Quality Assurance and Quality Control of Global Copper's programs are under the control of the Company's geological employees and are consistent with industry best practices. Qualified Person Nathan Chutas is the non-independent qualified person as defined by National Instrument 43-101 - Standards of Disclosure for Mineral Projects for the technical disclosure contained in this news release.  Mr. Chutas has reviewed and approved the technical disclosure contained in this news release. Also, mineralization hosted on adjacent and/or nearby properties, particularly with respect to neighbouring mineral resources, is not necessarily indicative of mineralization hosted on the Company's Project. About Global Copper Corp. Global Copper Corp is focused on its 100% owned Northern Lights Copper Project in Nevada. The Northern Lights Copper Project is located in the central portion of Nevada's well-known Walker Lane Trend about 25 km southeast of Yerington, Nevada. The property covers 1,200 acres (485 hectares) and is in close proximity to Nevada Copper Corporation's producing Pumpkin Hollow copper mine.  There are also several active copper exploration projects underway in close proximity to the property.  Global Copper Corp plans to confirm the deposit model with additional surface exploration work following by drilling to define a mineable high-grade copper deposit. Contact Information : Global Copper Corp. Stephen Dunn, CEO and Director Tel: 416-361-2827 Email: steve@crownminingcorp.com CAUTIONARY STATEMENT: Neither the TSXV nor its Regulation Services Provider (as that term is defined in the policies of the TSXV) accepts responsibility for the adequacy or accuracy of this release. This news release contains certain \"forward-looking information\" within the meaning of applicable securities laws. Forward looking information is frequently characterized by words such as \"plan\", \"expect\", \"project\", \"intend\", \"believe\", \"anticipate\", \"estimate\", \"may\", \"will\", \"would\", \"potential\", \"proposed\" and other similar words, or statements that certain events or conditions \"may\" or \"will\" occur. These statements are only predictions. Forward-looking information is based on the opinions and estimates of management at the date the information is provided, and is subject to a variety of risks and uncertainties and other factors that could cause actual events or results to differ materially from those projected in the forward- looking information. For a description of the risks and uncertainties facing the Company and its business and affairs, readers should refer to the Company's Management's Discussion and Analysis. The Company undertakes no obligation to update forward-looking information if circumstances or management's estimates or opinions should change, unless required by law. The reader is cautioned not to place undue reliance on forward-looking information. To view the source version of this press release, please visit https://www.newsfilecorp.com/release/225197",
    "primary_commodity": "Cu"
  },
  "articleProject": {
    "gid": 5937,
    "project_name": "Northern Lights",
    "location": "Nevada, United States"
  },
  "articleExchange": "TSXV",
  "articleCompanyId": 2268,
  "articleTicker": "CUCU",
  "articleCompanyName": "Global Copper Corp.",
  "allOtherCompanyProjects": [
    {
      "company_id": 2268,
      "gid": 4408,
      "project_name": "Mutare",
      "location": "Manicaland Province, Zimbabwe"
    },
    {
      "company_id": 2268,
      "gid": 5937,
      "project_name": "Northern Lights",
      "location": "Nevada, United States"
    }
  ],
  "allOtherCompanyNews": [
    {
      "id": 97729,
      "company_id": 2268,
      "title": "Global Copper Corp Announces Appointment of Gordon Villeneuve to its Board of Directors and Nathan Chutas as Chief Executive Officer",
      "link": "https://app.quotemedia.com/data/downloadFiling?webmasterId=104408&ref=672b8376a99d2434a54a0e24&type=PDFC&formType=002-002-001089-003001&formDescription=News+release&dateFiled=2024-11-06",
      "date": "2024-11-06T14:55:50.000Z",
      "hidden": false
    },
    {
      "id": 73930,
      "company_id": 2268,
      "title": "Global Copper Corp Announces Appointment of Dr. Nathan Chutas to Its Board of Directors and Scott Davis as Chief Financial Officer",
      "link": "https://www.newsfilecorp.com/release/225789/Global-Copper-Corp-Announces-Appointment-of-Dr.-Nathan-Chutas-to-Its-Board-of-Directors-and-Scott-Davis-as-Chief-Financial-Officer",
      "date": "2024-10-07T12:30:00.000Z",
      "hidden": false
    },
    {
      "id": 73419,
      "company_id": 2268,
      "title": "Global Copper Corp Initiates Soil & Rock Geochemical Sampling Survey on its 100%-owned, Northern Lights Copper Project and Announces Option Agreement to Acquire Copper/Silver Property located in British Colombia",
      "link": "https://www.newsfilecorp.com/release/225197/Global-Copper-Corp-Initiates-Soil-Rock-Geochemical-Sampling-Survey-on-its-100owned-Northern-Lights-Copper-Project-and-Announces-Option-Agreement-to-Acquire-CopperSilver-Property-located-in-British-Colombia",
      "date": "2024-10-01T11:30:00.000Z",
      "hidden": false
    },
    {
      "id": 70892,
      "company_id": 2268,
      "title": "Li3 Lithium Corp. Announces Name Change",
      "link": "https://www.newsfilecorp.com/release/222767/Li3-Lithium-Corp.-Announces-Name-Change",
      "date": "2024-09-10T12:00:00.000Z",
      "hidden": false
    },
    {
      "id": 69108,
      "company_id": 2268,
      "title": "Li3 Lithium Announces Shareholder Approval of Name Change to Reflect its Focus on its 100%-Owned Northern Lights Copper Project Located in Nevada",
      "link": "https://www.newsfilecorp.com/release/220848/Li3-Lithium-Announces-Shareholder-Approval-of-Name-Change-to-Reflect-its-Focus-on-its-100Owned-Northern-Lights-Copper-Project-Located-in-Nevada",
      "date": "2024-08-22T21:00:00.000Z",
      "hidden": false
    },
    {
      "id": 45967,
      "company_id": 2268,
      "title": "Li3 Lithium Shifts Focus to its 100%-Owned Northern Lights Copper Project Located in Nevada in Close Proximity to Nevada Copper's Producing Mine",
      "link": "https://www.newsfilecorp.com/release/191117/Li3-Lithium-Shifts-Focus-to-its-100Owned-Northern-Lights-Copper-Project-Located-in-Nevada-in-Close-Proximity-to-Nevada-Coppers-Producing-Mine",
      "date": "2023-12-15T13:00:00.000Z",
      "hidden": false
    },
    {
      "id": 44666,
      "company_id": 2268,
      "title": "Li3 Lithium Completes $170,000 Private Placement",
      "link": "https://www.newsfilecorp.com/release/188490/Li3-Lithium-Completes-170000-Private-Placement",
      "date": "2023-11-23T13:00:00.000Z",
      "hidden": false
    },
    {
      "id": 43046,
      "company_id": 2268,
      "title": "Li3 Lithium Announces Appointment of Robert Metcalfe to the Board of Directors",
      "link": "https://www.newsfilecorp.com/release/185090/Li3-Lithium-Announces-Appointment-of-Robert-Metcalfe-to-the-Board-of-Directors",
      "date": "2023-10-25T12:30:00.000Z",
      "hidden": false
    },
    {
      "id": 42148,
      "company_id": 2268,
      "title": "Li3 Lithium Announces Non-Brokered Private Placement",
      "link": "https://www.newsfilecorp.com/release/183417/Li3-Lithium-Announces-NonBrokered-Private-Placement",
      "date": "2023-10-10T12:30:00.000Z",
      "hidden": false
    },
    {
      "id": 39228,
      "company_id": 2268,
      "title": "Li3 Lithium Corp Uncovers 1.2km Mineralized Pegmatite Body at the Mutare Lithium Project in Zimbabwe",
      "link": "https://www.newsfilecorp.com/release/176796/Li3-Lithium-Corp-Uncovers-1.2km-Mineralized-Pegmatite-Body-at-the-Mutare-Lithium-Project-in-Zimbabwe",
      "date": "2023-08-10T20:02:00.000Z",
      "hidden": false
    }
  ]
}
