{
  "article": {
    "id": 31167,
    "link": "https://contentapi.cision.com/api/v1.0/releases/20230214C3747",
    "title": "Nevada Sunrise Stakes Badlands Lithium Project, Esmeralda County, Nevada",
    "description": "\n\n<p><span class=\"legendSpanClass\"><span class=\"xn-location\">VANCOUVER, BC</span></span>, <span class=\"legendSpanClass\"><span class=\"xn-chron\">Feb. 14, 2023</span></span> /CNW/ -<b> Nevada Sunrise Metals Corp. </b>(\"Nevada Sunrise\", or the \"Company\") (TSXV: NEV) (OTC: NVSGF) is pleased to announce the acquisition by staking of the Badlands Lithium Project (\"Badlands\" or the \"Project\") located in the Lida Valley, <span class=\"xn-location\">Esmeralda County, Nevada</span>.  Badlands consists of 54 unpatented claims on Bureau of Land Management land totaling approximately 1,080 acres (437 hectares) and lies roughly halfway between the Company's Gemini and Jackson Wash Lithium projects.</p>\n<p>Badlands was staked by Nevada Sunrise in 2022 following the new lithium discovery made by the Company at Gemini and was not announced at the time of its acquisition due to the onset of competitive staking in the Lida Valley.  The general topography of the Project is reminiscent of the TLC lithium property in <span class=\"xn-location\">Nye County</span>, which led to a surface investigation by Nevada Sunrise in <span class=\"xn-chron\">March 2022</span>. Samples were collected in a reconnaissance prospecting program, from which six outcrop samples were randomly selected for analysis and subsequently returned anomalous values of lithium ranging from <b>70.0 parts per million (\"ppm\") </b>to<b> 165.8 ppm lithium.</b></p>\n<div class=\"PRN_ImbeddedAssetReference\" id=\"DivAssetPlaceHolder5960\"><p><a href=\"https://mma.prnewswire.com/media/2001731/Nevada_Sunrise_Metals_Corporation_Nevada_Sunrise_Stakes_Badlands.html\" rel=\"nofollow\" target=\"_blank\"><img alt=\"Lida Valley Area Properties (CNW Group/Nevada Sunrise Metals Corporation)\" src=\"https://mma.prnewswire.com/media/2001731/Nevada_Sunrise_Metals_Corporation_Nevada_Sunrise_Stakes_Badlands.jpg?p=original\" title=\"Lida Valley Area Properties (CNW Group/Nevada Sunrise Metals Corporation)\"></img></a></p>\n</div><div class=\"PRN_ImbeddedAssetReference\" id=\"DivAssetPlaceHolder8531\"><p><a href=\"https://mma.prnewswire.com/media/2001730/Nevada_Sunrise_Metals_Corporation_Nevada_Sunrise_Stakes_Badlands.html\" rel=\"nofollow\" target=\"_blank\"><img alt=\"Surface Sampling at Badlands March 2022 (CNW Group/Nevada Sunrise Metals Corporation)\" src=\"https://mma.prnewswire.com/media/2001730/Nevada_Sunrise_Metals_Corporation_Nevada_Sunrise_Stakes_Badlands.jpg?p=original\" title=\"Surface Sampling at Badlands March 2022 (CNW Group/Nevada Sunrise Metals Corporation)\"></img></a></p>\n</div><p>The Badlands property is underlain by flat-lying tan-colored beds of weakly lithified bedded clay, silt and gravel. The sediments are primarily composed of air-fall tuffs interbedded with thin-bedded clastic alluvial deposits. Weathering and erosion have sculpted the area into a \"badlands\"-style topography, featuring eroded ravines, gullies and hoodoos. The maximum exposed thickness of the volcanic ash beds and alluvium is approximately 20 feet (6.1 metres). Drilling will be required to determine the total thickness of the deposits. Judging by the flat dips and weak induration it has been inferred by previous investigations that these deposits of volcanic ash beds and alluvium are Pleistocene-aged or younger. They appear to be dissected playa deposits like those found in the Clayton Valley and other playas in <span class=\"xn-location\">Esmeralda County</span> and <span class=\"xn-location\">Nye County</span>.</p>\n<div class=\"PRN_ImbeddedAssetReference\" id=\"DivAssetPlaceHolder6699\"><p><a href=\"https://mma.prnewswire.com/media/2001729/Nevada_Sunrise_Metals_Corporation_Nevada_Sunrise_Stakes_Badlands.html\" rel=\"nofollow\" target=\"_blank\"><img alt=\"Badlands Lithium Project, looking northwest to the Montezuma Range (CNW Group/Nevada Sunrise Metals Corporation)\" src=\"https://mma.prnewswire.com/media/2001729/Nevada_Sunrise_Metals_Corporation_Nevada_Sunrise_Stakes_Badlands.jpg?p=original\" title=\"Badlands Lithium Project, looking northwest to the Montezuma Range (CNW Group/Nevada Sunrise Metals Corporation)\"></img></a></p>\n</div><div aria-level=\"3\" class=\"wcag-arialevel-3\" role=\"heading\" style=\"display: block; font-size: 1.17em; margin-block-start: 1em; margin-block-end: 1em; margin-inline-start: 0px; margin-inline-end: 0px; font-weight: bold;\"><b><u>Exploration Plans for 2023</u></b></div><p>Nevada Sunrise intends to carry out a more comprehensive sampling program at Badlands in 2023, which may include the use of a \"backpack\" prospecting drill to collect small-core samples to a depth of several metres from surface. The goal of further work at the Project is to determine if lithium values increase with depth and if so, positive results from the proposed prospecting program could provide the foundation for a systematic conventional drilling program.</p>\n<div aria-level=\"3\" class=\"wcag-arialevel-3\" role=\"heading\" style=\"display: block; font-size: 1.17em; margin-block-start: 1em; margin-block-end: 1em; margin-inline-start: 0px; margin-inline-end: 0px; font-weight: bold;\"><b><u>Sampling and Analytical QA/QC and Statement of Qualified Person</u></b></div><div aria-level=\"3\" class=\"wcag-arialevel-3\" role=\"heading\" style=\"display: block; font-size: 1.17em; margin-block-start: 1em; margin-block-end: 1em; margin-inline-start: 0px; margin-inline-end: 0px; font-weight: bold;\"><b><i>Surface Sample Collection and Analysis</i></b></div><p>Outcrop samples described in this new release averaged approximately 0.24 kilograms each. The samples were submitted to American Assay in <span class=\"xn-location\">Reno, NV</span>, and were analyzed utilizing a multi-element ICP-AES method. Specifically, the analytical method involves aqua regia digestion of the sample followed by the inductively coupled plasma (ICP) technique to ionize the sample, and atomic emission spectrometry (AES) to determine elemental concentrations. Duplicates, field blanks, and certified reference standards were inserted at regular intervals in the sample stream to ensure accuracy of the analytical method.</p>\n<p>The scientific and technical information contained in this news release has been reviewed and approved by <span class=\"xn-person\">Robert M. Allender, Jr.</span>, CPG, RG, SME and a Qualified Person for Nevada Sunrise as defined in National Instrument 43-101 – <i>Standards of Disclosure</i> <i>for Mineral Projects</i>.</p>\n<div aria-level=\"3\" class=\"wcag-arialevel-3\" role=\"heading\" style=\"display: block; font-size: 1.17em; margin-block-start: 1em; margin-block-end: 1em; margin-inline-start: 0px; margin-inline-end: 0px; font-weight: bold;\"><b><u>Status of Warrants Exercised </u></b></div><p>Nevada Sunrise is pleased to announce that a total of 1,154,700 common share purchase warrants with an expiry date of <span class=\"xn-chron\">February 12, 2023</span> and an exercise price of <span class=\"xn-money\">CAD$0.16</span> were exercised in 2022-2023 by the warrant holders, with total proceeds to the Company of <span class=\"xn-money\">$184,752</span>.</p>\n<div aria-level=\"3\" class=\"wcag-arialevel-3\" role=\"heading\" style=\"display: block; font-size: 1.17em; margin-block-start: 1em; margin-block-end: 1em; margin-inline-start: 0px; margin-inline-end: 0px; font-weight: bold;\"><b><u>About Nevada Sunrise</u></b></div><p>Nevada Sunrise is a junior mineral exploration company with a strong technical team based in <span class=\"xn-location\">Vancouver, BC</span>, <span class=\"xn-location\">Canada</span>, that holds interests in lithium, gold, copper, and cobalt exploration projects located in the <span class=\"xn-location\">State of Nevada, USA</span>.</p>\n<p>Nevada Sunrise owns 100% interests in the Gemini, <span class=\"xn-person\">Jackson Wash</span> and Badlands lithium projects, all of which are located in the Lida Valley in <span class=\"xn-location\">Esmeralda County, NV.</span> The Company owns Nevada water right Permit 86863, also located in the Lida Valley basin, near Lida, NV.</p>\n<p>The Company's key gold asset is a 20.01% interest in a joint venture at the Kinsley Mountain Gold Project near <span class=\"xn-location\">Wendover, NV</span> with Copaur Minerals Inc.  Kinsley Mountain is a Carlin-style gold project hosting a National Instrument 43-101 compliant gold resource consisting of <b>418,000 indicated ounces of gold grading 2.63 g/t Au (4.95 million tonnes), and 117,000 inferred ounces of gold averaging 1.51 g/t Au (2.44 million tonnes), at cut-off grades ranging from 0.2 to 2.0 g/t Au <sup>1</sup>.</b></p>\n<div><table border=\"1\" cellpadding=\"0\" cellspacing=\"0\" class=\"prnbcc\"><tr><td class=\"prngen2\" colspan=\"1\" rowspan=\"1\"><br></br></td><td class=\"prngen2\" colspan=\"1\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\">1 <i>Technical Report on the Kinsley Project, Elko County, Nevada, U.S.A., dated June 21, 2021 with an effective date of May 5, 2021 and prepared by Michael M. Gustin, Ph.D., and Gary L. Simmons, MMSA and filed under New Placer Dome Gold Corp.'s Issuer Profile on SEDAR (</i><i><a class=\"prnews_a\" href=\"about:blank\" rel=\"nofollow\" target=\"_blank\">www.sedar.com</a></i><i>).</i></span></p>\n</td></tr></table></div><p>Nevada Sunrise has the right to earn a 100% interest in the Coronado VMS Project, located approximately 48 kilometers (30 miles) southeast of <span class=\"xn-location\">Winnemucca, NV.</span> The Company owns a 15% interest in the historic Lovelock Cobalt Mine and the Treasure Box copper properties, each located approximately 150 kilometers (100 miles) east of <span class=\"xn-location\">Reno, NV</span>, with Global Energy Metals Corp. holding an 85% participating interest. </p>\n<p><b>FORWARD LOOKING STATEMENTS</b></p>\n<p><i>This release may contain forward</i><i>–</i><i>looking statements. Forward looking statements are statements that are not historical facts and are generally, but not always, identified by the words \"expects\", \"plans\", \"anticipates\", \"believes\", \"intends\", \"estimates\", \"projects\", \"potential\" and similar expressions, or that events or conditions \"will\", \"would\", \"may\", \"could\" or \"should\" occur and include disclosure of anticipated exploration activities. Although the Company believes the expectations expressed in such forward</i><i>–</i><i>looking statements are based on reasonable assumptions, such statements are not guarantees of future performance and actual results may differ materially from those in forward looking statements. Forward</i><i>–</i><i>looking statements are based on the beliefs, estimates and opinions of the Company's management on the date such statements were made. The Company expressly disclaims any intention or obligation to update or revise any forward</i><i>–</i><i>looking statements whether as a result of new information, future events or otherwise.</i></p>\n<p><i>Such factors include, among others, risks related to the results and outcomes of the Company's 2022-2023 exploration at the Badlands Lithium Project; reliance on technical information provided by third parties on any of our exploration properties; changes in project parameters as plans continue to be refined; current economic conditions; future prices of commodities; possible variations in grade or recovery rates; failure of equipment or processes to operate as anticipated; the failure of contracted parties to perform; labor disputes and other risks of the mining industry; delays due to pandemic; delays in obtaining governmental approvals, financing or in the completion of exploration, as well as those factors discussed in the section entitled \"Risk Factors\" in the Company's Management Discussion and Analysis for the Year Ended <span class=\"xn-chron\">September 30</span>, 2022,  which is available under Company's SEDAR profile at <u><a href=\"about:blank\" rel=\"nofollow\" target=\"_blank\">www.sedar.com</a></u>.</i></p>\n<p><i>Although Nevada Sunrise has attempted to identify important factors that could cause actual actions, events or results to differ materially from those described in forward-looking information, there may be other factors that cause actions, events or results not to be as anticipated, estimated or intended. There can be no assurance that such information will prove to be accurate as actual results and future events could differ materially from those anticipated in such statements. Nevada Sunrise disclaims any intention or obligation to update or revise any forward-looking information, whether as a result of new information, future events or otherwise. Accordingly, readers should not place undue reliance on forward-looking information.</i></p>\n<p><b>Neither TSX Venture Exchange nor its Regulation Services Provider (as that term is defined in the policies of TSX Venture Exchange) accepts responsibility for the adequacy or accuracy of this release.</b></p>\n\n<div class=\"PRN_ImbeddedAssetReference\" id=\"DivAssetPlaceHolder0\">\n                    <p>\n                            <a href=\"https://mma.prnewswire.com/media/2001734/Nevada_Sunrise_Metals_Corporation_Nevada_Sunrise_Stakes_Badlands.html\" rel=\"nofollow\" target=\"_blank\">\n                        <img alt=\"Nevada Sunrise Metals Corporation logo (CNW Group/Nevada Sunrise Metals Corporation)\" src=\"https://mma.prnewswire.com/media/2001734/Nevada_Sunrise_Metals_Corporation_Nevada_Sunrise_Stakes_Badlands.jpg\" title=\"Nevada Sunrise Metals Corporation logo (CNW Group/Nevada Sunrise Metals Corporation)\"></img>\n                            </a>\n                    </p>\n\n</div>\n<p>SOURCE  Nevada Sunrise Metals Corporation</p>\n<img alt=\"\" src=\"https://rt.newswire.ca/rt.gif?NewsItemId=C3747&amp;Transmission_Id=202302140730CANADANWCANADAPR_C3747&amp;DateId=20230214\" style=\"border:0px; width:1px; height:1px;\"></img>\n\n",
    "search_terms": "Badlands,Nevada Sunrise Metals Corporation,NEV",
    "master_gid": 4049,
    "date": "2023-02-14T12:30:00.000Z",
    "tags": "USA|Nevada||Lithium|Project Acquisition",
    "image_id": null,
    "hidden": false,
    "company_id": 357,
    "provider": null,
    "excerpt": "VANCOUVER, BC,Feb. 14, 2023/CNW/ -Nevada Sunrise Metals Corp.(\"Nevada Sunrise\", or the \"Company\") (TSXV: NEV) (OTC: NVSGF) is pleased to announce the acquisition by staking of the Badlands Lithium Project (\"Badlands\" or the \"Project\") located in the Lida Valley,Esmeralda County, Nevada.  Badlands consists of 54 unpatented claims on Bureau of Land Management",
    "is_regulatory": false,
    "refined_tags": [
      "Project Acquisition"
    ],
    "ftp_filename": null,
    "company_name": "Nevada Sunrise Metals Corporation",
    "exchange": "TSXV",
    "root_ticker": "NEV",
    "project_name": "Badlands",
    "gid": 4049,
    "location": "Nevada, United States",
    "plan_id": null,
    "description_text": "VANCOUVER, BC , Feb. 14, 2023 /CNW/ - Nevada Sunrise Metals Corp. (\"Nevada Sunrise\", or the \"Company\") (TSXV: NEV) (OTC: NVSGF) is pleased to announce the acquisition by staking of the Badlands Lithium Project (\"Badlands\" or the \"Project\") located in the Lida Valley, Esmeralda County, Nevada .  Badlands consists of 54 unpatented claims on Bureau of Land Management land totaling approximately 1,080 acres (437 hectares) and lies roughly halfway between the Company's Gemini and Jackson Wash Lithium projects. Badlands was staked by Nevada Sunrise in 2022 following the new lithium discovery made by the Company at Gemini and was not announced at the time of its acquisition due to the onset of competitive staking in the Lida Valley.  The general topography of the Project is reminiscent of the TLC lithium property in Nye County , which led to a surface investigation by Nevada Sunrise in March 2022 . Samples were collected in a reconnaissance prospecting program, from which six outcrop samples were randomly selected for analysis and subsequently returned anomalous values of lithium ranging from 70.0 parts per million (\"ppm\") to 165.8 ppm lithium. The Badlands property is underlain by flat-lying tan-colored beds of weakly lithified bedded clay, silt and gravel. The sediments are primarily composed of air-fall tuffs interbedded with thin-bedded clastic alluvial deposits. Weathering and erosion have sculpted the area into a \"badlands\"-style topography, featuring eroded ravines, gullies and hoodoos. The maximum exposed thickness of the volcanic ash beds and alluvium is approximately 20 feet (6.1 metres). Drilling will be required to determine the total thickness of the deposits. Judging by the flat dips and weak induration it has been inferred by previous investigations that these deposits of volcanic ash beds and alluvium are Pleistocene-aged or younger. They appear to be dissected playa deposits like those found in the Clayton Valley and other playas in Esmeralda County and Nye County . Exploration Plans for 2023 Nevada Sunrise intends to carry out a more comprehensive sampling program at Badlands in 2023, which may include the use of a \"backpack\" prospecting drill to collect small-core samples to a depth of several metres from surface. The goal of further work at the Project is to determine if lithium values increase with depth and if so, positive results from the proposed prospecting program could provide the foundation for a systematic conventional drilling program. Sampling and Analytical QA/QC and Statement of Qualified Person Surface Sample Collection and Analysis Outcrop samples described in this new release averaged approximately 0.24 kilograms each. The samples were submitted to American Assay in Reno, NV , and were analyzed utilizing a multi-element ICP-AES method. Specifically, the analytical method involves aqua regia digestion of the sample followed by the inductively coupled plasma (ICP) technique to ionize the sample, and atomic emission spectrometry (AES) to determine elemental concentrations. Duplicates, field blanks, and certified reference standards were inserted at regular intervals in the sample stream to ensure accuracy of the analytical method. The scientific and technical information contained in this news release has been reviewed and approved by Robert M. Allender, Jr. , CPG, RG, SME and a Qualified Person for Nevada Sunrise as defined in National Instrument 43-101 – Standards of Disclosure for Mineral Projects . Status of Warrants Exercised Nevada Sunrise is pleased to announce that a total of 1,154,700 common share purchase warrants with an expiry date of February 12, 2023 and an exercise price of CAD$0.16 were exercised in 2022-2023 by the warrant holders, with total proceeds to the Company of $184,752 . About Nevada Sunrise Nevada Sunrise is a junior mineral exploration company with a strong technical team based in Vancouver, BC , Canada , that holds interests in lithium, gold, copper, and cobalt exploration projects located in the State of Nevada, USA . Nevada Sunrise owns 100% interests in the Gemini, Jackson Wash and Badlands lithium projects, all of which are located in the Lida Valley in Esmeralda County, NV. The Company owns Nevada water right Permit 86863, also located in the Lida Valley basin, near Lida, NV. The Company's key gold asset is a 20.01% interest in a joint venture at the Kinsley Mountain Gold Project near Wendover, NV with Copaur Minerals Inc.  Kinsley Mountain is a Carlin-style gold project hosting a National Instrument 43-101 compliant gold resource consisting of 418,000 indicated ounces of gold grading 2.63 g/t Au (4.95 million tonnes), and 117,000 inferred ounces of gold averaging 1.51 g/t Au (2.44 million tonnes), at cut-off grades ranging from 0.2 to 2.0 g/t Au 1 . 1 Technical Report on the Kinsley Project, Elko County, Nevada, U.S.A., dated June 21, 2021 with an effective date of May 5, 2021 and prepared by Michael M. Gustin, Ph.D., and Gary L. Simmons, MMSA and filed under New Placer Dome Gold Corp.'s Issuer Profile on SEDAR ( www.sedar.com ). Nevada Sunrise has the right to earn a 100% interest in the Coronado VMS Project, located approximately 48 kilometers (30 miles) southeast of Winnemucca, NV. The Company owns a 15% interest in the historic Lovelock Cobalt Mine and the Treasure Box copper properties, each located approximately 150 kilometers (100 miles) east of Reno, NV , with Global Energy Metals Corp. holding an 85% participating interest. FORWARD LOOKING STATEMENTS This release may contain forward – looking statements. Forward looking statements are statements that are not historical facts and are generally, but not always, identified by the words \"expects\", \"plans\", \"anticipates\", \"believes\", \"intends\", \"estimates\", \"projects\", \"potential\" and similar expressions, or that events or conditions \"will\", \"would\", \"may\", \"could\" or \"should\" occur and include disclosure of anticipated exploration activities. Although the Company believes the expectations expressed in such forward – looking statements are based on reasonable assumptions, such statements are not guarantees of future performance and actual results may differ materially from those in forward looking statements. Forward – looking statements are based on the beliefs, estimates and opinions of the Company's management on the date such statements were made. The Company expressly disclaims any intention or obligation to update or revise any forward – looking statements whether as a result of new information, future events or otherwise. Such factors include, among others, risks related to the results and outcomes of the Company's 2022-2023 exploration at the Badlands Lithium Project; reliance on technical information provided by third parties on any of our exploration properties; changes in project parameters as plans continue to be refined; current economic conditions; future prices of commodities; possible variations in grade or recovery rates; failure of equipment or processes to operate as anticipated; the failure of contracted parties to perform; labor disputes and other risks of the mining industry; delays due to pandemic; delays in obtaining governmental approvals, financing or in the completion of exploration, as well as those factors discussed in the section entitled \"Risk Factors\" in the Company's Management Discussion and Analysis for the Year Ended September 30 , 2022,  which is available under Company's SEDAR profile at www.sedar.com . Although Nevada Sunrise has attempted to identify important factors that could cause actual actions, events or results to differ materially from those described in forward-looking information, there may be other factors that cause actions, events or results not to be as anticipated, estimated or intended. There can be no assurance that such information will prove to be accurate as actual results and future events could differ materially from those anticipated in such statements. Nevada Sunrise disclaims any intention or obligation to update or revise any forward-looking information, whether as a result of new information, future events or otherwise. Accordingly, readers should not place undue reliance on forward-looking information. Neither TSX Venture Exchange nor its Regulation Services Provider (as that term is defined in the policies of TSX Venture Exchange) accepts responsibility for the adequacy or accuracy of this release. SOURCE  Nevada Sunrise Metals Corporation",
    "primary_commodity": "Li"
  },
  "articleProject": {
    "gid": 4049,
    "project_name": "Badlands",
    "location": "Nevada, United States"
  },
  "articleExchange": "TSXV",
  "articleCompanyId": 357,
  "articleTicker": "NEV",
  "articleCompanyName": "Nevada Sunrise Metals Corporation",
  "allOtherCompanyProjects": [
    {
      "company_id": 357,
      "gid": 9874,
      "project_name": "Griffon Gold Mine",
      "location": "Nevada, United States"
    },
    {
      "company_id": 357,
      "gid": 817,
      "project_name": "Coronado",
      "location": "Nevada, USA"
    },
    {
      "company_id": 357,
      "gid": 1055,
      "project_name": "Gemini",
      "location": "Nevada, USA"
    },
    {
      "company_id": 357,
      "gid": 939,
      "project_name": "Lovelock",
      "location": "Nevada, USA"
    },
    {
      "company_id": 357,
      "gid": 1052,
      "project_name": "Jackson Wash",
      "location": "Nevada, USA"
    },
    {
      "company_id": 357,
      "gid": 4049,
      "project_name": "Badlands",
      "location": "Nevada, United States"
    },
    {
      "company_id": 357,
      "gid": 940,
      "project_name": "Treasure Box",
      "location": "Nevada, USA"
    },
    {
      "company_id": 357,
      "gid": 911,
      "project_name": "Kinsley Mountain",
      "location": "Nevada, USA"
    }
  ],
  "allOtherCompanyNews": [
    {
      "id": 90980,
      "company_id": 357,
      "title": "Nevada Sunrise to Leverage VRIFY's AI-Assisted Mineral Discovery Platform at the Past-Producing Griffon Gold Mine Project, Nevada",
      "link": null,
      "date": "2025-03-13T11:30:00.000Z",
      "hidden": false
    },
    {
      "id": -170356,
      "company_id": 357,
      "title": "Canadian Investment Regulatory Organization Trade Resumption - NEV",
      "link": "https://contentapi.cision.com/api/v1.0/releases/20250220C8085",
      "date": "2025-02-20T16:01:00.000Z",
      "hidden": false
    },
    {
      "id": 88760,
      "company_id": 357,
      "title": "Nevada Sunrise Announces Agreement to Purchase a 100% Interest in the Past-Producing Griffon Gold Mine Project, Nevada",
      "link": "https://www.newsfilecorp.com/release/241637/Nevada-Sunrise-Announces-Agreement-to-Purchase-a-100-Interest-in-the-PastProducing-Griffon-Gold-Mine-Project-Nevada",
      "date": "2025-02-20T15:22:00.000Z",
      "hidden": false
    },
    {
      "id": -170352,
      "company_id": 357,
      "title": "Canadian Investment Regulatory Organization Trading Halt - NEV",
      "link": "https://contentapi.cision.com/api/v1.0/releases/20250220C5826",
      "date": "2025-02-20T14:27:00.000Z",
      "hidden": false
    },
    {
      "id": 85160,
      "company_id": 357,
      "title": "Nevada Sunrise Amends Option to Purchase Coronado Copper Project, Nevada",
      "link": "https://www.newsfilecorp.com/release/238295/Nevada-Sunrise-Amends-Option-to-Purchase-Coronado-Copper-Project-Nevada",
      "date": "2025-01-24T12:30:00.000Z",
      "hidden": false
    },
    {
      "id": 84329,
      "company_id": 357,
      "title": "Nevada Sunrise Receives US$300,000 for the Sale of Non-Core Claims at the Gemini Lithium Project, Nevada",
      "link": "https://www.newsfilecorp.com/release/237370/Nevada-Sunrise-Receives-US300000-for-the-Sale-of-NonCore-Claims-at-the-Gemini-Lithium-Project-Nevada",
      "date": "2025-01-16T12:30:00.000Z",
      "hidden": false
    },
    {
      "id": 68156,
      "company_id": 357,
      "title": "Nevada Sunrise Completes Sale of Joint Venture Interest in the Kinsley Mountain Gold Project, Nevada",
      "link": "https://contentapi.cision.com/api/v1.0/releases/20240812C7203",
      "date": "2024-08-13T01:58:00.000Z",
      "hidden": false
    },
    {
      "id": 64804,
      "company_id": 357,
      "title": "Nevada Sunrise Initiates Data Review to Develop New Drill Targets at the Coronado Copper Project, Nevada",
      "link": "https://contentapi.cision.com/api/v1.0/releases/20240711C5052",
      "date": "2024-07-11T11:30:00.000Z",
      "hidden": false
    },
    {
      "id": 64426,
      "company_id": 357,
      "title": "Nevada Sunrise Signs Indicative Term Sheet to Sell Remaining Interest in the Kinsley Mountain Gold Project, Nevada",
      "link": "https://contentapi.cision.com/api/v1.0/releases/20240708C5338",
      "date": "2024-07-08T13:05:00.000Z",
      "hidden": false
    },
    {
      "id": 50395,
      "company_id": 357,
      "title": "Nevada Sunrise Files NI 43-101 Technical Report on Maiden Resource Estimate of 7.1 Million Tonnes LCE for its Gemini Lithium Project, Nevada",
      "link": "https://contentapi.cision.com/api/v1.0/releases/20240312C3712",
      "date": "2024-03-12T13:03:00.000Z",
      "hidden": false
    }
  ]
}
