{
  "article": {
    "id": 88618,
    "link": "https://www.accessnewswire.com/newsroom/en/metals-and-mining/troy-minerals-strategically-expands-its-lake-owen-project-in-wyoming-by-100-988251",
    "title": "Troy Minerals Strategically Expands Its Lake Owen Project in Wyoming by 100%",
    "description": "<p><strong id=\"dateline\">VANCOUVER, BC / <a href='https://www.accessnewswire.com/'>ACCESS Newswire</a> / February 20, 2025 / </strong>Troy Minerals Inc. (&quot;Troy&quot; or the &quot;Company&quot;) (CSE:TROY)(OTCQB:TROYF)(FSE:VJ3) is pleased to announce the strategic expansion of its Lake Owen Project, located 50km southwest of Laramie, Wyoming, USA (the &quot;Property&quot;) by adding a significant number of neighboring claims. The new Claims staking process followed the conclusion of the Company's first phase geological program that took place in H2 2024. The exploration program consisted of first pass geological mapping, diamond drilling and sampling. Results of this program will be reported in due course.</p><p>&quot;Our Lake Owen Project compliments our overall portfolio of strategic exploration assets in Canada, USA and Mongolia.&quot; stated Yannis Tsitos, President of Troy Minerals. &quot; The addition of 85 claims on our Wyoming holdings, now brings our total number of claims to 185 and was made to increase the amount of potentially fertile magnetite-rich gabbro in the Property. Our near-term goals are to explore the layered mafic intrusion for vanadium and titanium mineralization, which also includes ‘reef' style PGE (Platinum Group Elements) mineralization as noted by historic work and drilling on the Property by Chevron and, the potential for basal massive Cu and Ni sulfide mineralization along the Proterozoic- contact.&quot;</p><p>The Lake Owen Project has effectively been doubled and now comprises 1433 hectares from 714 hectares before the new staking. The newly acquired claims are accessible through existing infrastructure and cover strategic land adjacent to the existing Lake Owen claims (see Figure 1 below)</p><p style=\"text-align:center;\"><strong>Figure 1. Lake Owen Project Expanded Claims</strong></p><figure class=\"image\" style=\"text-align:center;margin:0.9em auto;\" width=\"100%\"><img src=\"https://app.accessnewswire.com/imagelibrary/9f3bcd58-a8db-47be-8557-e68b783401a2/988251/image.png\" width=\"100%\" /></figure><div style=\"clear: both\"> </div><div> </div><div> </div><p>The Lake Owen Project, is a Proterozoic layered mafic intrusion complex with a long history of sporadic exploration primarily for Platinum Group Elements. Similar in style to the Stillwater Complex in USA and the Merensky Reef of South Africa, the Lake Owen Complex is a highly prospective North American based target with a strong potential for significant vanadium, titanium, PGE and associated metals mineralization.</p><p>The Lake Owen Complex is the focus of the US government's critical minerals strategy resulting in a recently completed high resolution airborne Magnetic and Radiometric geophysical survey over the complex, which also covers the Company's property, and included ‘boots on the outcrop' mapping and sampling by the United States Geological Survey (&quot;USGS&quot;). Geologists from the USGS and Wyoming Geologic Survey (&quot;WGS&quot;) recently visited the Property with Troy's Chief Geologist Bill Cronk. Their goals were to review the recently drilled core, log it themselves and select samples for petrologic studies including thin section analysis.</p><p><strong>Qualified Person</strong></p><p>The scientific and technical disclosure in this news release was approved by Ted VanderWart, <i>P.Geo</i>, a Qualified Person as defined in NI 43-101 and a consultant to the Company.</p><p><strong>About Troy Minerals</strong></p><p>Troy Minerals is a Canadian based publicly listed mining company focused on building shareholder value through acquisition, exploration, and development of strategically located &quot;critical&quot; mineral assets. Troy is aggressively advancing its projects within the silica (silicon), vanadium, and rare earths industries within regions that exhibit high and growing demand for such commodities, in both North America and Central-East Asia. The Company's primary objective is the near-term prospect of production with a vision of becoming a cash-flowing mining company to ultimately deliver tangible monetary value to shareholders, state, and local communities.</p><p><strong>ON BEHALF OF THE BOARD,</strong></p><p>Rana Vig | CEO &amp; Director<br />Telephone: 604-218-4766<br />Email: <a rel=\"nofollow\" href=\"mailto:rana@ranavig.com\">rana@ranavig.com</a></p><p><strong>Forward-Looking Statements</strong></p><p>Statement Regarding Forward-Looking Information: This release includes certain statements that may be deemed &quot;forward-looking statements&quot;. All statements in this release, other than statements of historical facts, that address events or developments that Troy Resources Inc. (the &quot;Company&quot;) expects to occur, are forward-looking statements. Forward-looking statements are statements that are not historical facts and are generally, but not always, identified by the words &quot;expects&quot;, &quot;plans&quot;, &quot;anticipates&quot;, &quot;believes&quot;, &quot;intends&quot;, &quot;estimates&quot;, &quot;projects&quot;, &quot;potential&quot; and similar expressions, or that events or conditions &quot;will&quot;, &quot;would&quot;, &quot;may&quot;, &quot;could&quot; or &quot;should&quot; occur. Although the Company believes the expectations expressed in such forward-looking statements are based on reasonable assumptions, such statements are not guarantees of future performance and actual results may differ materially from those in the forward-looking statements. Factors that could cause the actual results to differ materially from those in forward-looking statements include results of exploration activities may not show quality and quantity necessary for further exploration or future exploitation of minerals deposits, volatility of commodity prices, and continued availability of capital and financing, permitting and other approvals, and general economic, market or business conditions. Investors are cautioned that any such statements are not guarantees of future performance and actual results or developments may differ materially from those projected in the forward-looking statements. Forward-looking statements are based on the beliefs, estimates and opinions of the Company's management on the date the statements are made. Except as required by applicable securities laws, the Company undertakes no obligation to update these forward-looking statements in the event that management's beliefs, estimates or opinions, or other factors, should change.</p><p><i><strong>The Canadian Securities Exchange has not reviewed this press release and does not accept responsibility for the adequacy or accuracy of this news release.</strong></i></p><p><strong>SOURCE: </strong>Troy Minerals Inc.</p><img src='https://app.accessnewswire.com/img.ashx?id=988251' width=\"100%\" /><br /><br />View the original <a href='https://www.accessnewswire.com/newsroom/en/metals-and-mining/troy-minerals-strategically-expands-its-lake-owen-project-in-wyoming-by-100-988251'>press release</a> on ACCESS Newswire<br /><br />",
    "search_terms": "Lake Owen,Troy Minerals Inc.,TROY",
    "master_gid": 5032,
    "date": "2025-02-20T12:30:00.000Z",
    "tags": "USA|Wyoming|||Project Acquisition",
    "image_id": null,
    "hidden": false,
    "company_id": 2141,
    "provider": "accesswire",
    "excerpt": "VANCOUVER, BC /ACCESS Newswire/ February 20, 2025 /Troy Minerals Inc. (&quot;Troy&quot; or the &quot;Company&quot;) (CSE:TROY)(OTCQB:TROYF)(FSE:VJ3) is pleased to announce the strategic expansion of its Lake Owen Project, located 50km southwest of Laramie, Wyoming, USA (the &quot;Property&quot;) by adding a significant number of neighboring claims. The new Claims staking process followed",
    "is_regulatory": false,
    "refined_tags": [],
    "ftp_filename": null,
    "company_name": "Troy Minerals Inc.",
    "exchange": "CSE",
    "root_ticker": "TROY",
    "project_name": "Lake Owen",
    "gid": 5032,
    "location": "Wyoming, United States",
    "plan_id": null,
    "description_text": "VANCOUVER, BC / ACCESS Newswire / February 20, 2025 / Troy Minerals Inc. (\"Troy\" or the \"Company\") (CSE:TROY)(OTCQB:TROYF)(FSE:VJ3) is pleased to announce the strategic expansion of its Lake Owen Project, located 50km southwest of Laramie, Wyoming, USA (the \"Property\") by adding a significant number of neighboring claims. The new Claims staking process followed the conclusion of the Company's first phase geological program that took place in H2 2024. The exploration program consisted of first pass geological mapping, diamond drilling and sampling. Results of this program will be reported in due course. \"Our Lake Owen Project compliments our overall portfolio of strategic exploration assets in Canada, USA and Mongolia.\" stated Yannis Tsitos, President of Troy Minerals. \" The addition of 85 claims on our Wyoming holdings, now brings our total number of claims to 185 and was made to increase the amount of potentially fertile magnetite-rich gabbro in the Property. Our near-term goals are to explore the layered mafic intrusion for vanadium and titanium mineralization, which also includes ‘reef' style PGE (Platinum Group Elements) mineralization as noted by historic work and drilling on the Property by Chevron and, the potential for basal massive Cu and Ni sulfide mineralization along the Proterozoic- contact.\" The Lake Owen Project has effectively been doubled and now comprises 1433 hectares from 714 hectares before the new staking. The newly acquired claims are accessible through existing infrastructure and cover strategic land adjacent to the existing Lake Owen claims (see Figure 1 below) Figure 1. Lake Owen Project Expanded Claims The Lake Owen Project, is a Proterozoic layered mafic intrusion complex with a long history of sporadic exploration primarily for Platinum Group Elements. Similar in style to the Stillwater Complex in USA and the Merensky Reef of South Africa, the Lake Owen Complex is a highly prospective North American based target with a strong potential for significant vanadium, titanium, PGE and associated metals mineralization. The Lake Owen Complex is the focus of the US government's critical minerals strategy resulting in a recently completed high resolution airborne Magnetic and Radiometric geophysical survey over the complex, which also covers the Company's property, and included ‘boots on the outcrop' mapping and sampling by the United States Geological Survey (\"USGS\"). Geologists from the USGS and Wyoming Geologic Survey (\"WGS\") recently visited the Property with Troy's Chief Geologist Bill Cronk. Their goals were to review the recently drilled core, log it themselves and select samples for petrologic studies including thin section analysis. Qualified Person The scientific and technical disclosure in this news release was approved by Ted VanderWart, P.Geo , a Qualified Person as defined in NI 43-101 and a consultant to the Company. About Troy Minerals Troy Minerals is a Canadian based publicly listed mining company focused on building shareholder value through acquisition, exploration, and development of strategically located \"critical\" mineral assets. Troy is aggressively advancing its projects within the silica (silicon), vanadium, and rare earths industries within regions that exhibit high and growing demand for such commodities, in both North America and Central-East Asia. The Company's primary objective is the near-term prospect of production with a vision of becoming a cash-flowing mining company to ultimately deliver tangible monetary value to shareholders, state, and local communities. ON BEHALF OF THE BOARD, Rana Vig | CEO & Director Telephone: 604-218-4766 Email: rana@ranavig.com Forward-Looking Statements Statement Regarding Forward-Looking Information: This release includes certain statements that may be deemed \"forward-looking statements\". All statements in this release, other than statements of historical facts, that address events or developments that Troy Resources Inc. (the \"Company\") expects to occur, are forward-looking statements. Forward-looking statements are statements that are not historical facts and are generally, but not always, identified by the words \"expects\", \"plans\", \"anticipates\", \"believes\", \"intends\", \"estimates\", \"projects\", \"potential\" and similar expressions, or that events or conditions \"will\", \"would\", \"may\", \"could\" or \"should\" occur. Although the Company believes the expectations expressed in such forward-looking statements are based on reasonable assumptions, such statements are not guarantees of future performance and actual results may differ materially from those in the forward-looking statements. Factors that could cause the actual results to differ materially from those in forward-looking statements include results of exploration activities may not show quality and quantity necessary for further exploration or future exploitation of minerals deposits, volatility of commodity prices, and continued availability of capital and financing, permitting and other approvals, and general economic, market or business conditions. Investors are cautioned that any such statements are not guarantees of future performance and actual results or developments may differ materially from those projected in the forward-looking statements. Forward-looking statements are based on the beliefs, estimates and opinions of the Company's management on the date the statements are made. Except as required by applicable securities laws, the Company undertakes no obligation to update these forward-looking statements in the event that management's beliefs, estimates or opinions, or other factors, should change. The Canadian Securities Exchange has not reviewed this press release and does not accept responsibility for the adequacy or accuracy of this news release. SOURCE: Troy Minerals Inc. View the original press release on ACCESS Newswire",
    "primary_commodity": "V"
  },
  "articleProject": {
    "gid": 5032,
    "project_name": "Lake Owen",
    "location": "Wyoming, United States"
  },
  "articleExchange": "CSE",
  "articleCompanyId": 2141,
  "articleTicker": "TROY",
  "articleCompanyName": "Troy Minerals Inc.",
  "allOtherCompanyProjects": [
    {
      "company_id": 2141,
      "gid": 4805,
      "project_name": "Ticktock",
      "location": "British Columbia, Canada"
    },
    {
      "company_id": 2141,
      "gid": 4804,
      "project_name": "Green Gold",
      "location": "British Columbia, Canada"
    },
    {
      "company_id": 2141,
      "gid": 5032,
      "project_name": "Lake Owen",
      "location": "Wyoming, United States"
    },
    {
      "company_id": 2141,
      "gid": 8930,
      "project_name": "Tsagaan Zalaa",
      "location": null
    },
    {
      "company_id": 2141,
      "gid": 5801,
      "project_name": "Lac Jacques",
      "location": "Quebec, Canada"
    },
    {
      "company_id": 2141,
      "gid": 6578,
      "project_name": "BC REE",
      "location": null
    },
    {
      "company_id": 2141,
      "gid": 7660,
      "project_name": "Table Mountain",
      "location": "British Columbia, Canada"
    }
  ],
  "allOtherCompanyNews": [
    {
      "id": 106924,
      "company_id": 2141,
      "title": "Troy Minerals Reports Drilling Results from the Lake Owen Project, Wyoming",
      "link": null,
      "date": "2025-06-04T12:00:00.000Z",
      "hidden": false
    },
    {
      "id": 105351,
      "company_id": 2141,
      "title": "Troy Minerals Reports Ongoing Geophysical Studies at the Lake Owen Project, Wyoming ",
      "link": null,
      "date": "2025-05-21T12:00:00.000Z",
      "hidden": false
    },
    {
      "id": 104793,
      "company_id": 2141,
      "title": "Troy Minerals Provides Projects Update",
      "link": null,
      "date": "2025-05-15T12:00:00.000Z",
      "hidden": false
    },
    {
      "id": 89624,
      "company_id": 2141,
      "title": "Troy Minerals Reports Drilling Results from the Lake Owen Project, Wyoming. Critical Minerals inclusive of Scandium (Rare Earths Element) Discovered",
      "link": "https://www.accessnewswire.com/newsroom/en/metals-and-mining/troy-minerals-reports-drilling-results-from-the-lake-owen-project-wyoming-critical-993100",
      "date": "2025-02-28T12:30:00.000Z",
      "hidden": false
    },
    {
      "id": 88618,
      "company_id": 2141,
      "title": "Troy Minerals Strategically Expands Its Lake Owen Project in Wyoming by 100%",
      "link": "https://www.accessnewswire.com/newsroom/en/metals-and-mining/troy-minerals-strategically-expands-its-lake-owen-project-in-wyoming-by-100-988251",
      "date": "2025-02-20T12:30:00.000Z",
      "hidden": false
    },
    {
      "id": 87585,
      "company_id": 2141,
      "title": "Troy Minerals Submits Mining License Application for Tsagaan Zalaa Silica Project in Mongolia",
      "link": "https://www.accessnewswire.com/newsroom/en/metals-and-mining/troy-minerals-submits-mining-license-application-for-tsagaan-zalaa-silica-project--983740",
      "date": "2025-02-12T13:00:00.000Z",
      "hidden": false
    },
    {
      "id": 87041,
      "company_id": 2141,
      "title": "Troy Minerals Reports Analytical Results from Table Mountain Silica Project, Identifying Broad High-Purity Zones",
      "link": "https://www.accessnewswire.com/newsroom/en/metals-and-mining/troy-minerals-reports-analytical-results-from-table-mountain-silica-project-identi-980583",
      "date": "2025-02-06T12:30:00.000Z",
      "hidden": false
    },
    {
      "id": 85946,
      "company_id": 2141,
      "title": "Troy Minerals Expands Table Mountain Silica Project",
      "link": "https://www.accessnewswire.com/newsroom/en/metals-and-mining/troy-minerals-expands-table-mountain-silica-project-975969",
      "date": "2025-01-30T13:00:00.000Z",
      "hidden": false
    },
    {
      "id": 82984,
      "company_id": 2141,
      "title": "Troy Minerals Announces Completion of $1.2 Million Private Placement",
      "link": "https://www.thenewswire.com/press-releases?id=1LYzF2ERY",
      "date": "2024-12-27T21:15:00.000Z",
      "hidden": false
    },
    {
      "id": 82506,
      "company_id": 2141,
      "title": "Troy Minerals Announces Private Placement",
      "link": "https://www.thenewswire.com/press-releases?id=1AlpFV39Y",
      "date": "2024-12-19T00:55:00.000Z",
      "hidden": false
    }
  ]
}
