{
  "article": {
    "id": 84727,
    "link": "https://www.accessnewswire.com/newsroom/en/metals-and-mining/south-star-battery-metals-announces-exercise-of-earn-in-and-acquisition-of-100-of-the-bamastar-graphite-project-in-coosa-county-alabama-971087",
    "title": "South Star Battery Metals Announces Exercise of Earn-in and Acquisition of 100% of the BamaStar Graphite Project in Coosa County, Alabama",
    "description": "<p><i><strong>THIS NEWS RELEASE IS NOT FOR DISTRIBUTION TO U.S. NEWSWIRE SERVICES FOR DISSEMINATION IN THE UNITED STATES</strong></i></p> <p><strong id=\"dateline\">VANCOUVER, BC / <a href='https://www.accessnewswire.com/'>ACCESS Newswire</a> / January 21, 2025 / </strong><a rel=\"nofollow\" href=\"https://pr.report/65gf\"><strong>South Star Battery Metals Corp.</strong></a> (&quot;<strong>South Star</strong>&quot; or the &quot;<strong>Company</strong>&quot;) <a rel=\"nofollow\" href=\"https://pr.report/65h0\">(TSXV:STS)</a><a rel=\"nofollow\" href=\"https://pr.report/65h1\">(OTCQB:STSBF)</a>, is pleased to announce that it has successfully exercised its right to earn-in 75% of the BamaStar Graphite Project (the &quot;Project&quot;), which was formerly named the Ceylon Graphite Project, located in Coosa County, Alabama. Per the terms of the binding earn-in agreement (the &quot;Agreement&quot;) (see <a rel=\"nofollow\" href=\"https://pr.report/65gi\">Dec 07, 2021 Press Release</a>), South Star successfully completed the following conditions to complete the 75% earn-in:</p><ul><li><p>The drilling, resource estimation and analysis needed to produce a NI 43-101 compliant Preliminary Economic Analysis (PEA) within three years (See <a rel=\"nofollow\" href=\"https://pr.report/65gj\">October 10, 2024 Press Release</a>).</p></li><li><p>Fund an annual minimum expenditure of C$250,000 (C$750,000 total) to earn 75% of the Project.</p></li><li><p>Extend or renew, as needed, the currently existing mineral leases and surface agreements on the Project to ensure they are valid for a period of a minimum of 12 months beyond the three-year term of the definitive earn-in period (<a rel=\"nofollow\" href=\"https://pr.report/65gk\">See March 05, 2024 Press Release</a>).</p></li></ul><p>Subsequently, all the Project partners (the &quot;CML Owners&quot;) exercised their vendor option to sell the remaining 25% of the Project to South Star for C$250,000 in common shares of South Star (the &quot; Shares&quot;), priced as per the terms of the Agreement. A total of 445,454 Shares are being issued pro rata to the CML Owners, subject to TSX Venture Exchange approval. On completion of the transfer of the mineral and surface rights to South Star, the Company will have 100% of the rights to the Project.</p><p>Richard Pearce, CEO of South Star commented, &quot;Our team continues to execute on our strategic goals of having a diversified portfolio of scalable, vertically integrated, graphite assets producing in stable, Tier 1 jurisdictions and a go-to-market commercial plan. Acquisition of 100% of BamaStar is an important strategic milestone as we move the Project forward quickly, and with the commencement of the upcoming feasibility study to be completed in partnership with the U.S. DoD Title III program.&quot;</p><p>Mr. Pearce continued, &quot;Looking ahead to 2025, South Star is poised for transformation, as we shift our focus from a project developer to a producing miner and integrated, industrial graphite processor in the Americas. We aim to leverage our first-mover advantage in onshore and near-shore, responsibly sourced graphite production, as well as continued strategic advancement into midstream and downstream products. Santa Cruz Mine, in Bahia Brazil, serves as our foundational asset as we ramp-up and scale high-quality, natural flake graphite production at a time when jurisdictions and companies are looking to derisk, diversify and strengthen supply chains. South Star is working hard to be a trusted supplier and innovator in ensuring certainty and reliability of supply of global graphite solutions for growth today, tomorrow and into the future. We would like to thank our BamaStar partners for their support and assistance during the past 3 years, and we wish them luck in their future endeavors.&quot;</p><p><i><strong># # #</strong></i></p><p><strong>About South Star Battery Metals Corp.</strong></p><p>South Star is a Canadian battery-metals project developer focused on the selective acquisition and development of near-term production projects in the Americas. South Star's Santa Cruz Graphite Project, located in Southern Bahia, Brazil is the first of a series of industrial- and battery-metals projects that will be put into production. Brazil is the second-largest graphite-producing region in the world with more than 80 years of continuous mining. Santa Cruz has at-surface mineralization in friable materials, and successful large-scale pilot-plant testing (&gt; 30 tonnes) has been completed. The results of the testing show that approximately 65% of graphite concentrate is +80 mesh with good recoveries and 95%-99% graphitic carbon (&quot;Cg&quot;). With excellent infrastructure and logistics, South Star Phase 1 is ramping up commercial production in 2025. Santa Cruz Phase 1 commercial production has a nameplate capacity of 12,000 tpy and is the first new graphite production in the Americas since 1996. Phase 2 production (25,000 tpy) is partially funded and planned for 2026, while Phase 3 (50,000 tpy) is scheduled for 2028.</p><p>South Star's second project in the development pipeline is strategically located in Alabama, U.S.A. in the center of a developing electric-vehicle, aerospace, and defense hub in the southeastern United States. The BamaStar Project includes a historic mine active during the First and Second World Wars. A NI 43-101 Preliminary Economic Assessment was filed on SEDAR+ in November 2024. Trenching, Phase 1 drilling, sampling, analysis, and preliminary metallurgical testing have been completed. The testing included a traditional crush/grind/flotation concentration circuit that achieved grades of approximately 94-99% Cg with approximately 90% recoveries. The vertically integrated production facilities include a mine and industrial concentrator in Coosa County, AL and a downstream value-add plant in Mobile, AL, which will be upgrading natural flake graphite concentrates from both Santa Cruz and BamaStar mines. South Star is executing on its plan to create a multi-asset, diversified battery-metals company with near-term operations in strategic jurisdictions. South Star trades on the TSX Venture Exchange under the symbol STS, and on the OTCQB under the symbol STSBF.</p><p>South Star is committed to a corporate culture, project execution plan and safe operations that embrace the highest standards of ESG principles, based on transparency, stakeholder engagement, ongoing education, and stewardship. To learn more, please visit the Company website at <a rel=\"nofollow\" href=\"https://pr.report/65gl\">http://www.southstarbatterymetals.com</a><u>.</u></p><p><i>This news release has been reviewed and approved for South Star by Richard Pearce, P.E., a &quot;Qualified Person&quot; under National Instrument 43-101 and President and CEO of South Star Battery Metals Corp.</i></p><p>On behalf of the South Star Board of Directors,</p><p><strong>MR. RICHARD L. PEARCE,</strong></p><p>President &amp; Chief Executive Officer</p><p><strong>For additional information, please contact:</strong></p><p><strong>South Star Investor Relations</strong><br /><strong>Email: </strong><a rel=\"nofollow\" href=\"mailto:invest@southstarbatterymetals.com\"><u>invest@southstarbatterymetals.com</u></a><br /><strong>Phone:</strong> +1 (604) 706-0212<br /><strong>Website: </strong><a rel=\"nofollow\" href=\"https://pr.report/65gm\">www.southstarbatterymetals.com</a></p><p><strong>Twitter: </strong><a rel=\"nofollow\" href=\"https://pr.report/65gn\">https://twitter.com/southstarbm</a><br /><strong>Facebook: </strong><a rel=\"nofollow\" href=\"https://pr.report/65go\">https://www.facebook.com/southstarbatterymetals</a><br /><strong>LinkedIn: </strong><a rel=\"nofollow\" href=\"https://pr.report/65gp\">https://www.linkedin.com/company/southstarbatterymetals/</a><br /><strong>YouTube: </strong><a rel=\"nofollow\" href=\"https://pr.report/65gq\">South Star Battery Metals - YouTube</a></p><p><strong>CAUTIONARY STATEMENT</strong></p><p><i>Neither the TSX Venture Exchange nor its Regulation Services Provider (as that term is defined in the policies of the TSX Venture Exchange) accepts responsibility for the adequacy or accuracy of this press release.</i></p><p><strong>Forward-Looking Information</strong></p><p><i>This press release contains &quot;forward-looking statements&quot; within the meaning of applicable securities legislation. Forward-looking statements relate to information that is based on assumptions of management, forecasts of future results, and estimates of amounts not yet determinable. Any statements that express predictions, expectations, beliefs, plans, projections, objectives, assumptions or future events or performance are not statements of historical fact and may be &quot;forward-looking statements&quot;. Forward-looking statements in this press release include, but are not limited to statements regarding production and scaling of operations at Santa Cruz, as well as advancing the Alabama project, and the Company's plans and expectations.</i></p><p><i>Forward-looking statements are subject to a variety of risks and uncertainties which could cause actual events or results to differ from those reflected in the forward-looking statements, including, without limitation: risks related to failure to obtain adequate financing on a timely basis and on acceptable terms; risks related to the outcome of legal proceedings; political and regulatory risks associated with mining and exploration; risks related to the maintenance of stock exchange listings; risks related to environmental regulation and liability; the potential for delays in exploration or development activities or the completion of feasibility studies; the uncertainty of profitability; risks and uncertainties relating to the interpretation of drill results, the geology, grade and continuity of mineral deposits; risks related to the inherent uncertainty of production and cost estimates and the potential for unexpected costs and expenses; results of prefeasibility and feasibility studies, and the possibility that future exploration, development or mining results will not be consistent with the Company's expectations; risks related to commodity price fluctuations; and other risks and uncertainties related to the Company's prospects, properties and business detailed elsewhere in the Company's disclosure record. Should one or more of these risks and uncertainties materialize, or should underlying assumptions prove incorrect, actual results may vary materially from those described in forward-looking statements. Investors are cautioned against attributing undue certainty to forward-looking statements. These forward-looking statements are made as of the date hereof and the Company does not assume any obligation to update or revise them to reflect new events or circumstances. Actual events or results could differ materially from the Company's expectations or projections.</i></p><p><i>This news release does not constitute an offer to sell or a solicitation of an offer to buy any of the securities in the United States. The securities have not been and will not be registered under the United States Securities Act of 1933, as amended (the &quot;<strong>U.S. Securities Act</strong>&quot;) or any state securities laws and may not be offered or sold within the United States or to U.S. Persons unless registered under the U.S. Securities Act and applicable state securities laws or an exemption from such registration is available.</i></p><p><strong>SOURCE: </strong>South Star Battery Metals Corp.</p><img src='https://app.accessnewswire.com/img.ashx?id=971087' width=\"100%\" /><br /><br />View the original <a href='https://www.accessnewswire.com/newsroom/en/metals-and-mining/south-star-battery-metals-announces-exercise-of-earn-in-and-acquisition-of-100-of-the-bamastar-graphite-project-in-coosa-county-alabama-971087'>press release</a> on ACCESS Newswire<br /><br />",
    "search_terms": "BamaStar,South Star Battery Metals Corp.,STS",
    "master_gid": 4230,
    "date": "2025-01-21T12:15:00.000Z",
    "tags": "|||Graphite|Project Acquisition",
    "image_id": null,
    "hidden": false,
    "company_id": 1746,
    "provider": "accesswire",
    "excerpt": "THIS NEWS RELEASE IS NOT FOR DISTRIBUTION TO U.S. NEWSWIRE SERVICES FOR DISSEMINATION IN THE UNITED STATESVANCOUVER, BC /ACCESS Newswire/ January 21, 2025 /South Star Battery Metals Corp.(&quot;South Star&quot; or the &quot;Company&quot;)(TSXV:STS)(OTCQB:STSBF), is pleased to announce that it has successfully exercised its right to earn-in 75% of the BamaStar Graphite",
    "is_regulatory": false,
    "refined_tags": [],
    "ftp_filename": null,
    "company_name": "South Star Battery Metals Corp.",
    "exchange": "TSXV",
    "root_ticker": "STS",
    "project_name": "BamaStar",
    "gid": 4230,
    "location": "Alabama, United States",
    "plan_id": null,
    "description_text": "THIS NEWS RELEASE IS NOT FOR DISTRIBUTION TO U.S. NEWSWIRE SERVICES FOR DISSEMINATION IN THE UNITED STATES VANCOUVER, BC / ACCESS Newswire / January 21, 2025 / South Star Battery Metals Corp. (\" South Star \" or the \" Company \") (TSXV:STS) (OTCQB:STSBF) , is pleased to announce that it has successfully exercised its right to earn-in 75% of the BamaStar Graphite Project (the \"Project\"), which was formerly named the Ceylon Graphite Project, located in Coosa County, Alabama. Per the terms of the binding earn-in agreement (the \"Agreement\") (see Dec 07, 2021 Press Release ), South Star successfully completed the following conditions to complete the 75% earn-in: The drilling, resource estimation and analysis needed to produce a NI 43-101 compliant Preliminary Economic Analysis (PEA) within three years (See October 10, 2024 Press Release ). Fund an annual minimum expenditure of C$250,000 (C$750,000 total) to earn 75% of the Project. Extend or renew, as needed, the currently existing mineral leases and surface agreements on the Project to ensure they are valid for a period of a minimum of 12 months beyond the three-year term of the definitive earn-in period ( See March 05, 2024 Press Release ). Subsequently, all the Project partners (the \"CML Owners\") exercised their vendor option to sell the remaining 25% of the Project to South Star for C$250,000 in common shares of South Star (the \" Shares\"), priced as per the terms of the Agreement. A total of 445,454 Shares are being issued pro rata to the CML Owners, subject to TSX Venture Exchange approval. On completion of the transfer of the mineral and surface rights to South Star, the Company will have 100% of the rights to the Project. Richard Pearce, CEO of South Star commented, \"Our team continues to execute on our strategic goals of having a diversified portfolio of scalable, vertically integrated, graphite assets producing in stable, Tier 1 jurisdictions and a go-to-market commercial plan. Acquisition of 100% of BamaStar is an important strategic milestone as we move the Project forward quickly, and with the commencement of the upcoming feasibility study to be completed in partnership with the U.S. DoD Title III program.\" Mr. Pearce continued, \"Looking ahead to 2025, South Star is poised for transformation, as we shift our focus from a project developer to a producing miner and integrated, industrial graphite processor in the Americas. We aim to leverage our first-mover advantage in onshore and near-shore, responsibly sourced graphite production, as well as continued strategic advancement into midstream and downstream products. Santa Cruz Mine, in Bahia Brazil, serves as our foundational asset as we ramp-up and scale high-quality, natural flake graphite production at a time when jurisdictions and companies are looking to derisk, diversify and strengthen supply chains. South Star is working hard to be a trusted supplier and innovator in ensuring certainty and reliability of supply of global graphite solutions for growth today, tomorrow and into the future. We would like to thank our BamaStar partners for their support and assistance during the past 3 years, and we wish them luck in their future endeavors.\" # # # About South Star Battery Metals Corp. South Star is a Canadian battery-metals project developer focused on the selective acquisition and development of near-term production projects in the Americas. South Star's Santa Cruz Graphite Project, located in Southern Bahia, Brazil is the first of a series of industrial- and battery-metals projects that will be put into production. Brazil is the second-largest graphite-producing region in the world with more than 80 years of continuous mining. Santa Cruz has at-surface mineralization in friable materials, and successful large-scale pilot-plant testing (> 30 tonnes) has been completed. The results of the testing show that approximately 65% of graphite concentrate is +80 mesh with good recoveries and 95%-99% graphitic carbon (\"Cg\"). With excellent infrastructure and logistics, South Star Phase 1 is ramping up commercial production in 2025. Santa Cruz Phase 1 commercial production has a nameplate capacity of 12,000 tpy and is the first new graphite production in the Americas since 1996. Phase 2 production (25,000 tpy) is partially funded and planned for 2026, while Phase 3 (50,000 tpy) is scheduled for 2028. South Star's second project in the development pipeline is strategically located in Alabama, U.S.A. in the center of a developing electric-vehicle, aerospace, and defense hub in the southeastern United States. The BamaStar Project includes a historic mine active during the First and Second World Wars. A NI 43-101 Preliminary Economic Assessment was filed on SEDAR+ in November 2024. Trenching, Phase 1 drilling, sampling, analysis, and preliminary metallurgical testing have been completed. The testing included a traditional crush/grind/flotation concentration circuit that achieved grades of approximately 94-99% Cg with approximately 90% recoveries. The vertically integrated production facilities include a mine and industrial concentrator in Coosa County, AL and a downstream value-add plant in Mobile, AL, which will be upgrading natural flake graphite concentrates from both Santa Cruz and BamaStar mines. South Star is executing on its plan to create a multi-asset, diversified battery-metals company with near-term operations in strategic jurisdictions. South Star trades on the TSX Venture Exchange under the symbol STS, and on the OTCQB under the symbol STSBF. South Star is committed to a corporate culture, project execution plan and safe operations that embrace the highest standards of ESG principles, based on transparency, stakeholder engagement, ongoing education, and stewardship. To learn more, please visit the Company website at http://www.southstarbatterymetals.com . This news release has been reviewed and approved for South Star by Richard Pearce, P.E., a \"Qualified Person\" under National Instrument 43-101 and President and CEO of South Star Battery Metals Corp. On behalf of the South Star Board of Directors, MR. RICHARD L. PEARCE, President & Chief Executive Officer For additional information, please contact: South Star Investor Relations Email: invest@southstarbatterymetals.com Phone: +1 (604) 706-0212 Website: www.southstarbatterymetals.com Twitter: https://twitter.com/southstarbm Facebook: https://www.facebook.com/southstarbatterymetals LinkedIn: https://www.linkedin.com/company/southstarbatterymetals/ YouTube: South Star Battery Metals - YouTube CAUTIONARY STATEMENT Neither the TSX Venture Exchange nor its Regulation Services Provider (as that term is defined in the policies of the TSX Venture Exchange) accepts responsibility for the adequacy or accuracy of this press release. Forward-Looking Information This press release contains \"forward-looking statements\" within the meaning of applicable securities legislation. Forward-looking statements relate to information that is based on assumptions of management, forecasts of future results, and estimates of amounts not yet determinable. Any statements that express predictions, expectations, beliefs, plans, projections, objectives, assumptions or future events or performance are not statements of historical fact and may be \"forward-looking statements\". Forward-looking statements in this press release include, but are not limited to statements regarding production and scaling of operations at Santa Cruz, as well as advancing the Alabama project, and the Company's plans and expectations. Forward-looking statements are subject to a variety of risks and uncertainties which could cause actual events or results to differ from those reflected in the forward-looking statements, including, without limitation: risks related to failure to obtain adequate financing on a timely basis and on acceptable terms; risks related to the outcome of legal proceedings; political and regulatory risks associated with mining and exploration; risks related to the maintenance of stock exchange listings; risks related to environmental regulation and liability; the potential for delays in exploration or development activities or the completion of feasibility studies; the uncertainty of profitability; risks and uncertainties relating to the interpretation of drill results, the geology, grade and continuity of mineral deposits; risks related to the inherent uncertainty of production and cost estimates and the potential for unexpected costs and expenses; results of prefeasibility and feasibility studies, and the possibility that future exploration, development or mining results will not be consistent with the Company's expectations; risks related to commodity price fluctuations; and other risks and uncertainties related to the Company's prospects, properties and business detailed elsewhere in the Company's disclosure record. Should one or more of these risks and uncertainties materialize, or should underlying assumptions prove incorrect, actual results may vary materially from those described in forward-looking statements. Investors are cautioned against attributing undue certainty to forward-looking statements. These forward-looking statements are made as of the date hereof and the Company does not assume any obligation to update or revise them to reflect new events or circumstances. Actual events or results could differ materially from the Company's expectations or projections. This news release does not constitute an offer to sell or a solicitation of an offer to buy any of the securities in the United States. The securities have not been and will not be registered under the United States Securities Act of 1933, as amended (the \" U.S. Securities Act \") or any state securities laws and may not be offered or sold within the United States or to U.S. Persons unless registered under the U.S. Securities Act and applicable state securities laws or an exemption from such registration is available. SOURCE: South Star Battery Metals Corp. View the original press release on ACCESS Newswire",
    "primary_commodity": "Graphite"
  },
  "articleProject": {
    "gid": 4230,
    "project_name": "BamaStar",
    "location": "Alabama, United States"
  },
  "articleExchange": "TSXV",
  "articleCompanyId": 1746,
  "articleTicker": "STS",
  "articleCompanyName": "South Star Battery Metals Corp.",
  "allOtherCompanyProjects": [
    {
      "company_id": 1746,
      "gid": 4230,
      "project_name": "BamaStar",
      "location": "Alabama, United States"
    },
    {
      "company_id": 1746,
      "gid": 3462,
      "project_name": "Santa Cruz",
      "location": "Bahia, Brazil"
    },
    {
      "company_id": 1746,
      "gid": 3813,
      "project_name": "Ceylon",
      "location": "Alabama, United States"
    }
  ],
  "allOtherCompanyNews": [
    {
      "id": 108243,
      "company_id": 1746,
      "title": "South Star Battery Metals Announces Selection by BNDES and FINEP for Strategic Minerals Funding Program, Maiden Shipment of Flake Graphite from the Santa Cruz Mine and Operational Update",
      "link": null,
      "date": "2025-06-17T00:08:02.000Z",
      "hidden": false
    },
    {
      "id": 106889,
      "company_id": 1746,
      "title": "South Star Battery Metals Announces Non-Brokered Private Placement",
      "link": null,
      "date": "2025-06-04T10:30:00.000Z",
      "hidden": false
    },
    {
      "id": 103805,
      "company_id": 1746,
      "title": "South Star Battery Metals Announces Production and Shipment of First Graphite Concentrates and Operational Update for the Santa Cruz Graphite Mine",
      "link": null,
      "date": "2025-05-07T10:45:00.000Z",
      "hidden": false
    },
    {
      "id": 90963,
      "company_id": 1746,
      "title": "South Star Battery Metals Enhances Board of Directors",
      "link": null,
      "date": "2025-03-13T10:30:00.000Z",
      "hidden": false
    },
    {
      "id": 89991,
      "company_id": 1746,
      "title": "South Star Battery Metals Announces Memorandum of Understanding with the University of Alabama - Alabama Mobility and Power Center to Develop Graphite Anode Materials",
      "link": "https://www.accessnewswire.com/newsroom/en/metals-and-mining/south-star-battery-metals-announces-memorandum-of-understanding-with-the-universit-995386",
      "date": "2025-03-04T11:30:00.000Z",
      "hidden": false
    },
    {
      "id": 97141,
      "company_id": 1746,
      "title": "South Star Battery Metals Announces Option, DSU and RSU Grants",
      "link": "https://app.quotemedia.com/data/downloadFiling?webmasterId=104408&ref=67ace677d621bf35450fd52b&type=PDFC&formType=002-002-001089-003001&formDescription=News+release&dateFiled=2025-02-12",
      "date": "2025-02-12T18:20:39.000Z",
      "hidden": false
    },
    {
      "id": 84727,
      "company_id": 1746,
      "title": "South Star Battery Metals Announces Exercise of Earn-in and Acquisition of 100% of the BamaStar Graphite Project in Coosa County, Alabama",
      "link": "https://www.accessnewswire.com/newsroom/en/metals-and-mining/south-star-battery-metals-announces-exercise-of-earn-in-and-acquisition-of-100-of-the-bamastar-graphite-project-in-coosa-county-alabama-971087",
      "date": "2025-01-21T12:15:00.000Z",
      "hidden": false
    },
    {
      "id": 83538,
      "company_id": 1746,
      "title": "South Star Battery Metals Announces Closing of Final Tranche of Upsized Private Placement Raising Gross Proceeds of US$3M",
      "link": "https://www.accesswire.com/964874/south-star-battery-metals-announces-closing-of-final-tranche-of-upsized-private-placement-raising-gross-proceeds-of-us3m",
      "date": "2025-01-08T12:15:00.000Z",
      "hidden": false
    },
    {
      "id": 82794,
      "company_id": 1746,
      "title": "South Star Battery Metals Announces Upsize of Non-Brokered Private Placement to Raise Up to US$3.20M, Extends Closing and Amended and Restated Stream Agreement",
      "link": "https://www.accesswire.com/958730/south-star-battery-metals-announces-upsize-of-non-brokered-private-placement-to-raise-up-to-us320m-extends-closing-and-amended-and-restated-stream-agreement",
      "date": "2024-12-23T12:15:00.000Z",
      "hidden": false
    },
    {
      "id": 82632,
      "company_id": 1746,
      "title": "South Star Battery Metals Announces Closing of Tranche 2 of Non-Brokered Private Placement",
      "link": "https://www.accesswire.com/957745/south-star-battery-metals-announces-closing-of-tranche-2-of-non-brokered-private-placement",
      "date": "2024-12-19T22:30:00.000Z",
      "hidden": false
    }
  ]
}
