{
  "article": {
    "id": 85723,
    "link": "https://contentapi.cision.com/api/v1.0/releases/20250129C5296",
    "title": "Black Mammoth Metals Options the High-Grade Clover Gold Property in Nevada",
    "description": "\n\n<p><span class=\"legendSpanClass\"><span class=\"xn-location\">VANCOUVER, BC</span></span>, <span class=\"legendSpanClass\"><span class=\"xn-chron\">Jan. 29, 2025</span></span> /CNW/ - <b>Black Mammoth Metals Corporation</b> (TSXV: BMM) (OTC: LQRCF)<b> (\"Black Mammoth\" or the \"Company\")</b> is pleased to announce that Antelope Creek Gold Corporation (\"Antelope Creek\"), a wholly owned subsidiary of Black Mammoth, has entered into an option agreement (the \"Agreement\") dated <span class=\"xn-chron\">January 8, 2025</span>, with Nevada Select Royalty, Inc. (the \"Vendor\") to acquire a 100% interest in 47 unpatented lode claims and the Company has recently completed staking of an additional 41 unpatented lode claims (the \"Claims\") covering approximately 708 hectares (1750 acres) and is called the Clover Gold property (\"Clover\" or the \"Property\").</p>\n<p><b>Claims:<br></br></b>The Property is located 16 kms west of the town of <span class=\"xn-location\">Midas</span>, along the southwest flank of the Snowstorm Mountains, in <span class=\"xn-location\">Elko County</span>, <span class=\"xn-location\">NE Nevada</span>. There is good access to the Property by the graded <span class=\"xn-location\">Midas</span>-<span class=\"xn-location\">Tuscarora</span> gravel road and the Claims are managed by the Bureau of Land Management with no difficulties permitting the recent drilling programs.</p>\n<p><b>Mineralization:<br></br></b>Faulting on the Property strike NNW and ENE, including a large reverse fault striking NNW (the \"Structure\"), dipping 40-45 degrees east on the surface, containing medium grained quartz-adularia veins and breccia filings. Most high-grade Au values in drill holes are spatially associated with nearby quartz veining but in several holes the high-grade intercepts are associated with little or no veining. Silver-gold ratios in most of the high-grade intercepts are around 1:1 although some holes contain up to 231 g/t Ag with Au of 0.68 g/t.</p>\n<p><b>Drill Intercepts/Targeting:<br></br></b>Where drill holes have targeted the down-dip extension of the 45 degree east dipping portion of the Structure, high-grade intercepts in drill holes usually occur immediately below and/or at the base of the Structure, suggesting that near-vertical, feeder structures may be controlling the high-grade intercepts.</p>\n<p>On the Property, high-grade intercepts along the southern portion of the north-south trending Structure include:</p>\n<ul type=\"disc\"><li><b>23.03 g/t Au over 9.75 meters </b><i>@ 102 meters</i> <i>depth</i>- JK-4C</li><li><b>20.17 g/t Au &amp; 23.6 g/t Ag over 3.0 meters </b><i>@ 211 meters depth<b> – </b></i>USCV012</li><li>7.15 g/t Au over 7.62 meters @<i> 88 meters depth</i> - CL-13 discovery hole</li></ul><p>Intercepts along the northern portion of the Structure include:</p>\n<ul type=\"disc\"><li>6.59 g/t Au over 3.04 meters @ <i>178 meters depth</i> - JK-14</li><li>2.375 g/t Au and 237.5 g/t Ag over 1.52 meters  <i>@ 143 meters</i> <i>depth</i>– JK-23</li></ul><p>Towards the northern extent of Claims, and along trend with the Structure, high-grade banded chalcedonic-<b>quartz vein boulders assay up to 29 g/t Au and 281 g/t Ag</b> and are geochemically similar to the veins being mined in the <span class=\"xn-location\">Midas</span> district.</p>\n<div class=\"PRN_ImbeddedAssetReference\" id=\"DivAssetPlaceHolder2327\"><p><a href=\"https://mma.prnewswire.com/media/2608277/Black_Mammoth_Metals_Corp_Black_Mammoth_Metals%C2%A0Options_the_High_.html\" rel=\"nofollow\" target=\"_blank\"><img alt=\"Drilling at Clover in 2008 – Yamana Gold Inc. (CNW Group/Black Mammoth Metals Corp)\" src=\"https://mma.prnewswire.com/media/2608277/Black_Mammoth_Metals_Corp_Black_Mammoth_Metals%C2%A0Options_the_High_.jpg?p=original\" title=\"Drilling at Clover in 2008 – Yamana Gold Inc. (CNW Group/Black Mammoth Metals Corp)\"></img></a></p>\n</div><p><i>Drilling at Clover in 2008 – Yamana Gold Inc.</i></p>\n<p><b>Past Operators:<br></br></b>Past operators at Clover include Romarco (JK drill holes), Placer Amex, <span class=\"xn-location\">Echo Bay</span> (CL drill holes), Meridian/Yamana (USCV drill holes), Amax, <span class=\"xn-location\">Nassau</span> and Atna.</p>\n<p><b>Geology<br></br></b>The Property occurs along the west margin of the Northern Nevada Rift. Other deposits and districts with a similar regional setting include <span class=\"xn-location\">Midas</span>, Ivanhoe and Mule Canyon. The large sediment-hosted Au deposits at Twin Creeks and Getchell are located 16-24 kms to the west. The Property is underlain by volcanic rocks of mid-Miocene age. Basaltic andesite flows are recognized along with the Clover rhyolite and \"green\" pumice-lithic tuff and lacustrine sedimentary and tuffaceous rocks that comprise the remaining older units. As mapped by the USGS and confirmed by later detailed work, these rocks are the time-stratigraphic equivalents to rocks that host bonanza veins in the <span class=\"xn-location\">Midas</span> district. High-grade drill intercepts on the Property occur mainly within the Clover rhyolite which is often moderately to strongly silicified with low level Au over a broad area.</p>\n<p><b>Acquisition Terms (in USD):<br></br></b>Under the terms of the Agreement, Antelope Creek may purchase a 100% interest in the Property by making an aggregate of <span class=\"xn-money\">$185,000</span> in cash payments in accordance with the following schedule:</p>\n<p><b><u>Payment Date            Cash Payment           Status</u></b></p>\n<p>At signing                     $7,500                          Paid</p>\n<p>1<sup>st</sup> anniversary             <span class=\"xn-money\">$15</span>,000                       -</p>\n<p>2<sup>nd</sup> anniversary            <span class=\"xn-money\">$30</span>,000                       -</p>\n<p>3<sup>rd</sup> anniversary             <span class=\"xn-money\">$65,000</span>                       -</p>\n<p><u>4<sup>th</sup> anniversary             $67,500 -______ </u></p>\n<p><b>Total:                          <span class=\"xn-money\">$185,000</span>                                 </b></p>\n<p>The Vendor will retain a 2.5% NSR and the Optionee will reimburse the Vendor for claims staking costs in addition to the associated BLM and County filing fees (paid).</p>\n<p>There are no work commitment amounts, finder's fees or share compensation in connection with Clover Agreement.</p>\n<p><b>About Black Mammoth Metals Corporation: </b></p>\n<p>In the past 12 months, Black Mammoth Metals acquired a 100% interest in:</p>\n<ul type=\"disc\"><li><b>Coleman Canyon property, <span class=\"xn-location\">Elko County, NV</span>,</b></li><li><b>Leadore Silver-Lead property</b>, <span class=\"xn-location\">Lemhi County, ID</span>,</li><li><b>East Reveille Gold property</b>, <span class=\"xn-location\">Nye County, NV</span>,</li><li><b><span class=\"xn-person\">America Mine Gold</span> property</b>, <span class=\"xn-location\">San Bernardino, CA</span>,</li><li><b>Quito Gold property</b>, <span class=\"xn-location\">Lander County, NV</span></li><li><b>South Ravenswood</b> <b>District</b>, <span class=\"xn-location\">Lander County NV</span>,</li><li><b>Callaghan Gold District</b>, <span class=\"xn-location\">Lander County NV.</span></li></ul><p>At the Company's 100% owned, 1,213 hectare (2,997 acre) <b>Happy Cat Gold property</b>, <span class=\"xn-location\">Lander County, NV</span>, an approximate 4 square kilometre area is identified as being hydrothermally altered. Structural modelling suggests the density of the alteration and its' density contrast relative to the host rock is typical to that of alteration zones present at other <span class=\"xn-location\">Carlin</span>-type deposits in northern <span class=\"xn-location\">Nevada</span>. The alteration encompasses an area where northerly trending high-angle faults intersect indicated NW-trending re-activated faults that are known to be of age and orientation as ore-controlling faults occurring at other <span class=\"xn-location\">Carlin</span>-type deposits. The Company intends to drill approximately <span class=\"xn-money\">1500m</span> in <span class=\"xn-chron\">January 2025</span> to further understand the structure and stratigraphy. The required permit and bond are in place.</p>\n<p>Black Mammoth also has a 100% interest in the <b>Blanco Creek Gold property</b> in the Elk Creek Mining District, central <span class=\"xn-location\">Idaho</span>, which hosts three historic underground mines along 3,550 meters (11,644 feet) of strike on the north-east trending regional <span class=\"xn-person\">Blanco Shear Zone</span>. Exploration by two previous operators identified a geological target for the Blanco Creek property in the order of 1.70 to 2.48 million tons, grading 0.20 to 0.33 oz/ton Au (1.54 to 2.24 million tonnes, grading 6.85 to 11.31 g/tonne Au); see the Company's press release dated <span class=\"xn-chron\">February 14, 2017</span>.</p>\n<p><i>Black Mammoth cautions investors to note the potential quantity and grade of the geological target are conceptual in nature. A qualified person has not completed sufficient work to classify the geological target as mineral resources as defined by NI 43-101, and it is uncertain if future exploration will result in the target being delineated as mineral resources.</i></p>\n<p><span class=\"xn-person\">Mark J. Abrams</span>, CPG #11451, a Qualified Person as defined under National Instrument 43-101 - <i>Standards of Disclosure for Mineral Projects</i> (\"<b>NI 43-101</b>\") and director of Black Mammoth, has reviewed and approved the technical content in this release. Historical information contained in this news release cannot be relied upon as Mr. Abrams, the Company's Qualified Person, has not prepared or verified the historical information.</p>\n<p>On behalf of the board,</p>\n<p>\"Dustin Henderson\"</p>\n<p><span class=\"xn-person\">Dustin Henderson</span>, BBA<br></br>President &amp; CEO</p>\n<p><i>This press release contains forward-looking statements and forward-looking information (collectively, \"forward looking statements\") within the meaning of applicable securities laws. All statements, other than statements of historical fact, included herein, including statements regarding the Company's completion of the Transaction and related transactions are forward-looking statements. Forward-looking statements are typically identified by words such as: believe, expect, anticipate, intend, estimate, postulate and similar expressions or are those which, by their nature, refer to future events. Although the Company believes that such statements are reasonable, there can be no assurance that such statements will prove to be accurate, and actual results and future events could differ materially from those anticipated in such statements. The Company cautions investors that any forward-looking statements by the Company are not guarantees of future performance, and that actual results may differ materially from those in forward-looking statements. Important factors that could cause actual events and results to differ materially from the Company's expectations include that the requisite corporate and TSXV for the Transaction may not be obtained; that the Company or IDA Mining, as applicable, may be unable to satisfy any or all closing conditions necessary for the completion of the Transaction; and other risks that are customary to transactions of this nature. Trading in the securities of the Company should be considered highly speculative. All of the Company's public disclosure filings may be accessed via</i> <i><a href=\"http://www.sedarplus.ca\" rel=\"nofollow\">www.sedarplus.ca</a></i> <i>and readers are urged to review these materials, including the latest technical reports filed with respect to the Company's mineral properties.</i></p>\n<p><i>Neither TSX Venture Exchange nor its Regulation Services Provider (as that term is defined in the policies of the TSX Venture Exchange) accepts responsibility for the adequacy or accuracy of this release.</i></p>\n\n<div class=\"PRN_ImbeddedAssetReference\" id=\"DivAssetPlaceHolder0\">\n                    <p>\n                            <a href=\"https://mma.prnewswire.com/media/2608278/Black_Mammoth_Metals_Corp_Black_Mammoth_Metals%C2%A0Options_the_High_.html\" rel=\"nofollow\" target=\"_blank\">\n                        <img alt=\"Black Mammoth Metals Corporation logo (CNW Group/Black Mammoth Metals Corp)\" src=\"https://mma.prnewswire.com/media/2608278/Black_Mammoth_Metals_Corp_Black_Mammoth_Metals%C2%A0Options_the_High_.jpg\" title=\"Black Mammoth Metals Corporation logo (CNW Group/Black Mammoth Metals Corp)\"></img>\n                            </a>\n                    </p>\n\n</div>\n<p>SOURCE  Black Mammoth Metals Corp</p>\n<img alt=\"\" src=\"https://rt.newswire.ca/rt.gif?NewsItemId=C5296&amp;Transmission_Id=202501290915CANADANWCANADAPR_C5296&amp;DateId=20250129\" style=\"border:0px; width:1px; height:1px;\"></img>\n\n",
    "search_terms": "Clover,Black Mammoth Metals Corp.,BMM",
    "master_gid": 9712,
    "date": "2025-01-29T14:15:00.000Z",
    "tags": "USA|Nevada||Gold|Project Acquisition",
    "image_id": null,
    "hidden": false,
    "company_id": 1153,
    "provider": "cision",
    "excerpt": "VANCOUVER, BC,Jan. 29, 2025/CNW/ -Black Mammoth Metals Corporation(TSXV: BMM) (OTC: LQRCF)(\"Black Mammoth\" or the \"Company\")is pleased to announce that Antelope Creek Gold Corporation (\"Antelope Creek\"), a wholly owned subsidiary of Black Mammoth, has entered into an option agreement (the \"Agreement\") datedJanuary 8, 2025, with Nevada Select Royalty, Inc. (the \"Vendor\")",
    "is_regulatory": false,
    "refined_tags": null,
    "ftp_filename": null,
    "company_name": "Nevada Select",
    "exchange": "TSXV",
    "root_ticker": "BMM",
    "project_name": "Clover",
    "gid": 9712,
    "location": "Nevada, United States",
    "plan_id": null,
    "description_text": "VANCOUVER, BC , Jan. 29, 2025 /CNW/ - Black Mammoth Metals Corporation (TSXV: BMM) (OTC: LQRCF) (\"Black Mammoth\" or the \"Company\") is pleased to announce that Antelope Creek Gold Corporation (\"Antelope Creek\"), a wholly owned subsidiary of Black Mammoth, has entered into an option agreement (the \"Agreement\") dated January 8, 2025 , with Nevada Select Royalty, Inc. (the \"Vendor\") to acquire a 100% interest in 47 unpatented lode claims and the Company has recently completed staking of an additional 41 unpatented lode claims (the \"Claims\") covering approximately 708 hectares (1750 acres) and is called the Clover Gold property (\"Clover\" or the \"Property\"). Claims: The Property is located 16 kms west of the town of Midas , along the southwest flank of the Snowstorm Mountains, in Elko County , NE Nevada . There is good access to the Property by the graded Midas - Tuscarora gravel road and the Claims are managed by the Bureau of Land Management with no difficulties permitting the recent drilling programs. Mineralization: Faulting on the Property strike NNW and ENE, including a large reverse fault striking NNW (the \"Structure\"), dipping 40-45 degrees east on the surface, containing medium grained quartz-adularia veins and breccia filings. Most high-grade Au values in drill holes are spatially associated with nearby quartz veining but in several holes the high-grade intercepts are associated with little or no veining. Silver-gold ratios in most of the high-grade intercepts are around 1:1 although some holes contain up to 231 g/t Ag with Au of 0.68 g/t. Drill Intercepts/Targeting: Where drill holes have targeted the down-dip extension of the 45 degree east dipping portion of the Structure, high-grade intercepts in drill holes usually occur immediately below and/or at the base of the Structure, suggesting that near-vertical, feeder structures may be controlling the high-grade intercepts. On the Property, high-grade intercepts along the southern portion of the north-south trending Structure include: 23.03 g/t Au over 9.75 meters @ 102 meters depth - JK-4C 20.17 g/t Au & 23.6 g/t Ag over 3.0 meters @ 211 meters depth – USCV012 7.15 g/t Au over 7.62 meters @ 88 meters depth - CL-13 discovery hole Intercepts along the northern portion of the Structure include: 6.59 g/t Au over 3.04 meters @ 178 meters depth - JK-14 2.375 g/t Au and 237.5 g/t Ag over 1.52 meters @ 143 meters depth – JK-23 Towards the northern extent of Claims, and along trend with the Structure, high-grade banded chalcedonic- quartz vein boulders assay up to 29 g/t Au and 281 g/t Ag and are geochemically similar to the veins being mined in the Midas district. Drilling at Clover in 2008 – Yamana Gold Inc. Past Operators: Past operators at Clover include Romarco (JK drill holes), Placer Amex, Echo Bay (CL drill holes), Meridian/Yamana (USCV drill holes), Amax, Nassau and Atna. Geology The Property occurs along the west margin of the Northern Nevada Rift. Other deposits and districts with a similar regional setting include Midas , Ivanhoe and Mule Canyon. The large sediment-hosted Au deposits at Twin Creeks and Getchell are located 16-24 kms to the west. The Property is underlain by volcanic rocks of mid-Miocene age. Basaltic andesite flows are recognized along with the Clover rhyolite and \"green\" pumice-lithic tuff and lacustrine sedimentary and tuffaceous rocks that comprise the remaining older units. As mapped by the USGS and confirmed by later detailed work, these rocks are the time-stratigraphic equivalents to rocks that host bonanza veins in the Midas district. High-grade drill intercepts on the Property occur mainly within the Clover rhyolite which is often moderately to strongly silicified with low level Au over a broad area. Acquisition Terms (in USD): Under the terms of the Agreement, Antelope Creek may purchase a 100% interest in the Property by making an aggregate of $185,000 in cash payments in accordance with the following schedule: Payment Date            Cash Payment           Status At signing                     $7,500                          Paid 1 st anniversary $15 ,000                       - 2 nd anniversary $30 ,000                       - 3 rd anniversary $65,000 - 4 th anniversary             $67,500 -______ Total: $185,000 The Vendor will retain a 2.5% NSR and the Optionee will reimburse the Vendor for claims staking costs in addition to the associated BLM and County filing fees (paid). There are no work commitment amounts, finder's fees or share compensation in connection with Clover Agreement. About Black Mammoth Metals Corporation: In the past 12 months, Black Mammoth Metals acquired a 100% interest in: Coleman Canyon property, Elko County, NV , Leadore Silver-Lead property , Lemhi County, ID , East Reveille Gold property , Nye County, NV , America Mine Gold property , San Bernardino, CA , Quito Gold property , Lander County, NV South Ravenswood District , Lander County NV , Callaghan Gold District , Lander County NV. At the Company's 100% owned, 1,213 hectare (2,997 acre) Happy Cat Gold property , Lander County, NV , an approximate 4 square kilometre area is identified as being hydrothermally altered. Structural modelling suggests the density of the alteration and its' density contrast relative to the host rock is typical to that of alteration zones present at other Carlin -type deposits in northern Nevada . The alteration encompasses an area where northerly trending high-angle faults intersect indicated NW-trending re-activated faults that are known to be of age and orientation as ore-controlling faults occurring at other Carlin -type deposits. The Company intends to drill approximately 1500m in January 2025 to further understand the structure and stratigraphy. The required permit and bond are in place. Black Mammoth also has a 100% interest in the Blanco Creek Gold property in the Elk Creek Mining District, central Idaho , which hosts three historic underground mines along 3,550 meters (11,644 feet) of strike on the north-east trending regional Blanco Shear Zone . Exploration by two previous operators identified a geological target for the Blanco Creek property in the order of 1.70 to 2.48 million tons, grading 0.20 to 0.33 oz/ton Au (1.54 to 2.24 million tonnes, grading 6.85 to 11.31 g/tonne Au); see the Company's press release dated February 14, 2017 . Black Mammoth cautions investors to note the potential quantity and grade of the geological target are conceptual in nature. A qualified person has not completed sufficient work to classify the geological target as mineral resources as defined by NI 43-101, and it is uncertain if future exploration will result in the target being delineated as mineral resources. Mark J. Abrams , CPG #11451, a Qualified Person as defined under National Instrument 43-101 - Standards of Disclosure for Mineral Projects (\" NI 43-101 \") and director of Black Mammoth, has reviewed and approved the technical content in this release. Historical information contained in this news release cannot be relied upon as Mr. Abrams, the Company's Qualified Person, has not prepared or verified the historical information. On behalf of the board, \"Dustin Henderson\" Dustin Henderson , BBA President & CEO This press release contains forward-looking statements and forward-looking information (collectively, \"forward looking statements\") within the meaning of applicable securities laws. All statements, other than statements of historical fact, included herein, including statements regarding the Company's completion of the Transaction and related transactions are forward-looking statements. Forward-looking statements are typically identified by words such as: believe, expect, anticipate, intend, estimate, postulate and similar expressions or are those which, by their nature, refer to future events. Although the Company believes that such statements are reasonable, there can be no assurance that such statements will prove to be accurate, and actual results and future events could differ materially from those anticipated in such statements. The Company cautions investors that any forward-looking statements by the Company are not guarantees of future performance, and that actual results may differ materially from those in forward-looking statements. Important factors that could cause actual events and results to differ materially from the Company's expectations include that the requisite corporate and TSXV for the Transaction may not be obtained; that the Company or IDA Mining, as applicable, may be unable to satisfy any or all closing conditions necessary for the completion of the Transaction; and other risks that are customary to transactions of this nature. Trading in the securities of the Company should be considered highly speculative. All of the Company's public disclosure filings may be accessed via www.sedarplus.ca and readers are urged to review these materials, including the latest technical reports filed with respect to the Company's mineral properties. Neither TSX Venture Exchange nor its Regulation Services Provider (as that term is defined in the policies of the TSX Venture Exchange) accepts responsibility for the adequacy or accuracy of this release. SOURCE  Black Mammoth Metals Corp",
    "primary_commodity": "Au"
  },
  "articleProject": {
    "gid": 9712,
    "project_name": "Clover",
    "location": "Nevada, United States"
  },
  "articleExchange": "TSXV",
  "articleCompanyId": 1153,
  "articleTicker": "BMM",
  "articleCompanyName": "Black Mammoth Metals Corp.",
  "allOtherCompanyProjects": [
    {
      "company_id": 1153,
      "gid": 4437,
      "project_name": "Blanco Creek",
      "location": "Idaho, United States"
    },
    {
      "company_id": 1153,
      "gid": 10775,
      "project_name": "Big Bear",
      "location": "Arizona, United States"
    },
    {
      "company_id": 1153,
      "gid": 10776,
      "project_name": "Zulu",
      "location": "Arizona, United States"
    },
    {
      "company_id": 1153,
      "gid": 10777,
      "project_name": "Northern Star",
      "location": "Arizona, United States"
    },
    {
      "company_id": 1153,
      "gid": 9342,
      "project_name": "East Reveille",
      "location": "Nevada, United States"
    },
    {
      "company_id": 1153,
      "gid": 9343,
      "project_name": "Callaghan",
      "location": "Nevada, United States"
    },
    {
      "company_id": 1153,
      "gid": 9344,
      "project_name": "Quito",
      "location": "Nevada, United States"
    },
    {
      "company_id": 1153,
      "gid": 9345,
      "project_name": "Happy Cat",
      "location": "Nevada, United States"
    },
    {
      "company_id": 1153,
      "gid": 9712,
      "project_name": "Clover",
      "location": "Nevada, United States"
    },
    {
      "company_id": 1153,
      "gid": 9540,
      "project_name": "Coleman Canyon",
      "location": "Nevada, United States"
    },
    {
      "company_id": 1153,
      "gid": 9153,
      "project_name": " Leadore",
      "location": "Idaho, United States"
    },
    {
      "company_id": 1153,
      "gid": 10212,
      "project_name": "Diamond Jim",
      "location": "Nevada, United States"
    },
    {
      "company_id": 1153,
      "gid": 10211,
      "project_name": "St. Elmo",
      "location": "Nevada, United States"
    },
    {
      "company_id": 1153,
      "gid": 10258,
      "project_name": "Coal Canyon",
      "location": "Nevada, United States"
    }
  ],
  "allOtherCompanyNews": [
    {
      "id": 108165,
      "company_id": 1153,
      "title": "Black Mammoth Metals Stakes Claims and Samples Copper and Gold at Big Bear, Northern Star and Zulu Properties, AZ",
      "link": "https://contentapi.cision.com/api/v1.0/releases/20250616C3054",
      "date": "2025-06-16T13:13:00.000Z",
      "hidden": false
    },
    {
      "id": 106244,
      "company_id": 1153,
      "title": "Black Mammoth Metals Reports Rock Chip Sampling Results at Coal Canyon, NV",
      "link": "https://contentapi.cision.com/api/v1.0/releases/20250528C0077",
      "date": "2025-05-28T13:15:00.000Z",
      "hidden": false
    },
    {
      "id": 104650,
      "company_id": 1153,
      "title": "Black Mammoth Metals Reports Drill Results at Callaghan Gold Property, NV",
      "link": "https://contentapi.cision.com/api/v1.0/releases/20250514C9946",
      "date": "2025-05-14T13:15:00.000Z",
      "hidden": false
    },
    {
      "id": 99844,
      "company_id": 1153,
      "title": "Black Mammoth Metals Leases Coal Canyon Gold Property, NV",
      "link": "https://contentapi.cision.com/api/v1.0/releases/20250415C5484",
      "date": "2025-04-15T13:15:00.000Z",
      "hidden": false
    },
    {
      "id": 99032,
      "company_id": 1153,
      "title": "Black Mammoth Metals Consolidates Claims at St. Elmo High-Grade Gold and Diamond Jim Silver-Lead-Zinc-Antimony Properties, NV",
      "link": "https://contentapi.cision.com/api/v1.0/releases/20250408C6286",
      "date": "2025-04-08T13:15:00.000Z",
      "hidden": false
    },
    {
      "id": 90136,
      "company_id": 1153,
      "title": "Black Mammoth Metals Samples up to 7.6% TREO with 26% NdPr at Leadore, Idaho",
      "link": "https://contentapi.cision.com/api/v1.0/releases/20250305C9326",
      "date": "2025-03-05T14:41:00.000Z",
      "hidden": false
    },
    {
      "id": 87475,
      "company_id": 1153,
      "title": "Black Mammoth Metals to Drill Rast and Cottonwood Targets at Callaghan Gold District in Nevada",
      "link": "https://contentapi.cision.com/api/v1.0/releases/20250211C9457",
      "date": "2025-02-11T19:25:00.000Z",
      "hidden": false
    },
    {
      "id": 85723,
      "company_id": 1153,
      "title": "Black Mammoth Metals Options the High-Grade Clover Gold Property in Nevada",
      "link": "https://contentapi.cision.com/api/v1.0/releases/20250129C5296",
      "date": "2025-01-29T14:15:00.000Z",
      "hidden": false
    },
    {
      "id": 83425,
      "company_id": 1153,
      "title": "Black Mammoth Metals Acquires Coleman Canyon Gold Property in Nevada",
      "link": "https://contentapi.cision.com/api/v1.0/releases/20250107C9698",
      "date": "2025-01-07T14:15:00.000Z",
      "hidden": false
    },
    {
      "id": 83231,
      "company_id": 1153,
      "title": "Black Mammoth Metals to Drill Stratigraphic Holes at Happy Cat Property",
      "link": "https://contentapi.cision.com/api/v1.0/releases/20250103C9429",
      "date": "2025-01-03T21:00:00.000Z",
      "hidden": false
    }
  ]
}