{
  "article": {
    "id": 76287,
    "link": "https://www.accesswire.com/935796/stillwater-critical-minerals-enters-letter-of-intent-to-sell-the-duke-island-cu-ni-pge-project-in-alaska-to-granite-creek-copper",
    "title": "Stillwater Critical Minerals Enters Letter of Intent to Sell the Duke Island Cu-Ni-PGE Project in Alaska to Granite Creek Copper",
    "description": "<p><strong id=\"dateline\">VANCOUVER, BC / ACCESSWIRE / October 28, 2024 / </strong><strong>Stillwater Critical Minerals Corp. (TSX.V:PGE)(OTCQB:PGEZF)(FSE:J0G) </strong>(the \"Company\" or \"Stillwater\") is pleased to announce that it has entered into a Letter of Intent (\"LOI\") with the objective of signing a definitive agreement (\"Agreement\") whereby fellow Metallic Group of Companies member Granite Creek Copper (\"Granite Creek\") will acquire a 90% interest in the Duke Island copper-nickel-platinum-palladium (\"Cu-Ni-PGE\") project via a non-arm's length, all-share transaction.</p><p>Stillwater President and CEO, Michael Rowley, stated, \"We are very pleased to enter this agreement with Granite Creek and look forward to both supporting, and benefiting from, its progress in advancing Duke Island's demonstrated nickel, copper, and platinum group element mineralization in addition to its carbon sequestration and geologic hydrogen generation potential. Our strong relationship with Dr. Greeshma Gadikota and the Cornell University team has expanded to now include Granite Creek and together they are well-positioned to advance the project in the nascent field of geologic hydrogen while giving Stillwater additional exposure to North American critical minerals The Company remains focused on its flagship Stillwater West project in Montana's iconic Stillwater mining district, including the previously announced carbon sequestration and geologic hydrogen studies, with the vision of becoming a cornerstone of the US' critical mineral supply chain.\"</p><p><strong>About Duke Island</strong></p><p>Duke Island enjoys excellent proximity to infrastructure, being approximately 52 km southeast of Ketchikan and 90 km northwest of Prince Rupert, BC. Located within the Alexander Platinum belt, the project consists of 31 unpatented claims that control a core area of Cu-Ni-PGE sulphide mineralization discovered by previous companies. While several prospective zones have been discovered based on geologic mapping, surface geochemistry, surface and airborne geophysics, only one of these zones has been tested to date with 3,434 meters of drilling in 16 holes. None of the holes are thought to have penetrated the prospective basal contact of the intrusion where the highest grades of Cu-Ni-PGE sulphide mineralization are inferred to occur.</p><p><strong>Terms of the Letter of Intent</strong></p><p>The LOI, signed October 23, 2024, outlines the proposed terms of the definitive Agreement. Under the LOI, Granite Creek will acquire a 90% interest in the Duke Island project, subject to a 1% Net Smelter Royalty (\"NSR\"), under the following terms:</p><ul style=\"list-style-type:disc;\"><li><p>Issuance of share units to Stillwater with a deemed aggregate value of C$150,000 over a 3-year period subject to regulatory share pricing minimums;</p></li><li><p>Units to consist of a share and a partial or full warrant with final warrant terms yet to be determined;</p></li><li><p>Minimum work commitment of C$500,000 over 3 years;</p></li><li><p>1% NSR royalty to Stillwater with buy-down to 0.5% for C$1,000,000;</p></li><li><p>The Agreement will provide for the formation of a joint venture based on the then legal and beneficial ownership levels in Duke Island; and</p></li><li><p>The Agreement is subject to final approval by the TSX Venture Exchange.</p></li></ul><p>Although the Company is confident in its ability to complete the transaction it cautions that the final terms of the transaction are subject to change.</p><p>The proposed transaction is non-arms length due to Granite Creek and Stillwater having a common director in Mr. Michael Rowley.</p><p><strong>About Stillwater Critical Minerals Corp.</strong></p><p>Stillwater Critical Minerals (TSX.V:PGE)(OTCQB:PGEZF)(FSE:J0G) is a mineral exploration company focused on its flagship Stillwater West Ni-PGE-Cu-Co + Au project in the iconic and famously productive Stillwater mining district in Montana, USA. With the addition of two renowned Bushveld and Platreef geologists to the team and strategic investments by Glencore plc, the Company is well positioned to advance the next phase of large-scale critical mineral supply from this world-class American district, building on past production of nickel, copper, and chromium, and the on-going production of platinum group, nickel, and other metals by neighboring Sibanye-Stillwater. An expanded NI 43-101 mineral resource estimate, released January 2023, positions Stillwater West with the largest nickel resource in an active US mining district as part of a compelling suite of nine minerals now listed as critical in the USA.</p><p>Stillwater also holds the high-grade Black Lake-Drayton Gold project adjacent to Nexgold Mining's development-stage Goliath Gold Complex in northwest Ontario, currently under an earn-in agreement with Heritage Mining, and the Kluane PGE-Ni-Cu-Co critical minerals project on trend with Nickel Creek Platinum‘s Wellgreen deposit in Canada‘s Yukon Territory.</p><p><strong>About Granite Creek Copper</strong></p><p>Granite Creek Copper, a member of the Metallic Group of Companies, is focused on the exploration and development of critical minerals projects in North America. The Company's projects consist of its flagship 177 square kilometer Carmacks project in the Minto copper district of Canada's Yukon Territory on trend with the formerly operating, high-grade Minto copper-gold mine and the advanced stage LS molybdenum project and the Star copper-nickel-PGM project, both located in central British Columbia. More information about Granite Creek Copper can be viewed on the Company's website at <a rel=\"nofollow\" href=\"https://pr.report/3t8b\">www.gcxcopper.com</a>.</p><p><strong>FOR FURTHER INFORMATION, PLEASE CONTACT:</strong></p><p>Michael Rowley, President, CEO & Director - Stillwater Critical Minerals</p><p>Email: <a rel=\"nofollow\" href=\"mailto:info@criticalminerals.com\">info@criticalminerals.com</a> Phone: (604) 357 4790<br>Web: <a rel=\"nofollow\" href=\"https://pr.report/3t14\">http://criticalminerals.com</a> Toll Free: (888) 432 0075</p><p><strong>Qualified Person</strong></p><p>Debbie James P.Geo, has reviewed and approved the technical information related to the Cu-Ni-PGM potential of the acquired projects contained in this news release. Ms. James is a Qualified Person as defined in NI 43-101. She is not independent of the Company because she has received employment income from the Company and holds stock in the Company.</p><p><strong>Forward-Looking Statements</strong></p><p>This news release includes certain statements that may be deemed \"forward-looking statements\". All statements in this release, other than statements of historical facts including, without limitation, statements regarding potential mineralization, historic production, estimation of mineral resources, the realization of mineral resource estimates, interpretation of prior exploration and potential exploration results, the timing and success of exploration activities generally, the timing and results of future resource estimates, permitting time lines, metal prices and currency exchange rates, availability of capital, government regulation of exploration operations, environmental risks, reclamation, title, and future plans and objectives of the company are forward-looking statements that involve various risks and uncertainties. Although Stillwater Critical Minerals believes the expectations expressed in such forward-looking statements are based on reasonable assumptions, such statements are not guarantees of future performance and actual results or developments may differ materially from those in the forward-looking statements. Forward-looking statements are based on a number of material factors and assumptions. Factors that could cause actual results to differ materially from those in forward-looking statements include failure to obtain necessary approvals, unsuccessful exploration results, changes in project parameters as plans continue to be refined, results of future resource estimates, future metal prices, availability of capital and financing on acceptable terms, general economic, market or business conditions, risks associated with regulatory changes, defects in title, availability of personnel, materials and equipment on a timely basis, accidents or equipment breakdowns, uninsured risks, delays in receiving government approvals, unanticipated environmental impacts on operations and costs to remedy same, and other exploration or other risks detailed herein and from time to time in the filings made by the companies with securities regulators. Readers are cautioned that mineral resources that are not mineral reserves do not have demonstrated economic viability. Mineral exploration and development of mines is an inherently risky business. Accordingly, the actual events may differ materially from those projected in the forward-looking statements. For more</p><p><strong>SOURCE: </strong>Stillwater Critical Minerals Corp.</p><br><br>View the original <a href='https://www.accesswire.com/935796/stillwater-critical-minerals-enters-letter-of-intent-to-sell-the-duke-island-cu-ni-pge-project-in-alaska-to-granite-creek-copper'>press release</a> on accesswire.com<br><br>",
    "search_terms": "Duke Island,Stillwater Critical Minerals ,PGE",
    "master_gid": 8850,
    "date": "2024-10-28T11:45:00.000Z",
    "tags": "|||Copper,Nickel|Project Acquisition",
    "image_id": null,
    "hidden": false,
    "company_id": 1391,
    "provider": "accesswire",
    "excerpt": "VANCOUVER, BC / ACCESSWIRE / October 28, 2024 /Stillwater Critical Minerals Corp. (TSX.V:PGE)(OTCQB:PGEZF)(FSE:J0G)(the \"Company\" or \"Stillwater\") is pleased to announce that it has entered into a Letter of Intent (\"LOI\") with the objective of signing a definitive agreement (\"Agreement\") whereby fellow Metallic Group of Companies member Granite Creek Copper (\"Granite",
    "is_regulatory": false,
    "refined_tags": null,
    "ftp_filename": null,
    "company_name": "Granite Creek Copper",
    "exchange": "TSXV",
    "root_ticker": "PGE",
    "project_name": "Duke Island",
    "gid": 8850,
    "location": null,
    "plan_id": "companytier2",
    "description_text": "VANCOUVER, BC / ACCESSWIRE / October 28, 2024 / Stillwater Critical Minerals Corp. (TSX.V:PGE)(OTCQB:PGEZF)(FSE:J0G) (the \"Company\" or \"Stillwater\") is pleased to announce that it has entered into a Letter of Intent (\"LOI\") with the objective of signing a definitive agreement (\"Agreement\") whereby fellow Metallic Group of Companies member Granite Creek Copper (\"Granite Creek\") will acquire a 90% interest in the Duke Island copper-nickel-platinum-palladium (\"Cu-Ni-PGE\") project via a non-arm's length, all-share transaction. Stillwater President and CEO, Michael Rowley, stated, \"We are very pleased to enter this agreement with Granite Creek and look forward to both supporting, and benefiting from, its progress in advancing Duke Island's demonstrated nickel, copper, and platinum group element mineralization in addition to its carbon sequestration and geologic hydrogen generation potential. Our strong relationship with Dr. Greeshma Gadikota and the Cornell University team has expanded to now include Granite Creek and together they are well-positioned to advance the project in the nascent field of geologic hydrogen while giving Stillwater additional exposure to North American critical minerals The Company remains focused on its flagship Stillwater West project in Montana's iconic Stillwater mining district, including the previously announced carbon sequestration and geologic hydrogen studies, with the vision of becoming a cornerstone of the US' critical mineral supply chain.\" About Duke Island Duke Island enjoys excellent proximity to infrastructure, being approximately 52 km southeast of Ketchikan and 90 km northwest of Prince Rupert, BC. Located within the Alexander Platinum belt, the project consists of 31 unpatented claims that control a core area of Cu-Ni-PGE sulphide mineralization discovered by previous companies. While several prospective zones have been discovered based on geologic mapping, surface geochemistry, surface and airborne geophysics, only one of these zones has been tested to date with 3,434 meters of drilling in 16 holes. None of the holes are thought to have penetrated the prospective basal contact of the intrusion where the highest grades of Cu-Ni-PGE sulphide mineralization are inferred to occur. Terms of the Letter of Intent The LOI, signed October 23, 2024, outlines the proposed terms of the definitive Agreement. Under the LOI, Granite Creek will acquire a 90% interest in the Duke Island project, subject to a 1% Net Smelter Royalty (\"NSR\"), under the following terms: Issuance of share units to Stillwater with a deemed aggregate value of C$150,000 over a 3-year period subject to regulatory share pricing minimums; Units to consist of a share and a partial or full warrant with final warrant terms yet to be determined; Minimum work commitment of C$500,000 over 3 years; 1% NSR royalty to Stillwater with buy-down to 0.5% for C$1,000,000; The Agreement will provide for the formation of a joint venture based on the then legal and beneficial ownership levels in Duke Island; and The Agreement is subject to final approval by the TSX Venture Exchange. Although the Company is confident in its ability to complete the transaction it cautions that the final terms of the transaction are subject to change. The proposed transaction is non-arms length due to Granite Creek and Stillwater having a common director in Mr. Michael Rowley. About Stillwater Critical Minerals Corp. Stillwater Critical Minerals (TSX.V:PGE)(OTCQB:PGEZF)(FSE:J0G) is a mineral exploration company focused on its flagship Stillwater West Ni-PGE-Cu-Co + Au project in the iconic and famously productive Stillwater mining district in Montana, USA. With the addition of two renowned Bushveld and Platreef geologists to the team and strategic investments by Glencore plc, the Company is well positioned to advance the next phase of large-scale critical mineral supply from this world-class American district, building on past production of nickel, copper, and chromium, and the on-going production of platinum group, nickel, and other metals by neighboring Sibanye-Stillwater. An expanded NI 43-101 mineral resource estimate, released January 2023, positions Stillwater West with the largest nickel resource in an active US mining district as part of a compelling suite of nine minerals now listed as critical in the USA. Stillwater also holds the high-grade Black Lake-Drayton Gold project adjacent to Nexgold Mining's development-stage Goliath Gold Complex in northwest Ontario, currently under an earn-in agreement with Heritage Mining, and the Kluane PGE-Ni-Cu-Co critical minerals project on trend with Nickel Creek Platinum‘s Wellgreen deposit in Canada‘s Yukon Territory. About Granite Creek Copper Granite Creek Copper, a member of the Metallic Group of Companies, is focused on the exploration and development of critical minerals projects in North America. The Company's projects consist of its flagship 177 square kilometer Carmacks project in the Minto copper district of Canada's Yukon Territory on trend with the formerly operating, high-grade Minto copper-gold mine and the advanced stage LS molybdenum project and the Star copper-nickel-PGM project, both located in central British Columbia. More information about Granite Creek Copper can be viewed on the Company's website at www.gcxcopper.com . FOR FURTHER INFORMATION, PLEASE CONTACT: Michael Rowley, President, CEO & Director - Stillwater Critical Minerals Email: info@criticalminerals.com Phone: (604) 357 4790 Web: http://criticalminerals.com Toll Free: (888) 432 0075 Qualified Person Debbie James P.Geo, has reviewed and approved the technical information related to the Cu-Ni-PGM potential of the acquired projects contained in this news release. Ms. James is a Qualified Person as defined in NI 43-101. She is not independent of the Company because she has received employment income from the Company and holds stock in the Company. Forward-Looking Statements This news release includes certain statements that may be deemed \"forward-looking statements\". All statements in this release, other than statements of historical facts including, without limitation, statements regarding potential mineralization, historic production, estimation of mineral resources, the realization of mineral resource estimates, interpretation of prior exploration and potential exploration results, the timing and success of exploration activities generally, the timing and results of future resource estimates, permitting time lines, metal prices and currency exchange rates, availability of capital, government regulation of exploration operations, environmental risks, reclamation, title, and future plans and objectives of the company are forward-looking statements that involve various risks and uncertainties. Although Stillwater Critical Minerals believes the expectations expressed in such forward-looking statements are based on reasonable assumptions, such statements are not guarantees of future performance and actual results or developments may differ materially from those in the forward-looking statements. Forward-looking statements are based on a number of material factors and assumptions. Factors that could cause actual results to differ materially from those in forward-looking statements include failure to obtain necessary approvals, unsuccessful exploration results, changes in project parameters as plans continue to be refined, results of future resource estimates, future metal prices, availability of capital and financing on acceptable terms, general economic, market or business conditions, risks associated with regulatory changes, defects in title, availability of personnel, materials and equipment on a timely basis, accidents or equipment breakdowns, uninsured risks, delays in receiving government approvals, unanticipated environmental impacts on operations and costs to remedy same, and other exploration or other risks detailed herein and from time to time in the filings made by the companies with securities regulators. Readers are cautioned that mineral resources that are not mineral reserves do not have demonstrated economic viability. Mineral exploration and development of mines is an inherently risky business. Accordingly, the actual events may differ materially from those projected in the forward-looking statements. For more SOURCE: Stillwater Critical Minerals Corp. View the original press release on accesswire.com",
    "primary_commodity": "Cu"
  },
  "articleProject": {
    "gid": 8850,
    "project_name": "Duke Island",
    "location": null
  },
  "articleExchange": "TSXV",
  "articleCompanyId": 1391,
  "articleTicker": "PGE",
  "articleCompanyName": "Stillwater Critical Minerals ",
  "allOtherCompanyProjects": [
    {
      "company_id": 1391,
      "gid": 8850,
      "project_name": "Duke Island",
      "location": null
    },
    {
      "company_id": 1391,
      "gid": 3176,
      "project_name": "Stillwater West",
      "location": "Montana, United States"
    },
    {
      "company_id": 1391,
      "gid": 9627,
      "project_name": "Catalyst (Kluane)",
      "location": "Yukon, Canada"
    }
  ],
  "allOtherCompanyNews": [
    {
      "id": 107782,
      "company_id": 1391,
      "title": "Stillwater Critical Minerals Announces Brokered Offering for Gross Proceeds of up to C$6 Million",
      "link": null,
      "date": "2025-06-12T10:00:00.000Z",
      "hidden": false
    },
    {
      "id": 106076,
      "company_id": 1391,
      "title": "Stillwater Critical Minerals Announces Participation in THE Mining Investment Event of the North in Quebec City",
      "link": "https://golddiscovery.com/legacy/user/news_details/760131-pgeca-stillwater-critical-minerals-announces-participation-in-the-mining-investment-event-of-the-north-in-quebec-city",
      "date": "2025-05-28T11:00:00.000Z",
      "hidden": false
    },
    {
      "id": 100286,
      "company_id": 1391,
      "title": "Stillwater Critical Minerals Announces Grant of Long-Term Performance Incentives and Restricted Share Units",
      "link": null,
      "date": "2025-04-21T19:45:00.000Z",
      "hidden": false
    },
    {
      "id": 92488,
      "company_id": 1391,
      "title": "Stillwater Reports Multiple Large-Scale Polymetallic Magmatic Sulphide Targets From 2024 Geophysical Surveys in Montana's Historic Stillwater Mining District",
      "link": null,
      "date": "2025-03-26T11:30:00.000Z",
      "hidden": false
    },
    {
      "id": 92221,
      "company_id": 1391,
      "title": "Stillwater Critical Minerals Welcomes Executive Order to Prioritize and Accelerate Domestic Mining and Mineral Production in the United States of America",
      "link": null,
      "date": "2025-03-24T11:30:00.000Z",
      "hidden": false
    },
    {
      "id": 89118,
      "company_id": 1391,
      "title": "Stillwater Closes Additional Flow-Through Private Placement for the Kluane Critical Minerals Project in Yukon, Canada ",
      "link": "https://www.accessnewswire.com/newsroom/en/metals-and-mining/stillwater-closes-additional-flow-through-private-placement-for-the-kluane-critica-990958",
      "date": "2025-02-25T12:30:00.000Z",
      "hidden": false
    },
    {
      "id": 87431,
      "company_id": 1391,
      "title": "Stillwater Announces Closing of Flow-Through Private Placement for the Kluane Critical Minerals Project in Yukon, Canada",
      "link": "https://www.accessnewswire.com/newsroom/en/metals-and-mining/stillwater-announces-closing-of-flow-through-private-placement-for-the-kluane-crit-982935",
      "date": "2025-02-11T12:30:00.000Z",
      "hidden": false
    },
    {
      "id": 85449,
      "company_id": 1391,
      "title": "Stillwater Critical Minerals Receives Payment from Heritage Mining Under Terms of Earn-In Agreement for Drayton-Black Lake Gold Project in Ontario",
      "link": "https://www.accessnewswire.com/newsroom/en/metals-and-mining/stillwater-critical-minerals-receives-payment-from-heritage-mining-under-terms-of--974878",
      "date": "2025-01-28T12:30:00.000Z",
      "hidden": false
    },
    {
      "id": 84726,
      "company_id": 1391,
      "title": "Stillwater Announces Flow-Through Private Placement for the Kluane Critical Minerals Project in Yukon, Canada",
      "link": "https://www.accessnewswire.com/newsroom/en/metals-and-mining/stillwater-announces-flow-through-private-placement-for-the-kluane-critical-minerals-project-in-yukon-canada-971242",
      "date": "2025-01-21T12:00:00.000Z",
      "hidden": false
    },
    {
      "id": 83817,
      "company_id": 1391,
      "title": "Stillwater Critical Minerals Provides Update on U.S. Federal Funding Applications",
      "link": "https://www.accesswire.com/967468/stillwater-critical-minerals-provides-update-on-us-federal-funding-applications",
      "date": "2025-01-13T12:00:00.000Z",
      "hidden": false
    }
  ]
}