{
  "article": {
    "id": 34720,
    "link": "https://contentapi.cision.com/api/v1.0/releases/20230504C5138",
    "title": "North Peak Signs Definitive Agreement to Acquire Prospect Mountain Mine Complex in Silver-Gold-Lead District of Eureka, Nevada",
    "description": "\n\n<p class=\"prntar\"><a href=\"https://c212.net/c/link/?t=0&amp;l=en&amp;o=3856235-1&amp;h=2888048972&amp;u=https%3A%2F%2Fnorthpeakresources.com%2F&amp;a=www.northpeakresources.com\" rel=\"nofollow\" target=\"_blank\">www.northpeakresources.com</a><br></br>TSXVenture: NPR</p>\n<p><span class=\"legendSpanClass\"><span class=\"xn-location\">CALGARY, AB</span></span>, <span class=\"legendSpanClass\"><span class=\"xn-chron\">May 4, 2023</span></span> /CNW/ - <b>North Peak Resources Ltd.</b> (TSXV: NPR) (the \"<b>Company</b>\" or \"<b>North Peak</b>\") announces it has executed a binding, definitive agreement (the \"<b>Agreement</b>\") dated effective <span class=\"xn-chron\">May 2, 2023</span> with Solarljos LLC (\"<b>Solarljos</b>\") and Gullsil LLC of <span class=\"xn-location\">Nevada</span> and their respective members, for the acquisition of the Prospect Mountain Mine complex (the \"<b>Property</b>\") located in the <span class=\"xn-location\">Eureka</span> district of <span class=\"xn-location\">Nevada</span> (the \"<b>Transaction</b>\"). The Property is located in <span class=\"xn-location\">Nevada's</span> Battle Mountain Eureka trend, in an area known as the Southern Eureka Gold Belt and within the Ruby Hill lead gold and silver district. The Transaction involves the issuance of up to 8 million common shares of the Company in two phases – an initial tranche of 5 million common shares that acquires an 80% interest in the Property, and at the Company's discretion, an additional 3 million common shares to acquire the remaining 20% interest. The Transaction is arm's length, and its terms and conditions are summarized below.</p>\n<p>\"The Prospect Mountain Mine complex, with its extensive shaft and mine infrastructure sits squarely on the important geological structures driving today's <span class=\"xn-location\">Eureka</span> district exploration activity and will benefit from the various drilling and geophysics programs this historic property will receive for the first time,\" said <span class=\"xn-person\">Brian Hinchcliffe</span>, CEO &amp; President<b>.</b> \"Significantly our team, will be promptly coordinating the launch of these programs and we are looking forward to working with the Erickson's as we advance the Property.\"</p>\n<p>\"We regard the gold, silver and base metal potential at Prospect Mountain as immense\", said <span class=\"xn-person\">Ty Erickson</span>, Director of Solarljos and Gullsil LLC. \"We are excited to work with the North Peak team to realise this potential.\"</p>\n<div aria-level=\"3\" class=\"wcag-arialevel-3\" role=\"heading\" style=\"display: block; font-size: 1.17em; margin-block-start: 1em; margin-block-end: 1em; margin-inline-start: 0px; margin-inline-end: 0px; font-weight: bold; text-align: left;\"><b>Transaction and Agreement</b></div><p>The Agreement sets forth that a Nevada LLC will be created where the Company (through its <span class=\"xn-location\">Nevada</span> subsidiary) will hold initially, an 80% interest in that Nevada LLC (the <b>\"Initial Interest\"</b>) and Solarljos will hold the remaining 20% interest, and the mining claims and rights and related permits that constitute the Property will be transferred into the Nevada LLC (the date on which this is completed is referred to herein as the <b>\"Formation Date\"</b>). The Company's <span class=\"xn-location\">Nevada</span> subsidiary will act as manager for the Nevada LLC and operator of the Property. Solarljos will not be required to contribute any funds or assume any liabilities for the benefit of the Nevada LLC or in connection with exploration and operations at the Property on account of its 20% interest.</p>\n<p>As described above, the Company will acquire the Initial Interest by issuing 5,000,000 common shares to Solarljos. The Company has the right to acquire the remaining 20% interest held by Solarljos (the <b>\"Right\"</b>), provided it maintains its obligations under the Agreement (summarized below) and by issuing an additional 3,000,000 common shares to Solarljos. The Company will have until 90 days after the third anniversary of the Formation Date to exercise the Right. If the Company decides not to exercise the Right within this time period, then the Initial Interest is to be transferred to Solarljos, and Solarljos will in turn return to the Company the 5,000,000 common shares that have been issued to it.</p>\n<p>To maintain the Initial Interest:</p>\n<ul type=\"disc\"><li>the Company will undertake to complete a minimum three year exploration program at the Property where expenditures will total no less than <span class=\"xn-money\">US$1 million</span> per year;</li><li>the Company will make cash payments of <span class=\"xn-money\">US$385,000</span> in total per year, for each of the first three years following completion of the Transaction, with the first of the three payments to be made on the Formation Date; and</li><li>on the Formation Date, the Company will issue 340,000 common share purchase warrants to those persons designated by Solarljos, and such warrants will have a five-year term and are to be issued and priced in accordance with the Policies of the TSX Venture Exchange (the \"<b>TSXV</b>\") (or otherwise as required by the TSXV).</li></ul><p>In addition:</p>\n<ul type=\"disc\"><li>on the Formation Date, Solarljos will be granted a 1% NSR royalty on mineral production from the Property;</li><li>Solarljos will have the right to nominate one director to the Board of Directors of the Company, provided that it continues to hold at least 500,000 common shares of the Company;</li><li>the Company has the right to transfer its Initial Interest to Solarljos at any time prior to the exercise of the Right or the deadline to exercise the Right, with the result that its annual obligations described above will cease and the 5,000,000 common shares issued to Solarljos will be returned to the Company; and</li><li>Solarljos has a right of reversion in the event the obligations of the Company to maintain the Initial Interest, as described above, are not completed within the agreed deadlines, which if exercised would result in the Initial Interest being transferred to Solarljos, who would in turn, return to the Company the 5,000,000 common shares of the Company that have been issued to it.</li></ul><p>The other terms of the Agreement include representations and warranties, covenants and conditions that are customarily seen in agreements setting forth the terms of a transaction similar to the Transaction.</p>\n<div aria-level=\"3\" class=\"wcag-arialevel-3\" role=\"heading\" style=\"display: block; font-size: 1.17em; margin-block-start: 1em; margin-block-end: 1em; margin-inline-start: 0px; margin-inline-end: 0px; font-weight: bold; text-align: left;\"><b>About the Prospect Mountain Complex</b></div><ul type=\"disc\"><li>The Property lies in the Battle Mountain Eureka trend, in an area known as the Southern Eureka Gold Belt, where three styles of mineralization have been identified, Au only <span class=\"xn-location\">Carlin</span> style mineralization, Carbonate Replacement mineralization (CRD) and carbonate hosted Porphyry Related Skarn lead, zinc and gold mineralization associated with cretaceous intrusions. At the Property, the CRD mineralization is heavily oxidized to depths of at least <span class=\"xn-money\">610m</span> (2000ft) below the top of the ridge line (see Figure 1 below).</li><li>The Property is over 1,700 acres of high elevation lands and lies within the Ruby Hill lead gold and silver district which during the late 19<sup>th</sup> century was famous for its high-grade gold-silver-lead ores. Ore was first discovered at the Property in the early 1870's with limited production from the Diamond, Excelsior, Silver Conner, Deadbroke, and Metamoras mines, peaking in the 1890's. The mines were consolidated in the 1930's and sporadic small volume production continued into the 1980's.</li><li>Extensive underground workings are present on the Property, with approximately eleven miles (17.7 km) of adits, drifting and development (see Figure 2 below). Ground conditions are excellent and the workings and stopes are largely intact and accessible, despite their considerable age. Workings are accessed mainly through the Diamond Tunnel adit, which penetrates westwards into the side of the ridge at 7,900 ft (<span class=\"xn-money\">2408 m</span>) above mean sea level (amsl) and joins an extensive north south trending series of workings that access multiple historic stopes over a 5,500 ft (<span class=\"xn-money\">1676m</span>) strike, accessing the 3 shafts that exist on this main level. The shafts are open but no longer in use. Shaft 1 (500 feet depth) and Shaft 3 (770 feet depth) are both two compartment shafts, whilst Shaft 2 is a one compartment shaft (270 feet depth). The Diamond mine area is connected to the deeper Silver Connor tunnel by an inclined winze from the 300-650 ft level. Shaft 4 commences on the 650 ft level and extends for 576 ft (<span class=\"xn-money\">175.6m</span>) to 6640 ft amsl, giving over 2000 ft (<span class=\"xn-money\">609.6m</span>) of vertical extent to the historical workings. The mine is dry to the lowest levels of the workings due to it being above the water table.</li><li>Despite the 150-year history of exploration and mining at the Prospect Mountain Mine complex, the Property contains very limited recorded drilling. Some drilling and surface sampling occurred in 1990's and early 2000 by various optionees, but there has been no systematic modern drilling. The surface geochemistry undertaken by Homestake (2001-2003) successfully identified several multi-element surface geochemical anomalies on the western flank of Prospect ridge, as well as other areas. These have not been followed up and represent high priority exploration targets.</li><li>The Erickson family during their ownership of the Property have undertaken significant rehabilitation work to the Property including reopening the Diamond tunnel, as well as bringing water and power to the site. In addition, they completed a Plan of Operations which covers part of the Property (totalling 81 acres) and entitles an operator to pursue surface exploration, underground mining of up to 365,000 tons per annum and certain infrastructural works. It also includes a permit to extract water from a well and to build water containment facilities. </li></ul><p>The Transaction is subject to approval of the TSXV, which the Company is promptly seeking. It is not expected the TSXV will impose sponsorship requirements as part of its approval of the Transaction. No finders' fees are payable by the Company in connection with the Transaction. </p>\n<p>Mr. <span class=\"xn-person\">Mike Sutton</span>, P.Geo., a director of the Company, is the Qualified Person, as defined under National Instrument 43-101 - <i>Standards of Disclosure for Mineral Projects,</i> who reviewed and approved scientific and technical disclosure in this news release. The Qualified Person has not reviewed the mineral tenure, nor independently verified the legal status and ownership of the Property or any underlying property agreements.</p>\n<p><b>Investors are cautioned that there can be no assurance that the Transaction will be completed as proposed, or at all. In addition, the Company </b><b>can give no assurances at this time that the Property will fulfil the Company's business development goals described herein. </b><b>Trading in the securities of the Company should be considered highly speculative.</b></p>\n<p>The Company will issue additional press release related to approvals from the TSXV for the Transaction and other material information as it becomes available.</p>\n<div aria-level=\"3\" class=\"wcag-arialevel-3\" role=\"heading\" style=\"display: block; font-size: 1.17em; margin-block-start: 1em; margin-block-end: 1em; margin-inline-start: 0px; margin-inline-end: 0px; font-weight: bold; text-align: left;\"><b>About North Peak </b></div><p>The Company is a Canadian based gold exploration and development company that is listed on the TSX Venture Exchange under the symbol \"NPR\". The Company is focused on acquiring historic sites, with low cost producing gold and other metals properties, with near term production potential and 8+ year mine life in the northern hemisphere. </p>\n<p>Website: <a href=\"https://c212.net/c/link/?t=0&amp;l=en&amp;o=3856235-1&amp;h=13344297&amp;u=http%3A%2F%2Fwww.northpeakresources.com%2F&amp;a=www.northpeakresources.com\" rel=\"nofollow\" target=\"_blank\">www.northpeakresources.com</a></p>\n<div class=\"PRN_ImbeddedAssetReference\" id=\"DivAssetPlaceHolder1791\"><p><a href=\"https://mma.prnewswire.com/media/2069538/North_Peak_Resources_Ltd__North_Peak_Signs_Definitive_Agreement.html\" rel=\"nofollow\" target=\"_blank\"><img alt=\"Figure 1: Eureka Mountain Belt Historical mines and important occurrences. (CNW Group/North Peak Resources Ltd.)\" src=\"https://mma.prnewswire.com/media/2069538/North_Peak_Resources_Ltd__North_Peak_Signs_Definitive_Agreement.jpg?p=original\" title=\"Figure 1: Eureka Mountain Belt Historical mines and important occurrences. (CNW Group/North Peak Resources Ltd.)\"></img></a></p>\n</div><div class=\"PRN_ImbeddedAssetReference\" id=\"DivAssetPlaceHolder2756\"><p><a href=\"https://mma.prnewswire.com/media/2069539/North_Peak_Resources_Ltd__North_Peak_Signs_Definitive_Agreement.html\" rel=\"nofollow\" target=\"_blank\"><img alt=\"Figure 2: Prospect Mountain Mine complex underground workings (green) and stopes (red) projected to surface with names of main mine areas (NPR,2023) (CNW Group/North Peak Resources Ltd.)\" src=\"https://mma.prnewswire.com/media/2069539/North_Peak_Resources_Ltd__North_Peak_Signs_Definitive_Agreement.jpg?p=original\" title=\"Figure 2: Prospect Mountain Mine complex underground workings (green) and stopes (red) projected to surface with names of main mine areas (NPR,2023) (CNW Group/North Peak Resources Ltd.)\"></img></a></p>\n</div><p><b><i>The TSXV has in no way passed upon the merits of the Transaction and has neither approved nor disapproved the contents of this news release. </i></b></p>\n<p><b><i>CAUTIONARY STATEMENT REGARDING FORWARD-LOOKING STATEMENTS</i></b><i>:</i><i>This news release includes certain \"forward-looking statements\" under applicable Canadian securities legislation. Forward-looking statements include, but are not limited to, </i><i>statements with respect to </i><i>the ability to receive applicable approvals from the TSXV and applicable governmental authorities for the Transaction, the ability of the parties to complete the Transaction, the ability of the Company to complete the exploration programs as proposed and on the timelines suggested, estimates of mineralization from drilling and the potential for minerals and/or mineral resources and reserves, and </i><i>regarding the plans, intentions, beliefs, and current expectations of the Property and the Company </i><i>that may be described herein</i><i>. Forward-looking statements consist of statements that are not purely historical, including any statements regarding beliefs, plans, expectations or intentions regarding the future. Such information can generally be identified by the use of forwarding-looking wording such as \"may\", \"expect\", \"estimate\", \"anticipate\", \"intend\", \"believe\" and \"continue\" or the negative thereof or similar variations. Readers are cautioned not to place undue reliance on forward-looking statements, as there can be no assurance that the plans, intentions or expectations upon which they are based will occur. </i></p>\n<p><i>By their nature, forward-looking statements involve numerous assumptions, known and unknown risks and uncertainties, both general and specific, that contribute to the possibility that the predictions, estimates, forecasts, projections and other forward-looking statements will not occur. These assumptions, risks and uncertainties include, among other things, the state of the economy in general and capital markets in particular, </i><i>accuracy of assay results, geological interpretations from drilling results, timing and amount of capital expenditures; performance of available laboratory and other related services, future operating costs, and the historical basis for current estimates of potential quantities and grades of target zones, </i><i>as well as those risk factors discussed or referred to in the Company's Management's Discussion and Analysis for the year ended <span class=\"xn-chron\">December 31, 2022</span>, available at <a href=\"https://c212.net/c/link/?t=0&amp;l=en&amp;o=3856235-1&amp;h=219603588&amp;u=https%3A%2F%2Fwww.sedar.com%2F&amp;a=www.sedar.com\" rel=\"nofollow\" target=\"_blank\">www.sedar.com</a>, many of which are beyond the control of the Company. Forward-looking statements contained in this press release are expressly qualified by this cautionary statement.</i></p>\n<p><i>The forward-looking statements contained in this press release are made as of the date of this press release. Except as required by law, the Company disclaims any intention and assumes no obligation to update or revise any forward-looking statements, whether as a result of new information, future events or otherwise. Additionally, the Company undertakes no obligation to comment on the expectations of, or statements made by, third parties in respect of the matters discussed above.</i></p>\n<p><b><i>Neither the TSX Venture Exchange nor its Regulation Service Provider (as that term is defined in the policies of the TSX Venture Exchange) accepts responsibility for the adequacy or accuracy of this release.</i></b></p>\n\n<div class=\"PRN_ImbeddedAssetReference\" id=\"DivAssetPlaceHolder0\">\n                    <p>\n                            <a href=\"https://mma.prnewswire.com/media/2069542/North_Peak_Resources_Ltd__North_Peak_Signs_Definitive_Agreement.html\" rel=\"nofollow\" target=\"_blank\">\n                        <img alt=\"North Peak Resources Ltd. logo (CNW Group/North Peak Resources Ltd.)\" src=\"https://mma.prnewswire.com/media/2069542/North_Peak_Resources_Ltd__North_Peak_Signs_Definitive_Agreement.jpg\" title=\"North Peak Resources Ltd. logo (CNW Group/North Peak Resources Ltd.)\"></img>\n                            </a>\n                    </p>\n\n</div>\n<p>SOURCE  North Peak Resources Ltd.</p>\n<img alt=\"\" src=\"https://rt.newswire.ca/rt.gif?NewsItemId=C5138&amp;Transmission_Id=202305040730CANADANWCANADAPR_C5138&amp;DateId=20230504\" style=\"border:0px; width:1px; height:1px;\"></img>\n\n",
    "search_terms": "Prospect Mountain Mine complex,North Peak Resources Ltd.,NPR",
    "master_gid": 4571,
    "date": "2023-05-04T11:30:00.000Z",
    "tags": "USA|Nevada||Gold,Silver|Project Acquisition",
    "image_id": null,
    "hidden": false,
    "company_id": 1589,
    "provider": null,
    "excerpt": "www.northpeakresources.comTSXVenture: NPRCALGARY, AB,May 4, 2023/CNW/ -North Peak Resources Ltd.(TSXV: NPR) (the \"Company\" or \"North Peak\") announces it has executed a binding, definitive agreement (the \"Agreement\") dated effectiveMay 2, 2023with Solarljos LLC (\"Solarljos\") and Gullsil LLC ofNevadaand their respective members, for the acquisition of the Prospect Mountain Mine complex (the \"Property\") located",
    "is_regulatory": false,
    "refined_tags": [
      "Project Acquisition"
    ],
    "ftp_filename": null,
    "company_name": "North Peak Resources Ltd.",
    "exchange": "TSXV",
    "root_ticker": "NPR",
    "project_name": "Prospect Mountain Mine complex",
    "gid": 4571,
    "location": "Nevada, United States",
    "plan_id": null,
    "description_text": "www.northpeakresources.com TSXVenture: NPR CALGARY, AB , May 4, 2023 /CNW/ - North Peak Resources Ltd. (TSXV: NPR) (the \" Company \" or \" North Peak \") announces it has executed a binding, definitive agreement (the \" Agreement \") dated effective May 2, 2023 with Solarljos LLC (\" Solarljos \") and Gullsil LLC of Nevada and their respective members, for the acquisition of the Prospect Mountain Mine complex (the \" Property \") located in the Eureka district of Nevada (the \" Transaction \"). The Property is located in Nevada's Battle Mountain Eureka trend, in an area known as the Southern Eureka Gold Belt and within the Ruby Hill lead gold and silver district. The Transaction involves the issuance of up to 8 million common shares of the Company in two phases – an initial tranche of 5 million common shares that acquires an 80% interest in the Property, and at the Company's discretion, an additional 3 million common shares to acquire the remaining 20% interest. The Transaction is arm's length, and its terms and conditions are summarized below. \"The Prospect Mountain Mine complex, with its extensive shaft and mine infrastructure sits squarely on the important geological structures driving today's Eureka district exploration activity and will benefit from the various drilling and geophysics programs this historic property will receive for the first time,\" said Brian Hinchcliffe , CEO & President . \"Significantly our team, will be promptly coordinating the launch of these programs and we are looking forward to working with the Erickson's as we advance the Property.\" \"We regard the gold, silver and base metal potential at Prospect Mountain as immense\", said Ty Erickson , Director of Solarljos and Gullsil LLC. \"We are excited to work with the North Peak team to realise this potential.\" Transaction and Agreement The Agreement sets forth that a Nevada LLC will be created where the Company (through its Nevada subsidiary) will hold initially, an 80% interest in that Nevada LLC (the \"Initial Interest\" ) and Solarljos will hold the remaining 20% interest, and the mining claims and rights and related permits that constitute the Property will be transferred into the Nevada LLC (the date on which this is completed is referred to herein as the \"Formation Date\" ). The Company's Nevada subsidiary will act as manager for the Nevada LLC and operator of the Property. Solarljos will not be required to contribute any funds or assume any liabilities for the benefit of the Nevada LLC or in connection with exploration and operations at the Property on account of its 20% interest. As described above, the Company will acquire the Initial Interest by issuing 5,000,000 common shares to Solarljos. The Company has the right to acquire the remaining 20% interest held by Solarljos (the \"Right\" ), provided it maintains its obligations under the Agreement (summarized below) and by issuing an additional 3,000,000 common shares to Solarljos. The Company will have until 90 days after the third anniversary of the Formation Date to exercise the Right. If the Company decides not to exercise the Right within this time period, then the Initial Interest is to be transferred to Solarljos, and Solarljos will in turn return to the Company the 5,000,000 common shares that have been issued to it. To maintain the Initial Interest: the Company will undertake to complete a minimum three year exploration program at the Property where expenditures will total no less than US$1 million per year; the Company will make cash payments of US$385,000 in total per year, for each of the first three years following completion of the Transaction, with the first of the three payments to be made on the Formation Date; and on the Formation Date, the Company will issue 340,000 common share purchase warrants to those persons designated by Solarljos, and such warrants will have a five-year term and are to be issued and priced in accordance with the Policies of the TSX Venture Exchange (the \" TSXV \") (or otherwise as required by the TSXV). In addition: on the Formation Date, Solarljos will be granted a 1% NSR royalty on mineral production from the Property; Solarljos will have the right to nominate one director to the Board of Directors of the Company, provided that it continues to hold at least 500,000 common shares of the Company; the Company has the right to transfer its Initial Interest to Solarljos at any time prior to the exercise of the Right or the deadline to exercise the Right, with the result that its annual obligations described above will cease and the 5,000,000 common shares issued to Solarljos will be returned to the Company; and Solarljos has a right of reversion in the event the obligations of the Company to maintain the Initial Interest, as described above, are not completed within the agreed deadlines, which if exercised would result in the Initial Interest being transferred to Solarljos, who would in turn, return to the Company the 5,000,000 common shares of the Company that have been issued to it. The other terms of the Agreement include representations and warranties, covenants and conditions that are customarily seen in agreements setting forth the terms of a transaction similar to the Transaction. About the Prospect Mountain Complex The Property lies in the Battle Mountain Eureka trend, in an area known as the Southern Eureka Gold Belt, where three styles of mineralization have been identified, Au only Carlin style mineralization, Carbonate Replacement mineralization (CRD) and carbonate hosted Porphyry Related Skarn lead, zinc and gold mineralization associated with cretaceous intrusions. At the Property, the CRD mineralization is heavily oxidized to depths of at least 610m (2000ft) below the top of the ridge line (see Figure 1 below). The Property is over 1,700 acres of high elevation lands and lies within the Ruby Hill lead gold and silver district which during the late 19 th century was famous for its high-grade gold-silver-lead ores. Ore was first discovered at the Property in the early 1870's with limited production from the Diamond, Excelsior, Silver Conner, Deadbroke, and Metamoras mines, peaking in the 1890's. The mines were consolidated in the 1930's and sporadic small volume production continued into the 1980's. Extensive underground workings are present on the Property, with approximately eleven miles (17.7 km) of adits, drifting and development (see Figure 2 below). Ground conditions are excellent and the workings and stopes are largely intact and accessible, despite their considerable age. Workings are accessed mainly through the Diamond Tunnel adit, which penetrates westwards into the side of the ridge at 7,900 ft ( 2408 m ) above mean sea level (amsl) and joins an extensive north south trending series of workings that access multiple historic stopes over a 5,500 ft ( 1676m ) strike, accessing the 3 shafts that exist on this main level. The shafts are open but no longer in use. Shaft 1 (500 feet depth) and Shaft 3 (770 feet depth) are both two compartment shafts, whilst Shaft 2 is a one compartment shaft (270 feet depth). The Diamond mine area is connected to the deeper Silver Connor tunnel by an inclined winze from the 300-650 ft level. Shaft 4 commences on the 650 ft level and extends for 576 ft ( 175.6m ) to 6640 ft amsl, giving over 2000 ft ( 609.6m ) of vertical extent to the historical workings. The mine is dry to the lowest levels of the workings due to it being above the water table. Despite the 150-year history of exploration and mining at the Prospect Mountain Mine complex, the Property contains very limited recorded drilling. Some drilling and surface sampling occurred in 1990's and early 2000 by various optionees, but there has been no systematic modern drilling. The surface geochemistry undertaken by Homestake (2001-2003) successfully identified several multi-element surface geochemical anomalies on the western flank of Prospect ridge, as well as other areas. These have not been followed up and represent high priority exploration targets. The Erickson family during their ownership of the Property have undertaken significant rehabilitation work to the Property including reopening the Diamond tunnel, as well as bringing water and power to the site. In addition, they completed a Plan of Operations which covers part of the Property (totalling 81 acres) and entitles an operator to pursue surface exploration, underground mining of up to 365,000 tons per annum and certain infrastructural works. It also includes a permit to extract water from a well and to build water containment facilities. The Transaction is subject to approval of the TSXV, which the Company is promptly seeking. It is not expected the TSXV will impose sponsorship requirements as part of its approval of the Transaction. No finders' fees are payable by the Company in connection with the Transaction. Mr. Mike Sutton , P.Geo., a director of the Company, is the Qualified Person, as defined under National Instrument 43-101 - Standards of Disclosure for Mineral Projects, who reviewed and approved scientific and technical disclosure in this news release. The Qualified Person has not reviewed the mineral tenure, nor independently verified the legal status and ownership of the Property or any underlying property agreements. Investors are cautioned that there can be no assurance that the Transaction will be completed as proposed, or at all. In addition, the Company can give no assurances at this time that the Property will fulfil the Company's business development goals described herein. Trading in the securities of the Company should be considered highly speculative. The Company will issue additional press release related to approvals from the TSXV for the Transaction and other material information as it becomes available. About North Peak The Company is a Canadian based gold exploration and development company that is listed on the TSX Venture Exchange under the symbol \"NPR\". The Company is focused on acquiring historic sites, with low cost producing gold and other metals properties, with near term production potential and 8+ year mine life in the northern hemisphere. Website: www.northpeakresources.com The TSXV has in no way passed upon the merits of the Transaction and has neither approved nor disapproved the contents of this news release. CAUTIONARY STATEMENT REGARDING FORWARD-LOOKING STATEMENTS : This news release includes certain \"forward-looking statements\" under applicable Canadian securities legislation. Forward-looking statements include, but are not limited to, statements with respect to the ability to receive applicable approvals from the TSXV and applicable governmental authorities for the Transaction, the ability of the parties to complete the Transaction, the ability of the Company to complete the exploration programs as proposed and on the timelines suggested, estimates of mineralization from drilling and the potential for minerals and/or mineral resources and reserves, and regarding the plans, intentions, beliefs, and current expectations of the Property and the Company that may be described herein . Forward-looking statements consist of statements that are not purely historical, including any statements regarding beliefs, plans, expectations or intentions regarding the future. Such information can generally be identified by the use of forwarding-looking wording such as \"may\", \"expect\", \"estimate\", \"anticipate\", \"intend\", \"believe\" and \"continue\" or the negative thereof or similar variations. Readers are cautioned not to place undue reliance on forward-looking statements, as there can be no assurance that the plans, intentions or expectations upon which they are based will occur. By their nature, forward-looking statements involve numerous assumptions, known and unknown risks and uncertainties, both general and specific, that contribute to the possibility that the predictions, estimates, forecasts, projections and other forward-looking statements will not occur. These assumptions, risks and uncertainties include, among other things, the state of the economy in general and capital markets in particular, accuracy of assay results, geological interpretations from drilling results, timing and amount of capital expenditures; performance of available laboratory and other related services, future operating costs, and the historical basis for current estimates of potential quantities and grades of target zones, as well as those risk factors discussed or referred to in the Company's Management's Discussion and Analysis for the year ended December 31, 2022 , available at www.sedar.com , many of which are beyond the control of the Company. Forward-looking statements contained in this press release are expressly qualified by this cautionary statement. The forward-looking statements contained in this press release are made as of the date of this press release. Except as required by law, the Company disclaims any intention and assumes no obligation to update or revise any forward-looking statements, whether as a result of new information, future events or otherwise. Additionally, the Company undertakes no obligation to comment on the expectations of, or statements made by, third parties in respect of the matters discussed above. Neither the TSX Venture Exchange nor its Regulation Service Provider (as that term is defined in the policies of the TSX Venture Exchange) accepts responsibility for the adequacy or accuracy of this release. SOURCE  North Peak Resources Ltd.",
    "primary_commodity": "Au"
  },
  "articleProject": {
    "gid": 4571,
    "project_name": "Prospect Mountain Mine complex",
    "location": "Nevada, United States"
  },
  "articleExchange": "TSXV",
  "articleCompanyId": 1589,
  "articleTicker": "NPR",
  "articleCompanyName": "North Peak Resources Ltd.",
  "allOtherCompanyProjects": [
    {
      "company_id": 1589,
      "gid": 3159,
      "project_name": "Black Horse",
      "location": "Nevada, United States"
    },
    {
      "company_id": 1589,
      "gid": 4571,
      "project_name": "Prospect Mountain Mine complex",
      "location": "Nevada, United States"
    },
    {
      "company_id": 1589,
      "gid": 4435,
      "project_name": "Kenogami Lake",
      "location": "Ontario, Canada"
    }
  ],
  "allOtherCompanyNews": [
    {
      "id": 105896,
      "company_id": 1589,
      "title": "North Peak Confirms High Grade Material Remains at Prospect Mountain within the Dean Cave Area, Including a Sample Grading 46.5 g/t Au, 569 g/t Ag",
      "link": null,
      "date": "2025-05-27T11:00:00.000Z",
      "hidden": false
    },
    {
      "id": 104307,
      "company_id": 1589,
      "title": "North Peak Announces Harry Dobson Has Been Appointed Executive Chairman and a Director; Grant of Stock Options",
      "link": null,
      "date": "2025-05-12T11:00:00.000Z",
      "hidden": false
    },
    {
      "id": 102491,
      "company_id": 1589,
      "title": "North Peak Announces Changes to Board of Directors",
      "link": null,
      "date": "2025-04-30T11:00:00.000Z",
      "hidden": false
    },
    {
      "id": 101150,
      "company_id": 1589,
      "title": "North Peak Closes Second and Final Tranche of Private Placement",
      "link": null,
      "date": "2025-04-24T21:30:00.000Z",
      "hidden": false
    },
    {
      "id": 100262,
      "company_id": 1589,
      "title": "North Peak Announces a $5.17 Million Closing for Previously Announced Private Placement",
      "link": null,
      "date": "2025-04-21T11:00:00.000Z",
      "hidden": false
    },
    {
      "id": -173399,
      "company_id": 1589,
      "title": "North Peak Engages ICP Securities for Automated Market Making Services",
      "link": "https://www.newsfilecorp.com/release/244099/North-Peak-Engages-ICP-Securities-for-Automated-Market-Making-Services",
      "date": "2025-03-11T14:11:00.000Z",
      "hidden": false
    },
    {
      "id": 90574,
      "company_id": 1589,
      "title": "North Peak Announces Grant of Stock Options",
      "link": "https://www.newsfilecorp.com/release/244020/North-Peak-Announces-Grant-of-Stock-Options",
      "date": "2025-03-10T18:51:00.000Z",
      "hidden": false
    },
    {
      "id": 89631,
      "company_id": 1589,
      "title": "North Peak Announces Non-Brokered Private Placement",
      "link": "https://www.newsfilecorp.com/release/242786/North-Peak-Announces-NonBrokered-Private-Placement",
      "date": "2025-02-28T12:30:00.000Z",
      "hidden": false
    },
    {
      "id": 87288,
      "company_id": 1589,
      "title": "North Peak Announces CEO Transition",
      "link": "https://www.newsfilecorp.com/release/240223/North-Peak-Announces-CEO-Transition",
      "date": "2025-02-10T12:30:00.000Z",
      "hidden": false
    },
    {
      "id": 85453,
      "company_id": 1589,
      "title": "North Peak intersects 42.7m (140ft) @ 2.1 g/t Au including 4.6m (15ft) @ 6.7 g/t Au and 6.1m (20ft) @ 5.8 g/t Au; Further drilling confirms continuous mineralization between Wabash and Williams trends at Prospect Mountain",
      "link": "https://www.newsfilecorp.com/release/238662/North-Peak-intersects-42.7m-140ft-2.1-gt-Au-including-4.6m-15ft-6.7-gt-Au-and-6.1m-20ft-5.8-gt-Au-Further-drilling-confirms-continuous-mineralization-between-Wabash-and-Williams-trends-at-Prospect-Mountain",
      "date": "2025-01-28T12:30:00.000Z",
      "hidden": false
    }
  ]
}
