{
  "article": {
    "id": 35585,
    "link": "https://contentapi.cision.com/api/v1.0/releases/20230523C0701",
    "title": "North Peak's Acquisition of the Prospect Mountain Mine Complex in Eureka, Nevada Receives Final TSXV Approval; Work Programs Launched",
    "description": "\n\n<p class=\"prntar\"><a href=\"www.northpeakresources.com\" rel=\"nofollow\" target=\"_blank\">www.northpeakresources.com</a><br></br>TSX Venture: NPR</p>\n<p><span class=\"legendSpanClass\"><span class=\"xn-location\">CALGARY, AB</span></span>, <span class=\"legendSpanClass\"><span class=\"xn-chron\">May 23, 2023</span></span> /CNW/ - <b>North Peak Resources Ltd.</b> (TSXV: NPR) (the \"<b>Company</b>\" or \"<b>North Peak</b>\") has received final acceptance from the TSX Venture Exchange for its acquisition of the Prospect Mountain Mine complex (the \"<b>Property</b>\") from Solarljos LLC and Gullsil LLC of <span class=\"xn-location\">Nevada</span> (each controlled by the Erickson family of <span class=\"xn-location\">Nevada</span>).  This former silver, gold, lead and zinc producing underground mine complex is located in the Battle Mountain Eureka trend in an area known as the Southern Eureka Gold Belt district of <span class=\"xn-location\">Nevada</span>. The Company issued a press release on <span class=\"xn-chron\">May 4, 2023</span> announcing execution of a binding, definitive Agreement (the \"<b>Agreement</b>\") with the materials terms and conditions of that Agreement described below.</p>\n\n    <div class=\"PRN_ImbeddedAssetReference\" id=\"DivAssetPlaceHolder1\">\n                <p>\n                        <a href=\"https://mma.prnewswire.com/media/2083572/North_Peak_Resources_Ltd__North_Peak_s_Acquisition_of_the_Prospe.html\" rel=\"nofollow\" target=\"_blank\">\n                    <img alt=\"North Peak Resources Ltd. logo (CNW Group/North Peak Resources Ltd.)\" src=\"https://mma.prnewswire.com/media/2083572/North_Peak_Resources_Ltd__North_Peak_s_Acquisition_of_the_Prospe.jpg\" title=\"North Peak Resources Ltd. logo (CNW Group/North Peak Resources Ltd.)\"></img>\n                        </a>\n                </p>\n\n    </div>\n<p>\"This final stock exchange approval is well timed for the launch of surface and underground work programs to be described in subsequent news releases,\" said <span class=\"xn-person\">Brian Hinchcliffe</span>, North Peak CEO. \"With <span class=\"xn-location\">Carlin</span> style gold mineralization, CRD polymetallic systems and carbonate hosted Porphyry related Skarn lead, zinc and gold mineralization within its boundaries, the Property's exploration programs will be targeted to advance the identification of these systems both from underground and surface.\"  </p>\n<p>\"We were very deliberate during the two-year development partner search for our Diamond and Silver-Connor mines at Prospect Mountain, to identify a team that could drive this forward\", said <span class=\"xn-person\">Ty Erickson</span>, MD. \"We became convinced that North Peak's team – which built <span class=\"xn-person\">Kirkland Lake Gold</span> and Rupert Resource – had the exploration and mine building background we needed to be successful here in <span class=\"xn-location\">Eureka</span>.\"</p>\n<p><b>Venture Formation</b></p>\n<p>The Company and Solarljos, LLC (\"Solarljos\") are now working to put in place a Nevada LLC where the Company (through its <span class=\"xn-location\">Nevada</span> subsidiary) will hold initially, an 80% interest (the \"Initial Interest\") and Solarljos will hold the remaining 20% interest, and the mining claims and rights and related permits that constitute the Property will be transferred into the Nevada LLC (the date on which this is completed is referred to herein as the \"Formation Date\").  The Company's <span class=\"xn-location\">Nevada</span> subsidiary will act as manager for the Nevada LLC and operator of the Property.  Solarljos will not be required to contribute any funds or assume any liabilities for the benefit of the Nevada LLC or in connection with exploration and operations at the Property on account of its 20% interest.</p>\n<p>The Company will acquire the Initial Interest by issuing 5,000,000 common shares to Solarljos on the Formation Date. The Company has the right to acquire the remaining 20% interest held by Solarljos (the \"Right\"), provided it maintains its obligations under the Agreement (which includes annual exploration expenditures on the Property and cash payments to Solarljos) and by issuing an additional 3,000,000 common shares to Solarljos. The Company will have until 90 days after the third anniversary of the Formation Date to exercise the Right.  If the Company decides not to exercise the Right within this time period, then the Initial Interest is to be transferred to Solarljos, and Solarljos will in turn return to the Company the 5,000,000 common shares that have been issued to it.</p>\n<p>Mr. <span class=\"xn-person\">Mike Sutton</span>, P.Geo., a director of the Company, is the Qualified Person, as defined under National Instrument 43-101 - <i>Standards of Disclosure for Mineral Projects,</i> who reviewed and approved scientific and technical disclosure in this news release. The Qualified Person has not reviewed the mineral tenure, nor independently verified the legal status and ownership of the Property or any underlying property agreements.</p>\n<p>The Company will issue additional press release related to completion of the formation of the Nevada LLC and related matters described herein, and other material information as it becomes available.</p>\n<div aria-level=\"3\" class=\"wcag-arialevel-3\" role=\"heading\" style=\"display: block; font-size: 1.17em; margin-block-start: 1em; margin-block-end: 1em; margin-inline-start: 0px; margin-inline-end: 0px; font-weight: bold;\"><b>About North Peak </b></div><p>The Company is a Canadian based gold exploration and development company that is listed on the TSX Venture Exchange under the symbol \"NPR\". The Company is focused on acquiring historic sites, with low cost producing gold and other metals properties, with near term production potential and 8+ year mine life in the northern hemisphere. </p>\n<p>The Company can give no assurances at this time that its properties and interests will fulfil the Company's business development goals described herein. Trading in the securities of the Company should be considered highly speculative<b>.</b></p>\n<p><b><i>The TSXV has in no way passed upon the merits of the transactions described herein and has neither approved nor disapproved the contents of this news release. </i></b></p>\n<p><b><i>CAUTIONARY STATEMENT REGARDING FORWARD-LOOKING STATEMENTS</i></b><i>:</i> <i>This news release includes certain \"forward-looking statements\" under applicable Canadian securities legislation. Forward-looking statements include, but are not limited to, </i><i>statements with respect to </i><i>the ability of the parties to complete the transactions described herein, the ability of the Company to complete the exploration programs as proposed and on the timelines suggested, estimates of mineralization from drilling and the potential for minerals and/or mineral resources and reserves, and </i><i>regarding the plans, intentions, beliefs, and current expectations of the Property and the Company </i><i>that may be described herein</i><i>. Forward-looking statements consist of statements that are not purely historical, including any statements regarding beliefs, plans, expectations or intentions regarding the future. Such information can generally be identified by the use of forwarding-looking wording such as \"may\", \"expect\", \"estimate\", \"anticipate\", \"intend\", \"believe\" and \"continue\" or the negative thereof or similar variations. Readers are cautioned not to place undue reliance on forward-looking statements, as there can be no assurance that the plans, intentions or expectations upon which they are based will occur. </i></p>\n<p><i>By their nature, forward-looking statements involve numerous assumptions, known and unknown risks and uncertainties, both general and specific, that contribute to the possibility that the predictions, estimates, forecasts, projections and other forward-looking statements will not occur. These assumptions, risks and uncertainties include, among other things, the state of the economy in general and capital markets in particular, </i><i>accuracy of assay results, geological interpretations from drilling results, timing and amount of capital expenditures; performance of available laboratory and other related services, future operating costs, and the historical basis for current estimates of potential quantities and grades of target zones, </i><i>as well as those risk factors discussed or referred to in the Company's Management's Discussion and Analysis for the year ended <span class=\"xn-chron\">December 31, 2022</span>, available at <u><a href=\"http://www.sedar.com\" rel=\"nofollow\">www.sedar.com</a></u>, many of which are beyond the control of the Company. Forward-looking statements contained in this press release are expressly qualified by this cautionary statement.</i></p>\n<p><i>The forward-looking statements contained in this press release are made as of the date of this press release. Except as required by law, the Company disclaims any intention and assumes no obligation to update or revise any forward-looking statements, whether as a result of new information, future events or otherwise. Additionally, the Company undertakes no obligation to comment on the expectations of, or statements made by, third parties in respect of the matters discussed above.</i></p>\n<p><b><i>Neither the TSX Venture Exchange nor its Regulation Service Provider (as that term is defined in the policies of the TSX Venture Exchange) accepts responsibility for the adequacy or accuracy of this release.</i></b></p>\n\n<div class=\"PRN_ImbeddedAssetReference\" id=\"DivAssetPlaceHolder2\">\n</div>\n<p>SOURCE  North Peak Resources Ltd.</p>\n<img alt=\"\" src=\"https://rt.newswire.ca/rt.gif?NewsItemId=C0701&amp;Transmission_Id=202305231308CANADANWCANADAPR_C0701&amp;DateId=20230523\" style=\"border:0px; width:1px; height:1px;\"></img>\n\n",
    "search_terms": "Prospect Mountain Mine complex,North Peak Resources Ltd.,NPR",
    "master_gid": 4571,
    "date": "2023-05-23T17:08:00.000Z",
    "tags": "USA|Nevada||Gold,Silver,Zinc|Exploration update,Project Acquisition",
    "image_id": null,
    "hidden": false,
    "company_id": 1589,
    "provider": null,
    "excerpt": "www.northpeakresources.comTSX Venture: NPRCALGARY, AB,May 23, 2023/CNW/ -North Peak Resources Ltd.(TSXV: NPR) (the \"Company\" or \"North Peak\") has received final acceptance from the TSX Venture Exchange for its acquisition of the Prospect Mountain Mine complex (the \"Property\") from Solarljos LLC and Gullsil LLC ofNevada(each controlled by the Erickson family ofNevada).  This",
    "is_regulatory": false,
    "refined_tags": [
      "Project Acquisition",
      "Exploration Update"
    ],
    "ftp_filename": null,
    "company_name": "North Peak Resources Ltd.",
    "exchange": "TSXV",
    "root_ticker": "NPR",
    "project_name": "Prospect Mountain Mine complex",
    "gid": 4571,
    "location": "Nevada, United States",
    "plan_id": null,
    "description_text": "www.northpeakresources.com TSX Venture: NPR CALGARY, AB , May 23, 2023 /CNW/ - North Peak Resources Ltd. (TSXV: NPR) (the \" Company \" or \" North Peak \") has received final acceptance from the TSX Venture Exchange for its acquisition of the Prospect Mountain Mine complex (the \" Property \") from Solarljos LLC and Gullsil LLC of Nevada (each controlled by the Erickson family of Nevada ).  This former silver, gold, lead and zinc producing underground mine complex is located in the Battle Mountain Eureka trend in an area known as the Southern Eureka Gold Belt district of Nevada . The Company issued a press release on May 4, 2023 announcing execution of a binding, definitive Agreement (the \" Agreement \") with the materials terms and conditions of that Agreement described below. \"This final stock exchange approval is well timed for the launch of surface and underground work programs to be described in subsequent news releases,\" said Brian Hinchcliffe , North Peak CEO. \"With Carlin style gold mineralization, CRD polymetallic systems and carbonate hosted Porphyry related Skarn lead, zinc and gold mineralization within its boundaries, the Property's exploration programs will be targeted to advance the identification of these systems both from underground and surface.\" \"We were very deliberate during the two-year development partner search for our Diamond and Silver-Connor mines at Prospect Mountain, to identify a team that could drive this forward\", said Ty Erickson , MD. \"We became convinced that North Peak's team – which built Kirkland Lake Gold and Rupert Resource – had the exploration and mine building background we needed to be successful here in Eureka .\" Venture Formation The Company and Solarljos, LLC (\"Solarljos\") are now working to put in place a Nevada LLC where the Company (through its Nevada subsidiary) will hold initially, an 80% interest (the \"Initial Interest\") and Solarljos will hold the remaining 20% interest, and the mining claims and rights and related permits that constitute the Property will be transferred into the Nevada LLC (the date on which this is completed is referred to herein as the \"Formation Date\").  The Company's Nevada subsidiary will act as manager for the Nevada LLC and operator of the Property.  Solarljos will not be required to contribute any funds or assume any liabilities for the benefit of the Nevada LLC or in connection with exploration and operations at the Property on account of its 20% interest. The Company will acquire the Initial Interest by issuing 5,000,000 common shares to Solarljos on the Formation Date. The Company has the right to acquire the remaining 20% interest held by Solarljos (the \"Right\"), provided it maintains its obligations under the Agreement (which includes annual exploration expenditures on the Property and cash payments to Solarljos) and by issuing an additional 3,000,000 common shares to Solarljos. The Company will have until 90 days after the third anniversary of the Formation Date to exercise the Right.  If the Company decides not to exercise the Right within this time period, then the Initial Interest is to be transferred to Solarljos, and Solarljos will in turn return to the Company the 5,000,000 common shares that have been issued to it. Mr. Mike Sutton , P.Geo., a director of the Company, is the Qualified Person, as defined under National Instrument 43-101 - Standards of Disclosure for Mineral Projects, who reviewed and approved scientific and technical disclosure in this news release. The Qualified Person has not reviewed the mineral tenure, nor independently verified the legal status and ownership of the Property or any underlying property agreements. The Company will issue additional press release related to completion of the formation of the Nevada LLC and related matters described herein, and other material information as it becomes available. About North Peak The Company is a Canadian based gold exploration and development company that is listed on the TSX Venture Exchange under the symbol \"NPR\". The Company is focused on acquiring historic sites, with low cost producing gold and other metals properties, with near term production potential and 8+ year mine life in the northern hemisphere. The Company can give no assurances at this time that its properties and interests will fulfil the Company's business development goals described herein. Trading in the securities of the Company should be considered highly speculative . The TSXV has in no way passed upon the merits of the transactions described herein and has neither approved nor disapproved the contents of this news release. CAUTIONARY STATEMENT REGARDING FORWARD-LOOKING STATEMENTS : This news release includes certain \"forward-looking statements\" under applicable Canadian securities legislation. Forward-looking statements include, but are not limited to, statements with respect to the ability of the parties to complete the transactions described herein, the ability of the Company to complete the exploration programs as proposed and on the timelines suggested, estimates of mineralization from drilling and the potential for minerals and/or mineral resources and reserves, and regarding the plans, intentions, beliefs, and current expectations of the Property and the Company that may be described herein . Forward-looking statements consist of statements that are not purely historical, including any statements regarding beliefs, plans, expectations or intentions regarding the future. Such information can generally be identified by the use of forwarding-looking wording such as \"may\", \"expect\", \"estimate\", \"anticipate\", \"intend\", \"believe\" and \"continue\" or the negative thereof or similar variations. Readers are cautioned not to place undue reliance on forward-looking statements, as there can be no assurance that the plans, intentions or expectations upon which they are based will occur. By their nature, forward-looking statements involve numerous assumptions, known and unknown risks and uncertainties, both general and specific, that contribute to the possibility that the predictions, estimates, forecasts, projections and other forward-looking statements will not occur. These assumptions, risks and uncertainties include, among other things, the state of the economy in general and capital markets in particular, accuracy of assay results, geological interpretations from drilling results, timing and amount of capital expenditures; performance of available laboratory and other related services, future operating costs, and the historical basis for current estimates of potential quantities and grades of target zones, as well as those risk factors discussed or referred to in the Company's Management's Discussion and Analysis for the year ended December 31, 2022 , available at www.sedar.com , many of which are beyond the control of the Company. Forward-looking statements contained in this press release are expressly qualified by this cautionary statement. The forward-looking statements contained in this press release are made as of the date of this press release. Except as required by law, the Company disclaims any intention and assumes no obligation to update or revise any forward-looking statements, whether as a result of new information, future events or otherwise. Additionally, the Company undertakes no obligation to comment on the expectations of, or statements made by, third parties in respect of the matters discussed above. Neither the TSX Venture Exchange nor its Regulation Service Provider (as that term is defined in the policies of the TSX Venture Exchange) accepts responsibility for the adequacy or accuracy of this release. SOURCE  North Peak Resources Ltd.",
    "primary_commodity": "Au"
  },
  "articleProject": {
    "gid": 4571,
    "project_name": "Prospect Mountain Mine complex",
    "location": "Nevada, United States"
  },
  "articleExchange": "TSXV",
  "articleCompanyId": 1589,
  "articleTicker": "NPR",
  "articleCompanyName": "North Peak Resources Ltd.",
  "allOtherCompanyProjects": [
    {
      "company_id": 1589,
      "gid": 3159,
      "project_name": "Black Horse",
      "location": "Nevada, United States"
    },
    {
      "company_id": 1589,
      "gid": 4571,
      "project_name": "Prospect Mountain Mine complex",
      "location": "Nevada, United States"
    },
    {
      "company_id": 1589,
      "gid": 4435,
      "project_name": "Kenogami Lake",
      "location": "Ontario, Canada"
    }
  ],
  "allOtherCompanyNews": [
    {
      "id": 105896,
      "company_id": 1589,
      "title": "North Peak Confirms High Grade Material Remains at Prospect Mountain within the Dean Cave Area, Including a Sample Grading 46.5 g/t Au, 569 g/t Ag",
      "link": null,
      "date": "2025-05-27T11:00:00.000Z",
      "hidden": false
    },
    {
      "id": 104307,
      "company_id": 1589,
      "title": "North Peak Announces Harry Dobson Has Been Appointed Executive Chairman and a Director; Grant of Stock Options",
      "link": null,
      "date": "2025-05-12T11:00:00.000Z",
      "hidden": false
    },
    {
      "id": 102491,
      "company_id": 1589,
      "title": "North Peak Announces Changes to Board of Directors",
      "link": null,
      "date": "2025-04-30T11:00:00.000Z",
      "hidden": false
    },
    {
      "id": 101150,
      "company_id": 1589,
      "title": "North Peak Closes Second and Final Tranche of Private Placement",
      "link": null,
      "date": "2025-04-24T21:30:00.000Z",
      "hidden": false
    },
    {
      "id": 100262,
      "company_id": 1589,
      "title": "North Peak Announces a $5.17 Million Closing for Previously Announced Private Placement",
      "link": null,
      "date": "2025-04-21T11:00:00.000Z",
      "hidden": false
    },
    {
      "id": -173399,
      "company_id": 1589,
      "title": "North Peak Engages ICP Securities for Automated Market Making Services",
      "link": "https://www.newsfilecorp.com/release/244099/North-Peak-Engages-ICP-Securities-for-Automated-Market-Making-Services",
      "date": "2025-03-11T14:11:00.000Z",
      "hidden": false
    },
    {
      "id": 90574,
      "company_id": 1589,
      "title": "North Peak Announces Grant of Stock Options",
      "link": "https://www.newsfilecorp.com/release/244020/North-Peak-Announces-Grant-of-Stock-Options",
      "date": "2025-03-10T18:51:00.000Z",
      "hidden": false
    },
    {
      "id": 89631,
      "company_id": 1589,
      "title": "North Peak Announces Non-Brokered Private Placement",
      "link": "https://www.newsfilecorp.com/release/242786/North-Peak-Announces-NonBrokered-Private-Placement",
      "date": "2025-02-28T12:30:00.000Z",
      "hidden": false
    },
    {
      "id": 87288,
      "company_id": 1589,
      "title": "North Peak Announces CEO Transition",
      "link": "https://www.newsfilecorp.com/release/240223/North-Peak-Announces-CEO-Transition",
      "date": "2025-02-10T12:30:00.000Z",
      "hidden": false
    },
    {
      "id": 85453,
      "company_id": 1589,
      "title": "North Peak intersects 42.7m (140ft) @ 2.1 g/t Au including 4.6m (15ft) @ 6.7 g/t Au and 6.1m (20ft) @ 5.8 g/t Au; Further drilling confirms continuous mineralization between Wabash and Williams trends at Prospect Mountain",
      "link": "https://www.newsfilecorp.com/release/238662/North-Peak-intersects-42.7m-140ft-2.1-gt-Au-including-4.6m-15ft-6.7-gt-Au-and-6.1m-20ft-5.8-gt-Au-Further-drilling-confirms-continuous-mineralization-between-Wabash-and-Williams-trends-at-Prospect-Mountain",
      "date": "2025-01-28T12:30:00.000Z",
      "hidden": false
    }
  ]
}
