{
  "article": {
    "id": 84595,
    "link": "https://www.accessnewswire.com/newsroom/en/metals-and-mining/wolfden-sells-timberland-parcel-for-21-million-in-non-dilutive-financing-970693",
    "title": "Wolfden Sells Timberland Parcel for $2.1 Million in Non-Dilutive Financing",
    "description": "<p><strong id=\"dateline\">TORONTO, ON / <a href='https://www.accessnewswire.com/'>ACCESS Newswire</a> / January 20, 2025 / </strong><strong>Wolfden Resources Corporation (WLF.V)</strong> (&quot;Wolfden&quot;or the&quot;Company&quot;)is pleased to announce that it has agreed to sell a 3,770 acre parcel (the &quot;Severed Land&quot;) from its 6,862 acre timberland property in Maine for gross proceeds of $2.1 million (US$1.5 million). The Severed Land is situated north of its wholly owned Pickett Project where Wolfden retains 3,082 acres of the southern portion of the original parcel (the &quot;Retained Land&quot;) that is host to a high grade polymetallic critical mineral deposit along with all mineral resources and known exploration upside.</p><figure class=\"image\" style=\"text-align:center;margin:0.9em auto;\" width=\"100%\"><img src=\"https://app.accessnewswire.com/imagelibrary/b69e14d9-ebaa-45c4-9525-bbe1a1b1b752/970693/wolfdenlogo.jpg\" width=\"100%\" /></figure><div style=\"clear: both\"> </div><div> </div><div> </div><div> </div><p>As per the terms of the property sale agreement dated January 16, 2025, in respect of the Severed Land, Wolfden retains exclusive rights to explore and buy-back the mineral rights of the Severed Land for a period of five years.</p><p>In addition, Altius Royalty Corporation (&quot;Altius&quot;), who had purchased in 2022, certain additional timber rights and carbon credits on the entire 6,862 acre property in consideration for US$1.0 million, has agreed to amend its royalty agreement with the Company whereby Altius will forfeit all of its timber and carbon rights on the Severed Land for the following terms: 1) Altius will retain all of its timber rights and carbon credits on Wolfden's Retained Land, and 2) Altius shall hold an option for five years to convert US$1.0 million (less any future timber harvest proceeds paid to Altius since January 2025) into common shares of the Company at a price that is the greater of C$0.30 and the 20-day VWAP of common shares of the Company at the time of conversion, subject to Altius not holding more than 19.9% of the issued and outstanding common shares of the Company or being issued more than 10% of the number of outstanding common shares of the Company, and 3) Should Wolfden sell the Retained Lands at arm's length to a third party, Altius shall receive US$1.0 million from the sale proceeds (less any timber harvest proceeds paid to Altius since January 2025). Should either option 2) or 3) occur, Altius will have forfeited its timber rights and carbon credits to the Retained Land.</p><p>The sale of the Severed Land is expected to close on or before January 31, 2025 and is subject to final approval of the TSX Venture Exchange. The Severed Land sale transaction is arm's length in nature, will be settled in cash, and may include up to a 2% finder's fee commission. The amendment to the Altius royalty agreement is considered not to be at arm's length as Altius owns more than 10% of the outstanding shares of the Company. The amendment is considered to be a &quot;related party transaction&quot; for the purposes of Multilateral Instrument 61-101 - Protection of Minority Security Holders in Special Transactions (&quot;MI 61-101&quot;) and is exempt from the formal valuation requirement pursuant to section 5.5(b) of MI 61-101 as the Company is not listed on a specified market within the meaning of MI 61-101 and furthermore, the amendment is exempt from the minority approval requirement pursuant to section 5.7(1)(a) of MI 61-101 on the basis that neither the fair market value of the subject matter of, nor the fair market value of the consideration for, the amendment to the royalty agreement, insofar as it involves Altius, exceeds 25 per cent of the Issuer's market capitalization at the time of the amendment. Altius's option to convert its Pickett Project mineral royalty into common shares of the Company and cash expired on November 15, 2023.</p><p><i><strong>About Wolfden</strong></i></p><p>Wolfden is a North American exploration and development company focused on <a rel=\"nofollow\" href=\"https://pr.report/64ip\">high-margin metallic mineral deposits</a> including precious, base, and strategic metals. It has two nickel sulphide deposits in Manitoba and one of the highest-grade polymetallic projects in the USA (Zn, Pb, Cu, Ag, Au) that represent significant development projects with the potential to be domestic sources of ethically produced base and critical metals in North America.</p><p><i><strong>For further information </strong></i>please contact Ron Little, President &amp; CEO at (807) 624-1136.</p><p><i><strong>Cautionary Statement Regarding Forward-Looking Information</strong></i></p><p><i>This press release contains forward-looking information (within the meaning of applicable Canadian securities legislation) that involves various risks and uncertainties regarding future events, including closing of the sale of the Severed Land and the potential for projects to be domestic sources of ethically produced base and critical metals for the expansion of renewable energy in North America. Such forward-looking information includes statements based on current expectations involving a number of risks and uncertainties and such forward-looking statements are not guarantees of future performance of the Company, and include, without limitation, metal price assumptions, cash flow forecasts, permitting, land transactions, timber harvesting, community and other regulatory approvals, and the timing and completion of exploration programs in the USA, Manitoba, New Brunswick and the respective drill results. There are numerous risks and uncertainties that could cause actual results and the Company's plans and objectives to differ materially from those expressed in the forward-looking information in this news release, including without limitation, the following risks and uncertainties: (i) risks inherent in the mining industry; (ii) regulatory and environmental risks; (iii) results of exploration activities and development of mineral properties; (iv) risks relating to the estimation of mineral resources; (v) stock market volatility and capital market fluctuations; and (vi) general market and industry conditions. Actual results and future events could differ materially from those anticipated in such information. This forward-looking information is based on estimates and opinions of management on the date hereof and is expressly qualified by this notice. Risks and uncertainties about the Company's business are more fully discussed in the Company's disclosure materials filed with the securities regulatory authorities in Canada at www.sedar.com. The Company assumes no obligation to update any forward-looking information or to update the reasons why actual results could differ from such information unless required by applicable law.</i></p><p><i>Neither TSX Venture Exchange nor its Regulation Services Provider (as that term is defined in the policies of the TSX Venture Exchange) accepts responsibility for the adequacy or accuracy of this release.</i></p><p><strong>SOURCE:</strong> Wolfden Resources Corp.</p><img src='https://app.accessnewswire.com/img.ashx?id=970693' width=\"100%\" /><br /><br />View the original <a href='https://www.accessnewswire.com/newsroom/en/metals-and-mining/wolfden-sells-timberland-parcel-for-21-million-in-non-dilutive-financing-970693'>press release</a> on ACCESS Newswire<br /><br />",
    "search_terms": "Pickett Mountain,Wolfden Resources Corporation,WLF",
    "master_gid": 4157,
    "date": "2025-01-20T13:30:00.000Z",
    "tags": "USA|Maine|||Financing,Project Acquisition",
    "image_id": null,
    "hidden": false,
    "company_id": 893,
    "provider": "accesswire",
    "excerpt": "TORONTO, ON /ACCESS Newswire/ January 20, 2025 /Wolfden Resources Corporation (WLF.V)(&quot;Wolfden&quot;or the&quot;Company&quot;)is pleased to announce that it has agreed to sell a 3,770 acre parcel (the &quot;Severed Land&quot;) from its 6,862 acre timberland property in Maine for gross proceeds of $2.1 million (US$1.5 million). The Severed Land is situated north",
    "is_regulatory": false,
    "refined_tags": null,
    "ftp_filename": null,
    "company_name": "Wolfden Resources Corporation",
    "exchange": "TSXV",
    "root_ticker": "WLF",
    "project_name": "Pickett Mountain",
    "gid": 4157,
    "location": "Maine, United States",
    "plan_id": null,
    "description_text": "TORONTO, ON / ACCESS Newswire / January 20, 2025 / Wolfden Resources Corporation (WLF.V) (\"Wolfden\"or the\"Company\")is pleased to announce that it has agreed to sell a 3,770 acre parcel (the \"Severed Land\") from its 6,862 acre timberland property in Maine for gross proceeds of $2.1 million (US$1.5 million). The Severed Land is situated north of its wholly owned Pickett Project where Wolfden retains 3,082 acres of the southern portion of the original parcel (the \"Retained Land\") that is host to a high grade polymetallic critical mineral deposit along with all mineral resources and known exploration upside. As per the terms of the property sale agreement dated January 16, 2025, in respect of the Severed Land, Wolfden retains exclusive rights to explore and buy-back the mineral rights of the Severed Land for a period of five years. In addition, Altius Royalty Corporation (\"Altius\"), who had purchased in 2022, certain additional timber rights and carbon credits on the entire 6,862 acre property in consideration for US$1.0 million, has agreed to amend its royalty agreement with the Company whereby Altius will forfeit all of its timber and carbon rights on the Severed Land for the following terms: 1) Altius will retain all of its timber rights and carbon credits on Wolfden's Retained Land, and 2) Altius shall hold an option for five years to convert US$1.0 million (less any future timber harvest proceeds paid to Altius since January 2025) into common shares of the Company at a price that is the greater of C$0.30 and the 20-day VWAP of common shares of the Company at the time of conversion, subject to Altius not holding more than 19.9% of the issued and outstanding common shares of the Company or being issued more than 10% of the number of outstanding common shares of the Company, and 3) Should Wolfden sell the Retained Lands at arm's length to a third party, Altius shall receive US$1.0 million from the sale proceeds (less any timber harvest proceeds paid to Altius since January 2025). Should either option 2) or 3) occur, Altius will have forfeited its timber rights and carbon credits to the Retained Land. The sale of the Severed Land is expected to close on or before January 31, 2025 and is subject to final approval of the TSX Venture Exchange. The Severed Land sale transaction is arm's length in nature, will be settled in cash, and may include up to a 2% finder's fee commission. The amendment to the Altius royalty agreement is considered not to be at arm's length as Altius owns more than 10% of the outstanding shares of the Company. The amendment is considered to be a \"related party transaction\" for the purposes of Multilateral Instrument 61-101 - Protection of Minority Security Holders in Special Transactions (\"MI 61-101\") and is exempt from the formal valuation requirement pursuant to section 5.5(b) of MI 61-101 as the Company is not listed on a specified market within the meaning of MI 61-101 and furthermore, the amendment is exempt from the minority approval requirement pursuant to section 5.7(1)(a) of MI 61-101 on the basis that neither the fair market value of the subject matter of, nor the fair market value of the consideration for, the amendment to the royalty agreement, insofar as it involves Altius, exceeds 25 per cent of the Issuer's market capitalization at the time of the amendment. Altius's option to convert its Pickett Project mineral royalty into common shares of the Company and cash expired on November 15, 2023. About Wolfden Wolfden is a North American exploration and development company focused on high-margin metallic mineral deposits including precious, base, and strategic metals. It has two nickel sulphide deposits in Manitoba and one of the highest-grade polymetallic projects in the USA (Zn, Pb, Cu, Ag, Au) that represent significant development projects with the potential to be domestic sources of ethically produced base and critical metals in North America. For further information please contact Ron Little, President & CEO at (807) 624-1136. Cautionary Statement Regarding Forward-Looking Information This press release contains forward-looking information (within the meaning of applicable Canadian securities legislation) that involves various risks and uncertainties regarding future events, including closing of the sale of the Severed Land and the potential for projects to be domestic sources of ethically produced base and critical metals for the expansion of renewable energy in North America. Such forward-looking information includes statements based on current expectations involving a number of risks and uncertainties and such forward-looking statements are not guarantees of future performance of the Company, and include, without limitation, metal price assumptions, cash flow forecasts, permitting, land transactions, timber harvesting, community and other regulatory approvals, and the timing and completion of exploration programs in the USA, Manitoba, New Brunswick and the respective drill results. There are numerous risks and uncertainties that could cause actual results and the Company's plans and objectives to differ materially from those expressed in the forward-looking information in this news release, including without limitation, the following risks and uncertainties: (i) risks inherent in the mining industry; (ii) regulatory and environmental risks; (iii) results of exploration activities and development of mineral properties; (iv) risks relating to the estimation of mineral resources; (v) stock market volatility and capital market fluctuations; and (vi) general market and industry conditions. Actual results and future events could differ materially from those anticipated in such information. This forward-looking information is based on estimates and opinions of management on the date hereof and is expressly qualified by this notice. Risks and uncertainties about the Company's business are more fully discussed in the Company's disclosure materials filed with the securities regulatory authorities in Canada at www.sedar.com. The Company assumes no obligation to update any forward-looking information or to update the reasons why actual results could differ from such information unless required by applicable law. Neither TSX Venture Exchange nor its Regulation Services Provider (as that term is defined in the policies of the TSX Venture Exchange) accepts responsibility for the adequacy or accuracy of this release. SOURCE: Wolfden Resources Corp. View the original press release on ACCESS Newswire",
    "primary_commodity": "Zn"
  },
  "articleProject": {
    "gid": 4157,
    "project_name": "Pickett Mountain",
    "location": "Maine, United States"
  },
  "articleExchange": "TSXV",
  "articleCompanyId": 893,
  "articleTicker": "WLF",
  "articleCompanyName": "Wolfden Resources Corporation",
  "allOtherCompanyProjects": [
    {
      "company_id": 893,
      "gid": 1368,
      "project_name": "Brunswick",
      "location": "New Brunswick, Canada"
    },
    {
      "company_id": 893,
      "gid": 1342,
      "project_name": "Canoe Landing Lake",
      "location": "New Brunswick, Canada"
    },
    {
      "company_id": 893,
      "gid": 2224,
      "project_name": "Rice Lake",
      "location": "Manitoba, Canada"
    },
    {
      "company_id": 893,
      "gid": 4157,
      "project_name": "Pickett Mountain",
      "location": "Maine, United States"
    },
    {
      "company_id": 893,
      "gid": 1343,
      "project_name": "Upsalquitch",
      "location": "New Brunswick, Canada"
    }
  ],
  "allOtherCompanyNews": [
    {
      "id": 106730,
      "company_id": 893,
      "title": "Wolfden Releases Positive Deep Survey Results at Rockland in Nevada",
      "link": null,
      "date": "2025-06-03T10:30:00.000Z",
      "hidden": false
    },
    {
      "id": 89097,
      "company_id": 893,
      "title": "Wolfden Provides Positive Update on Nevada Gold Property",
      "link": "https://www.accessnewswire.com/newsroom/en/metals-and-mining/wolfden-provides-positive-update-on-nevada-gold-property-990990",
      "date": "2025-02-25T11:30:00.000Z",
      "hidden": false
    },
    {
      "id": 86215,
      "company_id": 893,
      "title": "Wolfden Closes Sale of a Timberland Parcel  for $2.1 Million in Non-Dilutive Financing",
      "link": "https://www.accessnewswire.com/newsroom/en/metals-and-mining/wolfden-closes-sale-of-a-timberland-parcel-for-21-million-in-non-dilutive-financin-977025",
      "date": "2025-01-30T21:30:00.000Z",
      "hidden": false
    },
    {
      "id": 84595,
      "company_id": 893,
      "title": "Wolfden Sells Timberland Parcel for $2.1 Million in Non-Dilutive Financing",
      "link": "https://www.accessnewswire.com/newsroom/en/metals-and-mining/wolfden-sells-timberland-parcel-for-21-million-in-non-dilutive-financing-970693",
      "date": "2025-01-20T13:30:00.000Z",
      "hidden": false
    },
    {
      "id": 76518,
      "company_id": 893,
      "title": "Wolfden Options Drill-Ready Nevada Gold Property in the Walker Lane Trend  that hosts Several Bonanza and Large Epithermal Gold Systems",
      "link": "https://www.accesswire.com/936406/wolfden-options-drill-ready-nevada-gold-property-in-the-walker-lane-trend-that-hosts-several-bonanza-and-large-epithermal-gold-systems",
      "date": "2024-10-29T11:00:00.000Z",
      "hidden": false
    },
    {
      "id": 48938,
      "company_id": 893,
      "title": "Wolfden Announces Denial of Pickett Project Rezoning Application",
      "link": "https://www.accesswire.com/viewarticle.aspx?id=834096&lang=en",
      "date": "2024-02-15T11:50:00.000Z",
      "hidden": false
    },
    {
      "id": 48360,
      "company_id": 893,
      "title": "Wolfden Announces Potential Denial of Pickett Project Rezoning Application",
      "link": "https://www.accesswire.com/viewarticle.aspx?id=830600&lang=en",
      "date": "2024-02-02T19:20:00.000Z",
      "hidden": false
    },
    {
      "id": 39924,
      "company_id": 893,
      "title": "Wolfden Announces Public Hearing Date for Pickett Project Rezoning",
      "link": "https://www.accesswire.com/viewarticle.aspx?id=777465&lang=en",
      "date": "2023-08-28T10:30:00.000Z",
      "hidden": false
    },
    {
      "id": 38183,
      "company_id": 893,
      "title": "Wolfden Reports Progress Update on Pickett Rezoning Application",
      "link": "https://www.accesswire.com/viewarticle.aspx?id=768933&lang=en",
      "date": "2023-07-19T10:30:00.000Z",
      "hidden": false
    },
    {
      "id": -57755,
      "company_id": 893,
      "title": "Wolfden Announces Grant of Options",
      "link": "https://www.accesswire.com/viewarticle.aspx?id=752902&lang=en",
      "date": "2023-05-04T11:30:00.000Z",
      "hidden": false
    }
  ]
}
