{
  "article": {
    "id": 50179,
    "link": "https://www.newsfilecorp.com/release/200415/LIVE-Acquires-the-Mesa-Top-and-Section-20-Uranium-Vanadium-and-Molybdenum-Mine-Projects-in-the-Colorado-Plateau",
    "title": "LIVE Acquires the Mesa Top and Section 20 Uranium Vanadium and Molybdenum Mine Projects in the Colorado Plateau",
    "description": "<img src=\"https://api.newsfilecorp.com/newsinfo/200415/367\" id=\"367\" width=\"2\" height=\"2\" style=\"width: 1px;  height: 1px;border: 0px solid;\" /><p>Vancouver, British Columbia--(Newsfile Corp. - March 5, 2024) - <b>Live Energy Minerals Corp. </b>(CSE: LIVE) (OTC Pink: GTREF) (\"<b>LIVE</b>\" or the \"<b>Company</b>\") is pleased to announce that it has acquired through staking (pending approval from the Bureau of Land Management (\"BML\")) the Mesa Top Mine Property and the Section 20 Mine Property located on BLM land within McKinley County, New Mexico, USA (collectively the \"<b>Properties</b>\"). The Properties cover Jurassic age sediments within the Colorado Plateau and are prospective for Uranium, Vanadium and Molybdenum mineralization.</p><p>The claims were staked by the Company's wholly owned subsidiary, Lithium Valley Holdings Corp. and are pending approval from the BLM. The claims are also subject to a 3% NSR to an arms length party that assisted in identifying and directing the acquisition, which consist of 48 lode mineral claims totalling 960 acres. </p><p>The Properties are underlain by sedimentary rocks of the Morrison formation which represent a Jurassic aged depositional environment within the Grants Mineral belt area of the Colorado Plateau. The Colorado Plateau is a geographical area covering large portions of Utah, Colorado, Arizona and New Mexico, it is a region known for its sedimentary hosted Uranium deposits consisting of over 1.2 billion pounds of mined and in situ U3O8. A subsequent assessment estimated 4.4 billion pounds of U3O8 total endowment in the Jurassic Westwater Canyon Member of the Morrison Formation, which is the main host in the Grants mineral belt (Hall et al., 2023).</p><p><b>QP Statement</b></p><p>Adrian Smith, P.Geo., is a qualified person as defined in National Instrument 43-101 - Standards of Disclosure for Mineral Projects (the \"<b>QP</b>\") and has reviewed and approved the scientific and technical information contained in this news release. </p><p><b>References</b></p><p>**S.M. Hall, et. al., 2023, Sandstone-hosted uranium deposits of the Colorado Plateau, USA, Ore Geology Reviews, Volume 155.</p><p><a href=\"https://api.newsfilecorp.com/redirect/AMqAes1QWX\">https://mrdata.usgs.gov/mrds/show-mrds.php?dep_id=10014545</a></p><p><a href=\"https://api.newsfilecorp.com/redirect/ZAjNPU4Ywb\">https://mrdata.usgs.gov/mrds/show-mrds.php?dep_id=10014552</a></p><p><b>About LIVE Energy Minerals Corp.</b></p><p>LIVE is a mining exploration company actively engaged in exploring for and identifying new opportunities in clean energy minerals in North and South America. LIVE holds applications for 100% interest in the uranium, vanadium, and molybdenum, Messa Top and Section 20 Mine projects located in the Colorado Plateau, USA.  LIVE also holds, 100% interest in the Skygold project in BC, Canada, and a retained interest in the McDermitt Lithium East Project, Nevada, USA. LIVE is focused on creating value for its shareholders by combining quality project with proven exploration strategies and a team driven to achieve exceptional outcomes.</p><p><b>For further information please contact:</b></p><p>Adrian Smith</p><p>Chief Executive Officer &#38; Director <br />Live Energy Minerals Corp.</p><p>Email: <a href=\"mailto:adrian@liveenergyminerals.com\">adrian@liveenergyminerals.com</a></p><p>Phone: 604-687-2038</p><p><i>Neither the Canadian Securities Exchange nor the Market Regulator (as that term is defined in the policies of the Canadian Securities Exchange) accepts responsibility for the adequacy or accuracy of this release.</i></p><p><b>Forward-Looking Statements</b></p><p><font style=\"font-size: 11px;\">This news release may include \"forward-looking information\" under applicable Canadian securities legislation. Such forward-looking information reflects management's current beliefs and are based on a number of estimates and/or assumptions made by and information currently available to the Company that, while considered reasonable, are subject to known and unknown risks, uncertainties, and other factors that may cause the actual results and future events to differ materially from those expressed or implied by such forward-looking information. Readers are cautioned that such forward-looking information are neither promises nor guarantees and are subject to known and unknown risks and uncertainties including, but not limited to, general business, economic, competitive, political and social uncertainties, uncertain and volatile equity and capital markets, lack of available capital, actual results of exploration activities, environmental risks, future prices of base and other metals, operating risks, accidents, labour issues, delays in obtaining governmental approvals and permits, and other risks in the mining industry. </font></p><p><font style=\"font-size: 11px;\">The Company is presently an exploration stage company. Exploration is highly speculative in nature, involves many risks, requires substantial expenditures, and may not result in the discovery of mineral deposits that can be mined profitably. Furthermore, the Company currently has no reserves on any of its properties. As a result, there can be no assurance that such forward-looking statements will prove to be accurate, and actual results and future events could differ materially from those anticipated in such statements.</font></p><p>For further information, please contact us at <a href=\"mailto:info@liveenergyminerals.com\">info@liveenergyminerals.com</a>.</p><p id=\"corporateLinkBack\">To view the source version of this press release, please visit <a href=\"https://api.newsfilecorp.com/redirect/arBjWHnE80\">https://www.newsfilecorp.com/release/200415</a></p>",
    "search_terms": "Mesa Top Mine,Live Energy Minerals Corp.,LIVE",
    "master_gid": 6491,
    "date": "2024-03-05T14:06:00.000Z",
    "tags": "Mexico,USA|Colorado,New Mexico|||Project Acquisition",
    "image_id": null,
    "hidden": false,
    "company_id": 130,
    "provider": null,
    "excerpt": "Vancouver, British Columbia--(Newsfile Corp. - March 5, 2024) -Live Energy Minerals Corp.(CSE: LIVE) (OTC Pink: GTREF) (\"LIVE\" or the \"Company\") is pleased to announce that it has acquired through staking (pending approval from the Bureau of Land Management (\"BML\")) the Mesa Top Mine Property and the Section 20 Mine Property",
    "is_regulatory": false,
    "refined_tags": [
      "Project Acquisition"
    ],
    "ftp_filename": null,
    "company_name": "Live Energy Minerals Corp.",
    "exchange": "CSE",
    "root_ticker": "LIVE",
    "project_name": "Mesa Top Mine",
    "gid": 6491,
    "location": null,
    "plan_id": null,
    "description_text": "Vancouver, British Columbia--(Newsfile Corp. - March 5, 2024) - Live Energy Minerals Corp. (CSE: LIVE) (OTC Pink: GTREF) (\" LIVE \" or the \" Company \") is pleased to announce that it has acquired through staking (pending approval from the Bureau of Land Management (\"BML\")) the Mesa Top Mine Property and the Section 20 Mine Property located on BLM land within McKinley County, New Mexico, USA (collectively the \" Properties \"). The Properties cover Jurassic age sediments within the Colorado Plateau and are prospective for Uranium, Vanadium and Molybdenum mineralization. The claims were staked by the Company's wholly owned subsidiary, Lithium Valley Holdings Corp. and are pending approval from the BLM. The claims are also subject to a 3% NSR to an arms length party that assisted in identifying and directing the acquisition, which consist of 48 lode mineral claims totalling 960 acres. The Properties are underlain by sedimentary rocks of the Morrison formation which represent a Jurassic aged depositional environment within the Grants Mineral belt area of the Colorado Plateau. The Colorado Plateau is a geographical area covering large portions of Utah, Colorado, Arizona and New Mexico, it is a region known for its sedimentary hosted Uranium deposits consisting of over 1.2 billion pounds of mined and in situ U3O8. A subsequent assessment estimated 4.4 billion pounds of U3O8 total endowment in the Jurassic Westwater Canyon Member of the Morrison Formation, which is the main host in the Grants mineral belt (Hall et al., 2023). QP Statement Adrian Smith, P.Geo., is a qualified person as defined in National Instrument 43-101 - Standards of Disclosure for Mineral Projects (the \" QP \") and has reviewed and approved the scientific and technical information contained in this news release. References **S.M. Hall, et. al., 2023, Sandstone-hosted uranium deposits of the Colorado Plateau, USA, Ore Geology Reviews, Volume 155. https://mrdata.usgs.gov/mrds/show-mrds.php?dep_id=10014545 https://mrdata.usgs.gov/mrds/show-mrds.php?dep_id=10014552 About LIVE Energy Minerals Corp. LIVE is a mining exploration company actively engaged in exploring for and identifying new opportunities in clean energy minerals in North and South America. LIVE holds applications for 100% interest in the uranium, vanadium, and molybdenum, Messa Top and Section 20 Mine projects located in the Colorado Plateau, USA.  LIVE also holds, 100% interest in the Skygold project in BC, Canada, and a retained interest in the McDermitt Lithium East Project, Nevada, USA. LIVE is focused on creating value for its shareholders by combining quality project with proven exploration strategies and a team driven to achieve exceptional outcomes. For further information please contact: Adrian Smith Chief Executive Officer & Director Live Energy Minerals Corp. Email: adrian@liveenergyminerals.com Phone: 604-687-2038 Neither the Canadian Securities Exchange nor the Market Regulator (as that term is defined in the policies of the Canadian Securities Exchange) accepts responsibility for the adequacy or accuracy of this release. Forward-Looking Statements This news release may include \"forward-looking information\" under applicable Canadian securities legislation. Such forward-looking information reflects management's current beliefs and are based on a number of estimates and/or assumptions made by and information currently available to the Company that, while considered reasonable, are subject to known and unknown risks, uncertainties, and other factors that may cause the actual results and future events to differ materially from those expressed or implied by such forward-looking information. Readers are cautioned that such forward-looking information are neither promises nor guarantees and are subject to known and unknown risks and uncertainties including, but not limited to, general business, economic, competitive, political and social uncertainties, uncertain and volatile equity and capital markets, lack of available capital, actual results of exploration activities, environmental risks, future prices of base and other metals, operating risks, accidents, labour issues, delays in obtaining governmental approvals and permits, and other risks in the mining industry. The Company is presently an exploration stage company. Exploration is highly speculative in nature, involves many risks, requires substantial expenditures, and may not result in the discovery of mineral deposits that can be mined profitably. Furthermore, the Company currently has no reserves on any of its properties. As a result, there can be no assurance that such forward-looking statements will prove to be accurate, and actual results and future events could differ materially from those anticipated in such statements. For further information, please contact us at info@liveenergyminerals.com . To view the source version of this press release, please visit https://www.newsfilecorp.com/release/200415",
    "primary_commodity": "U"
  },
  "articleProject": {
    "gid": 6491,
    "project_name": "Mesa Top Mine",
    "location": null
  },
  "articleExchange": "CSE",
  "articleCompanyId": 130,
  "articleTicker": "LIVE",
  "articleCompanyName": "Live Energy Minerals Corp.",
  "allOtherCompanyProjects": [
    {
      "company_id": 130,
      "gid": 3844,
      "project_name": "McDermitt Lithium East",
      "location": "Nevada, United States"
    },
    {
      "company_id": 130,
      "gid": 6491,
      "project_name": "Mesa Top Mine",
      "location": null
    },
    {
      "company_id": 130,
      "gid": 6492,
      "project_name": "Section 20 Mine",
      "location": null
    }
  ],
  "allOtherCompanyNews": [
    {
      "id": -190258,
      "company_id": 130,
      "title": "Live Energy Grants Option for 100% Interest in Saskatchewan Claims",
      "link": null,
      "date": "2025-04-10T21:05:00.000Z",
      "hidden": false
    },
    {
      "id": 50179,
      "company_id": 130,
      "title": "LIVE Acquires the Mesa Top and Section 20 Uranium Vanadium and Molybdenum Mine Projects in the Colorado Plateau",
      "link": "https://www.newsfilecorp.com/release/200415/LIVE-Acquires-the-Mesa-Top-and-Section-20-Uranium-Vanadium-and-Molybdenum-Mine-Projects-in-the-Colorado-Plateau",
      "date": "2024-03-05T14:06:00.000Z",
      "hidden": false
    },
    {
      "id": -63640,
      "company_id": 130,
      "title": "LIVE Closes Debt Settlement",
      "link": "https://www.newsfilecorp.com/release/183095/LIVE-Closes-Debt-Settlement",
      "date": "2023-10-05T21:26:00.000Z",
      "hidden": false
    },
    {
      "id": -63084,
      "company_id": 130,
      "title": "LIVE Announces Debt Settlement",
      "link": "https://www.newsfilecorp.com/release/181196/LIVE-Announces-Debt-Settlement",
      "date": "2023-09-19T23:00:00.000Z",
      "hidden": false
    },
    {
      "id": 41079,
      "company_id": 130,
      "title": "LIVE Enters into Agreement with US Energy Metals Corp. to Option McDermitt Lithium East Project",
      "link": "https://www.newsfilecorp.com/release/180924/LIVE-Enters-into-Agreement-with-US-Energy-Metals-Corp.-to-Option-McDermitt-Lithium-East-Project",
      "date": "2023-09-18T12:00:00.000Z",
      "hidden": false
    },
    {
      "id": 34278,
      "company_id": 130,
      "title": "Live Energy Minerals Corp. Reports Initial Samples Returning up to 1907 ppm Lithium at McDermitt Lithium East Project",
      "link": "https://www.newsfilecorp.com/release/163787/Live-Energy-Minerals-Corp.-Reports-Initial-Samples-Returning-up-to-1907-ppm-Lithium-at-McDermitt-Lithium-East-Project",
      "date": "2023-04-26T07:01:00.000Z",
      "hidden": false
    },
    {
      "id": -54751,
      "company_id": 130,
      "title": "Gold Tree Announces Change of Name and Trading Symbol",
      "link": "https://www.newsfilecorp.com/release/156039/Gold-Tree-Announces-Change-of-Name-and-Trading-Symbol",
      "date": "2023-02-24T12:00:00.000Z",
      "hidden": false
    },
    {
      "id": 33471,
      "company_id": 130,
      "title": "Gold Tree Announces Filing of NI 43-101 Technical Report for the McDermitt Lithium East Property",
      "link": "https://www.newsfilecorp.com/release/149057/Gold-Tree-Announces-Filing-of-NI-43101-Technical-Report-for-the-McDermitt-Lithium-East-Property",
      "date": "2022-12-21T21:01:00.000Z",
      "hidden": false
    },
    {
      "id": 25879,
      "company_id": 130,
      "title": "Gold Tree Completes First Exploration Program at Skygold Project",
      "link": "https://www.newsfilecorp.com/release/137546/Gold-Tree-Completes-First-Exploration-Program-at-Skygold-Project",
      "date": "2022-09-19T13:01:00.000Z",
      "hidden": false
    },
    {
      "id": -45031,
      "company_id": 130,
      "title": "Gold Tree Acquires McDermitt Lithium Property",
      "link": "https://www.newsfilecorp.com/release/130306/Gold-Tree-Acquires-McDermitt-Lithium-Property",
      "date": "2022-07-08T13:01:00.000Z",
      "hidden": false
    }
  ]
}
