{
  "article": {
    "id": 36687,
    "link": "https://www.newsfilecorp.com/release/170012/Galleon-Gold-Completes-Neal-Project-Acquisition-with-Eric-Sprott-and-Announces-Results-of-AGSM",
    "title": "Galleon Gold Completes Neal Project Acquisition with Eric Sprott and Announces Results of AGSM",
    "description": "<img id=\"367\" width=\"2\" height=\"2\" style=\"width: 1px;  height: 1px;border: 0px solid;\" src=\"https://api.newsfilecorp.com/newsinfo/170012/367\" /><p class=\"nfSubHeading\">Eric Sprott's Ownership of Galleon Gold Increases to 21.45%</p><p>Toronto, Ontario--(Newsfile Corp. - June 15, 2023) - <b>Galleon Gold Corp.</b>&#160;(TSXV: GGO) (the \"<b>Company</b>\" or \"<b>Galleon Gold</b>\") is pleased to announce that it has closed the previously announced transaction (the \"Transaction\") (see press release dated May 31, 2023) with 2176423 Ontario Ltd., (the \"Vendor\"), a corporation that is beneficially owned and controlled by Eric Sprott to acquire the Vendor's 100% interest in a stockpile of mineralized material (the \"Stockpile\") located on the Neal Idaho Project, 27 km southeast of Boise, Idaho (the \"Project\") together with its 20% interest in the Project.  The Company has issued 2,000,000 common shares of Galleon Gold (the \"Shares\") to the Vendor and now holds a 100% leasehold interest in the Project.  The Shares are subject to a hold period of four months and a day under applicable Canadian securities law; Eric Sprott's ownership of Galleon Gold is now 21.45%.</p><p><b>Results of Annual Meeting of Shareholders<br /></b>The Company is pleased to report that all of the resolutions put forth at the Annual and Special Meeting of Shareholders (the \"Meeting\") held on June 14, 2023 were approved. At the Meeting, shareholders elected the following directors to hold office for the ensuing year: R. David Russell, Thomas Kofman, James T. O'Neil Jr., Mario Colantonio, Gerhard Merkel, Michael Hobart and Richard F. Nanna. Shareholders also approved resolutions to re-appoint Grant Thornton LLP as independent auditors of the Company and for the continuation of the stock option plan.</p><p><b>Stock Option Grant<br /></b>The Company also announces, pursuant to the Company's stock option plan, a total of 100,000 stock options have been granted to a consultant of the Company. The options are exercisable into one common share of the Company at a price of $0.22, vest immediately and expire on June 14, 2028.</p><p><b>Related Party Transaction<br /></b>The Transaction constitutes a \"related party transaction\" for the Company for the purposes of Multilateral Instrument 61-101 &#8211;&#160;<i>Protection of Minority Security Holders in Special Transactions</i> (\"MI 61-101\") as Mr. Sprott owns more than 10% of the Company's issued and outstanding Shares.  The Company is relying on the exemptions from the requirement to obtain a formal evaluation and minority shareholder approval in connection with the Transaction contained in sections 5.5 (a) and 5.7 (1) (a) of MI 61-101, as neither the fair market value of the securities issued, nor the fair market value of the consideration for the securities issued exceeds 25% of the Company's market capitalization as calculated in accordance with MI 61-101. The Company did not file a material change report containing all the disclosure required by MI 61-101 more than 21 days before the closing of the Transaction as the Company wished to close the Transaction as expeditiously as possible. Please refer to the material change report dated June 2, 2023 for further details.</p><p><b>Technical Content and Qualified Person<br /></b>The technical content of this news release has been reviewed and approved by by Thomas H. Chadwick, BSc., CPG, a Qualified Person under National Instrument 43-101 Disclosure Standards for Mineral Projects.</p><p><b>About the Neal Project</b></p><ul style=\"list-style-type: disc;\"><li>The Project is leased from Daisy Mining and Land LLP. Under the lease agreement, the Company may remove, extract, ship and sell all ores, minerals and material from the property. In exchange, Daisy Mining will receive lease payments equal to $3.00 per ton for all material removed from the property. If the annual lease payment is less than $10,000, Daisy Mining is paid a cash top-up to meet the $10,000 annual payment minimum. Daisy Mining will also receive production payments on any future production in the form of a 3% NSR.</li><li>The Stockpile, a 13,900-ton bulk sample, was derived from an open cut area in 2016-2017. As the material was trucked from the open cut to the Stockpile, approximately 741 samples were collected and assayed at an independent laboratory. Results of the sampling indicate the Stockpile graded at 0.132 opt (4.54 gpt Au), equivalent to approximately 1,835 ounces of gold in-situ. The Company is investigating various transport and processing options to determine the best means of handling the Stockpile material. The qualified person has not done sufficient work to classify this historical estimate as current mineral resources or reserves and the Company is not treating the historical estimate as current mineral resources or mineral reserves. </li><li>The Project is a high-grade gold-dominant vein system with at least five veins known to date. It is located near Boise, Idaho and has excellent access via 20 kilometers of improved gravel and dirt roads from Interstate-84.  </li><li>The Project consists of five private patented mining claims covering approximately 22.4 hectares (55.38 acres) and another seven unpatented lode claims covering about 52.6 hectares (130 acres) located on U.S. Forest Service administered public lands.</li><li>Gold mineralization at the Project and elsewhere in the Neal Mining District was discovered in 1889 by Arthur Neal.  Total reported District lode gold production through 1941 has been estimated at around 30,000 ounces, with most of this production coming from the Project area in the 1889-1915 time frame.</li><li>The Project area contains three historic underground gold mines: Hidden Treasure, Homestake and Daisy. These mines were eventually connected underground and were at peak production from 1902-1915.</li><li>The Project was explored in the late 1980's for open pit, heap leach potential with a reverse circulation drilling program consisting of 208 holes totaling 47,000 feet.</li></ul><p><b>About Galleon Gold<br /></b>Galleon Gold is an exploration and development company focused on advancing the West Cache Gold Project in Timmins, Ontario. The West Cache Gold Project is located 7 km northeast of Pan American Silver's Timmins West Mine and 14 km southwest of Newmont's Hollinger Mine.  A 2022 Preliminary Economic Assessment (PEA) for the project demonstrates strong economics.  Detail engineering design and baseline studies in support of a permit application for an underground bulk sample are underway.</p><p>For further information:</p><p><b>Galleon Gold<br /></b>R. David Russell<br />Chairman and CEO<br />T. (416) 644-0066<br /><a href=\"mailto:info@galleongold.com\">info@galleongold.com</a><br /><a href=\"https://api.newsfilecorp.com/redirect/WrDZNtvJM4\">www.galleongold.com</a></p><p><b>Investor Relations<br /></b>Harbor Access<br />Graham Farrell<br />T. (416) 842-9003<br /><a href=\"mailto:Graham.Farrell@harbor-access.com\">Graham.Farrell@harbor-access.com</a></p><p><b>Forward-Looking Statements<br /></b>This document contains certain forward-looking statements that reflect the current views and/or expectations of Galleon Gold with respect to its long-term strategy, proposed work, plans and other reports including the PEA for its projects. Forward-looking statements are based on the then-current expectations, beliefs, assumptions, estimates and forecasts about the business and the markets in which Galleon Gold operates.<i> </i> Some of the statements contained herein may be forward-looking statements which involve known and unknown risks and uncertainties. Without limitation, statements regarding potential mineralization and resources, exploration results, expectations, plans, and objectives of Galleon Gold are forward-looking statements that involve various risks. The following are important factors that could cause Galleon Gold's actual results to differ materially from those expressed or implied by such forward-looking statements: changes in the world-wide price of mineral commodities, general market conditions, risks inherent in mineral exploration, risks associated with development, construction and mining operations, risks related to infectious diseases, including Covid-19 and the uncertainty of future exploration activities and cash flows, and the uncertainty of access to additional capital. There can be no assurance that forward-looking statements will prove to be accurate as actual results and future events may differ materially from those anticipated in such statements. Galleon Gold undertakes no obligation to update such forward-looking statements if circumstances or management's estimates or opinions should change. The reader is cautioned not to place undue reliance on such forward-looking statements.</p><p><i>Neither the TSX Venture Exchange nor its Regulation Services Provider (as that term is defined in policies of the TSX Venture Exchange) accepts responsibility for the adequacy or accuracy of this release.</i></p><p id=\"corporateNewsLogoContainer\"><img src=\"https://images.newsfilecorp.com/files/1014/170012_1014.jpeg\" alt=\"Corporate Logo\" id=\"corporateNewsLogo\" /></p><p id=\"corporateLinkBack\">To view the source version of this press release, please visit <a href=\"https://api.newsfilecorp.com/redirect/q3QZWcZxK8\">https://www.newsfilecorp.com/release/170012</a></p>",
    "search_terms": "Neal,Galleon Gold Corp.,GGO",
    "master_gid": 4779,
    "date": "2023-06-15T11:45:00.000Z",
    "tags": "Canada,USA|Idaho|Timmins Camp|Gold|Eric Sprott,Project Acquisition,Sprott",
    "image_id": null,
    "hidden": false,
    "company_id": 779,
    "provider": null,
    "excerpt": "Eric Sprott's Ownership of Galleon Gold Increases to 21.45%Toronto, Ontario--(Newsfile Corp. - June 15, 2023) -Galleon Gold Corp.&#160;(TSXV: GGO) (the \"Company\" or \"Galleon Gold\") is pleased to announce that it has closed the previously announced transaction (the \"Transaction\") (see press release dated May 31, 2023) with 2176423 Ontario Ltd., (the",
    "is_regulatory": false,
    "refined_tags": [
      "Project Acquisition",
      "Eric Sprott",
      "Sprott"
    ],
    "ftp_filename": null,
    "company_name": "Galleon Gold Corp.",
    "exchange": "TSXV",
    "root_ticker": "GGO",
    "project_name": "Golden Trove (Neal)",
    "gid": 4779,
    "location": "Idaho, United States",
    "plan_id": null,
    "description_text": "Eric Sprott's Ownership of Galleon Gold Increases to 21.45% Toronto, Ontario--(Newsfile Corp. - June 15, 2023) - Galleon Gold Corp. (TSXV: GGO) (the \" Company \" or \" Galleon Gold \") is pleased to announce that it has closed the previously announced transaction (the \"Transaction\") (see press release dated May 31, 2023) with 2176423 Ontario Ltd., (the \"Vendor\"), a corporation that is beneficially owned and controlled by Eric Sprott to acquire the Vendor's 100% interest in a stockpile of mineralized material (the \"Stockpile\") located on the Neal Idaho Project, 27 km southeast of Boise, Idaho (the \"Project\") together with its 20% interest in the Project.  The Company has issued 2,000,000 common shares of Galleon Gold (the \"Shares\") to the Vendor and now holds a 100% leasehold interest in the Project.  The Shares are subject to a hold period of four months and a day under applicable Canadian securities law; Eric Sprott's ownership of Galleon Gold is now 21.45%. Results of Annual Meeting of Shareholders The Company is pleased to report that all of the resolutions put forth at the Annual and Special Meeting of Shareholders (the \"Meeting\") held on June 14, 2023 were approved. At the Meeting, shareholders elected the following directors to hold office for the ensuing year: R. David Russell, Thomas Kofman, James T. O'Neil Jr., Mario Colantonio, Gerhard Merkel, Michael Hobart and Richard F. Nanna. Shareholders also approved resolutions to re-appoint Grant Thornton LLP as independent auditors of the Company and for the continuation of the stock option plan. Stock Option Grant The Company also announces, pursuant to the Company's stock option plan, a total of 100,000 stock options have been granted to a consultant of the Company. The options are exercisable into one common share of the Company at a price of $0.22, vest immediately and expire on June 14, 2028. Related Party Transaction The Transaction constitutes a \"related party transaction\" for the Company for the purposes of Multilateral Instrument 61-101 – Protection of Minority Security Holders in Special Transactions (\"MI 61-101\") as Mr. Sprott owns more than 10% of the Company's issued and outstanding Shares.  The Company is relying on the exemptions from the requirement to obtain a formal evaluation and minority shareholder approval in connection with the Transaction contained in sections 5.5 (a) and 5.7 (1) (a) of MI 61-101, as neither the fair market value of the securities issued, nor the fair market value of the consideration for the securities issued exceeds 25% of the Company's market capitalization as calculated in accordance with MI 61-101. The Company did not file a material change report containing all the disclosure required by MI 61-101 more than 21 days before the closing of the Transaction as the Company wished to close the Transaction as expeditiously as possible. Please refer to the material change report dated June 2, 2023 for further details. Technical Content and Qualified Person The technical content of this news release has been reviewed and approved by by Thomas H. Chadwick, BSc., CPG, a Qualified Person under National Instrument 43-101 Disclosure Standards for Mineral Projects. About the Neal Project The Project is leased from Daisy Mining and Land LLP. Under the lease agreement, the Company may remove, extract, ship and sell all ores, minerals and material from the property. In exchange, Daisy Mining will receive lease payments equal to $3.00 per ton for all material removed from the property. If the annual lease payment is less than $10,000, Daisy Mining is paid a cash top-up to meet the $10,000 annual payment minimum. Daisy Mining will also receive production payments on any future production in the form of a 3% NSR. The Stockpile, a 13,900-ton bulk sample, was derived from an open cut area in 2016-2017. As the material was trucked from the open cut to the Stockpile, approximately 741 samples were collected and assayed at an independent laboratory. Results of the sampling indicate the Stockpile graded at 0.132 opt (4.54 gpt Au), equivalent to approximately 1,835 ounces of gold in-situ. The Company is investigating various transport and processing options to determine the best means of handling the Stockpile material. The qualified person has not done sufficient work to classify this historical estimate as current mineral resources or reserves and the Company is not treating the historical estimate as current mineral resources or mineral reserves. The Project is a high-grade gold-dominant vein system with at least five veins known to date. It is located near Boise, Idaho and has excellent access via 20 kilometers of improved gravel and dirt roads from Interstate-84. The Project consists of five private patented mining claims covering approximately 22.4 hectares (55.38 acres) and another seven unpatented lode claims covering about 52.6 hectares (130 acres) located on U.S. Forest Service administered public lands. Gold mineralization at the Project and elsewhere in the Neal Mining District was discovered in 1889 by Arthur Neal.  Total reported District lode gold production through 1941 has been estimated at around 30,000 ounces, with most of this production coming from the Project area in the 1889-1915 time frame. The Project area contains three historic underground gold mines: Hidden Treasure, Homestake and Daisy. These mines were eventually connected underground and were at peak production from 1902-1915. The Project was explored in the late 1980's for open pit, heap leach potential with a reverse circulation drilling program consisting of 208 holes totaling 47,000 feet. About Galleon Gold Galleon Gold is an exploration and development company focused on advancing the West Cache Gold Project in Timmins, Ontario. The West Cache Gold Project is located 7 km northeast of Pan American Silver's Timmins West Mine and 14 km southwest of Newmont's Hollinger Mine.  A 2022 Preliminary Economic Assessment (PEA) for the project demonstrates strong economics.  Detail engineering design and baseline studies in support of a permit application for an underground bulk sample are underway. For further information: Galleon Gold R. David Russell Chairman and CEO T. (416) 644-0066 info@galleongold.com www.galleongold.com Investor Relations Harbor Access Graham Farrell T. (416) 842-9003 Graham.Farrell@harbor-access.com Forward-Looking Statements This document contains certain forward-looking statements that reflect the current views and/or expectations of Galleon Gold with respect to its long-term strategy, proposed work, plans and other reports including the PEA for its projects. Forward-looking statements are based on the then-current expectations, beliefs, assumptions, estimates and forecasts about the business and the markets in which Galleon Gold operates. Some of the statements contained herein may be forward-looking statements which involve known and unknown risks and uncertainties. Without limitation, statements regarding potential mineralization and resources, exploration results, expectations, plans, and objectives of Galleon Gold are forward-looking statements that involve various risks. The following are important factors that could cause Galleon Gold's actual results to differ materially from those expressed or implied by such forward-looking statements: changes in the world-wide price of mineral commodities, general market conditions, risks inherent in mineral exploration, risks associated with development, construction and mining operations, risks related to infectious diseases, including Covid-19 and the uncertainty of future exploration activities and cash flows, and the uncertainty of access to additional capital. There can be no assurance that forward-looking statements will prove to be accurate as actual results and future events may differ materially from those anticipated in such statements. Galleon Gold undertakes no obligation to update such forward-looking statements if circumstances or management's estimates or opinions should change. The reader is cautioned not to place undue reliance on such forward-looking statements. Neither the TSX Venture Exchange nor its Regulation Services Provider (as that term is defined in policies of the TSX Venture Exchange) accepts responsibility for the adequacy or accuracy of this release. To view the source version of this press release, please visit https://www.newsfilecorp.com/release/170012",
    "primary_commodity": "Au"
  },
  "articleProject": {
    "gid": 4779,
    "project_name": "Golden Trove (Neal)",
    "location": "Idaho, United States"
  },
  "articleExchange": "TSXV",
  "articleCompanyId": 779,
  "articleTicker": "GGO",
  "articleCompanyName": "Galleon Gold Corp.",
  "allOtherCompanyProjects": [
    {
      "company_id": 779,
      "gid": 1555,
      "project_name": "PG-101",
      "location": "Ontario, Canada"
    },
    {
      "company_id": 779,
      "gid": 2240,
      "project_name": "West Cache (Price)",
      "location": "Ontario, Canada"
    },
    {
      "company_id": 779,
      "gid": 9994,
      "project_name": "West Cache (Godfrey Claims)",
      "location": "Ontario, Canada"
    },
    {
      "company_id": 779,
      "gid": 1705,
      "project_name": "West Cache (Ogden)",
      "location": "Ontario, Canada"
    },
    {
      "company_id": 779,
      "gid": 1554,
      "project_name": "Eastford Lake",
      "location": "Ontario, Canada"
    },
    {
      "company_id": 779,
      "gid": 4779,
      "project_name": "Golden Trove (Neal)",
      "location": "Idaho, United States"
    }
  ],
  "allOtherCompanyNews": [
    {
      "id": 106049,
      "company_id": 779,
      "title": "Galleon Gold Announces Results of Annual Meeting of Shareholders and Interest Payment on Convertible Debentures",
      "link": null,
      "date": "2025-05-27T21:00:00.000Z",
      "hidden": false
    },
    {
      "id": -197661,
      "company_id": 779,
      "title": "Galleon Gold Sells Non-Core Utah Asset for US$700,000",
      "link": null,
      "date": "2025-04-30T11:45:00.000Z",
      "hidden": false
    },
    {
      "id": 99996,
      "company_id": 779,
      "title": "Galleon Gold Commences Site Preparation for West Cache Bulk Sample Project",
      "link": null,
      "date": "2025-04-16T11:45:00.000Z",
      "hidden": false
    },
    {
      "id": 99190,
      "company_id": 779,
      "title": "Galleon Gold Receives Closure Plan Approval for West Cache Gold Project",
      "link": null,
      "date": "2025-04-09T15:00:00.000Z",
      "hidden": false
    },
    {
      "id": 90780,
      "company_id": 779,
      "title": "Galleon Gold Expands Timmins Land Position",
      "link": "https://www.newsfilecorp.com/release/244226/Galleon-Gold-Expands-Timmins-Land-Position",
      "date": "2025-03-12T11:45:00.000Z",
      "hidden": false
    },
    {
      "id": 88813,
      "company_id": 779,
      "title": "Galleon Gold Corporate Update",
      "link": "https://www.newsfilecorp.com/release/241914/Galleon-Gold-Corporate-Update",
      "date": "2025-02-21T22:19:00.000Z",
      "hidden": false
    },
    {
      "id": -168609,
      "company_id": 779,
      "title": "Canadian Investment Regulatory Organization Trade Resumption - GGO",
      "link": "https://contentapi.cision.com/api/v1.0/releases/20250210C8529",
      "date": "2025-02-10T17:13:00.000Z",
      "hidden": false
    },
    {
      "id": 87337,
      "company_id": 779,
      "title": "Galleon Gold Receives Invitation to Submit Closure Plan for West Cache Project Bulk Sample Program",
      "link": "https://www.newsfilecorp.com/release/240248/Galleon-Gold-Receives-Invitation-to-Submit-Closure-Plan-for-West-Cache-Project-Bulk-Sample-Program",
      "date": "2025-02-10T17:00:00.000Z",
      "hidden": false
    },
    {
      "id": -168607,
      "company_id": 779,
      "title": "Canadian Investment Regulatory Organization Trading Halt - GGO",
      "link": "https://contentapi.cision.com/api/v1.0/releases/20250210C3747",
      "date": "2025-02-10T17:00:00.000Z",
      "hidden": false
    },
    {
      "id": -154386,
      "company_id": 779,
      "title": "Galleon Gold Issues Shares for Interest Payment on Convertible Debentures",
      "link": "https://www.newsfilecorp.com/release/230192/Galleon-Gold-Issues-Shares-for-Interest-Payment-on-Convertible-Debentures",
      "date": "2024-11-15T21:00:00.000Z",
      "hidden": false
    }
  ]
}
