{
  "article": {
    "id": 38127,
    "link": "https://www.newsfilecorp.com/release/173810/Galleon-Gold-Converts-Neal-Project-Lease-Agreement-to-Purchase-Agreement",
    "title": "Galleon Gold Converts Neal Project Lease Agreement to Purchase Agreement",
    "description": "<img src=\"https://api.newsfilecorp.com/newsinfo/173810/367\" id=\"367\" width=\"2\" height=\"2\" style=\"width: 1px;  height: 1px;border: 0px solid;\" /><p>Toronto, Ontario--(Newsfile Corp. - July 18, 2023) - <b>Galleon Gold Corp.</b> (TSXV: GGO) (the \"<b>Company</b>\" or \"<b>Galleon Gold</b>\") is pleased to announce that it has entered into a purchase agreement (the \"Purchase Agreement\") with Daisy Mining &#38; Land LLP (\"Daisy\") to acquire seven (7) patented lode claims in Idaho, with five (5) of those claims forming the nucleus of the Neal Gold Project. To facilitate the transaction, the Company has formed a new Idaho company, Golden Trove, LLC (\"Golden Trove\") which will make 5 yearly payments of US $250,000 to Daisy starting May 1, 2024 and ending May 1, 2028, for a total consideration of US $1,250,000. Golden Trove has the right to accelerate the schedule of payments at its discretion. During the term of the Purchase Agreement, Daisy will receive $3.00 per ton of material removed from the project and a 3% NSR on any ore processed. Once a total of US$1,250,000 has been paid, the NSR and tonnage fee will be extinguished and Golden Trove will own the property 100%. Under the terms of the Purchase Agreement the Company and Daisy will terminate the existing lease agreement that has been in place since May 2019.  In addition, the Company announces that it is changing the name of the Neal Project to the Golden Trove Project.</p><p><b>Comment from CEO<br /></b>David Russell, President and CEO of Galleon Gold, commented, \"<i>We are very pleased to have come to an agreement with Daisy to simplify the further development and operation of the Golden Trove Project.  We anticipate updating the NI 43-101 to reflect the ownership changes that have taken place these past few months and are continuing to evaluate processing options for the stockpile of mineralized material we recently acquired.\"</i></p><p><b>Technical Content and Qualified Person<br /></b>The technical content of this news release has been reviewed and approved by by Thomas H. Chadwick, BSc., CPG, a Qualified Person under National Instrument 43-101 Disclosure Standards for Mineral Projects. </p><p><b>About the Golden Trove Project (formerly Neal Project)</b></p><ul style=\"list-style-type: disc;\"><li><p>The Project is a high-grade gold-dominant vein system with at least five veins known to date. It is located near Boise, Idaho and has excellent access via 20 kilometers of improved gravel and dirt roads from Interstate-84.  </p></li><li><p>The Project consists of five private patented mining claims covering approximately 22.4 hectares (55.38 acres) and another seven unpatented lode claims covering about 52.6 hectares (130 acres) located on U.S. Forest Service administered public lands.</p></li><li><p>Gold mineralization at the Project and elsewhere in the Neal Mining District was discovered in 1889 by Arthur Neal.  Total reported District lode gold production through 1941 has been estimated at around 30,000 ounces, with most of this production coming from the Project area in the 1889-1915 time frame.</p></li><li><p>The Project area contains three historic underground gold mines: Hidden Treasure, Homestake and Daisy. These mines were eventually connected underground and were at peak production from 1902-1915.</p></li><li><p>The Project was explored in the late 1980's for open pit - heap leach potential with a reverse circulation drilling program consisting of 208 holes totaling 47,000 feet.</p></li><li><p>There is currently an estimated 13,900-ton stockpile of mineralized material, derived from an open cut area in 2016-2017 on the property. As the material was trucked from the open cut to the stockpile, approximately 741 samples were collected and assayed at an independent laboratory. Results of the sampling indicate the Stockpile graded at 0.132 opt (4.54 gpt Au), equivalent to approximately 1,835 ounces of gold in-situ. The Company is investigating various transport and processing options to determine the best means of handling the stockpile material. The qualified person has not done sufficient work to classify this historical estimate as current mineral resources or reserves and the Company is not treating the historical estimate as current mineral resources or reserves. </p></li></ul><p><b>About Galleon Gold<br /></b>Galleon Gold is an exploration and development company focused on advancing the West Cache Gold Project in Timmins, Ontario. The West Cache Gold Project is located 7 km northeast of Pan American Silver's Timmins West Mine and 14 km southwest of Newmont's Hollinger Mine.  A 2022 Preliminary Economic Assessment (PEA) for the project demonstrates strong economics.  Detail engineering design and baseline studies in support of a permit application for an underground bulk sample are underway. </p><p>For further information:</p><p><b>Galleon Gold<br /></b>R. David Russell<br />Chairman and CEO<br />T. (416) 644-0066<br /><a href=\"mailto:info@galleongold.com\">info@galleongold.com<br /></a><a href=\"https://api.newsfilecorp.com/redirect/PLMaZfNG5K\">www.galleongold.com</a></p><p><b>Investor Relations<br /></b>Harbor Access<br />Graham Farrell<br />T. (416) 842-9003<br /><a href=\"mailto:Graham.Farrell@harbor-access.com\">Graham.Farrell@harbor-access.com</a></p><p><b>Forward-Looking Statements<br /></b>This document contains certain forward-looking statements that reflect the current views and/or expectations of Galleon Gold with respect to its long-term strategy, proposed work, plans and other reports including the PEA for its projects. Forward-looking statements are based on the then-current expectations, beliefs, assumptions, estimates and forecasts about the business and the markets in which Galleon Gold operates.<i> </i> Some of the statements contained herein may be forward-looking statements which involve known and unknown risks and uncertainties. Without limitation, statements regarding potential mineralization and resources, exploration results, expectations, plans, and objectives of Galleon Gold are forward-looking statements that involve various risks. The following are important factors that could cause Galleon Gold's actual results to differ materially from those expressed or implied by such forward-looking statements: changes in the world-wide price of mineral commodities, general market conditions, risks inherent in mineral exploration, risks associated with development, construction and mining operations, risks related to infectious diseases, including Covid-19 and the uncertainty of future exploration activities and cash flows, and the uncertainty of access to additional capital. There can be no assurance that forward-looking statements will prove to be accurate as actual results and future events may differ materially from those anticipated in such statements. Galleon Gold undertakes no obligation to update such forward-looking statements if circumstances or management's estimates or opinions should change. The reader is cautioned not to place undue reliance on such forward-looking statements.</p><p><i>Neither the TSX Venture Exchange nor its Regulation Services Provider (as that term is defined in policies of the TSX Venture Exchange) accepts responsibility for the adequacy or accuracy of this release.</i></p><p id=\"corporateNewsLogoContainer\"><img src=\"https://images.newsfilecorp.com/files/1014/173810_9a2324ca64b3f93a_logo.jpg\" id=\"corporateNewsLogo\" alt=\"Corporate Logo\" /></p><p id=\"corporateLinkBack\">To view the source version of this press release, please visit <a href=\"https://api.newsfilecorp.com/redirect/wW2BqcXJjB\">https://www.newsfilecorp.com/release/173810</a></p>",
    "search_terms": "Neal,Galleon Gold Corp.,GGO",
    "master_gid": 4779,
    "date": "2023-07-18T11:45:00.000Z",
    "tags": "USA|Idaho||Gold|Project Acquisition",
    "image_id": null,
    "hidden": false,
    "company_id": 779,
    "provider": null,
    "excerpt": "Toronto, Ontario--(Newsfile Corp. - July 18, 2023) -Galleon Gold Corp.(TSXV: GGO) (the \"Company\" or \"Galleon Gold\") is pleased to announce that it has entered into a purchase agreement (the \"Purchase Agreement\") with Daisy Mining &#38; Land LLP (\"Daisy\") to acquire seven (7) patented lode claims in Idaho, with five (5)",
    "is_regulatory": false,
    "refined_tags": [
      "Project Acquisition"
    ],
    "ftp_filename": null,
    "company_name": "Galleon Gold Corp.",
    "exchange": "TSXV",
    "root_ticker": "GGO",
    "project_name": "Golden Trove (Neal)",
    "gid": 4779,
    "location": "Idaho, United States",
    "plan_id": null,
    "description_text": "Toronto, Ontario--(Newsfile Corp. - July 18, 2023) - Galleon Gold Corp. (TSXV: GGO) (the \" Company \" or \" Galleon Gold \") is pleased to announce that it has entered into a purchase agreement (the \"Purchase Agreement\") with Daisy Mining & Land LLP (\"Daisy\") to acquire seven (7) patented lode claims in Idaho, with five (5) of those claims forming the nucleus of the Neal Gold Project. To facilitate the transaction, the Company has formed a new Idaho company, Golden Trove, LLC (\"Golden Trove\") which will make 5 yearly payments of US $250,000 to Daisy starting May 1, 2024 and ending May 1, 2028, for a total consideration of US $1,250,000. Golden Trove has the right to accelerate the schedule of payments at its discretion. During the term of the Purchase Agreement, Daisy will receive $3.00 per ton of material removed from the project and a 3% NSR on any ore processed. Once a total of US$1,250,000 has been paid, the NSR and tonnage fee will be extinguished and Golden Trove will own the property 100%. Under the terms of the Purchase Agreement the Company and Daisy will terminate the existing lease agreement that has been in place since May 2019.  In addition, the Company announces that it is changing the name of the Neal Project to the Golden Trove Project. Comment from CEO David Russell, President and CEO of Galleon Gold, commented, \" We are very pleased to have come to an agreement with Daisy to simplify the further development and operation of the Golden Trove Project.  We anticipate updating the NI 43-101 to reflect the ownership changes that have taken place these past few months and are continuing to evaluate processing options for the stockpile of mineralized material we recently acquired.\" Technical Content and Qualified Person The technical content of this news release has been reviewed and approved by by Thomas H. Chadwick, BSc., CPG, a Qualified Person under National Instrument 43-101 Disclosure Standards for Mineral Projects. About the Golden Trove Project (formerly Neal Project) The Project is a high-grade gold-dominant vein system with at least five veins known to date. It is located near Boise, Idaho and has excellent access via 20 kilometers of improved gravel and dirt roads from Interstate-84. The Project consists of five private patented mining claims covering approximately 22.4 hectares (55.38 acres) and another seven unpatented lode claims covering about 52.6 hectares (130 acres) located on U.S. Forest Service administered public lands. Gold mineralization at the Project and elsewhere in the Neal Mining District was discovered in 1889 by Arthur Neal.  Total reported District lode gold production through 1941 has been estimated at around 30,000 ounces, with most of this production coming from the Project area in the 1889-1915 time frame. The Project area contains three historic underground gold mines: Hidden Treasure, Homestake and Daisy. These mines were eventually connected underground and were at peak production from 1902-1915. The Project was explored in the late 1980's for open pit - heap leach potential with a reverse circulation drilling program consisting of 208 holes totaling 47,000 feet. There is currently an estimated 13,900-ton stockpile of mineralized material, derived from an open cut area in 2016-2017 on the property. As the material was trucked from the open cut to the stockpile, approximately 741 samples were collected and assayed at an independent laboratory. Results of the sampling indicate the Stockpile graded at 0.132 opt (4.54 gpt Au), equivalent to approximately 1,835 ounces of gold in-situ. The Company is investigating various transport and processing options to determine the best means of handling the stockpile material. The qualified person has not done sufficient work to classify this historical estimate as current mineral resources or reserves and the Company is not treating the historical estimate as current mineral resources or reserves. About Galleon Gold Galleon Gold is an exploration and development company focused on advancing the West Cache Gold Project in Timmins, Ontario. The West Cache Gold Project is located 7 km northeast of Pan American Silver's Timmins West Mine and 14 km southwest of Newmont's Hollinger Mine.  A 2022 Preliminary Economic Assessment (PEA) for the project demonstrates strong economics.  Detail engineering design and baseline studies in support of a permit application for an underground bulk sample are underway. For further information: Galleon Gold R. David Russell Chairman and CEO T. (416) 644-0066 info@galleongold.com www.galleongold.com Investor Relations Harbor Access Graham Farrell T. (416) 842-9003 Graham.Farrell@harbor-access.com Forward-Looking Statements This document contains certain forward-looking statements that reflect the current views and/or expectations of Galleon Gold with respect to its long-term strategy, proposed work, plans and other reports including the PEA for its projects. Forward-looking statements are based on the then-current expectations, beliefs, assumptions, estimates and forecasts about the business and the markets in which Galleon Gold operates. Some of the statements contained herein may be forward-looking statements which involve known and unknown risks and uncertainties. Without limitation, statements regarding potential mineralization and resources, exploration results, expectations, plans, and objectives of Galleon Gold are forward-looking statements that involve various risks. The following are important factors that could cause Galleon Gold's actual results to differ materially from those expressed or implied by such forward-looking statements: changes in the world-wide price of mineral commodities, general market conditions, risks inherent in mineral exploration, risks associated with development, construction and mining operations, risks related to infectious diseases, including Covid-19 and the uncertainty of future exploration activities and cash flows, and the uncertainty of access to additional capital. There can be no assurance that forward-looking statements will prove to be accurate as actual results and future events may differ materially from those anticipated in such statements. Galleon Gold undertakes no obligation to update such forward-looking statements if circumstances or management's estimates or opinions should change. The reader is cautioned not to place undue reliance on such forward-looking statements. Neither the TSX Venture Exchange nor its Regulation Services Provider (as that term is defined in policies of the TSX Venture Exchange) accepts responsibility for the adequacy or accuracy of this release. To view the source version of this press release, please visit https://www.newsfilecorp.com/release/173810",
    "primary_commodity": "Au"
  },
  "articleProject": {
    "gid": 4779,
    "project_name": "Golden Trove (Neal)",
    "location": "Idaho, United States"
  },
  "articleExchange": "TSXV",
  "articleCompanyId": 779,
  "articleTicker": "GGO",
  "articleCompanyName": "Galleon Gold Corp.",
  "allOtherCompanyProjects": [
    {
      "company_id": 779,
      "gid": 1555,
      "project_name": "PG-101",
      "location": "Ontario, Canada"
    },
    {
      "company_id": 779,
      "gid": 2240,
      "project_name": "West Cache (Price)",
      "location": "Ontario, Canada"
    },
    {
      "company_id": 779,
      "gid": 9994,
      "project_name": "West Cache (Godfrey Claims)",
      "location": "Ontario, Canada"
    },
    {
      "company_id": 779,
      "gid": 1705,
      "project_name": "West Cache (Ogden)",
      "location": "Ontario, Canada"
    },
    {
      "company_id": 779,
      "gid": 1554,
      "project_name": "Eastford Lake",
      "location": "Ontario, Canada"
    },
    {
      "company_id": 779,
      "gid": 4779,
      "project_name": "Golden Trove (Neal)",
      "location": "Idaho, United States"
    }
  ],
  "allOtherCompanyNews": [
    {
      "id": 106049,
      "company_id": 779,
      "title": "Galleon Gold Announces Results of Annual Meeting of Shareholders and Interest Payment on Convertible Debentures",
      "link": null,
      "date": "2025-05-27T21:00:00.000Z",
      "hidden": false
    },
    {
      "id": -197661,
      "company_id": 779,
      "title": "Galleon Gold Sells Non-Core Utah Asset for US$700,000",
      "link": null,
      "date": "2025-04-30T11:45:00.000Z",
      "hidden": false
    },
    {
      "id": 99996,
      "company_id": 779,
      "title": "Galleon Gold Commences Site Preparation for West Cache Bulk Sample Project",
      "link": null,
      "date": "2025-04-16T11:45:00.000Z",
      "hidden": false
    },
    {
      "id": 99190,
      "company_id": 779,
      "title": "Galleon Gold Receives Closure Plan Approval for West Cache Gold Project",
      "link": null,
      "date": "2025-04-09T15:00:00.000Z",
      "hidden": false
    },
    {
      "id": 90780,
      "company_id": 779,
      "title": "Galleon Gold Expands Timmins Land Position",
      "link": "https://www.newsfilecorp.com/release/244226/Galleon-Gold-Expands-Timmins-Land-Position",
      "date": "2025-03-12T11:45:00.000Z",
      "hidden": false
    },
    {
      "id": 88813,
      "company_id": 779,
      "title": "Galleon Gold Corporate Update",
      "link": "https://www.newsfilecorp.com/release/241914/Galleon-Gold-Corporate-Update",
      "date": "2025-02-21T22:19:00.000Z",
      "hidden": false
    },
    {
      "id": -168609,
      "company_id": 779,
      "title": "Canadian Investment Regulatory Organization Trade Resumption - GGO",
      "link": "https://contentapi.cision.com/api/v1.0/releases/20250210C8529",
      "date": "2025-02-10T17:13:00.000Z",
      "hidden": false
    },
    {
      "id": 87337,
      "company_id": 779,
      "title": "Galleon Gold Receives Invitation to Submit Closure Plan for West Cache Project Bulk Sample Program",
      "link": "https://www.newsfilecorp.com/release/240248/Galleon-Gold-Receives-Invitation-to-Submit-Closure-Plan-for-West-Cache-Project-Bulk-Sample-Program",
      "date": "2025-02-10T17:00:00.000Z",
      "hidden": false
    },
    {
      "id": -168607,
      "company_id": 779,
      "title": "Canadian Investment Regulatory Organization Trading Halt - GGO",
      "link": "https://contentapi.cision.com/api/v1.0/releases/20250210C3747",
      "date": "2025-02-10T17:00:00.000Z",
      "hidden": false
    },
    {
      "id": -154386,
      "company_id": 779,
      "title": "Galleon Gold Issues Shares for Interest Payment on Convertible Debentures",
      "link": "https://www.newsfilecorp.com/release/230192/Galleon-Gold-Issues-Shares-for-Interest-Payment-on-Convertible-Debentures",
      "date": "2024-11-15T21:00:00.000Z",
      "hidden": false
    }
  ]
}
