{
  "article": {
    "id": 42767,
    "link": "https://www.newsfilecorp.com/release/184637/Myriad-Acquires-Earnable-75-Interest-in-the-Copper-Mountain-Uranium-Project-in-Wyoming-USA",
    "title": "Myriad Acquires Earnable 75% Interest in the Copper Mountain Uranium Project in Wyoming, USA",
    "description": "<img src=\"https://api.newsfilecorp.com/newsinfo/184637/367\" id=\"367\" width=\"2\" height=\"2\" style=\"width: 1px;  height: 1px;border: 0px solid;\" /><p>Vancouver, British Columbia--(Newsfile Corp. - October 20, 2023) - <b>Myriad Uranium Corp.&#160;</b>(CSE: M) (OTCQB: MYRUF) (FSE: C3Q)&#160;(\"<b>Myriad</b>\" or the \"<b>Company</b>\") is pleased to announce that it has signed a property option agreement dated as of October 18, 2023 (the \"Option Agreement\") with Rush Rare Metals Corp. (\"Rush\") pursuant to which Myriad has the option (the \"Option\") to earn up to a 75% interest in and to Rush's Copper Mountain Project (the \"Property\"), comprised of 110 mineral claims in the State of Wyoming covering approximately 1,911 acres.  The Option Agreement replaces the binding letter of intent between the parties, as previously announced (see Myriad's news release dated September 18, 2023).</p><p>\"This is a transformative deal for us with a superb partner in Rush,\" stated Myriad's CEO, Thomas Lamb.   \"Copper Mountain is a historic producer.  One of its mines, the Arrowhead, produced 500,000 lbs eU<sub>3</sub>O<sub>8</sub> in the 1950s and 1960s.  The Property contains a number of other known uranium deposits and there is good potential to discover more.  Rocky Mountain Energy, a subsidiary of Union Pacific, drilled approximately 2,000 boreholes at Copper Mountain between 1969 and 1980.  They spent upwards of US$78 million advancing Copper Mountain (2023 dollars), planned a mine for one of its deposits, and built a leach pad.  Operations came to a halt in 1980 due to falling uranium prices.  There is also a great deal of exciting exploration upside at Copper Mountain.  Known high-grade areas have not yet been followed up, and new, more modern paragenesis theories could guide us to big discoveries. Finally, historical reports suggest the ore at Copper Mountain is leachable and does not require a mill, and it may even be ISR-amenable.  Wyoming is the centre of uranium mining in the USA and many of its operations are ISR.\" </p><p>Under the Option Agreement, Myriad has the option to acquire an initial 50% interest in the Property by: (1) making an initial cash payment of $100,000 to Rush and issuing 576,209 common shares of Myriad (each, a \"Share\") to Rush on the date of execution (the \"Effective Date\") of the Agreement; (2) making an additional cash payment of $35,000 to Rush on the date which is 90 days from the Effective Date; (3) issuing an additional $150,000 worth of Shares to Rush on the date which is one year from the Effective Date; (4) issuing an additional $250,000 worth of Shares to Rush on the date which is two years from the Effective Date; and (5) within two years of the Effective Date, making expenditures of no less than $1,500,000 on the Property. On successfully earning a 50% interest in the Property, Myriad will have the option to acquire an additional 25% interest (for a total interest of 75%) in the Property by making additional expenditures of no less than $4,000,000 (for total expenditures of no less than $5,500,000) on the Property within four years of the Effective Date.  In addition, upon completion of a Preliminary Economic Assessment or Prefeasibility Study respecting the Property, Myriad shall be obligated to issue an additional $2,500,000 worth of Shares to Rush.</p><p>Upon Myriad successfully earning a 50% or 75% interest in and to the Property, as the case may be, the parties will form a joint venture for the purposes of the continued exploration, development and exploitation of the Property and will negotiate, execute and deliver a joint venture agreement which shall include such terms and conditions normally provided for in commercial transactions of such nature that are mutually acceptable to the parties including without limitation: (i) the operator of the joint venture from time to time; (ii) Myriad's potential right to earn an additional 25% interest (for a total interest of 100%) in and to the Property at fair market value; and (iii) a 50% net profit interest held by Rush on the initial $50,000,000 in net profits from the Property, following commencement of commercial production.</p><p>Any Shares issued under the Agreement will be subject to a four month hold period under applicable securities laws. The Shares issued as of the Effective Date are subject to a four month hold period expiring February 20, 2024.  The value of any Shares issued under the Agreement following the Effective Date will be the value weighted average trading price of the Shares on the Canadian Securities Exchange (or such other Canadian stock exchange on which the Shares are trading at the applicable time) for the 10 trading days preceding the date on which such Shares are issued.</p><p><b>About Myriad Uranium Corp.</b></p><p>Myriad Uranium Corp. is a uranium exploration company with an earnable 75% interest in the Copper Mountain Uranium Project in Wyoming, USA.   Copper Mountain hosts several known uranium deposits and historic uranium mines, including the Arrowhead Mine which produced 500,000 lbs of eU<sub>3</sub>O<sub>8</sub>.  Copper Mountain saw extensive drilling and development by Rocky Mountain Energy, a subsidiary of Union Pacific, which developed a mine plan and built a leach pad for one of the deposits at Copper Mountain.  Operations ceased in 1980 before mining could commence due to falling uranium prices.  Approximately 2,000 boreholes have been drilled at Copper Mountain and the project area has significant exploration upside.   </p><p>Myriad also holds 80% ownership of over 1,800 km<sup>2</sup> of uranium exploration licenses in the Tim Mersoi&#776; Basin, Niger, and the option to earn up to 100%.  These licenses are surrounded by many of the most significant uranium deposits in Africa, including Orano's 384 Mlbs eU<sub>3</sub>O<sub>8</sub> Imouraren, Global Atomic's 236 Mlbs Dasa, and Goviex's 100 Mlbs Madaouela, and on the same fault structures.  Myriad also has a 50% interest in the Millen Mountain Property in Nova Scotia, Canada, with the other 50% held by Probe Metals Inc. For further information, please refer to Myriad's disclosure record on SEDAR+ (<a href=\"https://api.newsfilecorp.com/redirect/DZBoVsgXvK\">www.sedarplus.ca</a>), contact Myriad by telephone at +1.604.418.2877, or refer to Myriad's website at <a href=\"https://api.newsfilecorp.com/redirect/rvmy2c5rzQ\">www.myriaduranium.com</a>.   </p><p>A new informative video relating to this transaction is <a href=\"https://api.newsfilecorp.com/redirect/V70XJTbeRN\">here</a>.  A video announcing the Copper Mountain transaction is <a href=\"https://api.newsfilecorp.com/redirect/zE7x2URoEJ\">here</a>.  The Company's factsheet is <a href=\"https://api.newsfilecorp.com/redirect/AMV03SMvmB\">here</a>.</p><p><b>Myriad Contacts:</b></p><p>Thomas Lamb<br />President and Chief Executive Officer<br /><a href=\"mailto:tlamb@myriaduranium.com\">tlamb@myriaduranium.com</a></p><p style=\"text-align: center;\">###</p><p><i>Mineralization hosted on adjacent or nearby properties is not necessarily indicative of mineralization hosted on the Company's properties. This news release contains \"forward-looking information\" that is based on the Company's current expectations, estimates, forecasts and projections. This forward-looking information includes, among other things, the Company's business, plans, outlook and business strategy. The words \"may\", \"would\", \"could\", \"should\", \"will\", \"likely\", \"expect,\" \"anticipate,\" \"intend\", \"estimate\", \"plan\", \"forecast\", \"project\" and \"believe\" or other similar words and phrases are intended to identify forward-looking information. The reader is cautioned that assumptions used in the preparation of any forward-looking information may prove to be incorrect, including with respect to the Company's business plans respecting the exploration and development of the Company's mineral properties, the proposed work program on the Company's mineral properties and the potential and economic viability of the Company's mineral properties. Forward-Looking information is subject to known and unknown risks, uncertainties and other factors that may cause the Company's actual results, level of activity, performance or achievements to be materially different from those expressed or implied by such forward-looking information. Such factors include, but are not limited to: changes in economic conditions or financial markets; increases in costs; litigation; legislative, environmental and other judicial, regulatory, political and competitive developments; and technological or operational difficulties. This list is not exhaustive of the factors that may affect our forward-looking information. These and other factors should be considered carefully, and readers should not place undue reliance on such forward-looking information. The Company does not intend, and expressly disclaims any intention or obligation to, update or revise any forward-looking information whether as a result of new information, future events or otherwise, except as required by applicable law. </i></p><p><i>The CSE has not reviewed, approved or disapproved the contents of this news release. </i></p><p id=\"corporateNewsLogoContainer\"><img src=\"https://images.newsfilecorp.com/files/6301/184637_a90be49a64519a0b_logo.jpg\" id=\"corporateNewsLogo\" alt=\"Corporate Logo\" /></p><p id=\"corporateLinkBack\">To view the source version of this press release, please visit <a href=\"https://api.newsfilecorp.com/redirect/ZAqzeFez3Q\">https://www.newsfilecorp.com/release/184637</a></p>",
    "search_terms": "Copper Mountain,Myriad Uranium Corp.,M",
    "master_gid": 4300,
    "date": "2023-10-20T11:00:00.000Z",
    "tags": "|||Copper,Uranium|Project Acquisition",
    "image_id": null,
    "hidden": false,
    "company_id": 1558,
    "provider": null,
    "excerpt": "Vancouver, British Columbia--(Newsfile Corp. - October 20, 2023) -Myriad Uranium Corp.&#160;(CSE: M) (OTCQB: MYRUF) (FSE: C3Q)&#160;(\"Myriad\" or the \"Company\") is pleased to announce that it has signed a property option agreement dated as of October 18, 2023 (the \"Option Agreement\") with Rush Rare Metals Corp. (\"Rush\") pursuant to which Myriad",
    "is_regulatory": false,
    "refined_tags": [
      "Project Acquisition"
    ],
    "ftp_filename": null,
    "company_name": "Myriad Uranium Corp.",
    "exchange": "CSE",
    "root_ticker": "M",
    "project_name": "Copper Mountain",
    "gid": 4300,
    "location": "Wyoming, United States",
    "plan_id": null,
    "description_text": "Vancouver, British Columbia--(Newsfile Corp. - October 20, 2023) - Myriad Uranium Corp. (CSE: M) (OTCQB: MYRUF) (FSE: C3Q) (\" Myriad \" or the \" Company \") is pleased to announce that it has signed a property option agreement dated as of October 18, 2023 (the \"Option Agreement\") with Rush Rare Metals Corp. (\"Rush\") pursuant to which Myriad has the option (the \"Option\") to earn up to a 75% interest in and to Rush's Copper Mountain Project (the \"Property\"), comprised of 110 mineral claims in the State of Wyoming covering approximately 1,911 acres.  The Option Agreement replaces the binding letter of intent between the parties, as previously announced (see Myriad's news release dated September 18, 2023). \"This is a transformative deal for us with a superb partner in Rush,\" stated Myriad's CEO, Thomas Lamb.   \"Copper Mountain is a historic producer.  One of its mines, the Arrowhead, produced 500,000 lbs eU 3 O 8 in the 1950s and 1960s.  The Property contains a number of other known uranium deposits and there is good potential to discover more.  Rocky Mountain Energy, a subsidiary of Union Pacific, drilled approximately 2,000 boreholes at Copper Mountain between 1969 and 1980.  They spent upwards of US$78 million advancing Copper Mountain (2023 dollars), planned a mine for one of its deposits, and built a leach pad.  Operations came to a halt in 1980 due to falling uranium prices.  There is also a great deal of exciting exploration upside at Copper Mountain.  Known high-grade areas have not yet been followed up, and new, more modern paragenesis theories could guide us to big discoveries. Finally, historical reports suggest the ore at Copper Mountain is leachable and does not require a mill, and it may even be ISR-amenable.  Wyoming is the centre of uranium mining in the USA and many of its operations are ISR.\" Under the Option Agreement, Myriad has the option to acquire an initial 50% interest in the Property by: (1) making an initial cash payment of $100,000 to Rush and issuing 576,209 common shares of Myriad (each, a \"Share\") to Rush on the date of execution (the \"Effective Date\") of the Agreement; (2) making an additional cash payment of $35,000 to Rush on the date which is 90 days from the Effective Date; (3) issuing an additional $150,000 worth of Shares to Rush on the date which is one year from the Effective Date; (4) issuing an additional $250,000 worth of Shares to Rush on the date which is two years from the Effective Date; and (5) within two years of the Effective Date, making expenditures of no less than $1,500,000 on the Property. On successfully earning a 50% interest in the Property, Myriad will have the option to acquire an additional 25% interest (for a total interest of 75%) in the Property by making additional expenditures of no less than $4,000,000 (for total expenditures of no less than $5,500,000) on the Property within four years of the Effective Date.  In addition, upon completion of a Preliminary Economic Assessment or Prefeasibility Study respecting the Property, Myriad shall be obligated to issue an additional $2,500,000 worth of Shares to Rush. Upon Myriad successfully earning a 50% or 75% interest in and to the Property, as the case may be, the parties will form a joint venture for the purposes of the continued exploration, development and exploitation of the Property and will negotiate, execute and deliver a joint venture agreement which shall include such terms and conditions normally provided for in commercial transactions of such nature that are mutually acceptable to the parties including without limitation: (i) the operator of the joint venture from time to time; (ii) Myriad's potential right to earn an additional 25% interest (for a total interest of 100%) in and to the Property at fair market value; and (iii) a 50% net profit interest held by Rush on the initial $50,000,000 in net profits from the Property, following commencement of commercial production. Any Shares issued under the Agreement will be subject to a four month hold period under applicable securities laws. The Shares issued as of the Effective Date are subject to a four month hold period expiring February 20, 2024.  The value of any Shares issued under the Agreement following the Effective Date will be the value weighted average trading price of the Shares on the Canadian Securities Exchange (or such other Canadian stock exchange on which the Shares are trading at the applicable time) for the 10 trading days preceding the date on which such Shares are issued. About Myriad Uranium Corp. Myriad Uranium Corp. is a uranium exploration company with an earnable 75% interest in the Copper Mountain Uranium Project in Wyoming, USA.   Copper Mountain hosts several known uranium deposits and historic uranium mines, including the Arrowhead Mine which produced 500,000 lbs of eU 3 O 8 .  Copper Mountain saw extensive drilling and development by Rocky Mountain Energy, a subsidiary of Union Pacific, which developed a mine plan and built a leach pad for one of the deposits at Copper Mountain.  Operations ceased in 1980 before mining could commence due to falling uranium prices.  Approximately 2,000 boreholes have been drilled at Copper Mountain and the project area has significant exploration upside. Myriad also holds 80% ownership of over 1,800 km 2 of uranium exploration licenses in the Tim Mersoï Basin, Niger, and the option to earn up to 100%.  These licenses are surrounded by many of the most significant uranium deposits in Africa, including Orano's 384 Mlbs eU 3 O 8 Imouraren, Global Atomic's 236 Mlbs Dasa, and Goviex's 100 Mlbs Madaouela, and on the same fault structures.  Myriad also has a 50% interest in the Millen Mountain Property in Nova Scotia, Canada, with the other 50% held by Probe Metals Inc. For further information, please refer to Myriad's disclosure record on SEDAR+ ( www.sedarplus.ca ), contact Myriad by telephone at +1.604.418.2877, or refer to Myriad's website at www.myriaduranium.com . A new informative video relating to this transaction is here .  A video announcing the Copper Mountain transaction is here .  The Company's factsheet is here . Myriad Contacts: Thomas Lamb President and Chief Executive Officer tlamb@myriaduranium.com ### Mineralization hosted on adjacent or nearby properties is not necessarily indicative of mineralization hosted on the Company's properties. This news release contains \"forward-looking information\" that is based on the Company's current expectations, estimates, forecasts and projections. This forward-looking information includes, among other things, the Company's business, plans, outlook and business strategy. The words \"may\", \"would\", \"could\", \"should\", \"will\", \"likely\", \"expect,\" \"anticipate,\" \"intend\", \"estimate\", \"plan\", \"forecast\", \"project\" and \"believe\" or other similar words and phrases are intended to identify forward-looking information. The reader is cautioned that assumptions used in the preparation of any forward-looking information may prove to be incorrect, including with respect to the Company's business plans respecting the exploration and development of the Company's mineral properties, the proposed work program on the Company's mineral properties and the potential and economic viability of the Company's mineral properties. Forward-Looking information is subject to known and unknown risks, uncertainties and other factors that may cause the Company's actual results, level of activity, performance or achievements to be materially different from those expressed or implied by such forward-looking information. Such factors include, but are not limited to: changes in economic conditions or financial markets; increases in costs; litigation; legislative, environmental and other judicial, regulatory, political and competitive developments; and technological or operational difficulties. This list is not exhaustive of the factors that may affect our forward-looking information. These and other factors should be considered carefully, and readers should not place undue reliance on such forward-looking information. The Company does not intend, and expressly disclaims any intention or obligation to, update or revise any forward-looking information whether as a result of new information, future events or otherwise, except as required by applicable law. The CSE has not reviewed, approved or disapproved the contents of this news release. To view the source version of this press release, please visit https://www.newsfilecorp.com/release/184637",
    "primary_commodity": "U"
  },
  "articleProject": {
    "gid": 4300,
    "project_name": "Copper Mountain",
    "location": "Wyoming, United States"
  },
  "articleExchange": "CSE",
  "articleCompanyId": 1558,
  "articleTicker": "M",
  "articleCompanyName": "Myriad Uranium Corp.",
  "allOtherCompanyProjects": [
    {
      "company_id": 1558,
      "gid": 4762,
      "project_name": "Afouday",
      "location": "Niger"
    },
    {
      "company_id": 1558,
      "gid": 4764,
      "project_name": "Tagait 3",
      "location": "Niger"
    },
    {
      "company_id": 1558,
      "gid": 6029,
      "project_name": "Millen Mountain",
      "location": "Nova Scotia, Canada"
    },
    {
      "company_id": 1558,
      "gid": 4761,
      "project_name": "Agebout",
      "location": "Niger"
    },
    {
      "company_id": 1558,
      "gid": 4763,
      "project_name": "Tagait 2",
      "location": "Niger"
    },
    {
      "company_id": 1558,
      "gid": 6775,
      "project_name": "Bonanza-Kermac",
      "location": "Wyoming, United States"
    },
    {
      "company_id": 1558,
      "gid": 6421,
      "project_name": "Knob Claims",
      "location": "Wyoming, United States"
    }
  ],
  "allOtherCompanyNews": [
    {
      "id": 107877,
      "company_id": 1558,
      "title": "Myriad Uranium Announces Private Placement",
      "link": null,
      "date": "2025-06-12T21:25:00.000Z",
      "hidden": false
    },
    {
      "id": 107652,
      "company_id": 1558,
      "title": "Myriad Uranium Reports Final Chemical Assays from Copper Mountain. Grades Up to 60% Higher Than Probe Equivalents, with Positive Implications for Scale and Scope of the Project. Plan of Operations Application Submitted to Drill High Priority Prospects",
      "link": null,
      "date": "2025-06-11T11:30:00.000Z",
      "hidden": false
    },
    {
      "id": 105552,
      "company_id": 1558,
      "title": "Myriad Uranium Corp. Announces Extension of Warrants",
      "link": null,
      "date": "2025-05-22T20:44:00.000Z",
      "hidden": false
    },
    {
      "id": 103827,
      "company_id": 1558,
      "title": "Myriad Uranium Expands its New Mexico Land Position, Now Controls Significant High Grade Historical Resources and Vast Majority of Historical Boreholes at Red Basin",
      "link": null,
      "date": "2025-05-07T11:30:00.000Z",
      "hidden": false
    },
    {
      "id": 102155,
      "company_id": 1558,
      "title": "Myriad Uranium Reports Chemical Assays from Eight More Boreholes at Copper Mountain. Assays Continue to Be up to 50% Higher than Probe Grades Previously Reported.",
      "link": null,
      "date": "2025-04-29T11:30:00.000Z",
      "hidden": false
    },
    {
      "id": 98301,
      "company_id": 1558,
      "title": "Myriad Uranium Appoints Eduards Smirnovs as Industry Advisor",
      "link": null,
      "date": "2025-04-01T11:30:00.000Z",
      "hidden": false
    },
    {
      "id": 91528,
      "company_id": 1558,
      "title": "Myriad Uranium Reports Chemical Assays on 20 Copper Mountain Boreholes. Confirmed U3O8 Grades Are 20% Higher on Average than Previously Reported Gamma Grades. Assays also Reveal the Presence of Extensive Uranium Mineralisation That Could Not Be Detected by the Probe, with Potential Positive Implications for Historical Estimates. Large Number of Additional Intervals to Be Sent for Assay",
      "link": null,
      "date": "2025-03-17T11:30:00.000Z",
      "hidden": false
    },
    {
      "id": 87551,
      "company_id": 1558,
      "title": "Myriad Uranium Issues Shares under Option to Acquire 100% of the Red Basin Uranium Project in New Mexico, USA",
      "link": "https://www.newsfilecorp.com/release/240503/Myriad-Uranium-Issues-Shares-under-Option-to-Acquire-100-of-the-Red-Basin-Uranium-Project-in-New-Mexico-USA",
      "date": "2025-02-12T00:21:00.000Z",
      "hidden": false
    },
    {
      "id": 86759,
      "company_id": 1558,
      "title": "Myriad Uranium Enters into Option to Acquire 100% of the Red Basin Uranium Project in New Mexico, USA",
      "link": "https://www.newsfilecorp.com/release/239518/Myriad-Uranium-Enters-into-Option-to-Acquire-100-of-the-Red-Basin-Uranium-Project-in-New-Mexico-USA",
      "date": "2025-02-04T12:30:00.000Z",
      "hidden": false
    },
    {
      "id": 85660,
      "company_id": 1558,
      "title": "Myriad Uranium Grants Stock Options and RSUs",
      "link": "https://www.newsfilecorp.com/release/238802/Myriad-Uranium-Grants-Stock-Options-and-RSUs",
      "date": "2025-01-29T12:30:00.000Z",
      "hidden": false
    }
  ]
}
