{
  "article": {
    "id": 49603,
    "link": "https://www.accesswire.com/viewarticle.aspx?id=836816&lang=en",
    "title": "Rush Rare Metals Announces Expansion of Copper Mountain Project",
    "description": "<p><strong>VANCOUVER, BC / ACCESSWIRE / February 27, 2024 / Rush Rare Metals Corp.</strong> (&quot;<strong>Rush</strong>&quot; or the &quot;<strong>Company</strong>&quot;) (CSE:RSH) is pleased to announce the staking of the Knob claims in Wyoming, comprised of 52 mineral claims aggregating 780 acres. The claims now form part of Rush's Copper Mountain Project, which is the subject of an option/earn-in agreement between Rush and Myriad Uranium Corp. (&quot;Myriad&quot;), pursuant to which Myriad can earn a 50% interest in the project by spending $1.5m exploring Copper Mountain, and 75% by spending a total of $5.5m, with Myriad shares and other incentives triggered for Rush at certain progress thresholds (see Rush news release dated October 20,<sup> </sup>2023 for further details).</p><p>&quot;This clearly demonstrates a part of the ongoing value of the new data found surrounding previous work at Copper Mountain,&quot; said Peter Smith, CEO of Rush. &quot;Not only does the data give the project an enormous head-start in terms of exploration within our current clam area, but it also gives us some fantastic data regarding other uranium previously encountered in the immediate area. Knob itself has historical work showing huge uranium potential, and there are other areas indicated in the materials as being highly prospective, which we are acquiring. As the data was mostly collected many years ago, a great deal of it is ‘paper only', and thus, we are among the only people with access to it. It's possible that in our partnership with Myriad, and through access to this data, we will have the ability to compile a uranium district at Copper Mountain, with multiple high-confidence uranium targets based on millions in historical spending.&quot;</p><p><strong>About Rush Rare Metals Corp.</strong></p><p>Rush Rare Metals Corp. is a mineral exploration company focused on its Boxi Property located in the Province of Québec, Canada. Rush also owns the Copper Mountain Project located in Wyoming, USA. For further information, please refer to Rush's disclosure record on SEDAR+ (www.sedarplus.ca) or contact Rush by email at <a href=\"mailto:psmith@rushraremetals.com\">psmith@rushraremetals.com</a> or by telephone at 778.999.7030, or refer to Rush's website at <a href=\"https://pr.report/U9H7P2o8\">www.rushraremetals.com</a>.</p><p><strong>Rush Contacts:</strong><br />Peter Smith<br />Chief Executive Officer<br /><a href=\"mailto:psmith@rushraremetals.com\">psmith@rushraremetals.com</a></p><p>###</p><p><i>Mineralization hosted on adjacent or nearby properties is not necessarily indicative of mineralization hosted on the Company's properties. Certain statements in this news release are forward-looking statements, including with respect to future plans, and other matters. Forward-looking statements consist of statements that are not purely historical, including any statements regarding beliefs, plans, expectations or intentions regarding the future. Such information can generally be identified by the use of forwarding-looking wording such as &quot;may&quot;, &quot;expect&quot;, &quot;estimate&quot;, &quot;anticipate&quot;, &quot;intend&quot;, &quot;believe&quot; and &quot;continue&quot; or the negative thereof or similar variations. The reader is cautioned that assumptions used in the preparation of any forward-looking information may prove to be incorrect. Events or circumstances may cause actual results to differ materially from those predicted, as a result of numerous known and unknown risks, uncertainties, and other factors, many of which are beyond the control of the Company, including but not limited to, business, economic and capital market conditions, the ability to manage operating expenses, and dependence on key personnel. Such statements and information are based on numerous assumptions regarding present and future business strategies and the environment in which the Company will operate in the future, anticipated costs, and the ability to achieve goals. Factors that could cause the actual results to differ materially from those in forward-looking statements include, the continued availability of capital and financing, litigation, loss of key employees and consultants, and general economic, market or business conditions. Forward-looking statements contained in this news release are expressly qualified by this cautionary statement. The reader is cautioned not to place undue reliance on any forward-looking information.</i></p><p><i>The forward-looking statements contained in this news release are made as of the date of this news release. Except as required by law, the Company disclaims any intention and assumes no obligation to update or revise any forward-looking statements, whether as a result of new information, future events or otherwise.</i></p><p><i>The CSE has not reviewed, approved or disapproved the contents of this news release.</i></p><p><strong>SOURCE:</strong> Rush Rare Metals Corp.</p><br><br>View the original <a href='https://www.accesswire.com/836816/rush-rare-metals-announces-expansion-of-copper-mountain-project'>press release</a> on accesswire.com<br><br>",
    "search_terms": "Copper Mountain,Rush Rare Metals Corp.,RSH",
    "master_gid": 4300,
    "date": "2024-02-27T12:30:00.000Z",
    "tags": "USA|Wyoming||Copper,Uranium|Project Acquisition",
    "image_id": null,
    "hidden": false,
    "company_id": 2390,
    "provider": "accesswire",
    "excerpt": "VANCOUVER, BC / ACCESSWIRE / February 27, 2024 / Rush Rare Metals Corp.(&quot;Rush&quot; or the &quot;Company&quot;) (CSE:RSH) is pleased to announce the staking of the Knob claims in Wyoming, comprised of 52 mineral claims aggregating 780 acres. The claims now form part of Rush's Copper Mountain Project, which is the",
    "is_regulatory": false,
    "refined_tags": [
      "Project Acquisition"
    ],
    "ftp_filename": null,
    "company_name": "Myriad Uranium Corp.",
    "exchange": "CSE",
    "root_ticker": "RSH",
    "project_name": "Copper Mountain",
    "gid": 4300,
    "location": "Wyoming, United States",
    "plan_id": null,
    "description_text": "VANCOUVER, BC / ACCESSWIRE / February 27, 2024 / Rush Rare Metals Corp. (\" Rush \" or the \" Company \") (CSE:RSH) is pleased to announce the staking of the Knob claims in Wyoming, comprised of 52 mineral claims aggregating 780 acres. The claims now form part of Rush's Copper Mountain Project, which is the subject of an option/earn-in agreement between Rush and Myriad Uranium Corp. (\"Myriad\"), pursuant to which Myriad can earn a 50% interest in the project by spending $1.5m exploring Copper Mountain, and 75% by spending a total of $5.5m, with Myriad shares and other incentives triggered for Rush at certain progress thresholds (see Rush news release dated October 20, 2023 for further details). \"This clearly demonstrates a part of the ongoing value of the new data found surrounding previous work at Copper Mountain,\" said Peter Smith, CEO of Rush. \"Not only does the data give the project an enormous head-start in terms of exploration within our current clam area, but it also gives us some fantastic data regarding other uranium previously encountered in the immediate area. Knob itself has historical work showing huge uranium potential, and there are other areas indicated in the materials as being highly prospective, which we are acquiring. As the data was mostly collected many years ago, a great deal of it is ‘paper only', and thus, we are among the only people with access to it. It's possible that in our partnership with Myriad, and through access to this data, we will have the ability to compile a uranium district at Copper Mountain, with multiple high-confidence uranium targets based on millions in historical spending.\" About Rush Rare Metals Corp. Rush Rare Metals Corp. is a mineral exploration company focused on its Boxi Property located in the Province of Québec, Canada. Rush also owns the Copper Mountain Project located in Wyoming, USA. For further information, please refer to Rush's disclosure record on SEDAR+ (www.sedarplus.ca) or contact Rush by email at psmith@rushraremetals.com or by telephone at 778.999.7030, or refer to Rush's website at www.rushraremetals.com . Rush Contacts: Peter Smith Chief Executive Officer psmith@rushraremetals.com ### Mineralization hosted on adjacent or nearby properties is not necessarily indicative of mineralization hosted on the Company's properties. Certain statements in this news release are forward-looking statements, including with respect to future plans, and other matters. Forward-looking statements consist of statements that are not purely historical, including any statements regarding beliefs, plans, expectations or intentions regarding the future. Such information can generally be identified by the use of forwarding-looking wording such as \"may\", \"expect\", \"estimate\", \"anticipate\", \"intend\", \"believe\" and \"continue\" or the negative thereof or similar variations. The reader is cautioned that assumptions used in the preparation of any forward-looking information may prove to be incorrect. Events or circumstances may cause actual results to differ materially from those predicted, as a result of numerous known and unknown risks, uncertainties, and other factors, many of which are beyond the control of the Company, including but not limited to, business, economic and capital market conditions, the ability to manage operating expenses, and dependence on key personnel. Such statements and information are based on numerous assumptions regarding present and future business strategies and the environment in which the Company will operate in the future, anticipated costs, and the ability to achieve goals. Factors that could cause the actual results to differ materially from those in forward-looking statements include, the continued availability of capital and financing, litigation, loss of key employees and consultants, and general economic, market or business conditions. Forward-looking statements contained in this news release are expressly qualified by this cautionary statement. The reader is cautioned not to place undue reliance on any forward-looking information. The forward-looking statements contained in this news release are made as of the date of this news release. Except as required by law, the Company disclaims any intention and assumes no obligation to update or revise any forward-looking statements, whether as a result of new information, future events or otherwise. The CSE has not reviewed, approved or disapproved the contents of this news release. SOURCE: Rush Rare Metals Corp. View the original press release on accesswire.com",
    "primary_commodity": "U"
  },
  "articleProject": {
    "gid": 4300,
    "project_name": "Copper Mountain",
    "location": "Wyoming, United States"
  },
  "articleExchange": "CSE",
  "articleCompanyId": 2390,
  "articleTicker": "RSH",
  "articleCompanyName": "Rush Rare Metals Corp.",
  "allOtherCompanyProjects": [
    {
      "company_id": 2390,
      "gid": 4300,
      "project_name": "Copper Mountain",
      "location": "Wyoming, United States"
    },
    {
      "company_id": 2390,
      "gid": 4413,
      "project_name": "Boxi",
      "location": "Quebec, Canada"
    }
  ],
  "allOtherCompanyNews": [
    {
      "id": 106554,
      "company_id": 2390,
      "title": "Rush Rare Metals Provides Updates Surrounding Boxi Property and Copper Mountain Property",
      "link": null,
      "date": "2025-06-02T11:30:00.000Z",
      "hidden": false
    },
    {
      "id": 84734,
      "company_id": 2390,
      "title": "Rush Confirms Significant Expansion of Copper Mountain Uranium Project Claim Area and Provides Boxi Progress Update",
      "link": "https://www.accessnewswire.com/newsroom/en/metals-and-mining/rush-confirms-significant-expansion-of-copper-mountain-uranium-project-claim-area-and-provides-boxi-progress-update-971240",
      "date": "2025-01-21T12:30:00.000Z",
      "hidden": false
    },
    {
      "id": 80254,
      "company_id": 2390,
      "title": "Myriad Uranium Concludes Maiden Drill Campaign at Rush’s Copper Mountain Project",
      "link": "https://www.accesswire.com/948317/myriad-uranium-concludes-maiden-drill-campaign-at-rushs-copper-mountain-project",
      "date": "2024-11-27T23:20:00.000Z",
      "hidden": false
    },
    {
      "id": 76347,
      "company_id": 2390,
      "title": "Myriad Uranium Exercises Initial 50% Option On Rush's Copper Mountain Project",
      "link": "https://www.accesswire.com/936179/myriad-uranium-exercises-initial-50-option-on-rushs-copper-mountain-project",
      "date": "2024-10-28T20:00:00.000Z",
      "hidden": false
    },
    {
      "id": 75706,
      "company_id": 2390,
      "title": "Myriad Uranium Provides Initial Drill Results On Rush’s Copper Mountain Project",
      "link": "https://www.accesswire.com/viewarticle.aspx?id=934583&lang=en",
      "date": "2024-10-23T11:30:00.000Z",
      "hidden": false
    },
    {
      "id": 75412,
      "company_id": 2390,
      "title": "Myriad Uranium To Accelerate 50% Option on Rush's Copper Mountain Project",
      "link": "https://www.accesswire.com/viewarticle.aspx?id=933904&lang=en",
      "date": "2024-10-21T20:00:00.000Z",
      "hidden": false
    },
    {
      "id": 75152,
      "company_id": 2390,
      "title": "Rush Rare Metals Updates Regarding Copper Mountain",
      "link": "https://www.accesswire.com/viewarticle.aspx?id=932817&lang=en",
      "date": "2024-10-17T20:00:00.000Z",
      "hidden": false
    },
    {
      "id": 72385,
      "company_id": 2390,
      "title": "Rush Rare Metals Updates Regarding Newly Discovered Historical High-Grade Intervals and Other Insights at Copper Mountain",
      "link": "https://www.accesswire.com/viewarticle.aspx?id=922275&lang=en",
      "date": "2024-09-24T13:30:00.000Z",
      "hidden": false
    },
    {
      "id": 70866,
      "company_id": 2390,
      "title": "Rush Rare Metals Updates Regarding Myriad's Recent Ground Magnetometer Survey at the Copper Mountain Uranium Project, Wyoming",
      "link": "https://www.accesswire.com/viewarticle.aspx?id=915177&lang=en",
      "date": "2024-09-10T11:30:00.000Z",
      "hidden": false
    },
    {
      "id": 69157,
      "company_id": 2390,
      "title": "Rush Rare Metals Updates Regarding Myriad’s Ongoing Financing, Amends Property Option Agreement, and Provides Boxi Property Update ",
      "link": "https://www.accesswire.com/viewarticle.aspx?id=906253&lang=en",
      "date": "2024-08-23T11:30:00.000Z",
      "hidden": false
    }
  ]
}