{
  "article": {
    "id": 76347,
    "link": "https://www.accesswire.com/936179/myriad-uranium-exercises-initial-50-option-on-rushs-copper-mountain-project",
    "title": "Myriad Uranium Exercises Initial 50% Option On Rush's Copper Mountain Project",
    "description": "<p><strong id=\"dateline\">VANCOUVER, BC / ACCESSWIRE / October 28, 2024 / </strong><strong>Rush Rare Metals Corp. </strong>(<strong>CSE:RSH</strong>) (\"<strong>Rush</strong>\" or the \"<strong>Company</strong>) is pleased to advise that Rush's earn-in partner on the Copper Mountain uranium property in Wyoming, Myriad Uranium Corp. (CSE:M)(OTCQB:MYRUF)(FRA:C3Q) (\"Myriad\"), has exercised its option to acquire an initial 50% interest (subject to certain underlying NSR royalties) in Rush's Copper Mountain Project under the property option agreement between Rush and Myriad dated October 18, 2023, as amended (see announcements <a rel=\"nofollow\" href=\"https://pr.report/3tyn\">here</a> and <a rel=\"nofollow\" href=\"https://pr.report/3tyo\">here</a>).</p><p>In conjunction with Myriad's exercise of the option, Myriad has issued to Rush an aggregate of 1,093,702 Myriad common shares (each, a \"Share\") having an aggregate value of $400,000, representing a deemed price per Share of approximately $0.365, calculated based on the 10 day value-weighted average price of Myriad's common shares, as stipulated in the option agreement. Pursuant to applicable securities laws, the Shares are subject to a hold period of four months and a day expiring February 26, 2025.</p><p>Peter Smith, Rush's CEO, commented \"We are very excited to be joined with Myriad in developing this extraordinary project at Copper Mountain. The project area has been continuously and systematically expanded to now cover a multitude of highly prospective uranium occurrences, all originally identified through tens of millions in exploration spending, and we have now also started the process of confirming all this historical data with new drilling. With uranium demand and the need for North American supply increasing, and with Wyoming quickly being recognized as the world's premier uranium exploration jurisdiction, everything appears to be lining up very well for Copper Mountain - we very much look forward to releasing more drilling results very soon.\"</p><p><strong>About Rush Rare Metals Corp.</strong></p><p>Rush Rare Metals Corp. is a mineral exploration company focused on its Boxi Property located in the Province of Québec, Canada. Rush also owns the Copper Mountain Project located in Wyoming, USA, which it has optioned to Myriad Uranium Corp. Rush currently has a 100% interest in both properties. For further information, please refer to Rush's disclosure record on SEDAR+ (<a rel=\"nofollow\" href=\"https://pr.report/3typ\">www.sedarplus.ca</a>) or contact Rush by email at <a rel=\"nofollow\" href=\"mailto:psmith@rushraremetals.com\">psmith@rushraremetals.com</a> or by telephone at 778.999.7030, or refer to Rush's website at <a rel=\"nofollow\" href=\"https://pr.report/3tyq\">www.rushraremetals.com</a>.</p><p>Rush Contacts:</p><p>Peter Smith<br>Chief Executive Officer<br><a rel=\"nofollow\" href=\"mailto:psmith@rushraremetals.com\">psmith@rushraremetals.com</a></p><p>###</p><p><i>Mineralization hosted on adjacent or nearby properties is not necessarily indicative of mineralization hosted on the Company's properties. Certain statements in this news release are forward-looking statements, including with respect to future plans, and other matters. Forward-looking statements consist of statements that are not purely historical, including any statements regarding beliefs, plans, expectations or intentions regarding the future. Such information can generally be identified by the use of forwarding-looking wording such as \"may\", \"expect\", \"estimate\", \"anticipate\", \"intend\", \"believe\" and \"continue\" or the negative thereof or similar variations. The reader is cautioned that assumptions used in the preparation of any forward-looking information may prove to be incorrect. Events or circumstances may cause actual results to differ materially from those predicted, as a result of numerous known and unknown risks, uncertainties, and other factors, many of which are beyond the control of the Company, including but not limited to, business, economic and capital market conditions, the ability to manage operating expenses, and dependence on key personnel. Such statements and information are based on numerous assumptions regarding present and future business strategies and the environment in which the Company will operate in the future, anticipated costs, and the ability to achieve goals. Factors that could cause the actual results to differ materially from those in forward-looking statements include, the continued availability of capital and financing, litigation, loss of key employees and consultants, and general economic, market or business conditions. Forward-looking statements contained in this news release are expressly qualified by this cautionary statement. The reader is cautioned not to place undue reliance on any forward-looking information.</i></p><p><i>The forward-looking statements contained in this news release are made as of the date of this news release. Except as required by law, the Company disclaims any intention and assumes no obligation to update or revise any forward-looking statements, whether as a result of new information, future events or otherwise.</i></p><p><i>The CSE has not reviewed, approved or disapproved the contents of this news release.</i></p><p><strong>SOURCE:</strong> Rush Rare Metals Corp.</p><br><br>View the original <a href='https://www.accesswire.com/936179/myriad-uranium-exercises-initial-50-option-on-rushs-copper-mountain-project'>press release</a> on accesswire.com<br><br>",
    "search_terms": "Copper Mountain,Rush Rare Metals Corp.,RSH",
    "master_gid": 4300,
    "date": "2024-10-28T20:00:00.000Z",
    "tags": "USA|Wyoming||Copper,Uranium|Project Acquisition",
    "image_id": null,
    "hidden": false,
    "company_id": 2390,
    "provider": "accesswire",
    "excerpt": "VANCOUVER, BC / ACCESSWIRE / October 28, 2024 /Rush Rare Metals Corp.(CSE:RSH) (\"Rush\" or the \"Company) is pleased to advise that Rush's earn-in partner on the Copper Mountain uranium property in Wyoming, Myriad Uranium Corp. (CSE:M)(OTCQB:MYRUF)(FRA:C3Q) (\"Myriad\"), has exercised its option to acquire an initial 50% interest (subject to certain",
    "is_regulatory": false,
    "refined_tags": [],
    "ftp_filename": null,
    "company_name": "Myriad Uranium Corp.",
    "exchange": "CSE",
    "root_ticker": "RSH",
    "project_name": "Copper Mountain",
    "gid": 4300,
    "location": "Wyoming, United States",
    "plan_id": null,
    "description_text": "VANCOUVER, BC / ACCESSWIRE / October 28, 2024 / Rush Rare Metals Corp. ( CSE:RSH ) (\" Rush \" or the \" Company ) is pleased to advise that Rush's earn-in partner on the Copper Mountain uranium property in Wyoming, Myriad Uranium Corp. (CSE:M)(OTCQB:MYRUF)(FRA:C3Q) (\"Myriad\"), has exercised its option to acquire an initial 50% interest (subject to certain underlying NSR royalties) in Rush's Copper Mountain Project under the property option agreement between Rush and Myriad dated October 18, 2023, as amended (see announcements here and here ). In conjunction with Myriad's exercise of the option, Myriad has issued to Rush an aggregate of 1,093,702 Myriad common shares (each, a \"Share\") having an aggregate value of $400,000, representing a deemed price per Share of approximately $0.365, calculated based on the 10 day value-weighted average price of Myriad's common shares, as stipulated in the option agreement. Pursuant to applicable securities laws, the Shares are subject to a hold period of four months and a day expiring February 26, 2025. Peter Smith, Rush's CEO, commented \"We are very excited to be joined with Myriad in developing this extraordinary project at Copper Mountain. The project area has been continuously and systematically expanded to now cover a multitude of highly prospective uranium occurrences, all originally identified through tens of millions in exploration spending, and we have now also started the process of confirming all this historical data with new drilling. With uranium demand and the need for North American supply increasing, and with Wyoming quickly being recognized as the world's premier uranium exploration jurisdiction, everything appears to be lining up very well for Copper Mountain - we very much look forward to releasing more drilling results very soon.\" About Rush Rare Metals Corp. Rush Rare Metals Corp. is a mineral exploration company focused on its Boxi Property located in the Province of Québec, Canada. Rush also owns the Copper Mountain Project located in Wyoming, USA, which it has optioned to Myriad Uranium Corp. Rush currently has a 100% interest in both properties. For further information, please refer to Rush's disclosure record on SEDAR+ ( www.sedarplus.ca ) or contact Rush by email at psmith@rushraremetals.com or by telephone at 778.999.7030, or refer to Rush's website at www.rushraremetals.com . Rush Contacts: Peter Smith Chief Executive Officer psmith@rushraremetals.com ### Mineralization hosted on adjacent or nearby properties is not necessarily indicative of mineralization hosted on the Company's properties. Certain statements in this news release are forward-looking statements, including with respect to future plans, and other matters. Forward-looking statements consist of statements that are not purely historical, including any statements regarding beliefs, plans, expectations or intentions regarding the future. Such information can generally be identified by the use of forwarding-looking wording such as \"may\", \"expect\", \"estimate\", \"anticipate\", \"intend\", \"believe\" and \"continue\" or the negative thereof or similar variations. The reader is cautioned that assumptions used in the preparation of any forward-looking information may prove to be incorrect. Events or circumstances may cause actual results to differ materially from those predicted, as a result of numerous known and unknown risks, uncertainties, and other factors, many of which are beyond the control of the Company, including but not limited to, business, economic and capital market conditions, the ability to manage operating expenses, and dependence on key personnel. Such statements and information are based on numerous assumptions regarding present and future business strategies and the environment in which the Company will operate in the future, anticipated costs, and the ability to achieve goals. Factors that could cause the actual results to differ materially from those in forward-looking statements include, the continued availability of capital and financing, litigation, loss of key employees and consultants, and general economic, market or business conditions. Forward-looking statements contained in this news release are expressly qualified by this cautionary statement. The reader is cautioned not to place undue reliance on any forward-looking information. The forward-looking statements contained in this news release are made as of the date of this news release. Except as required by law, the Company disclaims any intention and assumes no obligation to update or revise any forward-looking statements, whether as a result of new information, future events or otherwise. The CSE has not reviewed, approved or disapproved the contents of this news release. SOURCE: Rush Rare Metals Corp. View the original press release on accesswire.com",
    "primary_commodity": "U"
  },
  "articleProject": {
    "gid": 4300,
    "project_name": "Copper Mountain",
    "location": "Wyoming, United States"
  },
  "articleExchange": "CSE",
  "articleCompanyId": 2390,
  "articleTicker": "RSH",
  "articleCompanyName": "Rush Rare Metals Corp.",
  "allOtherCompanyProjects": [
    {
      "company_id": 2390,
      "gid": 4300,
      "project_name": "Copper Mountain",
      "location": "Wyoming, United States"
    },
    {
      "company_id": 2390,
      "gid": 4413,
      "project_name": "Boxi",
      "location": "Quebec, Canada"
    }
  ],
  "allOtherCompanyNews": [
    {
      "id": 106554,
      "company_id": 2390,
      "title": "Rush Rare Metals Provides Updates Surrounding Boxi Property and Copper Mountain Property",
      "link": null,
      "date": "2025-06-02T11:30:00.000Z",
      "hidden": false
    },
    {
      "id": 84734,
      "company_id": 2390,
      "title": "Rush Confirms Significant Expansion of Copper Mountain Uranium Project Claim Area and Provides Boxi Progress Update",
      "link": "https://www.accessnewswire.com/newsroom/en/metals-and-mining/rush-confirms-significant-expansion-of-copper-mountain-uranium-project-claim-area-and-provides-boxi-progress-update-971240",
      "date": "2025-01-21T12:30:00.000Z",
      "hidden": false
    },
    {
      "id": 80254,
      "company_id": 2390,
      "title": "Myriad Uranium Concludes Maiden Drill Campaign at Rush’s Copper Mountain Project",
      "link": "https://www.accesswire.com/948317/myriad-uranium-concludes-maiden-drill-campaign-at-rushs-copper-mountain-project",
      "date": "2024-11-27T23:20:00.000Z",
      "hidden": false
    },
    {
      "id": 76347,
      "company_id": 2390,
      "title": "Myriad Uranium Exercises Initial 50% Option On Rush's Copper Mountain Project",
      "link": "https://www.accesswire.com/936179/myriad-uranium-exercises-initial-50-option-on-rushs-copper-mountain-project",
      "date": "2024-10-28T20:00:00.000Z",
      "hidden": false
    },
    {
      "id": 75706,
      "company_id": 2390,
      "title": "Myriad Uranium Provides Initial Drill Results On Rush’s Copper Mountain Project",
      "link": "https://www.accesswire.com/viewarticle.aspx?id=934583&lang=en",
      "date": "2024-10-23T11:30:00.000Z",
      "hidden": false
    },
    {
      "id": 75412,
      "company_id": 2390,
      "title": "Myriad Uranium To Accelerate 50% Option on Rush's Copper Mountain Project",
      "link": "https://www.accesswire.com/viewarticle.aspx?id=933904&lang=en",
      "date": "2024-10-21T20:00:00.000Z",
      "hidden": false
    },
    {
      "id": 75152,
      "company_id": 2390,
      "title": "Rush Rare Metals Updates Regarding Copper Mountain",
      "link": "https://www.accesswire.com/viewarticle.aspx?id=932817&lang=en",
      "date": "2024-10-17T20:00:00.000Z",
      "hidden": false
    },
    {
      "id": 72385,
      "company_id": 2390,
      "title": "Rush Rare Metals Updates Regarding Newly Discovered Historical High-Grade Intervals and Other Insights at Copper Mountain",
      "link": "https://www.accesswire.com/viewarticle.aspx?id=922275&lang=en",
      "date": "2024-09-24T13:30:00.000Z",
      "hidden": false
    },
    {
      "id": 70866,
      "company_id": 2390,
      "title": "Rush Rare Metals Updates Regarding Myriad's Recent Ground Magnetometer Survey at the Copper Mountain Uranium Project, Wyoming",
      "link": "https://www.accesswire.com/viewarticle.aspx?id=915177&lang=en",
      "date": "2024-09-10T11:30:00.000Z",
      "hidden": false
    },
    {
      "id": 69157,
      "company_id": 2390,
      "title": "Rush Rare Metals Updates Regarding Myriad’s Ongoing Financing, Amends Property Option Agreement, and Provides Boxi Property Update ",
      "link": "https://www.accesswire.com/viewarticle.aspx?id=906253&lang=en",
      "date": "2024-08-23T11:30:00.000Z",
      "hidden": false
    }
  ]
}