{
  "article": {
    "id": 84574,
    "link": "https://www.newsfilecorp.com/release/237804/Myriad-Uranium-Announces-Major-Expansion-of-the-Copper-Mountain-Project-Area-to-Lock-Up-Mineralised-Extensions-Historical-Resources-and-Key-Targets",
    "title": "Myriad Uranium Announces Major Expansion of the Copper Mountain Project Area to Lock Up Mineralised Extensions, Historical Resources, and Key Targets",
    "description": "<img src=\"https://api.newsfilecorp.com/newsinfo/237804/367\" id=\"367\" width=\"2\" height=\"2\" style=\"width: 1px;  height: 1px;border: 0px solid;\" /><p>Vancouver, British Columbia--(Newsfile Corp. - January 20, 2025) - <b>Myriad Uranium Corp</b>. (CSE: M) (OTCQB: MYRUF) (FSE: C3Q) (\"<b>Myriad</b>\" or the \"<b>Company</b>\") is pleased to announce an expansion of the Copper Mountain Project Area, from approximately 4,200 acres to approximately 9,320 acres. The selection of newly-acquired areas was guided by insights from the Company's 2024 maiden drill program, proprietary historical data, and advice from Jim Davis, who was General Manager of Union Pacific's exploration program at Copper Mountain during the 1970s.  </p><p>The newly-acquired areas include prospects, generally known as Railroad, Steffen Hill, Cedar Ridge, Mole, West Mesa, and Lucky Cliff, plus extensions into areas of known mineralisation adjacent to Fuller/Utah, Mint, Arrowhead, Midnight, and Knob (see Figure 1 below).  Most of the new areas have historically confirmed uranium mineralisation at surface or subsurface and may be prospective for other minerals, as described in historic reports:</p><ul style=\"list-style-type: disc;\"><li>Railroad: 3 of 5 holes drilled by Anaconda intersected &#62;0.01% eU<sub>3</sub>O<sub>8</sub>. One hole (CM 5-3) intersected 0.1% over 6 ft at 585 ft depth, as well as 400 - 500 ppm at 622 ft, 937 ft and 943 ft.</li><li>Knob: A speculative target of &#60;500,000 lbs eU<sub>3</sub>O<sub>8</sub> at 0.15% was anticipated by Union Pacific, based on limited drilling data.</li><li>Cedar Ridge: Sandstone-hosted mineralisation with up to 0.12% eU<sub>3</sub>O<sub>8</sub> detected in outcrop. Limited drilling done historically, but no physical data is available.</li><li>Steffen Hill (various areas): No specific targets have been identified yet and data is limited, but historic drilling appears to have targeted mineralisation in sandstones. Individual logs show signs of mineralisation (&#62;200 ppm) at 150 ft and 450 ft in certain areas.</li><li>Lucky Cliff: Relatively shallow mineralisation reported. Limited logs available indicate grades &#62;500 ppm eU<sub>3</sub>O<sub>8</sub> with one hole reported to contain 85 ft of 0.12% eU<sub>3</sub>O<sub>8</sub>.</li></ul><p>All areas have significant expansion potential beyond known mineralisation, including at depth. Union Pacific estimated that the potential within their existing deposit areas could exceed 65 Mlbs with further exploration. An assessment by Bendix for the NURE program concluded that the mineral endowment within the known deposit areas could exceed 200 Mlbs and could exceed 600 Mlbs in the greater Copper Mountain district.</p><p>Some of the newly-acquired areas were previously targeted for uranium mineralisation in sandstone. This is important because sandstone-hosted deposits could be more amenable to in-situ recovery methods, if the conditions are favourable. All of the new areas were acquired by staking. A small percentage of tenements at Copper Mountain are split, in that only subsurface rights are held.  In those cases, surface access will be negotiated on a case-by-case basis with surface rights holders as required. </p><p style=\"text-align: center;\"><a rel=\"nofollow\" href=\"https://images.newsfilecorp.com/files/6301/237804_ed45d959946c791a_002full.jpg\"><img src=\"https://images.newsfilecorp.com/files/6301/237804_ed45d959946c791a_002.jpg\" style=\"border-width: 0px;\" alt=\"Cannot view this image? Visit: https://images.newsfilecorp.com/files/6301/237804_ed45d959946c791a_002.jpg\" /></a></p><p style=\"text-align: center;\"><b>Figure 1. The Copper Mountain Uranium Project.</b></p><p style=\"text-align: center;\">To view an enhanced version of this graphic, please visit:<br /><a rel=\"nofollow\" href=\"https://images.newsfilecorp.com/files/6301/237804_ed45d959946c791a_002full.jpg\">https://images.newsfilecorp.com/files/6301/237804_ed45d959946c791a_002full.jpg</a></p><p>Myriad's CEO, Thomas Lamb, commented: <i>\"I've referred to the blue sky potential of Copper Mountain in the past, but perhaps without the emphasis it deserved, since we didn't have all key areas tied up. But now I feel more comfortable doing so. During the 1970s Union Pacific estimated the potential of known deposits and prospects within their areas at Copper Mountain at over 65 Mlbs.  But subsequent estimates by experts such as Bendix (for the US Department of Energy) and the authors of a 2010 comprehensive data review for Neutron Energy (now part of enCore) put the district's potential even higher. All the historical reports suggest something similar: </i></p><p style=\"margin-left: 20px;\"><i>'Field work, drilling and evaluations of the data produced has established that there is potentially a very large resource of uranium at Copper Mountain. Perhaps as much as several hundred million pounds. - Neutron Energy, 2010'  </i></p><p><i>We intend to control the key areas that will enable us to test this potential.  Previous exploration has shown that the newly-acquired areas have exciting potential and could significantly increase our mineral endowment at Copper Mountain.  I should remind readers that all of the estimates of potential I refer to, and, indeed, any other estimates in this news release, are 'historical estimates'.</i></p><p><i>Geological models by various experts suggest that deeper thrust faulting across the Copper Mountain District may have acted as conduits for fluid movement. At Canning, for example, this could have resulted in the potentially significant mineralisation below Union Pacific's 500-600 foot \"hard deck\" maximum drilling depth that we encountered.  It is this deeper mineralisation that Anaconda was chasing at our newly-acquired Railroad prospect and their initial intercepts from just a few holes may help substantiate the hypothesis that there is connected deeper mineralisation across Copper Mountain. </i></p><p><i>I think it's apposite here to quote Jim Davis and D.T. Wilton (2010): </i></p><p style=\"margin-left: 20px;\"><i>'The Copper Mountain Uranium District has an enormous uranium endowment in the granites which make up the core of the Owl Creek mountain range. This uranium endowment, mobilized by extensive hydrothermal solutions acting within a complex structural system and demonstrated host situations, represents an attractive potential for large uranium deposits based on world class models, including the French granites; Nabarlek, Australia and Beaverlodge, Canada.'  </i></p><p><i>As you can see, we have a tremendously positive outlook for Copper Mountain. Our plan for 2025 includes new exploration plans for the numerous prospects identified at Copper Mountain, each having the potential to yield exciting results and increase the overall potential of Copper Mountain, which could become one of Wyoming's largest uranium districts.\"</i></p><p><b>Chemical Assays Are Delayed </b></p><p>The Company advises that a significant number of the core and chip samples from its recent drill program are testing above ALS Laboratories' radioactivity thresholds for sample preparation and chemical assay. ALS has informed Myriad that samples with radioactivity levels between 3 to 10 &#181;Sv/h will require shipment to their Vancouver facility for processing, whereas samples with radioactivity levels above 10 &#181;Sv/h cannot be processed by them. We have located alternative analytical services in the USA with Paragon Geochemical in Sparks, Nevada, and samples are already on their way there.  As a result of this change, chemical assay results will be delayed several weeks beyond our target schedule.  </p><p><b>Engagement of VSA Capital</b></p><p>The Company is pleased to announce that it has entered into a financial advisory services agreement with VSA Capital Limited (\"VSA\"), an arm's length party, to provide financial advisory and research services to Myriad. </p><p>The agreement has a term starting on January 15, 2025 and runs until January 15, 2027, unless renewed by the parties. Either party has the right to terminate the agreement after 12 months by providing not less than three months' notice of termination. Under the agreement, VSA will receive a fee of &#163;25,000 (approximately CAD$44,000) for services in the first year and &#163;30,000 (approximately CAD$52,500) for services in the second year.  VSA can be contacted at Park House, 16-18 Finsbury Circus, London, England EC2M 7EB; Tel:  +44(0)20 3005 5000; <a href=\"mailto:mail@vsacapital.com\">mail@vsacapital.com</a>.  </p><p>Andrew Monk, Chief Executive Officer of VSA Capital, commented: <i>\"The fundamental and geopolitical backdrop to the uranium market is rapidly evolving and securing transparent and reliable supply is becoming increasingly important, particularly for the USA and North America. VSA Capital is pleased to be working with Myriad Uranium providing the company with the necessary strategic and corporate financial advice as they seek to advance their portfolio of assets in Wyoming. We will seek to leverage our significant expertise in the mining sector to support Myriad and its stakeholders' objectives.\"</i></p><p><b>Historical Estimates</b></p><p>While Myriad Uranium has determined that the historical estimates described in this news release are relevant to the Copper Mountain Project Area and are reasonably reliable given the authors and circumstances of their preparation, and are suitable for public disclosure, readers are cautioned to not place undue reliance on these historical estimates as an indicator of current mineral resources or mineral reserves at the Project Area. A qualified person (as defined under NI 43-101) has not done sufficient work to classify any of the historical estimates as current mineral resources or mineral reserves, and Myriad Uranium is not treating the historical estimates as a current mineral resource or mineral reserve. Also, while the Copper Mountain Project Area contains all or most of each deposit referred to, some of the resources referred to may be located outside the current Copper Mountain Project Area.  Furthermore, the estimates are decades old and based on drilling data for which the logs are, as of yet, predominantly unavailable.  The historical resource estimates, therefore, should not be unduly relied upon.</p><p>Inherent limitations of the historical estimates include that the nature of mineralisation (fracture hosted) makes estimation from drill data less reliable than other deposit types (e.g. those that are thick and uniform).  From Myriad Uranium's viewpoint, limitations include that the Company has not been able to verify the data itself and that the estimate may be optimistic relative to subsequent work which applied a \"delayed fission neutron\" (DFN) factor to calculate grades. On the other hand, DFN is controversial, in that the approach is viewed by some experts as too conservative. Nevertheless, it was applied in later resource estimations by Union Pacific relating to Copper Mountain.</p><p>To verify the historical estimates and potentially re-state them as current resources, a program of digitization of available data would be required. This must be followed by re-logging and/or re-drilling to generate new data to the extent necessary that it is comparable with the original data, or new data that can be used to establish the correlation and continuity of geology and grades between boreholes with sufficient confidence to estimate mineral resources.</p><p><b>Qualified Person</b></p><p>The scientific or technical information in this news release respecting the Company's Copper Mountain Project has been approved by George van der Walt, MSc., Pr.Sci.Nat., FGSSA, a Qualified Person as defined in National Instrument 43-101 - <i>Standards of Disclosure for Mineral Projects</i>.  Mr van der Walt is employed by The MSA Group (Pty) Ltd (MSA), a leading geological consultancy providing services to the minerals industry, based in Johannesburg, South Africa. He has more than 20 years industry experience and sufficient relevant experience in the type and style of mineralisation to report on exploration results.</p><p>The information and interpretations thereof are based on the Qualified Person's initial review of historical reports, which were recently obtained by the Company.  The information did not include original data such as drilling records, sampling, analytical or test data underlying the information or opinions contained in the written documents. Therefore, the Qualified Person has not reviewed or otherwise verified the information and has not done sufficient work to classify the historical estimates as current mineral resources or mineral reserves. The Qualified Person considers the information to be relevant based on the amount and quality of work undertaken and reported historically. A more thorough review of any available original data will be undertaken and reported on in more detail in future releases.</p><p><b>About Myriad Uranium Corp.</b></p><p>Myriad Uranium Corp. is a uranium exploration company with an earnable 75% interest in the Copper Mountain Uranium Project in Wyoming, USA. To date, Myriad has earned a 50% interest in the Project. Copper Mountain hosts several known uranium deposits and historical uranium mines, including the Arrowhead Mine which produced 500,000 lbs of eU3O8. Copper Mountain saw extensive drilling and development by Union Pacific during the late 1970s including the development of a mine plan to fuel a planned fleet of California Edison reactors. Operations ceased in 1980 before mining could commence due to falling uranium prices. Approximately 2,000 boreholes have been drilled at Copper Mountain and the Project Area has significant exploration upside. Union Pacific is estimated to have spent C$117 million (2024 dollars) exploring and developing Copper Mountain, generating significant historical resource estimates which are detailed <a href=\"https://api.newsfilecorp.com/redirect/MAaDjUGgmr\">here</a>.  Myriad recently concluded a 34-hole maiden drill program in November 2024 which encountered significant high grade uranium mineralisation that exceeded expectations, provided verification of historical exploration work, and encountered mineralisation in deeper zones, which opens exciting new potential for the Copper Mountain Uranium Project.  A comprehensive news release regarding the drilling can be viewed <a href=\"https://api.newsfilecorp.com/redirect/bVaYNue0AD\">here</a>.</p><p>A recent detailed update with Crux Investor can be viewed <a href=\"https://api.newsfilecorp.com/redirect/3jBmJfYQLV\">here</a>.  The Company's presentation can be viewed&#160;<a href=\"https://api.newsfilecorp.com/redirect/NBarvUQKZq\">here</a>.  News releases regarding historical drilling can be viewed&#160;<a href=\"https://api.newsfilecorp.com/redirect/X3akOuOWv8\">here</a> and&#160;<a href=\"https://api.newsfilecorp.com/redirect/DZxKWtZYDW\">here</a>.</p><p>For further information, please refer to Myriad's disclosure record on SEDAR+ (<a href=\"https://api.newsfilecorp.com/redirect/rvJrLUPakD\">www.sedarplus.ca</a>), contact Myriad by telephone at +1.604.418.2877, or refer to Myriad's website at <a href=\"https://api.newsfilecorp.com/redirect/V72QLiEWk7\">www.myriaduranium.com</a>.</p><div id=\"contactInfo\"><p><b>Myriad Contacts:</b><br />Thomas Lamb<br />President and CEO<br /><a href=\"mailto:tlamb@myriaduranium.com\">tlamb@myriaduranium.com</a></p></div><p><i><b>Forward-Looking Statements</b></i></p><p><i>This news release contains \"forward-looking information\" that is based on the Company's current expectations, estimates, forecasts and projections. This forward-looking information includes, among other things, the Company's business, plans, outlook and business strategy. The words \"may\", \"would\", \"could\", \"should\", \"will\", \"likely\", \"expect,\" \"anticipate,\" \"intend\", \"estimate\", \"plan\", \"forecast\", \"project\" and \"believe\" or other similar words and phrases are intended to identify forward-looking information. The reader is cautioned that assumptions used in the preparation of any forward-looking information may prove to be incorrect, including with respect to the Company's business plans respecting the exploration and development of the Company's mineral properties, the proposed work program on the Company's mineral properties and the potential and economic viability of the Company's mineral properties. Forward-looking information is subject to known and unknown risks, uncertainties and other factors that may cause the Company's actual results, level of activity, performance or achievements to be materially different from those expressed or implied by such forward-looking information. Such factors include, but are not limited to: changes in economic conditions or financial markets; increases in costs; litigation; legislative, environmental and other judicial, regulatory, political and competitive developments; access to minerals where the surface rights above them have not been settled; and technological or operational difficulties. This list is not exhaustive of the factors that may affect our forward-looking information. These and other factors should be considered carefully, and readers should not place undue reliance on such forward-looking information. The Company does not intend, and expressly disclaims any intention or obligation to, update or revise any forward-looking information whether as a result of new information, future events or otherwise, except as required by applicable law.</i></p><p><i>The CSE has not reviewed, approved or disapproved the contents of this news release.</i></p><p id=\"corporateNewsLogoContainer\"><img src=\"https://images.newsfilecorp.com/files/6301/237804_ed45d959946c791a_logo.jpg\" id=\"corporateNewsLogo\" alt=\"Corporate Logo\" /></p><p id=\"corporateLinkBack\">To view the source version of this press release, please visit <a href=\"https://api.newsfilecorp.com/redirect/zEoQ0TVKYR\">https://www.newsfilecorp.com/release/237804</a></p>",
    "search_terms": "Copper Mountain,Myriad Uranium Corp.,M",
    "master_gid": 4300,
    "date": "2025-01-20T12:30:00.000Z",
    "tags": "|||Copper,Uranium|Project Acquisition",
    "image_id": null,
    "hidden": false,
    "company_id": 1558,
    "provider": "newsfilecorp",
    "excerpt": "Vancouver, British Columbia--(Newsfile Corp. - January 20, 2025) -Myriad Uranium Corp. (CSE: M) (OTCQB: MYRUF) (FSE: C3Q) (\"Myriad\" or the \"Company\") is pleased to announce an expansion of the Copper Mountain Project Area, from approximately 4,200 acres to approximately 9,320 acres. The selection of newly-acquired areas was guided by insights",
    "is_regulatory": false,
    "refined_tags": [
      "Maiden Drill",
      "Drilling Update"
    ],
    "ftp_filename": null,
    "company_name": "Myriad Uranium Corp.",
    "exchange": "CSE",
    "root_ticker": "M",
    "project_name": "Copper Mountain",
    "gid": 4300,
    "location": "Wyoming, United States",
    "plan_id": null,
    "description_text": "Vancouver, British Columbia--(Newsfile Corp. - January 20, 2025) - Myriad Uranium Corp . (CSE: M) (OTCQB: MYRUF) (FSE: C3Q) (\" Myriad \" or the \" Company \") is pleased to announce an expansion of the Copper Mountain Project Area, from approximately 4,200 acres to approximately 9,320 acres. The selection of newly-acquired areas was guided by insights from the Company's 2024 maiden drill program, proprietary historical data, and advice from Jim Davis, who was General Manager of Union Pacific's exploration program at Copper Mountain during the 1970s. The newly-acquired areas include prospects, generally known as Railroad, Steffen Hill, Cedar Ridge, Mole, West Mesa, and Lucky Cliff, plus extensions into areas of known mineralisation adjacent to Fuller/Utah, Mint, Arrowhead, Midnight, and Knob (see Figure 1 below).  Most of the new areas have historically confirmed uranium mineralisation at surface or subsurface and may be prospective for other minerals, as described in historic reports: Railroad: 3 of 5 holes drilled by Anaconda intersected >0.01% eU 3 O 8 . One hole (CM 5-3) intersected 0.1% over 6 ft at 585 ft depth, as well as 400 - 500 ppm at 622 ft, 937 ft and 943 ft. Knob: A speculative target of <500,000 lbs eU 3 O 8 at 0.15% was anticipated by Union Pacific, based on limited drilling data. Cedar Ridge: Sandstone-hosted mineralisation with up to 0.12% eU 3 O 8 detected in outcrop. Limited drilling done historically, but no physical data is available. Steffen Hill (various areas): No specific targets have been identified yet and data is limited, but historic drilling appears to have targeted mineralisation in sandstones. Individual logs show signs of mineralisation (>200 ppm) at 150 ft and 450 ft in certain areas. Lucky Cliff: Relatively shallow mineralisation reported. Limited logs available indicate grades >500 ppm eU 3 O 8 with one hole reported to contain 85 ft of 0.12% eU 3 O 8 . All areas have significant expansion potential beyond known mineralisation, including at depth. Union Pacific estimated that the potential within their existing deposit areas could exceed 65 Mlbs with further exploration. An assessment by Bendix for the NURE program concluded that the mineral endowment within the known deposit areas could exceed 200 Mlbs and could exceed 600 Mlbs in the greater Copper Mountain district. Some of the newly-acquired areas were previously targeted for uranium mineralisation in sandstone. This is important because sandstone-hosted deposits could be more amenable to in-situ recovery methods, if the conditions are favourable. All of the new areas were acquired by staking. A small percentage of tenements at Copper Mountain are split, in that only subsurface rights are held.  In those cases, surface access will be negotiated on a case-by-case basis with surface rights holders as required. Figure 1. The Copper Mountain Uranium Project. To view an enhanced version of this graphic, please visit: https://images.newsfilecorp.com/files/6301/237804_ed45d959946c791a_002full.jpg Myriad's CEO, Thomas Lamb, commented: \"I've referred to the blue sky potential of Copper Mountain in the past, but perhaps without the emphasis it deserved, since we didn't have all key areas tied up. But now I feel more comfortable doing so. During the 1970s Union Pacific estimated the potential of known deposits and prospects within their areas at Copper Mountain at over 65 Mlbs.  But subsequent estimates by experts such as Bendix (for the US Department of Energy) and the authors of a 2010 comprehensive data review for Neutron Energy (now part of enCore) put the district's potential even higher. All the historical reports suggest something similar: 'Field work, drilling and evaluations of the data produced has established that there is potentially a very large resource of uranium at Copper Mountain. Perhaps as much as several hundred million pounds. - Neutron Energy, 2010' We intend to control the key areas that will enable us to test this potential.  Previous exploration has shown that the newly-acquired areas have exciting potential and could significantly increase our mineral endowment at Copper Mountain.  I should remind readers that all of the estimates of potential I refer to, and, indeed, any other estimates in this news release, are 'historical estimates'. Geological models by various experts suggest that deeper thrust faulting across the Copper Mountain District may have acted as conduits for fluid movement. At Canning, for example, this could have resulted in the potentially significant mineralisation below Union Pacific's 500-600 foot \"hard deck\" maximum drilling depth that we encountered.  It is this deeper mineralisation that Anaconda was chasing at our newly-acquired Railroad prospect and their initial intercepts from just a few holes may help substantiate the hypothesis that there is connected deeper mineralisation across Copper Mountain. I think it's apposite here to quote Jim Davis and D.T. Wilton (2010): 'The Copper Mountain Uranium District has an enormous uranium endowment in the granites which make up the core of the Owl Creek mountain range. This uranium endowment, mobilized by extensive hydrothermal solutions acting within a complex structural system and demonstrated host situations, represents an attractive potential for large uranium deposits based on world class models, including the French granites; Nabarlek, Australia and Beaverlodge, Canada.' As you can see, we have a tremendously positive outlook for Copper Mountain. Our plan for 2025 includes new exploration plans for the numerous prospects identified at Copper Mountain, each having the potential to yield exciting results and increase the overall potential of Copper Mountain, which could become one of Wyoming's largest uranium districts.\" Chemical Assays Are Delayed The Company advises that a significant number of the core and chip samples from its recent drill program are testing above ALS Laboratories' radioactivity thresholds for sample preparation and chemical assay. ALS has informed Myriad that samples with radioactivity levels between 3 to 10 µSv/h will require shipment to their Vancouver facility for processing, whereas samples with radioactivity levels above 10 µSv/h cannot be processed by them. We have located alternative analytical services in the USA with Paragon Geochemical in Sparks, Nevada, and samples are already on their way there.  As a result of this change, chemical assay results will be delayed several weeks beyond our target schedule. Engagement of VSA Capital The Company is pleased to announce that it has entered into a financial advisory services agreement with VSA Capital Limited (\"VSA\"), an arm's length party, to provide financial advisory and research services to Myriad. The agreement has a term starting on January 15, 2025 and runs until January 15, 2027, unless renewed by the parties. Either party has the right to terminate the agreement after 12 months by providing not less than three months' notice of termination. Under the agreement, VSA will receive a fee of £25,000 (approximately CAD$44,000) for services in the first year and £30,000 (approximately CAD$52,500) for services in the second year.  VSA can be contacted at Park House, 16-18 Finsbury Circus, London, England EC2M 7EB; Tel:  +44(0)20 3005 5000; mail@vsacapital.com . Andrew Monk, Chief Executive Officer of VSA Capital, commented: \"The fundamental and geopolitical backdrop to the uranium market is rapidly evolving and securing transparent and reliable supply is becoming increasingly important, particularly for the USA and North America. VSA Capital is pleased to be working with Myriad Uranium providing the company with the necessary strategic and corporate financial advice as they seek to advance their portfolio of assets in Wyoming. We will seek to leverage our significant expertise in the mining sector to support Myriad and its stakeholders' objectives.\" Historical Estimates While Myriad Uranium has determined that the historical estimates described in this news release are relevant to the Copper Mountain Project Area and are reasonably reliable given the authors and circumstances of their preparation, and are suitable for public disclosure, readers are cautioned to not place undue reliance on these historical estimates as an indicator of current mineral resources or mineral reserves at the Project Area. A qualified person (as defined under NI 43-101) has not done sufficient work to classify any of the historical estimates as current mineral resources or mineral reserves, and Myriad Uranium is not treating the historical estimates as a current mineral resource or mineral reserve. Also, while the Copper Mountain Project Area contains all or most of each deposit referred to, some of the resources referred to may be located outside the current Copper Mountain Project Area.  Furthermore, the estimates are decades old and based on drilling data for which the logs are, as of yet, predominantly unavailable.  The historical resource estimates, therefore, should not be unduly relied upon. Inherent limitations of the historical estimates include that the nature of mineralisation (fracture hosted) makes estimation from drill data less reliable than other deposit types (e.g. those that are thick and uniform).  From Myriad Uranium's viewpoint, limitations include that the Company has not been able to verify the data itself and that the estimate may be optimistic relative to subsequent work which applied a \"delayed fission neutron\" (DFN) factor to calculate grades. On the other hand, DFN is controversial, in that the approach is viewed by some experts as too conservative. Nevertheless, it was applied in later resource estimations by Union Pacific relating to Copper Mountain. To verify the historical estimates and potentially re-state them as current resources, a program of digitization of available data would be required. This must be followed by re-logging and/or re-drilling to generate new data to the extent necessary that it is comparable with the original data, or new data that can be used to establish the correlation and continuity of geology and grades between boreholes with sufficient confidence to estimate mineral resources. Qualified Person The scientific or technical information in this news release respecting the Company's Copper Mountain Project has been approved by George van der Walt, MSc., Pr.Sci.Nat., FGSSA, a Qualified Person as defined in National Instrument 43-101 - Standards of Disclosure for Mineral Projects .  Mr van der Walt is employed by The MSA Group (Pty) Ltd (MSA), a leading geological consultancy providing services to the minerals industry, based in Johannesburg, South Africa. He has more than 20 years industry experience and sufficient relevant experience in the type and style of mineralisation to report on exploration results. The information and interpretations thereof are based on the Qualified Person's initial review of historical reports, which were recently obtained by the Company.  The information did not include original data such as drilling records, sampling, analytical or test data underlying the information or opinions contained in the written documents. Therefore, the Qualified Person has not reviewed or otherwise verified the information and has not done sufficient work to classify the historical estimates as current mineral resources or mineral reserves. The Qualified Person considers the information to be relevant based on the amount and quality of work undertaken and reported historically. A more thorough review of any available original data will be undertaken and reported on in more detail in future releases. About Myriad Uranium Corp. Myriad Uranium Corp. is a uranium exploration company with an earnable 75% interest in the Copper Mountain Uranium Project in Wyoming, USA. To date, Myriad has earned a 50% interest in the Project. Copper Mountain hosts several known uranium deposits and historical uranium mines, including the Arrowhead Mine which produced 500,000 lbs of eU3O8. Copper Mountain saw extensive drilling and development by Union Pacific during the late 1970s including the development of a mine plan to fuel a planned fleet of California Edison reactors. Operations ceased in 1980 before mining could commence due to falling uranium prices. Approximately 2,000 boreholes have been drilled at Copper Mountain and the Project Area has significant exploration upside. Union Pacific is estimated to have spent C$117 million (2024 dollars) exploring and developing Copper Mountain, generating significant historical resource estimates which are detailed here .  Myriad recently concluded a 34-hole maiden drill program in November 2024 which encountered significant high grade uranium mineralisation that exceeded expectations, provided verification of historical exploration work, and encountered mineralisation in deeper zones, which opens exciting new potential for the Copper Mountain Uranium Project.  A comprehensive news release regarding the drilling can be viewed here . A recent detailed update with Crux Investor can be viewed here .  The Company's presentation can be viewed here .  News releases regarding historical drilling can be viewed here and here . For further information, please refer to Myriad's disclosure record on SEDAR+ ( www.sedarplus.ca ), contact Myriad by telephone at +1.604.418.2877, or refer to Myriad's website at www.myriaduranium.com . Myriad Contacts: Thomas Lamb President and CEO tlamb@myriaduranium.com Forward-Looking Statements This news release contains \"forward-looking information\" that is based on the Company's current expectations, estimates, forecasts and projections. This forward-looking information includes, among other things, the Company's business, plans, outlook and business strategy. The words \"may\", \"would\", \"could\", \"should\", \"will\", \"likely\", \"expect,\" \"anticipate,\" \"intend\", \"estimate\", \"plan\", \"forecast\", \"project\" and \"believe\" or other similar words and phrases are intended to identify forward-looking information. The reader is cautioned that assumptions used in the preparation of any forward-looking information may prove to be incorrect, including with respect to the Company's business plans respecting the exploration and development of the Company's mineral properties, the proposed work program on the Company's mineral properties and the potential and economic viability of the Company's mineral properties. Forward-looking information is subject to known and unknown risks, uncertainties and other factors that may cause the Company's actual results, level of activity, performance or achievements to be materially different from those expressed or implied by such forward-looking information. Such factors include, but are not limited to: changes in economic conditions or financial markets; increases in costs; litigation; legislative, environmental and other judicial, regulatory, political and competitive developments; access to minerals where the surface rights above them have not been settled; and technological or operational difficulties. This list is not exhaustive of the factors that may affect our forward-looking information. These and other factors should be considered carefully, and readers should not place undue reliance on such forward-looking information. The Company does not intend, and expressly disclaims any intention or obligation to, update or revise any forward-looking information whether as a result of new information, future events or otherwise, except as required by applicable law. The CSE has not reviewed, approved or disapproved the contents of this news release. To view the source version of this press release, please visit https://www.newsfilecorp.com/release/237804",
    "primary_commodity": "U"
  },
  "articleProject": {
    "gid": 4300,
    "project_name": "Copper Mountain",
    "location": "Wyoming, United States"
  },
  "articleExchange": "CSE",
  "articleCompanyId": 1558,
  "articleTicker": "M",
  "articleCompanyName": "Myriad Uranium Corp.",
  "allOtherCompanyProjects": [
    {
      "company_id": 1558,
      "gid": 4762,
      "project_name": "Afouday",
      "location": "Niger"
    },
    {
      "company_id": 1558,
      "gid": 4764,
      "project_name": "Tagait 3",
      "location": "Niger"
    },
    {
      "company_id": 1558,
      "gid": 6029,
      "project_name": "Millen Mountain",
      "location": "Nova Scotia, Canada"
    },
    {
      "company_id": 1558,
      "gid": 4761,
      "project_name": "Agebout",
      "location": "Niger"
    },
    {
      "company_id": 1558,
      "gid": 4763,
      "project_name": "Tagait 2",
      "location": "Niger"
    },
    {
      "company_id": 1558,
      "gid": 6775,
      "project_name": "Bonanza-Kermac",
      "location": "Wyoming, United States"
    },
    {
      "company_id": 1558,
      "gid": 6421,
      "project_name": "Knob Claims",
      "location": "Wyoming, United States"
    }
  ],
  "allOtherCompanyNews": [
    {
      "id": 107877,
      "company_id": 1558,
      "title": "Myriad Uranium Announces Private Placement",
      "link": null,
      "date": "2025-06-12T21:25:00.000Z",
      "hidden": false
    },
    {
      "id": 107652,
      "company_id": 1558,
      "title": "Myriad Uranium Reports Final Chemical Assays from Copper Mountain. Grades Up to 60% Higher Than Probe Equivalents, with Positive Implications for Scale and Scope of the Project. Plan of Operations Application Submitted to Drill High Priority Prospects",
      "link": null,
      "date": "2025-06-11T11:30:00.000Z",
      "hidden": false
    },
    {
      "id": 105552,
      "company_id": 1558,
      "title": "Myriad Uranium Corp. Announces Extension of Warrants",
      "link": null,
      "date": "2025-05-22T20:44:00.000Z",
      "hidden": false
    },
    {
      "id": 103827,
      "company_id": 1558,
      "title": "Myriad Uranium Expands its New Mexico Land Position, Now Controls Significant High Grade Historical Resources and Vast Majority of Historical Boreholes at Red Basin",
      "link": null,
      "date": "2025-05-07T11:30:00.000Z",
      "hidden": false
    },
    {
      "id": 102155,
      "company_id": 1558,
      "title": "Myriad Uranium Reports Chemical Assays from Eight More Boreholes at Copper Mountain. Assays Continue to Be up to 50% Higher than Probe Grades Previously Reported.",
      "link": null,
      "date": "2025-04-29T11:30:00.000Z",
      "hidden": false
    },
    {
      "id": 98301,
      "company_id": 1558,
      "title": "Myriad Uranium Appoints Eduards Smirnovs as Industry Advisor",
      "link": null,
      "date": "2025-04-01T11:30:00.000Z",
      "hidden": false
    },
    {
      "id": 91528,
      "company_id": 1558,
      "title": "Myriad Uranium Reports Chemical Assays on 20 Copper Mountain Boreholes. Confirmed U3O8 Grades Are 20% Higher on Average than Previously Reported Gamma Grades. Assays also Reveal the Presence of Extensive Uranium Mineralisation That Could Not Be Detected by the Probe, with Potential Positive Implications for Historical Estimates. Large Number of Additional Intervals to Be Sent for Assay",
      "link": null,
      "date": "2025-03-17T11:30:00.000Z",
      "hidden": false
    },
    {
      "id": 87551,
      "company_id": 1558,
      "title": "Myriad Uranium Issues Shares under Option to Acquire 100% of the Red Basin Uranium Project in New Mexico, USA",
      "link": "https://www.newsfilecorp.com/release/240503/Myriad-Uranium-Issues-Shares-under-Option-to-Acquire-100-of-the-Red-Basin-Uranium-Project-in-New-Mexico-USA",
      "date": "2025-02-12T00:21:00.000Z",
      "hidden": false
    },
    {
      "id": 86759,
      "company_id": 1558,
      "title": "Myriad Uranium Enters into Option to Acquire 100% of the Red Basin Uranium Project in New Mexico, USA",
      "link": "https://www.newsfilecorp.com/release/239518/Myriad-Uranium-Enters-into-Option-to-Acquire-100-of-the-Red-Basin-Uranium-Project-in-New-Mexico-USA",
      "date": "2025-02-04T12:30:00.000Z",
      "hidden": false
    },
    {
      "id": 85660,
      "company_id": 1558,
      "title": "Myriad Uranium Grants Stock Options and RSUs",
      "link": "https://www.newsfilecorp.com/release/238802/Myriad-Uranium-Grants-Stock-Options-and-RSUs",
      "date": "2025-01-29T12:30:00.000Z",
      "hidden": false
    }
  ]
}
