{
  "article": {
    "id": 77905,
    "link": "https://www.globenewswire.com/news-release/2024/11/06/2975616/0/en/DEMESNE-RESOURCES-ANNOUNCES-DEFINITIVE-OPTION-AGREEMENT-TO-ACQUIRE-IMA-MINE-TUNGSTEN-PROJECT-IN-IDAHO-U-S.html",
    "title": "DEMESNE RESOURCES ANNOUNCES DEFINITIVE OPTION AGREEMENT TO ACQUIRE IMA MINE TUNGSTEN PROJECT IN IDAHO, U.S.",
    "description": "<p align=\"justify\">Vancouver, BC, Nov.  06, 2024  (GLOBE NEWSWIRE) -- <strong>Demesne Resources Ltd. (CSE:DEME) (OTCQB:DEMRF) </strong>(“<strong>Demesne</strong>” or the “<strong>Company</strong>”) announces, further to its news release of October 24, 2024, that the Company has entered into an option agreement (the “<strong>Option Agreement</strong>”) dated November 5, 2024 with IMA-1, LLC (the “<strong>Optionor</strong>”), pursuant to which the Optionor has granted to the Company the option (the “<strong>Option</strong>”) to acquire from the Optionor a 100% undivided interest (subject to a 2% royalty) in the IMA Mine Project located in East-Central Idaho, United States (the “<strong>IMA</strong> <strong>Property</strong>”).</p>  <p align=\"justify\">The IMA Mine is a past producing underground tungsten mine situated on 22 patented claims located in East Central, Idaho. Between 1945 and 1957, the property produced approximately 199,449 MTUs of WO<sub>3</sub> and was subsequently explored for molybdenum by various operators between 1960 to 2008<sup>1</sup>.</p>  <p align=\"justify\"><em>“The IMA property offers tremendous opportunity for the near-term development of North America’s only producing tungsten operation, a strategic and critical mineral, and the exploration potential for significant porphyry-style molybdenum mineralization on the property.” </em>said, Murray Nye, President and CEO Demesne. <em>“Extensive historical records, prior drilling programs, 1980s underground rehabilitation work, and the project’s location on patented claims in mining-friendly Idaho should allow accelerated advancement of the project and a low-cost production scenario.”</em></p>  <p align=\"justify\">Pursuant to the terms and conditions of the Option Agreement, and in order to acquire a 100% interest in and to the Property (subject to a 2% royalty), the Company must pay to the Optionor an aggregate of US$5,800,000 as follows:</p>  <p>(a)        US$100,000 on the effective date;</p>  <p>(b)        US$50,000 on the six (6) month anniversary of the effective date;</p>  <p>(c)        US$100,000 on the one (1) year anniversary of the effective date;</p>  <p>(d)        US$130,000 on the two (2) year anniversary of the effective date;</p>  <p>(e)        US$150,000 on the three (3) year anniversary of the effective date;</p>  <p>(f)        US$250,000 on the four (4) year anniversary of the effective date;</p>  <p>(g)        US$250,000 on the five (5) year anniversary of the effective date;</p>  <p>(h)        US$770,000 on the six (6) year anniversary of the effective date;</p>  <p>(i)        US$1,000,000 on the seven (7) year anniversary of the effective date; and</p>  <p>(j)        US$3,000,000 on the eight (8) year anniversary of the effective date.</p>  <p align=\"justify\">If and when the Option has been exercised, a 100% undivided right, title and interest to the Property will thereupon vest in the Company free and clear of all encumbrances, subject only to the 2% royalty. Demesne will have the right to reduce the royalty to a 1% royalty by paying the Optionor US$2,000,000 on or before the four (4) year anniversary of the effective date.</p>  <p><strong>ABOUT THE IMA PROPERTY</strong></p>  <p align=\"justify\">The IMA Property is located in the Lemhi Range, near the community of Patterson, Idaho, located approximately 20 miles east of Challis, comprising of the IMA Mine, with 22 patented claims on 395.98 acres and an additional 214.4 acres of patented ground in adjacent Pahsimeroi Valley. The patented claims are accessible over existing roads managed by the Bureau of Land Management.</p>  <p align=\"justify\">The IMA Property is a past producing tungsten property that began as a silver mine in the 1800s. Between 1945 and 1957, while operated by the Bradley Mining Company, the IMA Mine produced approximately 2,198 tons of WO<sub>3</sub> (199,449 MTUs), from 468k tonnes of ore with an average <em>recovered</em> grade of 0.434% WO<sub>3</sub>,<sup>2</sup> and produced an additional sulfide concentrate yielding 1.29M oz silver, 1.8M lbs copper, 2.92M lbs lead and 0.02M lbs zinc<sup>3</sup>. The IMA mine shut down in 1958 upon collapse of the U.S. government tungsten buying program.</p>  <p align=\"justify\">The property was subsequently explored for molybdenum by AMAX Inc. (1960-1962), Inspiration Development Company (“Inspiration”) (1979-1982), Gentor Resources Ltd (2007-2008), and other junior exploration companies. Inspiration ultimately focused on exploration and development of the quartz-tungsten-vein system, rehabilitating upper levels of the mine to complete underground resource delineation drilling, conducting metallurgical work and commencing construction of a haulage adit.<sup>3</sup> Due to a decrease in tungsten prices, development work ceased in 1982 prior to recommencement of mining.</p>  <p align=\"justify\">Tungsten mineralization in the IMA Mine occurs in quartz veins hosted in Precambrian siliciclastic metasediments containing pyrite, fluorite, hubnerite, scheelite, tetrahedrite, galena, sphalerite and chalcopyrite. The quartz veins occur in a zone up to 900 feet wide, 2000 feet long and up to 700 feet in vertical extent<sup>1</sup>. Molybdenite mineralization occurs in the veins and disseminations in potassically altered Cenozoic porphyry intrusive that is exposed in the lower levels of the IMA Mine and intersected in deeper historical drilling. Mineralization occurrence is interpreted as consistent with a sub-Climax type porphyry model with higher-level tungsten-base metal veins. <sup>1</sup></p>  <p align=\"justify\">The IMA Mine is situated close to key infrastructure items and resources, including paved county roads, tier-1 low-cost power supply, access to water rights, and a mining-oriented labour force.</p>  <p><strong>ABOUT DEMESNE RESOURCES LTD.</strong></p>  <p align=\"justify\">Demesne Resources Ltd. is a British Columbia based company involved in the acquisition and exploration of magnetite mineral properties. The Company's principal property is the Star Project, consisting of five contiguous mineral titles covering an area of approximately 4,615.75 hectares located in the Skeena Mining Division, British Columbia, Canada. The Company has entered into an option agreement pursuant to which it is entitled to earn an undivided 100% interest in the Star Project.</p>  <p align=\"justify\"><strong>ON BEHALF OF THE BOARD OF DIRECTORS:</strong></p>  <p>Murray Nye<br />CEO</p>  <p align=\"justify\">For further information, please contact: Murray Nye, CEO, Email: ir@demesneresources.com; Phone: (778)706-6104.</p>  <p align=\"justify\"><em>The Canadian Securities Exchange does not accept responsibility for the adequacy or accuracy of this release and has neither approved nor disapproved the contents of this press release.</em></p>  <p align=\"justify\"><strong><em>This press release includes \"forward-looking information\" that is subject to a number of assumptions, risks and uncertainties, many of which are beyond the control of the Company. Such statements represent the Company’s current views with respect to future events and are necessarily based upon a number of assumptions and estimates that, while considered reasonable by the Company, are inherently subject to significant business, economic, competitive, political and social risks, contingencies and uncertainties. Many factors, both known and unknown, could cause results, performance, or achievements to be materially different from the results, performance or achievements that are or may be expressed or implied by such forward-looking statements. The Company does not intend, and does not assume any obligation, to update these forward-looking statements or information to reflect changes in assumptions or changes in circumstances or any other events affecting such statements and information other than as required by applicable laws, rules and regulations.</em></strong></p>  <p align=\"justify\"><strong><em>Statements concerning historical exploration and production on the property have been obtained through both public and private sources, and are believed to be substantially factual and relevant in that they demonstrate the tenor of exploration targets on the property. Neither Demesne Resources, nor its Qualified Person, has done sufficient work to verify historical information regarding past production or exploration, and this information should not be relied upon until it has been verified.</em></strong></p>  <p align=\"justify\"><strong><em>Technical information in this news release has been prepared in accordance with Canadian regulatory requirements set out in National Instrument 43-101 — Standards of Disclosure for Mineral Projects (“NI-43-101”). Austin Zinsser, P.G., SME-RM, Vice President, Exploration for the Company, and a Qualified Person as defined by NI-43-101 and has reviewed and approved the scientific and technical information in this Presentation. </em></strong></p>  <hr />  <p><sup>1</sup> Wardrop 2008; Technical Report on the IMA Mine Molybdenum Project, July 2008; Prepared for Gentor Resources Inc., 52p.<br /><sup>2</sup> Bradley Mining Company, 1958; Summarized Information on IMA Mine, Lemhi Co, Patterson, Idaho. Company Report, 6p. <br /><sup>3</sup> Victoria Mitchell, 1999; History of the Ima Mine, Lemhi County, Idaho, Idaho Geological Survey, Staff Report 99-2, University of Idaho, August 1999.</p>  <br/><img src='https://ml.globenewswire.com/media/YjFmZDNhMTItNTY4Yy00ZmViLWEwMzMtZDlmMTQ5MjhkYzE4LTUwMDEyOTQyOA==/tiny/Demesne-Resources-Ltd-.png' referrerpolicy='no-referrer-when-downgrade'/>",
    "search_terms": "Ima Mine,American Tungsten Corp.,DEME",
    "master_gid": 8936,
    "date": "2024-11-06T12:30:00.000Z",
    "tags": "||||Project Acquisition",
    "image_id": null,
    "hidden": false,
    "company_id": 4691,
    "provider": "globenewswire",
    "excerpt": "Vancouver, BC, Nov. 06, 2024 (GLOBE NEWSWIRE) --Demesne Resources Ltd. (CSE:DEME) (OTCQB:DEMRF)(“Demesne” or the “Company”) announces, further to its news release of October 24, 2024, that the Company has entered into an option agreement (the “Option Agreement”) dated November 5, 2024 with IMA-1, LLC (the “Optionor”), pursuant to which the",
    "is_regulatory": false,
    "refined_tags": null,
    "ftp_filename": null,
    "company_name": "American Tungsten Corp.",
    "exchange": "CSE",
    "root_ticker": "TUNG",
    "project_name": "Ima Mine",
    "gid": 8936,
    "location": null,
    "plan_id": null,
    "description_text": "Vancouver, BC, Nov.  06, 2024  (GLOBE NEWSWIRE) -- Demesne Resources Ltd. (CSE:DEME) (OTCQB:DEMRF) (“ Demesne ” or the “ Company ”) announces, further to its news release of October 24, 2024, that the Company has entered into an option agreement (the “ Option Agreement ”) dated November 5, 2024 with IMA-1, LLC (the “ Optionor ”), pursuant to which the Optionor has granted to the Company the option (the “ Option ”) to acquire from the Optionor a 100% undivided interest (subject to a 2% royalty) in the IMA Mine Project located in East-Central Idaho, United States (the “ IMA Property ”). The IMA Mine is a past producing underground tungsten mine situated on 22 patented claims located in East Central, Idaho. Between 1945 and 1957, the property produced approximately 199,449 MTUs of WO 3 and was subsequently explored for molybdenum by various operators between 1960 to 2008 1 . “The IMA property offers tremendous opportunity for the near-term development of North America’s only producing tungsten operation, a strategic and critical mineral, and the exploration potential for significant porphyry-style molybdenum mineralization on the property.” said, Murray Nye, President and CEO Demesne. “Extensive historical records, prior drilling programs, 1980s underground rehabilitation work, and the project’s location on patented claims in mining-friendly Idaho should allow accelerated advancement of the project and a low-cost production scenario.” Pursuant to the terms and conditions of the Option Agreement, and in order to acquire a 100% interest in and to the Property (subject to a 2% royalty), the Company must pay to the Optionor an aggregate of US$5,800,000 as follows: (a)        US$100,000 on the effective date; (b)        US$50,000 on the six (6) month anniversary of the effective date; (c)        US$100,000 on the one (1) year anniversary of the effective date; (d)        US$130,000 on the two (2) year anniversary of the effective date; (e)        US$150,000 on the three (3) year anniversary of the effective date; (f)        US$250,000 on the four (4) year anniversary of the effective date; (g)        US$250,000 on the five (5) year anniversary of the effective date; (h)        US$770,000 on the six (6) year anniversary of the effective date; (i)        US$1,000,000 on the seven (7) year anniversary of the effective date; and (j)        US$3,000,000 on the eight (8) year anniversary of the effective date. If and when the Option has been exercised, a 100% undivided right, title and interest to the Property will thereupon vest in the Company free and clear of all encumbrances, subject only to the 2% royalty. Demesne will have the right to reduce the royalty to a 1% royalty by paying the Optionor US$2,000,000 on or before the four (4) year anniversary of the effective date. ABOUT THE IMA PROPERTY The IMA Property is located in the Lemhi Range, near the community of Patterson, Idaho, located approximately 20 miles east of Challis, comprising of the IMA Mine, with 22 patented claims on 395.98 acres and an additional 214.4 acres of patented ground in adjacent Pahsimeroi Valley. The patented claims are accessible over existing roads managed by the Bureau of Land Management. The IMA Property is a past producing tungsten property that began as a silver mine in the 1800s. Between 1945 and 1957, while operated by the Bradley Mining Company, the IMA Mine produced approximately 2,198 tons of WO 3 (199,449 MTUs), from 468k tonnes of ore with an average recovered grade of 0.434% WO 3 , 2 and produced an additional sulfide concentrate yielding 1.29M oz silver, 1.8M lbs copper, 2.92M lbs lead and 0.02M lbs zinc 3 . The IMA mine shut down in 1958 upon collapse of the U.S. government tungsten buying program. The property was subsequently explored for molybdenum by AMAX Inc. (1960-1962), Inspiration Development Company (“Inspiration”) (1979-1982), Gentor Resources Ltd (2007-2008), and other junior exploration companies. Inspiration ultimately focused on exploration and development of the quartz-tungsten-vein system, rehabilitating upper levels of the mine to complete underground resource delineation drilling, conducting metallurgical work and commencing construction of a haulage adit. 3 Due to a decrease in tungsten prices, development work ceased in 1982 prior to recommencement of mining. Tungsten mineralization in the IMA Mine occurs in quartz veins hosted in Precambrian siliciclastic metasediments containing pyrite, fluorite, hubnerite, scheelite, tetrahedrite, galena, sphalerite and chalcopyrite. The quartz veins occur in a zone up to 900 feet wide, 2000 feet long and up to 700 feet in vertical extent 1 . Molybdenite mineralization occurs in the veins and disseminations in potassically altered Cenozoic porphyry intrusive that is exposed in the lower levels of the IMA Mine and intersected in deeper historical drilling. Mineralization occurrence is interpreted as consistent with a sub-Climax type porphyry model with higher-level tungsten-base metal veins. 1 The IMA Mine is situated close to key infrastructure items and resources, including paved county roads, tier-1 low-cost power supply, access to water rights, and a mining-oriented labour force. ABOUT DEMESNE RESOURCES LTD. Demesne Resources Ltd. is a British Columbia based company involved in the acquisition and exploration of magnetite mineral properties. The Company's principal property is the Star Project, consisting of five contiguous mineral titles covering an area of approximately 4,615.75 hectares located in the Skeena Mining Division, British Columbia, Canada. The Company has entered into an option agreement pursuant to which it is entitled to earn an undivided 100% interest in the Star Project. ON BEHALF OF THE BOARD OF DIRECTORS: Murray Nye CEO For further information, please contact: Murray Nye, CEO, Email: ir@demesneresources.com; Phone: (778)706-6104. The Canadian Securities Exchange does not accept responsibility for the adequacy or accuracy of this release and has neither approved nor disapproved the contents of this press release. This press release includes \"forward-looking information\" that is subject to a number of assumptions, risks and uncertainties, many of which are beyond the control of the Company. Such statements represent the Company’s current views with respect to future events and are necessarily based upon a number of assumptions and estimates that, while considered reasonable by the Company, are inherently subject to significant business, economic, competitive, political and social risks, contingencies and uncertainties. Many factors, both known and unknown, could cause results, performance, or achievements to be materially different from the results, performance or achievements that are or may be expressed or implied by such forward-looking statements. The Company does not intend, and does not assume any obligation, to update these forward-looking statements or information to reflect changes in assumptions or changes in circumstances or any other events affecting such statements and information other than as required by applicable laws, rules and regulations. Statements concerning historical exploration and production on the property have been obtained through both public and private sources, and are believed to be substantially factual and relevant in that they demonstrate the tenor of exploration targets on the property. Neither Demesne Resources, nor its Qualified Person, has done sufficient work to verify historical information regarding past production or exploration, and this information should not be relied upon until it has been verified. Technical information in this news release has been prepared in accordance with Canadian regulatory requirements set out in National Instrument 43-101 — Standards of Disclosure for Mineral Projects (“NI-43-101”). Austin Zinsser, P.G., SME-RM, Vice President, Exploration for the Company, and a Qualified Person as defined by NI-43-101 and has reviewed and approved the scientific and technical information in this Presentation. 1 Wardrop 2008; Technical Report on the IMA Mine Molybdenum Project, July 2008; Prepared for Gentor Resources Inc., 52p. 2 Bradley Mining Company, 1958; Summarized Information on IMA Mine, Lemhi Co, Patterson, Idaho. Company Report, 6p. 3 Victoria Mitchell, 1999; History of the Ima Mine, Lemhi County, Idaho, Idaho Geological Survey, Staff Report 99-2, University of Idaho, August 1999.",
    "primary_commodity": "W"
  },
  "articleProject": {
    "gid": 8936,
    "project_name": "Ima Mine",
    "location": null
  },
  "articleExchange": "CSE",
  "articleCompanyId": 4691,
  "articleTicker": "TUNG",
  "articleCompanyName": "American Tungsten Corp.",
  "allOtherCompanyProjects": [
    {
      "company_id": 4691,
      "gid": 8936,
      "project_name": "Ima Mine",
      "location": null
    }
  ],
  "allOtherCompanyNews": [
    {
      "id": 107509,
      "company_id": 4691,
      "title": "American Tungsten Corp. Identified Multiple Exploration Targets at Ima Mine & Provides an Update on its Technical Report",
      "link": null,
      "date": "2025-06-10T11:30:00.000Z",
      "hidden": false
    },
    {
      "id": 105888,
      "company_id": 4691,
      "title": "American Tungsten Corp. Commences Mine Site Preparation and Exploration Work",
      "link": null,
      "date": "2025-05-27T11:30:00.000Z",
      "hidden": false
    },
    {
      "id": 104460,
      "company_id": 4691,
      "title": "American Tungsten Corp. To Host Management Update Webinar",
      "link": null,
      "date": "2025-05-13T11:30:00.000Z",
      "hidden": false
    },
    {
      "id": 104004,
      "company_id": 4691,
      "title": "American Tungsten Corp. Announces Addition to Board of Directors",
      "link": null,
      "date": "2025-05-08T11:30:00.000Z",
      "hidden": false
    },
    {
      "id": 103453,
      "company_id": 4691,
      "title": "American Tungsten Corp. Announces Changes to Board of Directors",
      "link": null,
      "date": "2025-05-05T11:30:00.000Z",
      "hidden": false
    },
    {
      "id": 101625,
      "company_id": 4691,
      "title": "Demesne Resources Ltd. Grants Stock Options",
      "link": "https://app.quotemedia.com/data/downloadFiling?webmasterId=104408&ref=680bcdd2e2bbc25fd64692ae&type=PDFC&formType=002-002-001089-003001&formDescription=News+release&dateFiled=2025-04-25",
      "date": "2025-04-25T18:00:50.000Z",
      "hidden": false
    },
    {
      "id": 100268,
      "company_id": 4691,
      "title": "American Tungsten Corp. to Participate at Top Shelf Partners Commodities Global Expo 2025",
      "link": null,
      "date": "2025-04-21T11:30:00.000Z",
      "hidden": false
    },
    {
      "id": 99986,
      "company_id": 4691,
      "title": "American Tungsten Corp. Applauds U.S. Presidential Executive Order to Ensure National Security Through the Assessment of and Securing of Domestic Critical Minerals Supply Chains",
      "link": null,
      "date": "2025-04-16T11:30:00.000Z",
      "hidden": false
    },
    {
      "id": 99629,
      "company_id": 4691,
      "title": "American Tungsten Corp. Announces New CEO, Ali Haji",
      "link": null,
      "date": "2025-04-14T11:30:00.000Z",
      "hidden": false
    },
    {
      "id": 98464,
      "company_id": 4691,
      "title": "American Tungsten Corp. Joins The Critical Mineral Institute",
      "link": null,
      "date": "2025-04-02T11:30:00.000Z",
      "hidden": false
    }
  ]
}
