{
  "article": {
    "id": 87567,
    "link": "https://www.globenewswire.com/news-release/2025/02/12/3024940/0/en/American-Tungsten-Corp-Acquires-Additional-Claims-Surrounding-the-IMA-Mine-in-Idaho.html",
    "title": "American Tungsten Corp. Acquires Additional Claims Surrounding the IMA Mine in Idaho",
    "description": "<p align=\"justify\">Vancouver, BC, Feb.  12, 2025  (GLOBE NEWSWIRE) -- <b>American Tungsten Corp. (CSE:TUNG) (OTCQB:DEMRF) (FSE:RK9) </b>(“<b>American Tungsten</b>” or the “<b>Company</b>”) is pleased to announce that it has acquired additional mining rights at its IMA Mine Project through the staking of 113 WMO federal lode mining claims covering an area of 1,988.6 acres (804.75ha). </p>   <p align=\"justify\" style=\" text-align: justify; font-size:12pt;\"> </p>   <p align=\"justify\">The IMA Mine is a past producing underground tungsten mine situated on 22 patented claims located in East Central Idaho. Between 1945 and 1957, the property produced approximately 199,449 MTUs of WO3 and was subsequently explored for molybdenum and tungsten by various operators between 1960-2008<sup>(1</sup><sup>)</sup>. </p>   <p align=\"justify\" style=\" text-align: justify; font-size:12pt;\"> </p>   <p align=\"justify\">“I am pleased to announce that we have claimed acquired additional mineral rights, representing approximately 805ha,” said Murray Nye, CEO of American Tungsten. “These additional claims reinforce our footprint in Idaho and bolster the IMA Mine’s land position.”</p>   <p align=\"justify\" style=\" text-align: justify; font-size:12pt;\"> </p>   <p><b>ABOUT AMERICAN TUNGSTEN CORP.</b></p>   <p align=\"justify\" style=\" text-align: justify; font-size:12pt;\"> </p>   <p align=\"justify\">American Tungsten Corp. (previously Demesne Resources Inc.) is a Canadian-based company involved in the acquisition and exploration of magnetite mineral properties. The Company's Star Project consists of five contiguous mineral titles covering an area of approximately 4,615.75 hectares located in the Skeena Mining Division, British Columbia, Canada. The Company has entered into an option agreement pursuant to which it is entitled to earn an undivided 100% interest in the Star Project. American Tungsten has also entered into an option agreement, pursuant to which it can acquire a 100% interest (subject to a 2% royalty) in and to the IMA Mine Project, a past producing underground tungsten mine situated on 22 patented claims located in East Central, Idaho, United States.</p>   <p align=\"justify\" style=\" text-align: justify; font-size:12pt;\"> </p>   <p align=\"justify\">Social media links:</p>   <p align=\"justify\">LinkedIn: <a href=\"https://www.globenewswire.com/Tracker?data=cYH_fCaCJUtpYMRCuJehHu0F0obJLLJqCXNVuvarWMi7mVK1E85wCDcQpV3TkboyUlv-Mp6IrUWCfWkgYoO32sm9i5AK14Lgt27-GcXcb421nodfYHG7IAjfGvRIlENflSZ1fXn4xVUyHxtz76Cxd4yMu8LejsUNNTCbi074IVypRumAO95NUbljWrzS0Hop\" rel=\"nofollow\" target=\"_blank\" title=\"\"><u>https://www.linkedin.com/company/americantungstencorp/</u></a></p>   <p align=\"justify\">X: <a href=\"https://www.globenewswire.com/Tracker?data=cYH_fCaCJUtpYMRCuJehHtadxJudDOKTaspbKBD6oIDE7azkZxSak2_P3OD79uCNi96yLav6JtAB95Fb0K6fWgdEmwHAomkMWUghWGc0R0U=\" rel=\"nofollow\" target=\"_blank\" title=\"\"><u>https://x.com/amtungsten</u></a></p>   <p align=\"justify\">Facebook: <a href=\"https://www.globenewswire.com/Tracker?data=cYH_fCaCJUtpYMRCuJehHtIP6QahyeN8IQeuxMvYgB9VPBvlS50GYegOXmlnpJb1GemSNT1Zzuxu565HXizHx7vkX085OProOE-ru2ppGX5RvbagcFcVZWN6YUNvfWF6jpgfboRVRYdkwZpTdTKQmw==\" rel=\"nofollow\" target=\"_blank\" title=\"\"><u>https://www.facebook.com/americantungsten</u></a></p>   <p align=\"justify\">Instagram: <a href=\"https://www.globenewswire.com/Tracker?data=cYH_fCaCJUtpYMRCuJehHm4unmYpolirsFPMKA2NjNdRsQwCAunrmNpITNl8uoNvWBFMSibN7ChZiRSL3RUW8prH-Q4pLUCcMeffdhDWUwbAfFYe2UU9VqFacnhhc5gFNBsl_CjmMGpDcsjmdXoyHWsCn_BWEKYczS5K-Of0Zow=\" rel=\"nofollow\" target=\"_blank\" title=\"\"><u>https://www.instagram.com/americantungstencorp/</u></a></p>   <p align=\"justify\">YouTube: <a href=\"https://www.globenewswire.com/Tracker?data=cYH_fCaCJUtpYMRCuJehHnZcGPU4VoDZfa17nzlK-u3BvXmt0iXiD0NzBfa_Bni3Jr2LQUnfQyls1nxn5AJoAubBAyLcLw342FD7OlSVyIP4xNkLOstUfW6GenScmt2rub9jUUWt16OkgvZO839MPGzblsOMVG6xn1YOP0zko0U=\" rel=\"nofollow\" target=\"_blank\" title=\"\"><u>https://www.youtube.com/@americantungstencorp</u></a></p>   <p align=\"justify\" style=\" text-align: justify; font-size:12pt;\"> </p>   <p align=\"justify\"><b>ON BEHALF OF THE BOARD OF DIRECTORS:</b></p>   <p style=\"font-size:12pt;\"> </p>   <p>Murray Nye <br />‎CEO</p>   <p style=\"font-size:12pt;\"> </p>   <p>1055 West Georgia Street, Suite 1500<br />Vancouver, BC V6E 0B6<br />Canada</p>   <p align=\"justify\" style=\" text-align: justify; font-size:12pt;\"> </p>   <p align=\"justify\">For further information, please contact: </p>   <p align=\"justify\" style=\" text-align: justify; font-size:12pt;\"> </p>   <p align=\"justify\">Murray Nye, CEO<br />Email: <a href=\"https://www.globenewswire.com/Tracker?data=ic5VlgYpmoadScX8B3LoNI6RjYnsVxi-dmd1Iz4ypGVal_KlLcJ6zvj3ic_xc6ggE4PvcaI15h4zUQk3NHDg-lOXf1NqXOeqnrnSy0NM7M1BcUzMyhsZds53XPuw7Drv\" rel=\"nofollow\" target=\"_blank\" title=\"\"><u>ir@americantungstencorp.com</u></a><br />Phone: +1 (416) 300-7398</p>   <p align=\"justify\">CSE:TUNG<br />OTCQB:DEMRF<br />FSE:RK9</p>   <p align=\"justify\" style=\" text-align: justify; font-size:12pt;\"> </p>   <p align=\"justify\"><i>The Canadian Securities Exchange does not accept responsibility for the adequacy or accuracy of this release and has neither approved nor disapproved the contents of this press release.</i></p>   <p align=\"justify\" style=\" text-align: justify; font-size:12pt;\"> </p>   <p align=\"justify\"><b><i>This news release includes certain statements that may be deemed “forward-looking statements”. All statements in this news release, other than statements of historical facts, that address events or developments that the Company expects to occur, are forward-looking statements. Forward-looking statements are statements that are not historical facts and are generally, but not always, identified by the words “believes”, “expects”, “plans”, “anticipates”, “intends”, “estimates”, “projects”, “potential” and similar expressions, or that events or conditions “will”, “would”, “may”, “could” or “should” occur. Although the Company believes the expectations expressed in such forward-looking statements are based on reasonable assumptions, such statements are not guarantees of future performance and actual results may differ materially from those in the forward-looking statements. Forward looking statements in this news release include statements respecting: (</i></b><b><i>i) the IMA Mine Project and the mineral prospects thereon, (ii) the Company's performance of its obligations under the Option Agreement, and the exercise of the option thereunder, and (iii) the Company's planned activities on the IMA Mine Project</i></b><b><i>. Factors that could cause the actual results to differ materially from those in forward-looking statements include the receipt of regulatory approvals, market prices, continued availability of capital and financing, and general economic, market or business conditions. Investors are cautioned that any such statements are not guarantees of future performance and actual results or developments may differ materially from those projected in the forward-looking statements. Forward-looking statements are based on the beliefs, estimates and opinions of the Company’s management on the date the statements are made. Except as required by applicable securities laws, the Company undertakes no obligation to update these forward-looking statements in the event that management's beliefs, estimates or opinions, or other factors, should change.</i></b></p>   <p align=\"justify\" style=\"background: #FFFFFF;  text-align: justify; font-size:12pt;\"> </p>   <p align=\"justify\"><b><i>Neither American Tungsten, nor its Qualified Person, has done sufficient work to verify historical drillhole information. American Tungsten is not treating the historical drillhole information as current drilling results. Historical drillhole results are believed to be substantially factual and relevant in that they demonstrate the tenor of exploration targets on the property. Drillholes may be oriented oblique to structures and may not be representative of true-width of mineralization.</i></b></p>   <p align=\"justify\" style=\"background: #FFFFFF;  text-align: justify; font-size:12pt;\"> </p>   <p align=\"justify\"><b><i>Technical information in this news release has been prepared in accordance with Canadian regulatory requirements set out in National Instrument 43-101 — Standards of Disclosure for Mineral Projects (“NI-43-101”). Austin Zinsser, P.G., SME-RM, Vice President, Exploration for the Company, and a Qualified Person as defined by NI-43-101, has reviewed and approved the scientific and technical information in this Presentation.</i></b></p>   <p align=\"justify\" style=\" text-align: justify; font-size:12pt;\"> </p>   <p align=\"justify\" style=\" text-align: justify; font-size:12pt;\"> </p>   <p id=\"footnote-1\"><em>1. Bradley Mining Company, 1958; Summarized Information on IMA Mine, Lemhi Co, Patterson, Idaho. Company Report, 6p. </em></p>  <br /><img alt=\"\" src='https://ml.globenewswire.com/media/YTRiZGI2OTAtY2QwYi00YWI2LWEyNzAtZGQ5ZTYzZGFhMjQ5LTUwMDEyOTQyOA==/tiny/American-Tungsten-Corp-.png' referrerpolicy='no-referrer-when-downgrade' />",
    "search_terms": "Ima Mine,American Tungsten Corp.,TUNG",
    "master_gid": 8936,
    "date": "2025-02-12T12:30:00.000Z",
    "tags": "USA|Idaho|||Project Acquisition",
    "image_id": null,
    "hidden": false,
    "company_id": 4691,
    "provider": "globenewswire",
    "excerpt": "Vancouver, BC, Feb. 12, 2025 (GLOBE NEWSWIRE) --American Tungsten Corp. (CSE:TUNG) (OTCQB:DEMRF) (FSE:RK9)(“American Tungsten” or the “Company”) is pleased to announce that it has acquired additional mining rights at its IMA Mine Project through the staking of 113 WMO federal lode mining claims covering an area of 1,988.6 acres (804.75ha).The",
    "is_regulatory": false,
    "refined_tags": [],
    "ftp_filename": null,
    "company_name": "American Tungsten Corp.",
    "exchange": "CSE",
    "root_ticker": "TUNG",
    "project_name": "Ima Mine",
    "gid": 8936,
    "location": null,
    "plan_id": null,
    "description_text": "Vancouver, BC, Feb.  12, 2025  (GLOBE NEWSWIRE) -- American Tungsten Corp. (CSE:TUNG) (OTCQB:DEMRF) (FSE:RK9) (“ American Tungsten ” or the “ Company ”) is pleased to announce that it has acquired additional mining rights at its IMA Mine Project through the staking of 113 WMO federal lode mining claims covering an area of 1,988.6 acres (804.75ha). The IMA Mine is a past producing underground tungsten mine situated on 22 patented claims located in East Central Idaho. Between 1945 and 1957, the property produced approximately 199,449 MTUs of WO3 and was subsequently explored for molybdenum and tungsten by various operators between 1960-2008 (1 ) . “I am pleased to announce that we have claimed acquired additional mineral rights, representing approximately 805ha,” said Murray Nye, CEO of American Tungsten. “These additional claims reinforce our footprint in Idaho and bolster the IMA Mine’s land position.” ABOUT AMERICAN TUNGSTEN CORP. American Tungsten Corp. (previously Demesne Resources Inc.) is a Canadian-based company involved in the acquisition and exploration of magnetite mineral properties. The Company's Star Project consists of five contiguous mineral titles covering an area of approximately 4,615.75 hectares located in the Skeena Mining Division, British Columbia, Canada. The Company has entered into an option agreement pursuant to which it is entitled to earn an undivided 100% interest in the Star Project. American Tungsten has also entered into an option agreement, pursuant to which it can acquire a 100% interest (subject to a 2% royalty) in and to the IMA Mine Project, a past producing underground tungsten mine situated on 22 patented claims located in East Central, Idaho, United States. Social media links: LinkedIn: https://www.linkedin.com/company/americantungstencorp/ X: https://x.com/amtungsten Facebook: https://www.facebook.com/americantungsten Instagram: https://www.instagram.com/americantungstencorp/ YouTube: https://www.youtube.com/@americantungstencorp ON BEHALF OF THE BOARD OF DIRECTORS: Murray Nye ‎CEO 1055 West Georgia Street, Suite 1500 Vancouver, BC V6E 0B6 Canada For further information, please contact: Murray Nye, CEO Email: ir@americantungstencorp.com Phone: +1 (416) 300-7398 CSE:TUNG OTCQB:DEMRF FSE:RK9 The Canadian Securities Exchange does not accept responsibility for the adequacy or accuracy of this release and has neither approved nor disapproved the contents of this press release. This news release includes certain statements that may be deemed “forward-looking statements”. All statements in this news release, other than statements of historical facts, that address events or developments that the Company expects to occur, are forward-looking statements. Forward-looking statements are statements that are not historical facts and are generally, but not always, identified by the words “believes”, “expects”, “plans”, “anticipates”, “intends”, “estimates”, “projects”, “potential” and similar expressions, or that events or conditions “will”, “would”, “may”, “could” or “should” occur. Although the Company believes the expectations expressed in such forward-looking statements are based on reasonable assumptions, such statements are not guarantees of future performance and actual results may differ materially from those in the forward-looking statements. Forward looking statements in this news release include statements respecting: ( i) the IMA Mine Project and the mineral prospects thereon, (ii) the Company's performance of its obligations under the Option Agreement, and the exercise of the option thereunder, and (iii) the Company's planned activities on the IMA Mine Project . Factors that could cause the actual results to differ materially from those in forward-looking statements include the receipt of regulatory approvals, market prices, continued availability of capital and financing, and general economic, market or business conditions. Investors are cautioned that any such statements are not guarantees of future performance and actual results or developments may differ materially from those projected in the forward-looking statements. Forward-looking statements are based on the beliefs, estimates and opinions of the Company’s management on the date the statements are made. Except as required by applicable securities laws, the Company undertakes no obligation to update these forward-looking statements in the event that management's beliefs, estimates or opinions, or other factors, should change. Neither American Tungsten, nor its Qualified Person, has done sufficient work to verify historical drillhole information. American Tungsten is not treating the historical drillhole information as current drilling results. Historical drillhole results are believed to be substantially factual and relevant in that they demonstrate the tenor of exploration targets on the property. Drillholes may be oriented oblique to structures and may not be representative of true-width of mineralization. Technical information in this news release has been prepared in accordance with Canadian regulatory requirements set out in National Instrument 43-101 — Standards of Disclosure for Mineral Projects (“NI-43-101”). Austin Zinsser, P.G., SME-RM, Vice President, Exploration for the Company, and a Qualified Person as defined by NI-43-101, has reviewed and approved the scientific and technical information in this Presentation. 1. Bradley Mining Company, 1958; Summarized Information on IMA Mine, Lemhi Co, Patterson, Idaho. Company Report, 6p.",
    "primary_commodity": "W"
  },
  "articleProject": {
    "gid": 8936,
    "project_name": "Ima Mine",
    "location": null
  },
  "articleExchange": "CSE",
  "articleCompanyId": 4691,
  "articleTicker": "TUNG",
  "articleCompanyName": "American Tungsten Corp.",
  "allOtherCompanyProjects": [
    {
      "company_id": 4691,
      "gid": 8936,
      "project_name": "Ima Mine",
      "location": null
    }
  ],
  "allOtherCompanyNews": [
    {
      "id": 107509,
      "company_id": 4691,
      "title": "American Tungsten Corp. Identified Multiple Exploration Targets at Ima Mine & Provides an Update on its Technical Report",
      "link": null,
      "date": "2025-06-10T11:30:00.000Z",
      "hidden": false
    },
    {
      "id": 105888,
      "company_id": 4691,
      "title": "American Tungsten Corp. Commences Mine Site Preparation and Exploration Work",
      "link": null,
      "date": "2025-05-27T11:30:00.000Z",
      "hidden": false
    },
    {
      "id": 104460,
      "company_id": 4691,
      "title": "American Tungsten Corp. To Host Management Update Webinar",
      "link": null,
      "date": "2025-05-13T11:30:00.000Z",
      "hidden": false
    },
    {
      "id": 104004,
      "company_id": 4691,
      "title": "American Tungsten Corp. Announces Addition to Board of Directors",
      "link": null,
      "date": "2025-05-08T11:30:00.000Z",
      "hidden": false
    },
    {
      "id": 103453,
      "company_id": 4691,
      "title": "American Tungsten Corp. Announces Changes to Board of Directors",
      "link": null,
      "date": "2025-05-05T11:30:00.000Z",
      "hidden": false
    },
    {
      "id": 101625,
      "company_id": 4691,
      "title": "Demesne Resources Ltd. Grants Stock Options",
      "link": "https://app.quotemedia.com/data/downloadFiling?webmasterId=104408&ref=680bcdd2e2bbc25fd64692ae&type=PDFC&formType=002-002-001089-003001&formDescription=News+release&dateFiled=2025-04-25",
      "date": "2025-04-25T18:00:50.000Z",
      "hidden": false
    },
    {
      "id": 100268,
      "company_id": 4691,
      "title": "American Tungsten Corp. to Participate at Top Shelf Partners Commodities Global Expo 2025",
      "link": null,
      "date": "2025-04-21T11:30:00.000Z",
      "hidden": false
    },
    {
      "id": 99986,
      "company_id": 4691,
      "title": "American Tungsten Corp. Applauds U.S. Presidential Executive Order to Ensure National Security Through the Assessment of and Securing of Domestic Critical Minerals Supply Chains",
      "link": null,
      "date": "2025-04-16T11:30:00.000Z",
      "hidden": false
    },
    {
      "id": 99629,
      "company_id": 4691,
      "title": "American Tungsten Corp. Announces New CEO, Ali Haji",
      "link": null,
      "date": "2025-04-14T11:30:00.000Z",
      "hidden": false
    },
    {
      "id": 98464,
      "company_id": 4691,
      "title": "American Tungsten Corp. Joins The Critical Mineral Institute",
      "link": null,
      "date": "2025-04-02T11:30:00.000Z",
      "hidden": false
    }
  ]
}
