{
  "article": {
    "id": 35612,
    "link": "https://www.accesswire.com/viewarticle.aspx?id=756856&lang=en",
    "title": "Ivanhoe Electric Closes Acquisition of Private Land at the Santa Cruz Copper Project in Arizona",
    "description": "<p><i><strong>Ivanhoe Electric Now Has Control Over Surface Land and Mineral Rights Encompassing the Entire Santa Cruz Project</strong></i></p><p><strong>PHOENIX, AZ / ACCESSWIRE / May 24, 2023 /</strong> Ivanhoe Electric (NYSE American:IE)(TSX:IE) announces today the closing of its previously disclosed private land acquisition at its Santa Cruz Copper Project in Casa Grande, Arizona. The terms of the Purchase and Sale Agreement (\"PSA\") for the acquisition of surface title and associated water rights are described in <a href=\"https://pr.report/MJE0VOtf\">Ivanhoe Electric's May 11, 2023, news release.</a></p><p>Taylor Melvin, Ivanhoe Electric's President and Chief Executive Officer, commented: \"We are excited to close our previously announced land acquisition at our Santa Cruz Copper Project in Arizona. Acquiring this land is a major milestone in the advancement of our Santa Cruz Project, where we already have agreements in place to control all the mineral rights associated with the acquired surface land. The land acquisition puts us in excellent position to finalize our initial economic assessment, which we expect to release in the third quarter of this year.\"</p><p>The final purchase price has been reduced by $3.63 million compared to the amount previously disclosed to reflect an adjustment to the final acreage being acquired. The adjustment to the total acreage acquired of 5,975 acres is a result of final land surveys completed in the normal course of confirmatory due diligence.</p><p>At closing, Ivanhoe Electric paid a total of $34.3 million to the seller, which includes $5.1 million of previously paid deposits. Ivanhoe Electric has also issued a secured promissory note to the seller in the principal amount of approximately $82.6 million over a period of 4.5 years. The promissory note includes an annual interest rate of prime plus 1%.</p><p>Ivanhoe Electric holds the option to acquire all the mineral titles contiguous with the acquired surface lands. Those mineral rights will be formally acquired upon the completion of scheduled payments by Ivanhoe Electric to the current mineral title holder in August 2023 and 2024. At that time, Ivanhoe Electric will have a unified land and mineral package encompassing the entire Santa Cruz Project.</p><p>Map of the 5,975 acres of private land acquired at the Santa Cruz Copper Project, Casa Grande, Arizona.</p><figure class=\"image image_resized\" style=\"width:626px;display:table;text-align:center;margin:0.9em auto;\"><img src=\"https://www.accesswire.com/users/newswire/images/756856/image.png\" alt=\"Ivanhoe Electric Inc., Tuesday, May 23, 2023, Press release picture\"></figure><div style=\"clear: both\"> </div><p> </p><p> </p><p> </p><p> </p><p> </p><p> </p><p> </p><p><br> </p><p><strong>About Ivanhoe Electric</strong> <br>Ivanhoe Electric is an American technology and mineral exploration company that is re-inventing mining for the electrification of everything by combining advanced mineral exploration technologies, renewable energy storage solutions and electric metals projects predominantly located in the United States. Ivanhoe Electric uses its Typhoon&trade; transmitter, an accurate and powerful geophysical survey system, together with advanced data analytics provided by its subsidiary, Computational Geosciences Inc., to accelerate and de-risk the mineral exploration process as well as to potentially discover deposits of critical metals that may otherwise be undetectable by traditional exploration technologies. Through its controlling interest in VRB Energy, Ivanhoe Electric also develops and manufactures advanced grid-scale vanadium redox battery storage systems. Finally, through advancing its portfolio of electric metals projects located primarily in the United States, headlined by the Santa Cruz Copper Project in Arizona and the Tintic Copper-Gold Project in Utah, as well as projects in Montana, Nevada, Oregon and North Carolina, Ivanhoe Electric is also well positioned to support American supply chain independence by delivering the critical metals necessary for electrification of the economy.</p><p><strong>Contact Information</strong></p><p>Investors: Valerie Kimball, Director, Investor Relations 720-933-1150</p><p>Follow us on Twitter</p><p>Ivanhoe Electric's Executive Chairman Robert Friedland: <a href=\"https://pr.report/NPBmWtzw\">@robert_ivanhoe</a></p><p>Ivanhoe Electric: <a href=\"https://pr.report/Hwr7t4uL\">@ivanhoeelectric</a></p><p><strong>Forward-Looking Statements</strong> <br>Certain statements in this news release constitute \"forward-looking statements\" or \"forward-looking information\" within the meaning of applicable US and Canadian securities laws. Such statements and information involve known and unknown risks, uncertainties and other factors that may cause the actual results, performance or achievements of the company, its projects, or industry results, to be materially different from any future results, performance or achievements expressed or implied by such forward-looking statements or information. Such statements can be identified by the use of words such as \"may\", \"would\", \"could\", \"will\", \"intend\", \"expect\", \"believe\", \"plan\", \"anticipate\", \"estimate\", \"scheduled\", \"forecast\", \"predict\" and other similar terminology, or state that certain actions, events or results \"may\", \"could\", \"would\", \"might\" or \"will\" be taken, occur or be achieved. These statements reflect the company's current expectations regarding future events, performance and results and speak only as of the date of this news release.</p><p>Such statements in this news release include, without limitation: the schedule of payments; the development of the Santa Cruz Project and the potential benefits thereof.</p><p>Forward-looking statements are based on management's beliefs and assumptions and on information currently available to management. Such statements are subject to significant risks and uncertainties, and actual results may differ materially from those expressed or implied in the forward-looking statements due to various factors, including uncertainties as to the timing of closing the transaction, including the potential failure to close; the Company's ability to complete due diligence on the timeline or at all; the satisfaction of conditions to closing; the risk that the Company cannot complete the payments owed; changes in the prices of copper or other metals Ivanhoe Electric is exploring for; the results of exploration and drilling activities and/or the failure of exploration programs or studies to deliver anticipated results or results that would justify and support continued exploration, studies, development or operations; the final assessment of exploration results and information that is preliminary; the significant risk and hazards associated with any future mining operations, extensive regulation by the US government as well as local governments; changes in laws, rules or regulations, or their enforcement by applicable authorities; the failure of parties to contracts with the company to perform as agreed; and the impact of political, economic and other uncertainties associated with operating in foreign countries, and the impact of the COVID-19 pandemic and the global economy. These factors should not be construed as exhaustive and should be read in conjunction with the other cautionary statements and risk factors described in Ivanhoe Electric's Annual Report on Form 10-K filed with the U.S. Securities and Exchange Commission.</p><p>No assurance can be given that such future results will be achieved. Forward-looking statements speak only as of the date of this news release. Ivanhoe Electric cautions you not to place undue reliance on these forward-looking statements. Subject to applicable securities laws, the company does not assume any obligation to update or revise the forward-looking statements contained herein to reflect events or circumstances occurring after the date of this news release, and Ivanhoe Electric expressly disclaims any requirement to do so.</p><p><strong>SOURCE:</strong> Ivanhoe Electric Inc.</p><br><br>View source version on accesswire.com: <br><a href='https://www.accesswire.com/756856/Ivanhoe-Electric-Closes-Acquisition-of-Private-Land-at-the-Santa-Cruz-Copper-Project-in-Arizona'>https://www.accesswire.com/756856/Ivanhoe-Electric-Closes-Acquisition-of-Private-Land-at-the-Santa-Cruz-Copper-Project-in-Arizona</a><br><br>",
    "search_terms": "Santa Cruz,Ivanhoe Electric Inc.,IE",
    "master_gid": 3239,
    "date": "2023-05-24T11:00:00.000Z",
    "tags": "USA|Arizona||Copper|Project Acquisition",
    "image_id": null,
    "hidden": false,
    "company_id": 2082,
    "provider": "accesswire",
    "excerpt": "Ivanhoe Electric Now Has Control Over Surface Land and Mineral Rights Encompassing the Entire Santa Cruz ProjectPHOENIX, AZ / ACCESSWIRE / May 24, 2023 /Ivanhoe Electric (NYSE American:IE)(TSX:IE) announces today the closing of its previously disclosed private land acquisition at its Santa Cruz Copper Project in Casa Grande, Arizona. The",
    "is_regulatory": false,
    "refined_tags": [
      "Project Acquisition"
    ],
    "ftp_filename": null,
    "company_name": "Ivanhoe Electric Inc.",
    "exchange": "TSX",
    "root_ticker": "IE",
    "project_name": "Santa Cruz",
    "gid": 3239,
    "location": "Arizona, United States",
    "plan_id": null,
    "description_text": "Ivanhoe Electric Now Has Control Over Surface Land and Mineral Rights Encompassing the Entire Santa Cruz Project PHOENIX, AZ / ACCESSWIRE / May 24, 2023 / Ivanhoe Electric (NYSE American:IE)(TSX:IE) announces today the closing of its previously disclosed private land acquisition at its Santa Cruz Copper Project in Casa Grande, Arizona. The terms of the Purchase and Sale Agreement (\"PSA\") for the acquisition of surface title and associated water rights are described in Ivanhoe Electric's May 11, 2023, news release. Taylor Melvin, Ivanhoe Electric's President and Chief Executive Officer, commented: \"We are excited to close our previously announced land acquisition at our Santa Cruz Copper Project in Arizona. Acquiring this land is a major milestone in the advancement of our Santa Cruz Project, where we already have agreements in place to control all the mineral rights associated with the acquired surface land. The land acquisition puts us in excellent position to finalize our initial economic assessment, which we expect to release in the third quarter of this year.\" The final purchase price has been reduced by $3.63 million compared to the amount previously disclosed to reflect an adjustment to the final acreage being acquired. The adjustment to the total acreage acquired of 5,975 acres is a result of final land surveys completed in the normal course of confirmatory due diligence. At closing, Ivanhoe Electric paid a total of $34.3 million to the seller, which includes $5.1 million of previously paid deposits. Ivanhoe Electric has also issued a secured promissory note to the seller in the principal amount of approximately $82.6 million over a period of 4.5 years. The promissory note includes an annual interest rate of prime plus 1%. Ivanhoe Electric holds the option to acquire all the mineral titles contiguous with the acquired surface lands. Those mineral rights will be formally acquired upon the completion of scheduled payments by Ivanhoe Electric to the current mineral title holder in August 2023 and 2024. At that time, Ivanhoe Electric will have a unified land and mineral package encompassing the entire Santa Cruz Project. Map of the 5,975 acres of private land acquired at the Santa Cruz Copper Project, Casa Grande, Arizona. About Ivanhoe Electric Ivanhoe Electric is an American technology and mineral exploration company that is re-inventing mining for the electrification of everything by combining advanced mineral exploration technologies, renewable energy storage solutions and electric metals projects predominantly located in the United States. Ivanhoe Electric uses its Typhoon™ transmitter, an accurate and powerful geophysical survey system, together with advanced data analytics provided by its subsidiary, Computational Geosciences Inc., to accelerate and de-risk the mineral exploration process as well as to potentially discover deposits of critical metals that may otherwise be undetectable by traditional exploration technologies. Through its controlling interest in VRB Energy, Ivanhoe Electric also develops and manufactures advanced grid-scale vanadium redox battery storage systems. Finally, through advancing its portfolio of electric metals projects located primarily in the United States, headlined by the Santa Cruz Copper Project in Arizona and the Tintic Copper-Gold Project in Utah, as well as projects in Montana, Nevada, Oregon and North Carolina, Ivanhoe Electric is also well positioned to support American supply chain independence by delivering the critical metals necessary for electrification of the economy. Contact Information Investors: Valerie Kimball, Director, Investor Relations 720-933-1150 Follow us on Twitter Ivanhoe Electric's Executive Chairman Robert Friedland: @robert_ivanhoe Ivanhoe Electric: @ivanhoeelectric Forward-Looking Statements Certain statements in this news release constitute \"forward-looking statements\" or \"forward-looking information\" within the meaning of applicable US and Canadian securities laws. Such statements and information involve known and unknown risks, uncertainties and other factors that may cause the actual results, performance or achievements of the company, its projects, or industry results, to be materially different from any future results, performance or achievements expressed or implied by such forward-looking statements or information. Such statements can be identified by the use of words such as \"may\", \"would\", \"could\", \"will\", \"intend\", \"expect\", \"believe\", \"plan\", \"anticipate\", \"estimate\", \"scheduled\", \"forecast\", \"predict\" and other similar terminology, or state that certain actions, events or results \"may\", \"could\", \"would\", \"might\" or \"will\" be taken, occur or be achieved. These statements reflect the company's current expectations regarding future events, performance and results and speak only as of the date of this news release. Such statements in this news release include, without limitation: the schedule of payments; the development of the Santa Cruz Project and the potential benefits thereof. Forward-looking statements are based on management's beliefs and assumptions and on information currently available to management. Such statements are subject to significant risks and uncertainties, and actual results may differ materially from those expressed or implied in the forward-looking statements due to various factors, including uncertainties as to the timing of closing the transaction, including the potential failure to close; the Company's ability to complete due diligence on the timeline or at all; the satisfaction of conditions to closing; the risk that the Company cannot complete the payments owed; changes in the prices of copper or other metals Ivanhoe Electric is exploring for; the results of exploration and drilling activities and/or the failure of exploration programs or studies to deliver anticipated results or results that would justify and support continued exploration, studies, development or operations; the final assessment of exploration results and information that is preliminary; the significant risk and hazards associated with any future mining operations, extensive regulation by the US government as well as local governments; changes in laws, rules or regulations, or their enforcement by applicable authorities; the failure of parties to contracts with the company to perform as agreed; and the impact of political, economic and other uncertainties associated with operating in foreign countries, and the impact of the COVID-19 pandemic and the global economy. These factors should not be construed as exhaustive and should be read in conjunction with the other cautionary statements and risk factors described in Ivanhoe Electric's Annual Report on Form 10-K filed with the U.S. Securities and Exchange Commission. No assurance can be given that such future results will be achieved. Forward-looking statements speak only as of the date of this news release. Ivanhoe Electric cautions you not to place undue reliance on these forward-looking statements. Subject to applicable securities laws, the company does not assume any obligation to update or revise the forward-looking statements contained herein to reflect events or circumstances occurring after the date of this news release, and Ivanhoe Electric expressly disclaims any requirement to do so. SOURCE: Ivanhoe Electric Inc. View source version on accesswire.com: https://www.accesswire.com/756856/Ivanhoe-Electric-Closes-Acquisition-of-Private-Land-at-the-Santa-Cruz-Copper-Project-in-Arizona",
    "primary_commodity": "Cu"
  },
  "articleProject": {
    "gid": 3239,
    "project_name": "Santa Cruz",
    "location": "Arizona, United States"
  },
  "articleExchange": "TSX",
  "articleCompanyId": 2082,
  "articleTicker": "IE",
  "articleCompanyName": "Ivanhoe Electric Inc.",
  "allOtherCompanyProjects": [
    {
      "company_id": 2082,
      "gid": 8732,
      "project_name": "Wadi Bidah",
      "location": null
    },
    {
      "company_id": 2082,
      "gid": 8733,
      "project_name": "Bir Umq",
      "location": null
    },
    {
      "company_id": 2082,
      "gid": 3239,
      "project_name": "Santa Cruz",
      "location": "Arizona, United States"
    },
    {
      "company_id": 2082,
      "gid": 3476,
      "project_name": "Tintic",
      "location": "Utah, United States"
    },
    {
      "company_id": 2082,
      "gid": 8279,
      "project_name": "Al Amar (Umm Ad Dabah)",
      "location": null
    },
    {
      "company_id": 2082,
      "gid": 5814,
      "project_name": "Umm Ash Shalahib",
      "location": "Saudi Arabia"
    }
  ],
  "allOtherCompanyNews": [
    {
      "id": -199864,
      "company_id": 2082,
      "title": "Ivanhoe Electric Subsidiary Cordoba Minerals Corp. Signs Definitive Agreement to Sell Remaining 50% Stake in Alacran Copper Project in Colombia",
      "link": null,
      "date": "2025-05-08T11:15:00.000Z",
      "hidden": false
    },
    {
      "id": 99779,
      "company_id": 2082,
      "title": "Ivanhoe Electric Receives Indication for up to $825 Million in Financing from Export-Import Bank of the United States for Santa Cruz Copper Project",
      "link": null,
      "date": "2025-04-15T11:00:00.000Z",
      "hidden": false
    },
    {
      "id": 92046,
      "company_id": 2082,
      "title": "Ivanhoe Electric Applauds Executive Order to Accelerate Mineral Production in the United States",
      "link": null,
      "date": "2025-03-21T11:00:00.000Z",
      "hidden": false
    },
    {
      "id": 87922,
      "company_id": 2082,
      "title": "Ivanhoe Electric Announces Closing of Public Offering and Exercise of Underwriter's Option",
      "link": "https://www.newsfilecorp.com/release/240898/Ivanhoe-Electric-Announces-Closing-of-Public-Offering-and-Exercise-of-Underwriters-Option",
      "date": "2025-02-14T21:05:00.000Z",
      "hidden": false
    },
    {
      "id": 87606,
      "company_id": 2082,
      "title": "Ivanhoe Electric Announces Pricing and Upsizing of Public Offering",
      "link": "https://www.newsfilecorp.com/release/240530/Ivanhoe-Electric-Announces-Pricing-and-Upsizing-of-Public-Offering",
      "date": "2025-02-12T04:00:00.000Z",
      "hidden": false
    },
    {
      "id": 87553,
      "company_id": 2082,
      "title": "Ivanhoe Electric Announces Public Offering of Units",
      "link": "https://www.newsfilecorp.com/release/240480/Ivanhoe-Electric-Announces-Public-Offering-of-Units",
      "date": "2025-02-11T21:24:00.000Z",
      "hidden": false
    },
    {
      "id": 83828,
      "company_id": 2082,
      "title": "Ivanhoe Electric's Typhoon(TM) Technology Quickly Proves its Power with Discovery in Saudi Arabia",
      "link": "https://www.newsfilecorp.com/release/236905/Ivanhoe-Electrics-TyphoonTM-Technology-Quickly-Proves-its-Power-with-Discovery-in-Saudi-Arabia",
      "date": "2025-01-13T12:00:00.000Z",
      "hidden": false
    },
    {
      "id": -163476,
      "company_id": 2082,
      "title": "Ivanhoe Electric and BHP Exploration Alliance Advance Exploration Activities in the Southwest United States",
      "link": "https://www.newsfilecorp.com/release/236199/Ivanhoe-Electric-and-BHP-Exploration-Alliance-Advance-Exploration-Activities-in-the-Southwest-United-States",
      "date": "2025-01-07T12:00:00.000Z",
      "hidden": false
    },
    {
      "id": 83275,
      "company_id": 2082,
      "title": "Ivanhoe Electric Reports Year-End Update on United States Exploration Programs",
      "link": "https://www.newsfilecorp.com/release/236000/Ivanhoe-Electric-Reports-YearEnd-Update-on-United-States-Exploration-Programs",
      "date": "2025-01-06T12:00:00.000Z",
      "hidden": false
    },
    {
      "id": -147198,
      "company_id": 2082,
      "title": "Ivanhoe Electric's VRB Energy Subsidiary and Red Sun Sign Definitive Agreements for Formation of New Grid Scale Battery Joint Venture",
      "link": "https://www.newsfilecorp.com/release/226647/Ivanhoe-Electrics-VRB-Energy-Subsidiary-and-Red-Sun-Sign-Definitive-Agreements-for-Formation-of-New-Grid-Scale-Battery-Joint-Venture",
      "date": "2024-10-15T11:00:00.000Z",
      "hidden": false
    }
  ]
}
