{
  "article": {
    "id": 85641,
    "link": "https://www.globenewswire.com/news-release/2025/01/28/3016673/0/en/ExGen-Signs-Purchase-Agreement-to-Acquire-Spark-North-Lithium-Project-in-Nevada.html",
    "title": "ExGen Signs Purchase Agreement to Acquire Spark North Lithium Project in Nevada",
    "description": "<p><strong>NOT</strong> <strong>FOR</strong> <strong>DISTRIBUTION</strong> <strong>TO</strong> <strong>UNITED</strong> <strong>STATES</strong> <strong>NEWSWIRE</strong> <strong>SERVICES</strong> <strong>OR</strong> <strong>FOR DISSEMINATION IN THE UNITED STATES</strong></p>  <p align=\"justify\">VANCOUVER, British Columbia, Jan.  28, 2025  (GLOBE NEWSWIRE) -- <strong>ExGen Resources Inc. </strong>(TSX.V: EXG; OTC: BXXRF) (“<strong>ExGen</strong>”, the “<strong>Company</strong>”): Further to ExGen’s previous news release dated December 5, 2024, Exgen is pleased to announce that it has entered into an asset purchase agreement dated January 21, 2025 (the “<strong>Purchase Agreement</strong>”) to acquire (the “<strong>Acquisition</strong>”) the Spark North lithium project in Elko County, Nevada consisting of 111 claims totaling approximately 2300 acres prospective for lithium (the “<strong>Spark North Lithium Project</strong>”) from an arm’s length private company (the “<strong>Vendor</strong>”). The Spark North Lithium Project is north of Surge Battery Metals Inc.’s (TSXV: NILI) “Nevada North Lithium Project” in Elko County, Nevada. In a news release dated September 24, 2024, Surge Battery Metals Inc. announced that the Nevada North Lithium Project had the highest grade lithium clay deposit in the USA (11.24 Mt LCE grading 3,010 ppm Li at a 1,250 ppm cutoff). The technical report for the Nevada North Lithium Project was prepared for Surge Battery Metals Inc. by authors Jeffrey D. Phinisey of TAG Resources LLC and Bruce M. Davis, independent geostatistical consultant, and titled “Technical Report on Mineral Resource Estimate for the Nevada North Lithium Project, Elko County, Nevada USA”, dated effective October 9, 2024, and as announced on September 24, 2024.</p>  <p align=\"justify\">The Purchase Agreement and the Acquisition of the Spark North Lithium Project are subject to TSX Venture Exchange (<strong>“TSXV”</strong>) approval. ExGen cautions that past results or discoveries on properties in proximity to ExGen’s properties, including the Nevada North Lithium Project, may not necessarily be indicative of the presence of mineralization on any of the Company’s properties. It is expected that the closing of the Acquisition (the “<strong>Closing</strong>”) will occur on or before February 17, 2025.</p>  <p align=\"justify\">The Purchase Agreement outlines the terms of the Acquisition as follows:</p>  <ul type=\"disc\"><li style=\"text-align:justify;\">ExGen to provide a cash payment of CAD $250,000 (the “<strong>Cash Consideration</strong>”) to the Vendor on the Closing of the Acquisition. ExGen has provided the Vendor with: (i) a $25,000 non-refundable deposit (the “<strong>Deposit</strong>”); and (ii) a secured refundable loan for $225,000 (the “<strong>Loan</strong>”), which, together with the Deposit, will comprise the Cash Consideration on Closing. If Closing does not occur by February 17, 2025, the Loan will be due and is required to be repaid in full by the Vendor, together with interest, on February 18, 2025. The Loan is secured by all the assets of the Vendor and accrues interest, payable in arrears, at 8% per annum.</li><li style=\"text-align:justify;\">ExGen to issue 5,000,000 common shares to the Vendor on Closing.</li><li style=\"text-align:justify;\">ExGen to grant a 1.5% NSR in favour of the Vendor, with a 0.75% NSR buyback (half of the NSR) at ExGen’s option for CAD $1,000,000.</li><li style=\"text-align:justify;\">The Closing of the Acquisition of the Spark North Lithium Project is also subject to conditions as are customary for transactions similar to the Acquisition.</li></ul>  <p align=\"justify\">Jason Riley, CEO of ExGen commented: “We believe the Lithium district in Elko County, NV will see increased activity in the next few years and we are excited to be acquiring this initial well positioned property in the district.”</p>  <p align=\"justify\"><strong>QUALIFIED </strong><strong>PERSON</strong></p>  <p align=\"justify\">Kieran Downes, Ph.D., P. Geo., a Qualified Person as defined by National Instrument 43-101, has reviewed and verified the technical information provided in this release.</p>  <p align=\"justify\"><strong>ABOUT EXGEN RESOURCES </strong><strong>INC.</strong></p>  <p align=\"justify\">ExGen, formerly Boxxer Gold Corp, is a project accelerator that seeks to fund exploration and development of our projects through joint ventures and partnership agreements. This approach significantly reduces the technical and financial risks for ExGen, while maintaining the upside exposure to new discoveries and potential cash flow. The Company intends to build a diverse portfolio of projects across exploration stages and various commodity groups. ExGen currently has 5 projects in Canada and the US.</p>  <p align=\"justify\">For more information on ExGen please contact:</p>  <p align=\"justify\" style=\"padding-left:30px;\">ExGen Resources Inc. <br />Jason Tong<br />Chief Financial Officer<br />Email: <a href=\"mailto:jason@catapultgroup.ca\" rel=\"nofollow\" target=\"_blank\" title=\"\"><u>jason@catapultgroup.ca</u></a></p>  <p align=\"justify\"><strong><em>Neither the TSX Venture Exchange nor its Regulation</em></strong> <strong><em>Services</em></strong> <strong><em>Provider</em></strong> <strong><em>(as</em></strong> <strong><em>that</em></strong> <strong><em>term</em></strong> <strong><em>is</em></strong> <strong><em>defined</em></strong> <strong><em>in</em></strong> <strong><em>the policies of the TSX Venture Exchange) accepts responsibility for the adequacy or accuracy of this </em></strong><strong><em>release.</em></strong></p>  <p align=\"justify\"><strong>Forward-Looking</strong> <strong>Information</strong>: This news release contains certain forward-looking information. All statements included herein, other than statements of historical fact, are forward-looking information and such information involves various risks and uncertainties. There can be no assurance that such information will prove to be accurate, and actual results and future events could differ materially from those anticipated in such information. In particular, this news release contains forward-looking information in relation to: the potential Acquisition of the Spark North Lithium Project, including the potential Closing of the Acquisition, potential TSXV approval of the Acquisition, and the potential payment of consideration in relation to the Spark North Lithium Project including the potential payment of 5,000,000 common shares of the Company, subject to TSXV approval; and the potential repayment of the Loan if the Closing of the Acquisition does not occur. There can be no assurance that such information will prove to be accurate, and actual results and future events could differ materially from those anticipated in such information. In the forward looking information contained in this news release, ExGen has made numerous assumptions, based upon practices and methodologies which are consistent with the mineral industry. In addition, ExGen has assumed: TSXV approval of the Acquisition; the fulfilment of the conditions in relation to the Acquisition; the continued market acceptance of its joint venture partnership model; the ability of ExGen and its partners to raise future equity financing, if needed, at prices acceptable to ExGen or its partners; ExGen's current and initial understanding and analysis of the Spark North Lithium Project; the ability of ExGen or third parties to discover viable exploration targets and the results of exploration on the Spark North Lithium Project; ExGen's general and administrative costs remaining sustainable; and the ability of the Vendor to repay the Loan if Closing does not occur. While ExGen considers these assumptions to be reasonable, these assumptions are inherently subject to significant uncertainties and contingencies. Additionally, there are known and unknown risk factors which could cause ExGen's observations, actual results, performance or achievements to be materially different from any future results, performance or achievements expressed or implied by the forward-looking information contained herein. Known risk factors include, among others: the possibility that the analytical results from future core sampling does not return significant grades of lithium or any other mineralization; uncertainties relating to interpretation of drill results and the geology; continuity and grade of mineralization; there is no certainty that any work programs will result in significant or successful exploration of the Spark North Lithium Project or development of the Spark North Lithium Project into a producing mine; uncertainty as to the actual results of exploration and development or operational activities; uncertainty as to the availability and terms of future financing; uncertainty as to timely availability of permits and other governmental approvals; ExGen may not be able to comply with its ongoing obligations regarding its properties; the early stage development of ExGen and its projects, and in particular, the Spark North Lithium Project; general business, economic, competitive, political and social uncertainties; capital market conditions and market prices for securities, junior market securities and mining exploration company securities; commodity prices, in particular copper, gold, silver, lithium and zinc prices; competition; changes in project parameters as plans continue to be refined; accidents and other risks inherent in the mining industry; lack of insurance; delay or failure to receive board or regulatory approvals; changes in legislation, including environmental legislation, affecting ExGen; conclusions of economic evaluations; the inability of the Vendor to repay the Loan; and lack of qualified, skilled labour or loss of key individuals. A description of additional risk factors that may cause actual results to differ materially from forward-looking information can be found in ExGen's disclosure documents on the SEDAR+ website at <a href=\"http://www.sedarplus.ca.\" rel=\"nofollow\" target=\"_blank\" title=\"www.sedarplus.ca.\">www.sedarplus.ca.</a> Although ExGen has attempted to identify important factors that could cause actual results to differ materially from those contained in forward-looking information, there may be other factors that cause results not to be as anticipated, estimated or intended. Accordingly, readers should not place undue reliance on forward-looking information. ExGen does not undertake to update any forward-looking information except in accordance with applicable securities laws.</p>  <br /><img alt=\"\" src='https://ml.globenewswire.com/media/MDhjMDg3ZmYtOTliMC00M2RjLTk1MTQtMzgxNjU3MDAwZGViLTEwOTk5OTc=/tiny/ExGen-Resources-Inc.png' referrerpolicy='no-referrer-when-downgrade' />",
    "search_terms": "Spark North Lithium,ExGen Resources Inc.,EXG",
    "master_gid": 9706,
    "date": "2025-01-28T17:09:00.000Z",
    "tags": "Canada|||Lithium|Project Acquisition",
    "image_id": null,
    "hidden": false,
    "company_id": 288,
    "provider": "globenewswire",
    "excerpt": "NOTFORDISTRIBUTIONTOUNITEDSTATESNEWSWIRESERVICESORFOR DISSEMINATION IN THE UNITED STATESVANCOUVER, British Columbia, Jan. 28, 2025 (GLOBE NEWSWIRE) --ExGen Resources Inc.(TSX.V: EXG; OTC: BXXRF) (“ExGen”, the “Company”): Further to ExGen’s previous news release dated December 5, 2024, Exgen is pleased to announce that it has entered into an asset purchase agreement dated January 21, 2025",
    "is_regulatory": false,
    "refined_tags": null,
    "ftp_filename": null,
    "company_name": "ExGen Resources Inc.",
    "exchange": "TSXV",
    "root_ticker": "EXG",
    "project_name": "Spark North Lithium",
    "gid": 9706,
    "location": "Nevada, United States",
    "plan_id": null,
    "description_text": "NOT FOR DISTRIBUTION TO UNITED STATES NEWSWIRE SERVICES OR FOR DISSEMINATION IN THE UNITED STATES VANCOUVER, British Columbia, Jan.  28, 2025  (GLOBE NEWSWIRE) -- ExGen Resources Inc. (TSX.V: EXG; OTC: BXXRF) (“ ExGen ”, the “ Company ”): Further to ExGen’s previous news release dated December 5, 2024, Exgen is pleased to announce that it has entered into an asset purchase agreement dated January 21, 2025 (the “ Purchase Agreement ”) to acquire (the “ Acquisition ”) the Spark North lithium project in Elko County, Nevada consisting of 111 claims totaling approximately 2300 acres prospective for lithium (the “ Spark North Lithium Project ”) from an arm’s length private company (the “ Vendor ”). The Spark North Lithium Project is north of Surge Battery Metals Inc.’s (TSXV: NILI) “Nevada North Lithium Project” in Elko County, Nevada. In a news release dated September 24, 2024, Surge Battery Metals Inc. announced that the Nevada North Lithium Project had the highest grade lithium clay deposit in the USA (11.24 Mt LCE grading 3,010 ppm Li at a 1,250 ppm cutoff). The technical report for the Nevada North Lithium Project was prepared for Surge Battery Metals Inc. by authors Jeffrey D. Phinisey of TAG Resources LLC and Bruce M. Davis, independent geostatistical consultant, and titled “Technical Report on Mineral Resource Estimate for the Nevada North Lithium Project, Elko County, Nevada USA”, dated effective October 9, 2024, and as announced on September 24, 2024. The Purchase Agreement and the Acquisition of the Spark North Lithium Project are subject to TSX Venture Exchange ( “TSXV” ) approval. ExGen cautions that past results or discoveries on properties in proximity to ExGen’s properties, including the Nevada North Lithium Project, may not necessarily be indicative of the presence of mineralization on any of the Company’s properties. It is expected that the closing of the Acquisition (the “ Closing ”) will occur on or before February 17, 2025. The Purchase Agreement outlines the terms of the Acquisition as follows: ExGen to provide a cash payment of CAD $250,000 (the “ Cash Consideration ”) to the Vendor on the Closing of the Acquisition. ExGen has provided the Vendor with: (i) a $25,000 non-refundable deposit (the “ Deposit ”); and (ii) a secured refundable loan for $225,000 (the “ Loan ”), which, together with the Deposit, will comprise the Cash Consideration on Closing. If Closing does not occur by February 17, 2025, the Loan will be due and is required to be repaid in full by the Vendor, together with interest, on February 18, 2025. The Loan is secured by all the assets of the Vendor and accrues interest, payable in arrears, at 8% per annum. ExGen to issue 5,000,000 common shares to the Vendor on Closing. ExGen to grant a 1.5% NSR in favour of the Vendor, with a 0.75% NSR buyback (half of the NSR) at ExGen’s option for CAD $1,000,000. The Closing of the Acquisition of the Spark North Lithium Project is also subject to conditions as are customary for transactions similar to the Acquisition. Jason Riley, CEO of ExGen commented: “We believe the Lithium district in Elko County, NV will see increased activity in the next few years and we are excited to be acquiring this initial well positioned property in the district.” QUALIFIED PERSON Kieran Downes, Ph.D., P. Geo., a Qualified Person as defined by National Instrument 43-101, has reviewed and verified the technical information provided in this release. ABOUT EXGEN RESOURCES INC. ExGen, formerly Boxxer Gold Corp, is a project accelerator that seeks to fund exploration and development of our projects through joint ventures and partnership agreements. This approach significantly reduces the technical and financial risks for ExGen, while maintaining the upside exposure to new discoveries and potential cash flow. The Company intends to build a diverse portfolio of projects across exploration stages and various commodity groups. ExGen currently has 5 projects in Canada and the US. For more information on ExGen please contact: ExGen Resources Inc. Jason Tong Chief Financial Officer Email: jason@catapultgroup.ca Neither the TSX Venture Exchange nor its Regulation Services Provider (as that term is defined in the policies of the TSX Venture Exchange) accepts responsibility for the adequacy or accuracy of this release. Forward-Looking Information : This news release contains certain forward-looking information. All statements included herein, other than statements of historical fact, are forward-looking information and such information involves various risks and uncertainties. There can be no assurance that such information will prove to be accurate, and actual results and future events could differ materially from those anticipated in such information. In particular, this news release contains forward-looking information in relation to: the potential Acquisition of the Spark North Lithium Project, including the potential Closing of the Acquisition, potential TSXV approval of the Acquisition, and the potential payment of consideration in relation to the Spark North Lithium Project including the potential payment of 5,000,000 common shares of the Company, subject to TSXV approval; and the potential repayment of the Loan if the Closing of the Acquisition does not occur. There can be no assurance that such information will prove to be accurate, and actual results and future events could differ materially from those anticipated in such information. In the forward looking information contained in this news release, ExGen has made numerous assumptions, based upon practices and methodologies which are consistent with the mineral industry. In addition, ExGen has assumed: TSXV approval of the Acquisition; the fulfilment of the conditions in relation to the Acquisition; the continued market acceptance of its joint venture partnership model; the ability of ExGen and its partners to raise future equity financing, if needed, at prices acceptable to ExGen or its partners; ExGen's current and initial understanding and analysis of the Spark North Lithium Project; the ability of ExGen or third parties to discover viable exploration targets and the results of exploration on the Spark North Lithium Project; ExGen's general and administrative costs remaining sustainable; and the ability of the Vendor to repay the Loan if Closing does not occur. While ExGen considers these assumptions to be reasonable, these assumptions are inherently subject to significant uncertainties and contingencies. Additionally, there are known and unknown risk factors which could cause ExGen's observations, actual results, performance or achievements to be materially different from any future results, performance or achievements expressed or implied by the forward-looking information contained herein. Known risk factors include, among others: the possibility that the analytical results from future core sampling does not return significant grades of lithium or any other mineralization; uncertainties relating to interpretation of drill results and the geology; continuity and grade of mineralization; there is no certainty that any work programs will result in significant or successful exploration of the Spark North Lithium Project or development of the Spark North Lithium Project into a producing mine; uncertainty as to the actual results of exploration and development or operational activities; uncertainty as to the availability and terms of future financing; uncertainty as to timely availability of permits and other governmental approvals; ExGen may not be able to comply with its ongoing obligations regarding its properties; the early stage development of ExGen and its projects, and in particular, the Spark North Lithium Project; general business, economic, competitive, political and social uncertainties; capital market conditions and market prices for securities, junior market securities and mining exploration company securities; commodity prices, in particular copper, gold, silver, lithium and zinc prices; competition; changes in project parameters as plans continue to be refined; accidents and other risks inherent in the mining industry; lack of insurance; delay or failure to receive board or regulatory approvals; changes in legislation, including environmental legislation, affecting ExGen; conclusions of economic evaluations; the inability of the Vendor to repay the Loan; and lack of qualified, skilled labour or loss of key individuals. A description of additional risk factors that may cause actual results to differ materially from forward-looking information can be found in ExGen's disclosure documents on the SEDAR+ website at www.sedarplus.ca. Although ExGen has attempted to identify important factors that could cause actual results to differ materially from those contained in forward-looking information, there may be other factors that cause results not to be as anticipated, estimated or intended. Accordingly, readers should not place undue reliance on forward-looking information. ExGen does not undertake to update any forward-looking information except in accordance with applicable securities laws.",
    "primary_commodity": "Li"
  },
  "articleProject": {
    "gid": 9706,
    "project_name": "Spark North Lithium",
    "location": "Nevada, United States"
  },
  "articleExchange": "TSXV",
  "articleCompanyId": 288,
  "articleTicker": "EXG",
  "articleCompanyName": "ExGen Resources Inc.",
  "allOtherCompanyProjects": [
    {
      "company_id": 288,
      "gid": 2505,
      "project_name": "Empire",
      "location": null
    },
    {
      "company_id": 288,
      "gid": 8278,
      "project_name": "Navarre Creek",
      "location": "Idaho, United States"
    },
    {
      "company_id": 288,
      "gid": 10235,
      "project_name": "Spark South Lithium",
      "location": "Nevada, United States"
    }
  ],
  "allOtherCompanyNews": [
    {
      "id": -203604,
      "company_id": 288,
      "title": "ExGen Updates Previous News Release",
      "link": null,
      "date": "2025-06-05T16:10:35.000Z",
      "hidden": false
    },
    {
      "id": 103846,
      "company_id": 288,
      "title": "Exgen Announces Investor Relations Agreement",
      "link": null,
      "date": "2025-05-06T20:53:32.000Z",
      "hidden": false
    },
    {
      "id": 99465,
      "company_id": 288,
      "title": "ExGen Announces ROFR and Convertible Loan to Private Company in Connection with the Spark South Lithium Project in Elko County Nevada",
      "link": null,
      "date": "2025-04-11T11:00:00.000Z",
      "hidden": false
    },
    {
      "id": 91418,
      "company_id": 288,
      "title": "ExGen Announces Closing of  Spark North Lithium Project Acquisition",
      "link": null,
      "date": "2025-03-14T20:02:48.000Z",
      "hidden": false
    },
    {
      "id": 85641,
      "company_id": 288,
      "title": "ExGen Signs Purchase Agreement to Acquire Spark North Lithium Project in Nevada",
      "link": "https://www.globenewswire.com/news-release/2025/01/28/3016673/0/en/ExGen-Signs-Purchase-Agreement-to-Acquire-Spark-North-Lithium-Project-in-Nevada.html",
      "date": "2025-01-28T17:09:00.000Z",
      "hidden": false
    },
    {
      "id": 82359,
      "company_id": 288,
      "title": "ExGen Signs Carried Interest Agreement with Phoenix for Construction of the Empire Mine Open Pit Project, Idaho",
      "link": "https://www.globenewswire.com/news-release/2024/12/18/2999095/0/en/ExGen-Signs-Carried-Interest-Agreement-with-Phoenix-for-Construction-of-the-Empire-Mine-Open-Pit-Project-Idaho.html",
      "date": "2024-12-18T14:00:00.000Z",
      "hidden": false
    },
    {
      "id": -158915,
      "company_id": 288,
      "title": "ExGen Signs Binding LOI to Acquire Lithium Property in Nevada",
      "link": "https://www.globenewswire.com/news-release/2024/12/05/2992638/0/en/ExGen-Signs-Binding-LOI-to-Acquire-Lithium-Property-in-Nevada.html",
      "date": "2024-12-05T18:20:00.000Z",
      "hidden": false
    },
    {
      "id": 93906,
      "company_id": 288,
      "title": "EXGEN: EMPIRE MINE PROJECT UPDATE",
      "link": "https://app.quotemedia.com/data/downloadFiling?webmasterId=104408&ref=666c88fd552864318d2fe637&type=PDFC&formType=002-002-001089-003001&formDescription=News+release&dateFiled=2024-06-14",
      "date": "2024-06-14T18:16:29.000Z",
      "hidden": false
    },
    {
      "id": 93907,
      "company_id": 288,
      "title": "EXGEN: DOK Project - Drilling Commenced",
      "link": "https://app.quotemedia.com/data/downloadFiling?webmasterId=104408&ref=666c8866552864318d2fe634&type=PDFC&formType=002-002-001089-003001&formDescription=News+release&dateFiled=2024-06-14",
      "date": "2024-06-14T18:13:58.000Z",
      "hidden": false
    },
    {
      "id": 93908,
      "company_id": 288,
      "title": "EXGEN: Results of Metallurgical Testing at Empire Mine, Idaho & Drilling Update at Navarre Creek",
      "link": "https://app.quotemedia.com/data/downloadFiling?webmasterId=104408&ref=666c880b552864318d2fe631&type=PDFC&formType=002-002-001089-003001&formDescription=News+release&dateFiled=2024-06-14",
      "date": "2024-06-14T18:12:27.000Z",
      "hidden": false
    }
  ]
}
