{
  "article": {
    "id": 64650,
    "link": "https://www.newsfilecorp.com/release/216051/Provenance-Gold-Completes-Final-Option-Payment-for-100-Interest-in-White-Rock-Gold-Property-in-Nevada",
    "title": "Provenance Gold Completes Final Option Payment for 100% Interest in White Rock Gold Property in Nevada",
    "description": "<img src=\"https://api.newsfilecorp.com/newsinfo/216051/367\" id=\"367\" width=\"2\" height=\"2\" style=\"width: 1px;  height: 1px;border: 0px solid;\" /><p>Vancouver, British Columbia--(Newsfile Corp. - July 10, 2024) - Provenance Gold Corp. (CSE: PAU) (OTCQB: PVGDF) (the \"<b>Company</b>\" or \"<b>Provenance</b>\") is pleased to announce that it has made its final payment of USD $125,000 to Gold Royalty Corp. for total payments of USD $250,000 to acquire 100 percent ownership of the White Rock Gold Property in northeastern Nevada.  Gold Royalty Corp. retains a two percent (2%) net smelter royalty (NSR) on the property.  The White Rock Property consists of 164 unpatented mineral claims covering a combined area of approximately 1,327 hectares (3,280 acres), located approximately 105 kilometers (65 miles) northeast of Wells, Elko County, Nevada. </p><p>The White Rock property hosts a large shallow, open-ended, low sulphidation gold system which has been defined by 65 historical drillholes and 35 drillholes conducted by Provenance in 2021.  The 2021 drilling defined the stratigraphic and structural controls within the extensive central area of sediment-hosted gold mineralization. The target mineralization extends across a 3.2 km by 1.6 km area centered on a complex dome structure that is believed to have formed on the upper plate of a system of thrust faults and is open in all directions.  Drilling not only confirmed results from historical drillholes that intersected numerous thick intervals of potentially open-pittable grade gold mineralization, but they also bottomed out in gold mineralization while confirming the Company's new understanding of the structural and stratigraphic controls of the gold mineralization. </p><p>For example, Hole WR-15 was drilled vertically to test disseminated gold mineralization in the sedimentary rocks that host the system. WR-15 returned three large, mineralized intervals; 7.6 m (25 ft) of 1.45 g/t Au, 29 m (95 ft) of 0.636 g/t Au, 53 m (175 ft) of 0.197 g/t Au. The anomalous gold mineralized zones have a cumulate thickness of 91.5 m (300 ft). </p><p>Large target areas to the south of the main target that host strong gold mineralization at surface remain untested. </p><p>Provenance Chairman Rauno Perttu said, \"Our White Rock property is a significant gold system in Nevada that is wide open for expansion.  Additional infill and step-out drilling could significantly expand the mineralised footprint both along strike and to depth making it a very attractive project for further exploration.\"</p><p style=\"text-align: center;\"><a rel=\"nofollow\" href=\"https://images.newsfilecorp.com/files/5654/216051_a9e061e76417ca61_001full.jpg\"><img src=\"https://images.newsfilecorp.com/files/5654/216051_a9e061e76417ca61_001.jpg\" style=\"border-width: 0px;\" alt=\"Cannot view this image? Visit: https://images.newsfilecorp.com/files/5654/216051_a9e061e76417ca61_001.jpg\" /></a></p><p style=\"text-align: center;\">White Rock Drill Locations and Gold Surface Contours</p><p style=\"text-align: center;\">To view an enhanced version of this graphic, please visit:<br /><a rel=\"nofollow\" href=\"https://images.newsfilecorp.com/files/5654/216051_a9e061e76417ca61_001full.jpg\">https://images.newsfilecorp.com/files/5654/216051_a9e061e76417ca61_001full.jpg</a></p><p><b>JV Opportunity</b></p><p>Under the right structure, the White Rock Property represents an excellent opportunity for a company looking for a top tier exploration project, with strong potential to become a major new gold discovery in an under-explored part of Nevada.  While the Company focuses on advancing Eldorado, additional exploration via a partner could allow the Company to realize further potential from the Property.</p><p><b>Qualified Person</b></p><p>The technical content disclosed in this press release was reviewed and approved by Jo Price, P.Geo., M.Sc., a Qualified Person as defined under National Instrument 43-101.</p><p><b>Paradox Public Relations Inc.</b></p><p>Further to the news release issued on June 19, 2024, the Company confirms it has engaged Paradox Public Relations Inc. (\"<b>Paradox</b>\") to provide certain services to the Company including market awareness, investment and mining introductions and presentations.  The Company expects these services to be delivered principally though organization of online and physical roadshows and communication with a proprietary database maintained by Paradox.  Paradox is a Montreal based investor relations consultancy firm that has been in business for over 25 years.  Paradox has represented a number of public companies through its extensive network and experience in the capital markets. The investor relations agreement with Paradox has a term of 36 months, commencing June 19, 2024, and may be terminated at any time without charge by either party by giving 30 days' notice.</p><p>Paradox will be paid a monthly fee of $20,000 and will be granted stock options to acquire up to 1,000,000 common shares at a price of $0.10 per share with a term of three years.  The options will vest in stages over a period of 12 months, in equal portions, on a quarterly basis starting three months from the date of grant, in accordance with the Company's stock option plan and the policies of the CSE.  Compensation to Paradox does not include any other securities of the Company.  The Company is at arms-length from Paradox.  Paradox may be contacted at 257 Sherbrooke Est, Suite 400, Montreal, Quebec, H2X 1E3, to the attention of Carl Desjardins, Managing Partner, or at <a href=\"mailto:carldesjardins@paradox-pr.ca\">carldesjardins@paradox-pr.ca</a> or 1-514-618-4477.</p><p><b>About Provenance Gold Corp.</b></p><p>Provenance Gold Corp. is a precious metals exploration company with a focus on gold and silver mineralization within North America. The Company currently holds interests in Nevada, and eastern Oregon, USA. For further information please visit the Company's website at <a href=\"https://api.newsfilecorp.com/redirect/x3nm4cRyGV\">https://provenancegold.com</a> or contact Rauno Perttu, CEO, at <u> </u><a href=\"mailto:email@provenancegold.com\">email@provenancegold.com</a> or 1-541-930-0986.</p><div id=\"contactInfo\"><p>On behalf of the Board,<br /><b>Provenance Gold Corp.</b><br />Rauno Perttu, Chief Executive Officer</p></div><p><i><b>Safe Harbor Statement: </b>Neither the Canadian Securities Exchange, nor its regulation services provider, accepts responsibility for the adequacy or accuracy of this press release. This news release may contain certain \"Forward-Looking Statements\" within the meaning of the United States Private Securities Litigation Reform Act of 1995 and applicable Canadian securities laws. When or if used in this news release, the words \"anticipate\", \"believe\", \"estimate\", \"expect\", \"target, \"plan\", \"forecast\", \"may\", \"schedule\" and similar words or expressions identify forward-looking statements or information. Such statements represent the Company's current views with respect to future events and are necessarily based upon a number of assumptions and estimates that, while considered reasonable by the Company, are inherently subject to significant business, economic, competitive, political and social risks, contingencies and uncertainties. Many factors, both known and unknown, could cause results, performance or achievements to be materially different from the results, performance or achievements that are or may be expressed or implied by such forward-looking statements. The Company does not intend, and does not assume any obligation, to update these forward-looking statements or information to reflect changes in assumptions or changes in circumstances or any other events affecting such statements and information other than as required by applicable laws, rules and regulations.</i></p><p id=\"corporateLinkBack\">To view the source version of this press release, please visit <a href=\"https://api.newsfilecorp.com/redirect/7WKA3T8pne\">https://www.newsfilecorp.com/release/216051</a></p>",
    "search_terms": "White Rock,Provenance Gold Corp.,PAU",
    "master_gid": 909,
    "date": "2024-07-10T10:00:00.000Z",
    "tags": "USA|Nevada||Gold|Project Acquisition",
    "image_id": null,
    "hidden": false,
    "company_id": 496,
    "provider": "newsfilecorp",
    "excerpt": "Vancouver, British Columbia--(Newsfile Corp. - July 10, 2024) - Provenance Gold Corp. (CSE: PAU) (OTCQB: PVGDF) (the \"Company\" or \"Provenance\") is pleased to announce that it has made its final payment of USD $125,000 to Gold Royalty Corp. for total payments of USD $250,000 to acquire 100 percent ownership of",
    "is_regulatory": false,
    "refined_tags": [],
    "ftp_filename": null,
    "company_name": "Provenance Gold Corp.",
    "exchange": "CSE",
    "root_ticker": "PAU",
    "project_name": "White Rock",
    "gid": 909,
    "location": "Nevada, United States",
    "plan_id": "companytier2",
    "description_text": "Vancouver, British Columbia--(Newsfile Corp. - July 10, 2024) - Provenance Gold Corp. (CSE: PAU) (OTCQB: PVGDF) (the \" Company \" or \" Provenance \") is pleased to announce that it has made its final payment of USD $125,000 to Gold Royalty Corp. for total payments of USD $250,000 to acquire 100 percent ownership of the White Rock Gold Property in northeastern Nevada.  Gold Royalty Corp. retains a two percent (2%) net smelter royalty (NSR) on the property.  The White Rock Property consists of 164 unpatented mineral claims covering a combined area of approximately 1,327 hectares (3,280 acres), located approximately 105 kilometers (65 miles) northeast of Wells, Elko County, Nevada. The White Rock property hosts a large shallow, open-ended, low sulphidation gold system which has been defined by 65 historical drillholes and 35 drillholes conducted by Provenance in 2021.  The 2021 drilling defined the stratigraphic and structural controls within the extensive central area of sediment-hosted gold mineralization. The target mineralization extends across a 3.2 km by 1.6 km area centered on a complex dome structure that is believed to have formed on the upper plate of a system of thrust faults and is open in all directions.  Drilling not only confirmed results from historical drillholes that intersected numerous thick intervals of potentially open-pittable grade gold mineralization, but they also bottomed out in gold mineralization while confirming the Company's new understanding of the structural and stratigraphic controls of the gold mineralization. For example, Hole WR-15 was drilled vertically to test disseminated gold mineralization in the sedimentary rocks that host the system. WR-15 returned three large, mineralized intervals; 7.6 m (25 ft) of 1.45 g/t Au, 29 m (95 ft) of 0.636 g/t Au, 53 m (175 ft) of 0.197 g/t Au. The anomalous gold mineralized zones have a cumulate thickness of 91.5 m (300 ft). Large target areas to the south of the main target that host strong gold mineralization at surface remain untested. Provenance Chairman Rauno Perttu said, \"Our White Rock property is a significant gold system in Nevada that is wide open for expansion.  Additional infill and step-out drilling could significantly expand the mineralised footprint both along strike and to depth making it a very attractive project for further exploration.\" White Rock Drill Locations and Gold Surface Contours To view an enhanced version of this graphic, please visit: https://images.newsfilecorp.com/files/5654/216051_a9e061e76417ca61_001full.jpg JV Opportunity Under the right structure, the White Rock Property represents an excellent opportunity for a company looking for a top tier exploration project, with strong potential to become a major new gold discovery in an under-explored part of Nevada.  While the Company focuses on advancing Eldorado, additional exploration via a partner could allow the Company to realize further potential from the Property. Qualified Person The technical content disclosed in this press release was reviewed and approved by Jo Price, P.Geo., M.Sc., a Qualified Person as defined under National Instrument 43-101. Paradox Public Relations Inc. Further to the news release issued on June 19, 2024, the Company confirms it has engaged Paradox Public Relations Inc. (\" Paradox \") to provide certain services to the Company including market awareness, investment and mining introductions and presentations.  The Company expects these services to be delivered principally though organization of online and physical roadshows and communication with a proprietary database maintained by Paradox.  Paradox is a Montreal based investor relations consultancy firm that has been in business for over 25 years.  Paradox has represented a number of public companies through its extensive network and experience in the capital markets. The investor relations agreement with Paradox has a term of 36 months, commencing June 19, 2024, and may be terminated at any time without charge by either party by giving 30 days' notice. Paradox will be paid a monthly fee of $20,000 and will be granted stock options to acquire up to 1,000,000 common shares at a price of $0.10 per share with a term of three years.  The options will vest in stages over a period of 12 months, in equal portions, on a quarterly basis starting three months from the date of grant, in accordance with the Company's stock option plan and the policies of the CSE.  Compensation to Paradox does not include any other securities of the Company.  The Company is at arms-length from Paradox.  Paradox may be contacted at 257 Sherbrooke Est, Suite 400, Montreal, Quebec, H2X 1E3, to the attention of Carl Desjardins, Managing Partner, or at carldesjardins@paradox-pr.ca or 1-514-618-4477. About Provenance Gold Corp. Provenance Gold Corp. is a precious metals exploration company with a focus on gold and silver mineralization within North America. The Company currently holds interests in Nevada, and eastern Oregon, USA. For further information please visit the Company's website at https://provenancegold.com or contact Rauno Perttu, CEO, at email@provenancegold.com or 1-541-930-0986. On behalf of the Board, Provenance Gold Corp. Rauno Perttu, Chief Executive Officer Safe Harbor Statement: Neither the Canadian Securities Exchange, nor its regulation services provider, accepts responsibility for the adequacy or accuracy of this press release. This news release may contain certain \"Forward-Looking Statements\" within the meaning of the United States Private Securities Litigation Reform Act of 1995 and applicable Canadian securities laws. When or if used in this news release, the words \"anticipate\", \"believe\", \"estimate\", \"expect\", \"target, \"plan\", \"forecast\", \"may\", \"schedule\" and similar words or expressions identify forward-looking statements or information. Such statements represent the Company's current views with respect to future events and are necessarily based upon a number of assumptions and estimates that, while considered reasonable by the Company, are inherently subject to significant business, economic, competitive, political and social risks, contingencies and uncertainties. Many factors, both known and unknown, could cause results, performance or achievements to be materially different from the results, performance or achievements that are or may be expressed or implied by such forward-looking statements. The Company does not intend, and does not assume any obligation, to update these forward-looking statements or information to reflect changes in assumptions or changes in circumstances or any other events affecting such statements and information other than as required by applicable laws, rules and regulations. To view the source version of this press release, please visit https://www.newsfilecorp.com/release/216051",
    "primary_commodity": "Au"
  },
  "articleProject": {
    "gid": 909,
    "project_name": "White Rock",
    "location": "Nevada, United States"
  },
  "articleExchange": "CSE",
  "articleCompanyId": 496,
  "articleTicker": "PAU",
  "articleCompanyName": "Provenance Gold Corp.",
  "allOtherCompanyProjects": [
    {
      "company_id": 496,
      "gid": 3509,
      "project_name": "Silver Bow",
      "location": "Nevada, United States"
    },
    {
      "company_id": 496,
      "gid": 909,
      "project_name": "White Rock",
      "location": "Nevada, United States"
    },
    {
      "company_id": 496,
      "gid": 3782,
      "project_name": "Eldorado",
      "location": "Oregon, United States"
    }
  ],
  "allOtherCompanyNews": [
    {
      "id": 106886,
      "company_id": 496,
      "title": "Provenance Gold Provides Field Update from Sunday Hill, Eldorado East",
      "link": null,
      "date": "2025-06-04T09:00:00.000Z",
      "hidden": false
    },
    {
      "id": 106191,
      "company_id": 496,
      "title": "Provenance Gold Completes First Infill and Step-Out RC Drill Holes at Eldorado",
      "link": null,
      "date": "2025-05-29T09:00:00.000Z",
      "hidden": false
    },
    {
      "id": 103976,
      "company_id": 496,
      "title": "Provenance Gold Substantially Expands its Eldorado Footprint Creating a District Scale Opportunity and Acquires Historical High-Grade Prospects Within the Land Package",
      "link": null,
      "date": "2025-05-08T09:00:00.000Z",
      "hidden": false
    },
    {
      "id": 100781,
      "company_id": 496,
      "title": "Provenance Gold Commences 2025 Drilling Program at the Eldorado Project in Eastern Oregon",
      "link": null,
      "date": "2025-04-24T09:00:00.000Z",
      "hidden": false
    },
    {
      "id": 91912,
      "company_id": 496,
      "title": "Provenance Gold Completes Drone-Based Airborne Magnetic Survey at the Eldorado Project",
      "link": null,
      "date": "2025-03-20T09:00:00.000Z",
      "hidden": false
    },
    {
      "id": 90957,
      "company_id": 496,
      "title": "Provenance Gold Announces the Addition of Mackenzie Watson, a Canadian Mining Hall of Fame Inductee and Co-Recipient of the Prospectors and Developers Association of Canada (PDAC) Bill Dennis Award, to the Advisory Board",
      "link": null,
      "date": "2025-03-13T09:00:00.000Z",
      "hidden": false
    },
    {
      "id": 89603,
      "company_id": 496,
      "title": "Provenance Gold Intersects 0.8 g/t Gold over 154.23m from Surface Including 3.02 g/t Gold over 13.72m",
      "link": "https://www.newsfilecorp.com/release/242787/Provenance-Gold-Intersects-0.8-gt-Gold-over-154.23m-from-Surface-Including-3.02-gt-Gold-over-13.72m",
      "date": "2025-02-28T10:00:00.000Z",
      "hidden": false
    },
    {
      "id": 86999,
      "company_id": 496,
      "title": "Provenance Gold Engages Drilling Contractor for March Drill Mobilization and Commences Drone-Based Airborne Magnetic Survey at its Eldorado Property",
      "link": "https://www.newsfilecorp.com/release/239853/Provenance-Gold-Engages-Drilling-Contractor-for-March-Drill-Mobilization-and-Commences-DroneBased-Airborne-Magnetic-Survey-at-its-Eldorado-Property",
      "date": "2025-02-06T10:00:00.000Z",
      "hidden": false
    },
    {
      "id": 83576,
      "company_id": 496,
      "title": "Provenance Gold Provides Operational Update and a Review of Recent Activities at Eldorado",
      "link": "https://www.newsfilecorp.com/release/236552/Provenance-Gold-Provides-Operational-Update-and-a-Review-of-Recent-Activities-at-Eldorado",
      "date": "2025-01-09T10:00:00.000Z",
      "hidden": false
    },
    {
      "id": -159722,
      "company_id": 496,
      "title": "Canadian Investment Regulatory Organization Trade Resumption - PAU",
      "link": "https://contentapi.cision.com/api/v1.0/releases/20241210C0355",
      "date": "2024-12-10T12:46:00.000Z",
      "hidden": false
    }
  ]
}
