{
  "article": {
    "id": 32894,
    "link": "https://www.thenewswire.com/press-releases?id=1BKRFwqQM",
    "title": "The Fuse Team is Actively Assessing Lithium Projects and Adds Another Lithium Exploration Project in Nevada",
    "description": "<table style='width:fit-content; border: none;'><tr style='background: none;'><td style='padding: 0; margin: 0; border: none; background: none;'></td></tr></table>   \n<p style='text-align:justify; '>\n<span style='font-weight:bold; '>Coquitlam, BC – </span><span style='font-weight:bold; '>TheNewswire -</span><span style='font-weight:bold; '> March 27, 2023 – Fuse Battery Metals Inc.</span><span style=''> (“the Company“ or “Fuse”) </span><span style='font-weight:bold; '>(TSXV:FUSE</span><span style='font-weight:bold; '>)</span> <span style='font-weight:bold; '>(</span><span style='font-weight:bold; '>OTC:FUSEF</span><span style='font-weight:bold; '>)</span> <span style='font-weight:bold; '>(</span><span style='font-weight:bold; '>FRA:43W3)</span> <span style=''>is pleased to announce expansion of our exploration land holdings with the inclusion of a new lithium exploration project in Nevada, the Monitor Valley North Project. </span>\n</p>\n\n<p style='text-align:justify; '>\n<span style=''>The Company has entered into a Purchase and Sale Agreement with J. Malcolm Bell (the “Vendor”) dated March 22, 2023 whereby the Company </span><span style=''>becomes the legal and beneficial owner of </span><span style=''>97 placer claims (MVN1 – MVN97) covering approximately 770 hectares of alluvial sediments and clays located 134 km northeast of Tonopah, Nevada (the “Monitor Valley North Lithium Property”).</span>\n</p>\n\n<p style='text-align:justify; '>\n<span style='font-weight:bold; '>Terms of the Transaction:</span>\n</p>\n\n<p style='text-align:justify; '>\n<span style=''>The Company agrees to the following: </span>\n</p>\n\n<p style='text-align:justify; '>\n<span style=''>(a) reimbursing the staking and recording cost of the Vendor in the amount of US$30,081 upon signing the Agreement; and (b) issuing to the Vendor 500,000 fully paid and non-assessable common shares in the capital of the Company upon TSX Venture Exchange acceptance of the transaction. </span>\n</p>\n\n<p style='text-align:justify; '>\n<span style=''>All securities issued in connection with the Transaction are subject to a four month and a day hold period in accordance with Canadian Securities Laws.</span>\n</p>\n\n<p style='text-align:justify; '>\n<span style='font-weight:bold; '>About the Monitor Valley North Lithium Property</span>\n</p>\n\n<p style='text-align:justify; '>\n<span style=''>The property is located in Monitor Valley, Nevada, about 138  km north-northeast of Tonopah, Nevada. The center of the property is about 39.21° North Latitude, 116.65° West Longitude.</span>\n</p>\n\n<p style='text-align:justify; '>\n<span style=''>The property is 55 km due west of the Little Smokey Valley, Nevada where exploration for lithium is ongoing.</span>\n</p>\n\n<p style='text-align:justify; '>\n<span style=''>Geology and Mineralization </span>\n</p>\n\n<p style='text-align:justify; '>\n<span style=''>The Monitor Valley North Project is a sediment-hosted lithium clay target. Access to the property is good and both exploration and exploitation could be conducted year-round. Minimal work has been conducted on the project, but initial surface samples reported in regional NURE sampling returned average lithium values of 664 ppm (max 970 ppm, min 388 ppm) contained within a sedimentary sequence of Miocene mudstone and claystone. </span>\n</p>\n\n<p style='text-align:justify; '>\n<span style=''>The origin of this lithium deposit is suspected to be similar to Clayton Valley clay deposits located about 180 km to the south. Both areas are reasonably well represented by the USGS preliminary deposit model, which describes the primary characteristics as light-colored, ash-rich, lacustrine (lake) rocks containing swelling clays.</span>\n</p>\n \n<p style='text-align:justify; '>\n<span style=''>Mr. Tim Fernback, President &amp; CEO comments </span><span style='font-style:italic; '>“The Monitor Valley North location has been relatively unexplored to date, but the lithium exploration potential due to the geothermal activity in the project area is compelling.  It is the Company’s intention to rapidly evaluate the lithium potential of this project over the coming months.  It is Fuse’s intent to complete an initial NI #43-101 Technical Report on the property in the near future”.</span>\n</p>\n\n<p style='text-align:justify; '>\n<span style='text-align:center; '><a href='https://www.thenewswire.com/data/tnw/clients/img/54a0d793868f7783916ec2ff7580bd34.png' target='_blank'><img src=\"https://www.thenewswire.com/data/tnw/clients/img/54a0d793868f7783916ec2ff7580bd34_.png\" /></a><br />\nClick Image To View Full Size</span>\n</p>\n \n<p style='text-align:justify; '>\n<span style='font-weight:bold; '>Qualified Person as Defined Under National Instrument 43-101</span>\n</p>\n\n<p style='text-align:justify; '>\n<span style=''>Alan J. Morris, CPG</span><span style=''> of Spring Creek, Nevada, a Qualified Person as defined under Nation Instrument 43-101 has reviewed and approved the technical aspects of this news release.</span>\n</p>\n \n<p style='text-align:justify; '>\n<span style=''>In other news, Interim President &amp; CEO Mr. Tim Fernback has been named Fuse’s permanent President &amp; CEO by the Company’s Board of Directors.   “I am excited to contribute to the success of Fuse for the benefit of all our shareholders.  There are good things in store for the Company and I am happy to lead this accomplished team of professionals going forward.”</span>\n</p>\n  \n<p style='text-align:justify; '>\n<span style='font-weight:bold; '>About Fuse Battery Metals Inc.</span>  <a href='https://fusecobalt.com/' target='_blank'><span style=''>https://fusecobalt.com/</span></a>\n</p>\n \n<p style='text-align:justify; '>\n<span style=''>Fuse Battery Metals Inc. is a Canadian based exploration company that trades under the symbol FUSE on the TSX Venture Exchange. The Company's focus is on exploration for high value metals required for the manufacturing of batteries.</span>\n</p>\n \n<p style='text-align:justify; '>\n<span style='font-weight:bold; '>Nevada Lithium Properties</span>\n</p>\n\n<p style='text-align:justify; '>\n<span style=''>Fuse owns 100% of the </span><span style='font-weight:bold; '>Lithium Springs Property</span><span style=''> which is located at the southern end of Black Rock Desert, Nevada, about 132 air-line km north-northeast of Reno, Nevada in Sections 1, 2, 11, and 12 Township 32 North, Range 23. The center of the property is about 40.676° North Latitude, 119.331° West Longitude, (40° 40’ 33” N, 119° 19’ 52”): UTM X 302,900 UTMY 4,505,400 NAD 27; Zone 11 N.   Black Rock Desert basin is about 110 km long and up to 25 km wide at the widest point. The central playa measures about 50 km northeast - southwest and 10 km southeast - northwest. </span><span style=''>The western arm of the Black Rock Desert covers an area of about 2,000 square kilometers and contains 5 of the 30 currently listed Known Geothermal Resource Areas in Nevada</span><span style=''>. </span>\n</p>\n \n<p style='text-align:justify; '>\n<span style='font-weight:bold; '>Ontario Cobalt Properties</span>\n</p>\n\n<p style='text-align:justify; '>\n<span style=''>Fuse owns a 100% interest its </span><span style='font-weight:bold; '>Glencore Bucke Property</span><span style=''>, situated in Bucke Township,</span><span style=''> 6 km east-northeast of Cobalt, Ontario, subject to a back-in provision, production royalty and off-take agreement</span><span style=''>.</span><span style=''>  The </span><span style=''>Glencore Bucke Property consists of 16.2 hectares and sits along the west boundary of Fuse’s </span><span style='font-weight:bold; '>Teledyne Cobalt Project</span><span style=''>.  The Company also owns a 100% interest, subject to a royalty, in the Teledyne Project located near Cobalt, Ontario.  The Teledyne Property adjoins the south and west boundaries of claims that hosted the Agnico Mine.</span>\n</p>\n \n<p style='text-align:justify; '>\n<span style='font-weight:bold; '>Glencore Bucke/Teledyne Property</span>\n</p>\n\n<p style='text-align:justify; '>\n<span style=''>Situated in Bucke Township, 6 km east-northeast of Cobalt, Ontario the Glencore Bucke Property adjoins, on its northeast corner, the former cobalt producing Agaunico Mine. From 1905 through to 1961, the Agaunico Mine produced a total of 4,350,000 lbs. of cobalt (“Co”), and 980,000 oz of silver (“Ag”) (Cunningham-Dunlop, 1979). </span><span style='font-weight:bold; '>The amount of cobalt produced from the Agaunico Mine is greater than that of any other mine in the Cobalt Mining Camp.</span><span style=''> Production ceased in 1961 due to depressed Co prices and over-supply (Thomson, 1964). The Glencore property is 100% owned by Fuse subject to a back-in provision, production royalty and off-take agreement.</span>\n</p>\n \n<p style='text-align:justify; '>\n<span style=''>The associated Teledyne Property, located in Bucke and Lorrain Townships, consists of 5 patented mining claims totaling 79.1 ha, and 46 unpatented mining claim cells totaling approximately 700 ha. The Property is easily accessible by highway 567 and a well-maintained secondary road</span><span style='font-weight:bold; '>.</span> \n</p>\n \n<p style='text-align:justify; '>\n<span style=''>Over $25 million Can has been spent thus far, (2020 dollars inflation-adjusted) on the Teledyne Property resulting in valuable infrastructure including a development ramp and a modern decline going down 500 ft parallel to the main cobalt mineralized vein. The Teledyne Property is subject to a production royalty in favor of New Found Gold and an off-take agreement in favor of Glencore Canada Corp., while the Glencore Bucke Property is subject to a back-in provision, production royalty, and an off-take agreement in favor of Glencore Canada Corp. Glencore PLC is the world’s largest producer of cobalt. </span><span style='font-weight:bold; '>A significant portion of the cobalt that was produced at the Agaunico Mine was located along structures (Vein #15) that extended southward towards the northern boundary of the Teledyne Cobalt Property, </span><span style=''>currently 100% owned by FUSE. Mineralization was generally located within 125 ft (38.1 m) above the Huronian/Archean unconformity. Stoping widths of up to 50 ft (15.2 m) were not unusual at the Agaunico Mine (Cunningham-Dunlop, 1979).</span>\n</p>\n \n<p style='text-align:justify; '>\n<span style='font-weight:bold; '>On Behalf of the Board of Directors</span>\n</p>\n \n<p style='text-align:justify; '>\n<span style='font-style:italic; '>“Tim Fernback”</span>\n</p>\n \n<p style='text-align:justify; '>\n<span style='font-weight:bold; '>Tim Fernback, President &amp; CEO</span>\n</p>\n \n<p style='text-align:justify; '>\n<span style=''>Contact Information: </span>\n</p>\n\n<p style='text-align:justify; '>\n<span style=''>Email:  </span><a href='mailto:info@fusecobalt.com' target='_blank'>info@fusecobalt.com</a>\n</p>\n\n<p style='text-align:justify; '>\n<span style=''>Phone: 236-521-0207</span>\n</p>\n \n<p style='text-align:justify; '>\n<span style='font-style:italic; '>Neither the TSX Venture Exchange nor its Regulation Services Provider (as that term is defined in the policies of the TSX Venture Exchange) accepts responsibility for the adequacy or accuracy of this release.  This news release may contain forward-looking statements which include, but are not limited to, comments that involve future events and conditions, which are subject to various risks and uncertainties. Except for statements of historical facts, comments that address resource potential, upcoming work programs, geological interpretations, receipt and security of mineral property titles, availability of funds, and others are forward-looking. Forward-looking </span><span style='font-style:italic; '>statements are not guarantees of future performance and actual results may vary materially from those </span><span style='font-style:italic; '>statements. General business conditions are factors that could cause actual results to vary materially from forward-looking statements.</span>\n</p>\n\n\n<p>Copyright (c) 2023 TheNewswire - All rights reserved.</p>\n",
    "search_terms": "Monitor Valley,Fuse Battery Metals Inc,FUSE",
    "master_gid": 4298,
    "date": "2023-03-27T11:30:00.000Z",
    "tags": "USA|Nevada||Lithium|Project Acquisition",
    "image_id": null,
    "hidden": false,
    "company_id": 1327,
    "provider": null,
    "excerpt": "   Coquitlam, BC –TheNewswire -March 27, 2023 – Fuse Battery Metals Inc.(“the Company“ or “Fuse”)(TSXV:FUSE)(OTC:FUSEF)(FRA:43W3)is pleased to announce expansion of our exploration land holdings with the inclusion of a new lithium exploration project in Nevada, the Monitor Valley North Project.The Company has entered into a Purchase and Sale Agreement with J.",
    "is_regulatory": false,
    "refined_tags": [
      "Project Acquisition"
    ],
    "ftp_filename": null,
    "company_name": "Fuse Battery Metals Inc",
    "exchange": "TSXV",
    "root_ticker": "FUSE",
    "project_name": "Monitor Valley North",
    "gid": 4298,
    "location": "Nevada, United States",
    "plan_id": null,
    "description_text": "Coquitlam, BC – TheNewswire - March 27, 2023 – Fuse Battery Metals Inc. (“the Company“ or “Fuse”) (TSXV:FUSE ) ( OTC:FUSEF ) ( FRA:43W3) is pleased to announce expansion of our exploration land holdings with the inclusion of a new lithium exploration project in Nevada, the Monitor Valley North Project. The Company has entered into a Purchase and Sale Agreement with J. Malcolm Bell (the “Vendor”) dated March 22, 2023 whereby the Company becomes the legal and beneficial owner of 97 placer claims (MVN1 – MVN97) covering approximately 770 hectares of alluvial sediments and clays located 134 km northeast of Tonopah, Nevada (the “Monitor Valley North Lithium Property”). Terms of the Transaction: The Company agrees to the following: (a) reimbursing the staking and recording cost of the Vendor in the amount of US$30,081 upon signing the Agreement; and (b) issuing to the Vendor 500,000 fully paid and non-assessable common shares in the capital of the Company upon TSX Venture Exchange acceptance of the transaction. All securities issued in connection with the Transaction are subject to a four month and a day hold period in accordance with Canadian Securities Laws. About the Monitor Valley North Lithium Property The property is located in Monitor Valley, Nevada, about 138  km north-northeast of Tonopah, Nevada. The center of the property is about 39.21° North Latitude, 116.65° West Longitude. The property is 55 km due west of the Little Smokey Valley, Nevada where exploration for lithium is ongoing. Geology and Mineralization The Monitor Valley North Project is a sediment-hosted lithium clay target. Access to the property is good and both exploration and exploitation could be conducted year-round. Minimal work has been conducted on the project, but initial surface samples reported in regional NURE sampling returned average lithium values of 664 ppm (max 970 ppm, min 388 ppm) contained within a sedimentary sequence of Miocene mudstone and claystone. The origin of this lithium deposit is suspected to be similar to Clayton Valley clay deposits located about 180 km to the south. Both areas are reasonably well represented by the USGS preliminary deposit model, which describes the primary characteristics as light-colored, ash-rich, lacustrine (lake) rocks containing swelling clays. Mr. Tim Fernback, President & CEO comments “The Monitor Valley North location has been relatively unexplored to date, but the lithium exploration potential due to the geothermal activity in the project area is compelling.  It is the Company’s intention to rapidly evaluate the lithium potential of this project over the coming months.  It is Fuse’s intent to complete an initial NI #43-101 Technical Report on the property in the near future”. Click Image To View Full Size Qualified Person as Defined Under National Instrument 43-101 Alan J. Morris, CPG of Spring Creek, Nevada, a Qualified Person as defined under Nation Instrument 43-101 has reviewed and approved the technical aspects of this news release. In other news, Interim President & CEO Mr. Tim Fernback has been named Fuse’s permanent President & CEO by the Company’s Board of Directors.   “I am excited to contribute to the success of Fuse for the benefit of all our shareholders.  There are good things in store for the Company and I am happy to lead this accomplished team of professionals going forward.” About Fuse Battery Metals Inc. https://fusecobalt.com/ Fuse Battery Metals Inc. is a Canadian based exploration company that trades under the symbol FUSE on the TSX Venture Exchange. The Company's focus is on exploration for high value metals required for the manufacturing of batteries. Nevada Lithium Properties Fuse owns 100% of the Lithium Springs Property which is located at the southern end of Black Rock Desert, Nevada, about 132 air-line km north-northeast of Reno, Nevada in Sections 1, 2, 11, and 12 Township 32 North, Range 23. The center of the property is about 40.676° North Latitude, 119.331° West Longitude, (40° 40’ 33” N, 119° 19’ 52”): UTM X 302,900 UTMY 4,505,400 NAD 27; Zone 11 N.   Black Rock Desert basin is about 110 km long and up to 25 km wide at the widest point. The central playa measures about 50 km northeast - southwest and 10 km southeast - northwest. The western arm of the Black Rock Desert covers an area of about 2,000 square kilometers and contains 5 of the 30 currently listed Known Geothermal Resource Areas in Nevada . Ontario Cobalt Properties Fuse owns a 100% interest its Glencore Bucke Property , situated in Bucke Township, 6 km east-northeast of Cobalt, Ontario, subject to a back-in provision, production royalty and off-take agreement . The Glencore Bucke Property consists of 16.2 hectares and sits along the west boundary of Fuse’s Teledyne Cobalt Project .  The Company also owns a 100% interest, subject to a royalty, in the Teledyne Project located near Cobalt, Ontario.  The Teledyne Property adjoins the south and west boundaries of claims that hosted the Agnico Mine. Glencore Bucke/Teledyne Property Situated in Bucke Township, 6 km east-northeast of Cobalt, Ontario the Glencore Bucke Property adjoins, on its northeast corner, the former cobalt producing Agaunico Mine. From 1905 through to 1961, the Agaunico Mine produced a total of 4,350,000 lbs. of cobalt (“Co”), and 980,000 oz of silver (“Ag”) (Cunningham-Dunlop, 1979). The amount of cobalt produced from the Agaunico Mine is greater than that of any other mine in the Cobalt Mining Camp. Production ceased in 1961 due to depressed Co prices and over-supply (Thomson, 1964). The Glencore property is 100% owned by Fuse subject to a back-in provision, production royalty and off-take agreement. The associated Teledyne Property, located in Bucke and Lorrain Townships, consists of 5 patented mining claims totaling 79.1 ha, and 46 unpatented mining claim cells totaling approximately 700 ha. The Property is easily accessible by highway 567 and a well-maintained secondary road . Over $25 million Can has been spent thus far, (2020 dollars inflation-adjusted) on the Teledyne Property resulting in valuable infrastructure including a development ramp and a modern decline going down 500 ft parallel to the main cobalt mineralized vein. The Teledyne Property is subject to a production royalty in favor of New Found Gold and an off-take agreement in favor of Glencore Canada Corp., while the Glencore Bucke Property is subject to a back-in provision, production royalty, and an off-take agreement in favor of Glencore Canada Corp. Glencore PLC is the world’s largest producer of cobalt. A significant portion of the cobalt that was produced at the Agaunico Mine was located along structures (Vein #15) that extended southward towards the northern boundary of the Teledyne Cobalt Property, currently 100% owned by FUSE. Mineralization was generally located within 125 ft (38.1 m) above the Huronian/Archean unconformity. Stoping widths of up to 50 ft (15.2 m) were not unusual at the Agaunico Mine (Cunningham-Dunlop, 1979). On Behalf of the Board of Directors “Tim Fernback” Tim Fernback, President & CEO Contact Information: Email: info@fusecobalt.com Phone: 236-521-0207 Neither the TSX Venture Exchange nor its Regulation Services Provider (as that term is defined in the policies of the TSX Venture Exchange) accepts responsibility for the adequacy or accuracy of this release.  This news release may contain forward-looking statements which include, but are not limited to, comments that involve future events and conditions, which are subject to various risks and uncertainties. Except for statements of historical facts, comments that address resource potential, upcoming work programs, geological interpretations, receipt and security of mineral property titles, availability of funds, and others are forward-looking. Forward-looking statements are not guarantees of future performance and actual results may vary materially from those statements. General business conditions are factors that could cause actual results to vary materially from forward-looking statements. Copyright (c) 2023 TheNewswire - All rights reserved.",
    "primary_commodity": "Li"
  },
  "articleProject": {
    "gid": 4298,
    "project_name": "Monitor Valley North",
    "location": "Nevada, United States"
  },
  "articleExchange": "TSXV",
  "articleCompanyId": 1327,
  "articleTicker": "FUSE",
  "articleCompanyName": "Fuse Battery Metals Inc",
  "allOtherCompanyProjects": [
    {
      "company_id": 1327,
      "gid": 4298,
      "project_name": "Monitor Valley North",
      "location": "Nevada, United States"
    },
    {
      "company_id": 1327,
      "gid": 4056,
      "project_name": "Lithium Springs",
      "location": "Nevada, United States"
    },
    {
      "company_id": 1327,
      "gid": 3492,
      "project_name": "Glencore Bucke",
      "location": "Ontario, Canada"
    },
    {
      "company_id": 1327,
      "gid": 3493,
      "project_name": "Teledyne",
      "location": "Ontario, Canada"
    }
  ],
  "allOtherCompanyNews": [
    {
      "id": 54767,
      "company_id": 1327,
      "title": "Fuse Battery Announces Effective Date of Share Consolidation",
      "link": "https://www.thenewswire.com/press-releases?id=1kx7FREDp",
      "date": "2024-05-30T11:30:00.000Z",
      "hidden": false
    },
    {
      "id": 53145,
      "company_id": 1327,
      "title": "Fuse Battery Announces Consolidation",
      "link": "https://www.thenewswire.com/press-releases?id=1ArbF2EDZ",
      "date": "2024-05-01T22:20:00.000Z",
      "hidden": false
    },
    {
      "id": 51096,
      "company_id": 1327,
      "title": "Fuse Battery Metals Provides a 2024 Exploration Update for its Nevada Lithium Properties",
      "link": "https://www.accesswire.com/viewarticle.aspx?id=847228&lang=en",
      "date": "2024-03-27T11:30:00.000Z",
      "hidden": false
    },
    {
      "id": 46400,
      "company_id": 1327,
      "title": "Fuse Battery Metals Provides a Year End Update for its Shareholders",
      "link": "https://www.thenewswire.com/press-releases?id=1Bz4FxxGz",
      "date": "2023-12-21T19:25:00.000Z",
      "hidden": false
    },
    {
      "id": 43104,
      "company_id": 1327,
      "title": "Fuse Battery Metals Completes Phase 1 of its Exploration Plan at the Monitor Valley Nevada Lithium Project",
      "link": "https://www.thenewswire.com/press-releases?id=1AwGFxQ2x",
      "date": "2023-10-26T11:30:00.000Z",
      "hidden": false
    },
    {
      "id": 42929,
      "company_id": 1327,
      "title": "Fuse Battery Metals Announces its Plan to Spin-out and List its Subsidiary on the TSX Venture Exchange",
      "link": "https://www.thenewswire.com/press-releases?id=1BglFlD0q",
      "date": "2023-10-24T11:30:00.000Z",
      "hidden": false
    },
    {
      "id": 40329,
      "company_id": 1327,
      "title": "Fuse Battery Metals intercepted 7.75% Co and 5.44% Ni over 0.42m at Glencore-Bucke",
      "link": "https://www.thenewswire.com/press-releases?id=1Be9FJrVP",
      "date": "2023-09-05T21:25:00.000Z",
      "hidden": false
    },
    {
      "id": -56882,
      "company_id": 1327,
      "title": "Fuse Battery Metals Adds Industry Veteran Ryan Cheung CPA, CA to its Board of Directors",
      "link": "https://www.thenewswire.com/press-releases?id=1LYzFZVr8",
      "date": "2023-04-17T11:30:00.000Z",
      "hidden": false
    },
    {
      "id": -56123,
      "company_id": 1327,
      "title": "The Power Play by The Market Herald Releases New Interviews with Trillion Energy, Fuse Battery Metals and ARway Discussing Their Latest News",
      "link": "https://www.accesswire.com/viewarticle.aspx?id=746278&lang=en",
      "date": "2023-03-28T18:30:00.000Z",
      "hidden": false
    },
    {
      "id": 32894,
      "company_id": 1327,
      "title": "The Fuse Team is Actively Assessing Lithium Projects and Adds Another Lithium Exploration Project in Nevada",
      "link": "https://www.thenewswire.com/press-releases?id=1BKRFwqQM",
      "date": "2023-03-27T11:30:00.000Z",
      "hidden": false
    }
  ]
}
