{
  "article": {
    "id": 94248,
    "link": "https://app.quotemedia.com/data/downloadFiling?webmasterId=104408&ref=61ce39161f348f69de7f8fb2&type=PDFC&formType=002-002-001089-003001&formDescription=News+release&dateFiled=2021-12-30",
    "title": "TECTONIC EAGERLY ANTICIPATES REMAINING 2021 DRILL ASSAYS; PROVIDES SUMMARY OF SUCCESSFUL 2021 EXPLORATION PROGRAM",
    "description": "\n1 \nTECTONIC EAGERLY ANTICIPATES REMAINING 2021 DRILL ASSAYS; PROVIDES \nSUMMARY OF SUCCESSFUL 2021 EXPLORATION PROGRAM \nVANCOUVER, B.C., December   20,   2021  Tectonic   Metals   Inc. (TECT: TSX-V; TETOF: \nOTCQB; T15B: FSE) (the \"Company\" or \"Tectonic\") is pleased to provide a summary of the \nCompanys 2021 exploration activities and new project acquisition in Alaska, USA. Over the \ncourse of 2021, Tectonic successfully completed 5,018 metres (m) of drilling, including 12 \nholes for 2,319m of the first oriented core diamond drilling and 18 holes for 2,699m of reverse \ncirculation    (RC)    drilling at    the    Companys    Tibbs    Gold Project    (Tibbs).    Drilling \ntested known high-grade gold targets and newly discovered prospects exhibiting coincident \ngold-in-soil anomalies, high-grade mineralization in grab samples, and both surficial structural \nlineaments and subsurface geophysical anomalies. Phase I drill results have been released; \nPhase II assays (85% of Tectonics total drill program) are pending.  \nWhy Were Excited  2021 Highlights and Key Takeaways \nFirst-Ever Drill Test of 5 Targets Possessing Characteristics Akin to the Pogo Geological\nModel (See map here)\noSince 2018, Tectonic has been diligently and methodically applying the Pogo\nGeological Model at Tibbs to generate drill targets in search of the next Pogo. In\ndoing so, the Company produced compelling drill-ready gold-in-soil anomalies\nthat share the same host rock (gneissic) and similar geochemistry (Au-As-Bi) as\nwell as interpreted high and low-angle structures observed in lineaments and\nTectonics TITAN Geophysical Survey completed this summer.\noGray Lead West Drill Target:  situated immediately west of one of the only known\nhigh- angle structures carrying high-grade Pogo-style gold mineralization outside\nof the Pogo mineral claims.\n?4  holes  (959m),  including  424m  of  diamond  core,  which  successfully\nintersected  interpreted  high  and  low-angle Pogo-style  quartz  veining;\nassays pending.\n?First ever Pogo-style quartz veining intersected in the western, gneissic\nhost rock region of Tibbs; assays pending.\noWest Trench Drill Target: Tectonic rock grab samples returned Pogo-style quartz\nveining up to 190 g/t Au, representing the second surface discovery of high-\ngrade Pogo-like quartz veining in the highly prospective western gneissic region\nof the property.  The 190 g/t Au rock grab sample coincides with a high-tenor\ngold-in-soil anomaly and geophysical anomaly. (News release here)\n?5 holes (952m) drilled, first ever drill test; assays pending.\noJohnson Saddle Drill Target: 2 holes (586m). Drill test of arcuate, high tenor gold-\nin-soil anomaly, including a 790 ppb Au soil sample coinciding with low-angle\nstructures observed in TITAN geophysics and lineament analysis: assays pending.\noGalosh Drill Target: 2 holes (357m), first ever drill test of gold-in-soil anomaly\ncoinciding with high and low-angle structures observed in TITAN geophysics;\nassays pending.\noTITAN-160   Geophysical   Survey   identified   low   and   high-angle   controlling\nstructures coinciding with gold-in-soil anomalies warranting drill follow up in\n2022. (News release here)\n\n\n \n \n \n2 \nHigh-Grade Rock Grab Anomaly Delineated and Drill Tested (News release here) \no Jorts Drill Target: Grab rock sampling returned gold values up to 50.3 g/t Au, \nwith 11 rock   samples   grading   greater   than   20   g/t   Au producing   a 450m \nlong high-grade gold rock anomaly. (See map here) \no Immediately followed up with Phase II drill test consisting of 5 holes (730m); \nassays pending.  \n Phase I oriented diamond drill results were announced from the Michigan and Gray Lead \nZones earlier this year. The program was successful in intersecting high-grade gold \nmineralization such as 7.69 g/t Au over 6.12m, including 33.92 g/t Au over 1.22m \nand 12.45 g/t Au over 5.15m, including 41.39 g/t Au over 1.26m, and determining \nthe structural orientation of the mineralization at both the Michigan and Gray Lead Zones.  \nBoth zones are approximately 250m in length and remain open along strike and at depth. \n(News release here) \n Comprehensive mapping and sampling programs were completed at Tibbs South, Mt. \nHarper, and Maple Leaf Projects. (News release here) \n Acquisition  of  Flat  Gold  Project,  a  ~92,000-acre  Intrusion-hosted,  bulk  tonnage \nopportunity in the Kuskokwim Mineral Belt with ~11,000m of historical drilling with all \nmineralized zones remaining open at depth and along strike and numerous untested \ngold-bearing trenches, rocks samples and soils located 40km from the Donlin Gold \nProject, jointly owned and operated by Barrick Gold Corporation (TSX: ABX; NYSE: \nGOLD) and NOVAGOLD Resources Inc. (TSX, NYSE American: NG). (News release here) \n \nTony Reda, President and CEO, commented, Tectonics 2021 exploration program at Tibbs was \npredicated on our desire to find the next mineable gold deposit in the Goodpaster Mining \nDistrict. Our ambition is reflected in the capital we raised this year and the diligent, aggressive \napproach we have taken with this years exploration program at Tibbs resulting in the deployment \nof two drills to site and the most targets being drill tested in one season at Tibbs. For us, the win \nis not only in discovering gold, but doing so in a safe and responsible manner. This year, like last \nyear, we had zero COVID-19 cases.  Were there challenges, yes of course, there always are, but \nhow you deal with those challenges is what separates a good team from a great team. I am proud \nof our team, both in the field and off, for their ability to adapt to each situation, pivot, regroup and \nexecute. The Phase I exploration program was a success with drilling demonstrating high-grade \ngold  at  two  Tibbs  gold  zones  while  prospecting,  rock  sampling  and  an  accompanying \ngeophysical survey fortified the merit of drill testing our gold-in-soil anomalies now.  Having \nraised additional funds to allow us to be opportunistic, Tectonic quickly launched a Phase II \nexploration program and delivered a comprehensive drill test focused on making new discoveries \nin the gneissic terrain of our property.  Lab delays mean the majority (85%) of our assays have yet \nto be released, but we eagerly anticipate sharing these with the market as soon as they are \navailable. \n  \nEric Buitenhuis, VP Exploration, commented, 2021 was a year of Firsts for the team at Tectonic, \nwith a comprehensive exploration program led by an aggressive drill campaign that stepped out \non our previous discoveries, built on our existing knowledge and pushed into the previously \nunexplored western gneissic frontier at Tibbs. We not only drilled the first ever oriented diamond \ncore at Tibbs but also completed comprehensive mapping and prospecting programs at our \n\n\n \n \n \n3 \nTibbs South, Mt. Harper and Maple Leaf properties. Another First was our TITAN-160 survey, \nthe first high-powered ground-based geophysical survey completed over the western rocks at \nTibbs, which provided unprecedented insight into the nature of the controlling structures there. \nOur  2021  exploration  program  reflected  our  attention  to  detail,  aggressive  targeting,  and \nfundamental reliance on a scientific approach to advancing our projects.  \n \nFig 1. Tectonic Metals properties, Alaska, USA \n \nNext Steps  Assays Pending \nWhile positive results have been released from Tibbs Phase I programs, Tectonic eagerly awaits \nassays from Phase II of our campaign. The planning and development of our 2022 field season \nwill be informed by these results and the Company looks forward to updating the market at the \nearliest opportunity. \n \nQualified Person \nTectonics disclosure of a technical or scientific nature in this press release has been reviewed, \nverified and approved by Eric Buitenhuis, M.Sc., P.Geo., Tectonics Vice President Exploration, \nwho serves as a Qualified Person under the definition of National Instrument 43-101.  \n \nAbout Tectonic \nTectonic Metals Inc. is a mineral exploration company created and operated by an experienced \nand well-respected technical and financial team with a track record of wealth creation for \nshareholders. Key members of the Tectonic team were involved with Kaminak Gold Corporation, \nthe Company that raised C$165 million to fund the acquisition, discovery and advancement of \nthe Coffee Gold Project in the Yukon Territory through to the completion of a bankable feasibility \nstudy before selling the multi-million-ounce gold project to Goldcorp Inc. (now Newmont) for \nC$520  million  in  2016.  Tectonic  is  focused  on  the  acquisition,  exploration,  discovery  and \n\n\n \n \n \n4 \ndevelopment of mineral resources from district-scale projects in politically stable jurisdictions \nthat have the potential to host world-class orebodies.  \n \nTo learn more about Tectonic please click here. \n \nOn behalf of Tectonic Metals Inc., \n \nTony Reda \nPresident and Chief Executive Officer \n \nFor further information about Tectonic Metals Inc. or this news release, please visit our website \nat www.tectonicmetals.com or contact Tony Reda, President & CEO of Tectonic, or Bill Stormont, \nInvestor Relations, at toll-free 1.888.685.8558 or by email at info@tectonicmetals.com. \nFacebook:  https://www.facebook.com/TectonicMetals/   \nTwitter:  https://twitter.com/TectonicMetals   \nLinkedIn:  https://www.linkedin.com/company/tectonic-metals  \n \nCautionary Note Regarding Forward-Looking Statements and Historical Information \nCertain information in this news release constitutes forward-looking information and statements under \napplicable securities law. Any statements that are contained in this news release that are not statements of \nhistorical fact may be deemed to be forward-looking statements. Forward-looking statements are often \nidentified by terms such as may, should, anticipate, expect, intend and similar expressions and \ninclude, but are not limited to, statements with respect to: the payment of finders fee and issuance of \nFinders Warrants; the exercise of the Finders Warrants in accordance with their terms; and the receipt of \nany regulatory approvals, including the final approval of the TSXV.  \n \nForward-looking information is not a guarantee of future performance and is based upon a number of \nestimates and assumptions of management at the date the statements are made including, among others, \nassumptions about future prices of gold and other metal prices, currency exchange rates and interest rates, \nfavourable operating conditions, political stability, obtaining governmental  and other approvals and \nfinancing on time, obtaining required licenses and permits, labour stability, stability in market conditions, \navailability  of  equipment,  accuracy  of  any  mineral  resources,  successful  resolution  of  disputes  and \nanticipated costs and expenditures. Many assumptions are based on factors and events that are not within \nthe control of Tectonic, and there is no assurance they will prove to be correct. \n \nAlthough  Tectonic considers  these beliefs and  assumptions  to  be  reasonable based on information \ncurrently available to it, they may prove to be incorrect, and the forward-looking statements in this release \nare subject to numerous risks, uncertainties and other factors that may cause future results to differ \nmaterially  from  those  expressed  or  implied  in  such  forward-looking  statements.  Forward-looking \nstatements necessarily involve known and unknown risks, including, without limitation: the Companys \nability to implement its business strategies; risks associated with mineral exploration and production; risks \nassociated with general economic conditions; adverse industry events; marketing and transportation costs; \nloss of markets; volatility of commodity prices; inability to access sufficient capital from internal and external \nsources,  and/or  inability  to  access  sufficient  capital  on  favourable  terms;  industry  and  government \nregulation; changes in legislation, income tax and regulatory matters; competition; currency and interest \nrate fluctuations; and other risks.   \n \n\n\n \n \n \n5 \nReaders are further cautioned not to place undue reliance on forward-looking statements as there can be \nno assurance that the plans, intentions or expectations upon which they are placed will occur. Such \ninformation, although considered reasonable by management at the time of preparation, may prove to be \nincorrect and actual results may differ materially from those anticipated. Forward-looking statements \ncontained in this news release are expressly qualified by this cautionary statement. Although Tectonic has \nattempted to identify important factors that could cause actual results to differ materially from those \ncontained in forward-looking information, there may be other factors that cause results not to be as \nanticipated, estimated or intended. There can be no assurance that such information will prove to be \naccurate,  as  actual  results  and  future  events  could  differ  materially  from  those  anticipated  in  such \nstatements.  Accordingly,  readers  should  not  place  undue  reliance  on  forward-looking  information. \nTectonic  does  not  undertake  to  update  any  forward-looking  information, except  in  accordance  with \napplicable securities laws. \n \nNeither the TSX Venture Exchange nor its Regulation Service Provider (as that term is defined in the \npolicies of the TSX Venture Exchange) accepts responsibility for the adequacy or accuracy of this \nrelease. \n \n\n\n",
    "search_terms": "Tibbs,Tectonic Metals Inc.,TECT",
    "master_gid": 1132,
    "date": "2021-12-30T22:56:22.000Z",
    "tags": "USA,Canada|Alaska,Michigan,Yukon||Gold|Financials,Pre-Feasibility Study,NI 43-101 (Geology Report),Drill Targets,Drill Program,Project Acquisition,Geophysical Survey,Marketing",
    "image_id": null,
    "hidden": false,
    "company_id": 436,
    "provider": "SEDAR",
    "excerpt": "1 TECTONIC EAGERLY ANTICIPATES REMAINING 2021 DRILL ASSAYS; PROVIDES SUMMARY OF SUCCESSFUL 2021 EXPLORATION PROGRAM VANCOUVER, B.C., December 20, 2021  Tectonic Metals Inc. (TECT: TSX-V; TETOF: OTCQB; T15B: FSE) (the \"Company\" or \"Tectonic\") is pleased to provide a summary of the Companys 2021 exploration activities and new project acquisition",
    "is_regulatory": false,
    "refined_tags": [
      "Drilling Update",
      "Project Acquisition",
      "Financials",
      "Pre-Feasibility Study",
      "Exploration Update",
      "NI 43-101 (Geology Report)",
      "Geophysical Survey",
      "Marketing"
    ],
    "ftp_filename": null,
    "company_name": "Tectonic Metals Inc.",
    "exchange": "TSXV",
    "root_ticker": "TECT",
    "project_name": "Tibbs",
    "gid": 1132,
    "location": "Alaska, United States",
    "plan_id": "companytier2",
    "description_text": "1 \nTECTONIC EAGERLY ANTICIPATES REMAINING 2021 DRILL ASSAYS; PROVIDES \nSUMMARY OF SUCCESSFUL 2021 EXPLORATION PROGRAM \nVANCOUVER, B.C., December   20,   2021  Tectonic   Metals   Inc. (TECT: TSX-V; TETOF: \nOTCQB; T15B: FSE) (the \"Company\" or \"Tectonic\") is pleased to provide a summary of the \nCompanys 2021 exploration activities and new project acquisition in Alaska, USA. Over the \ncourse of 2021, Tectonic successfully completed 5,018 metres (m) of drilling, including 12 \nholes for 2,319m of the first oriented core diamond drilling and 18 holes for 2,699m of reverse \ncirculation    (RC)    drilling at    the    Companys    Tibbs    Gold Project    (Tibbs).    Drilling \ntested known high-grade gold targets and newly discovered prospects exhibiting coincident \ngold-in-soil anomalies, high-grade mineralization in grab samples, and both surficial structural \nlineaments and subsurface geophysical anomalies. Phase I drill results have been released; \nPhase II assays (85% of Tectonics total drill program) are pending.  \nWhy Were Excited  2021 Highlights and Key Takeaways \nFirst-Ever Drill Test of 5 Targets Possessing Characteristics Akin to the Pogo Geological\nModel (See map here)\noSince 2018, Tectonic has been diligently and methodically applying the Pogo\nGeological Model at Tibbs to generate drill targets in search of the next Pogo. In\ndoing so, the Company produced compelling drill-ready gold-in-soil anomalies\nthat share the same host rock (gneissic) and similar geochemistry (Au-As-Bi) as\nwell as interpreted high and low-angle structures observed in lineaments and\nTectonics TITAN Geophysical Survey completed this summer.\noGray Lead West Drill Target:  situated immediately west of one of the only known\nhigh- angle structures carrying high-grade Pogo-style gold mineralization outside\nof the Pogo mineral claims.\n?4  holes  (959m),  including  424m  of  diamond  core,  which  successfully\nintersected  interpreted  high  and  low-angle Pogo-style  quartz  veining;\nassays pending.\n?First ever Pogo-style quartz veining intersected in the western, gneissic\nhost rock region of Tibbs; assays pending.\noWest Trench Drill Target: Tectonic rock grab samples returned Pogo-style quartz\nveining up to 190 g/t Au, representing the second surface discovery of high-\ngrade Pogo-like quartz veining in the highly prospective western gneissic region\nof the property.  The 190 g/t Au rock grab sample coincides with a high-tenor\ngold-in-soil anomaly and geophysical anomaly. (News release here)\n?5 holes (952m) drilled, first ever drill test; assays pending.\noJohnson Saddle Drill Target: 2 holes (586m). Drill test of arcuate, high tenor gold-\nin-soil anomaly, including a 790 ppb Au soil sample coinciding with low-angle\nstructures observed in TITAN geophysics and lineament analysis: assays pending.\noGalosh Drill Target: 2 holes (357m), first ever drill test of gold-in-soil anomaly\ncoinciding with high and low-angle structures observed in TITAN geophysics;\nassays pending.\noTITAN-160   Geophysical   Survey   identified   low   and   high-angle   controlling\nstructures coinciding with gold-in-soil anomalies warranting drill follow up in\n2022. (News release here)\n\n\n \n \n \n2 \nHigh-Grade Rock Grab Anomaly Delineated and Drill Tested (News release here) \no Jorts Drill Target: Grab rock sampling returned gold values up to 50.3 g/t Au, \nwith 11 rock   samples   grading   greater   than   20   g/t   Au producing   a 450m \nlong high-grade gold rock anomaly. (See map here) \no Immediately followed up with Phase II drill test consisting of 5 holes (730m); \nassays pending.  \n Phase I oriented diamond drill results were announced from the Michigan and Gray Lead \nZones earlier this year. The program was successful in intersecting high-grade gold \nmineralization such as 7.69 g/t Au over 6.12m, including 33.92 g/t Au over 1.22m \nand 12.45 g/t Au over 5.15m, including 41.39 g/t Au over 1.26m, and determining \nthe structural orientation of the mineralization at both the Michigan and Gray Lead Zones.  \nBoth zones are approximately 250m in length and remain open along strike and at depth. \n(News release here) \n Comprehensive mapping and sampling programs were completed at Tibbs South, Mt. \nHarper, and Maple Leaf Projects. (News release here) \n Acquisition  of  Flat  Gold  Project,  a  ~92,000-acre  Intrusion-hosted,  bulk  tonnage \nopportunity in the Kuskokwim Mineral Belt with ~11,000m of historical drilling with all \nmineralized zones remaining open at depth and along strike and numerous untested \ngold-bearing trenches, rocks samples and soils located 40km from the Donlin Gold \nProject, jointly owned and operated by Barrick Gold Corporation (TSX: ABX; NYSE: \nGOLD) and NOVAGOLD Resources Inc. (TSX, NYSE American: NG). (News release here) \n \nTony Reda, President and CEO, commented, Tectonics 2021 exploration program at Tibbs was \npredicated on our desire to find the next mineable gold deposit in the Goodpaster Mining \nDistrict. Our ambition is reflected in the capital we raised this year and the diligent, aggressive \napproach we have taken with this years exploration program at Tibbs resulting in the deployment \nof two drills to site and the most targets being drill tested in one season at Tibbs. For us, the win \nis not only in discovering gold, but doing so in a safe and responsible manner. This year, like last \nyear, we had zero COVID-19 cases.  Were there challenges, yes of course, there always are, but \nhow you deal with those challenges is what separates a good team from a great team. I am proud \nof our team, both in the field and off, for their ability to adapt to each situation, pivot, regroup and \nexecute. The Phase I exploration program was a success with drilling demonstrating high-grade \ngold  at  two  Tibbs  gold  zones  while  prospecting,  rock  sampling  and  an  accompanying \ngeophysical survey fortified the merit of drill testing our gold-in-soil anomalies now.  Having \nraised additional funds to allow us to be opportunistic, Tectonic quickly launched a Phase II \nexploration program and delivered a comprehensive drill test focused on making new discoveries \nin the gneissic terrain of our property.  Lab delays mean the majority (85%) of our assays have yet \nto be released, but we eagerly anticipate sharing these with the market as soon as they are \navailable. \n  \nEric Buitenhuis, VP Exploration, commented, 2021 was a year of Firsts for the team at Tectonic, \nwith a comprehensive exploration program led by an aggressive drill campaign that stepped out \non our previous discoveries, built on our existing knowledge and pushed into the previously \nunexplored western gneissic frontier at Tibbs. We not only drilled the first ever oriented diamond \ncore at Tibbs but also completed comprehensive mapping and prospecting programs at our \n\n\n \n \n \n3 \nTibbs South, Mt. Harper and Maple Leaf properties. Another First was our TITAN-160 survey, \nthe first high-powered ground-based geophysical survey completed over the western rocks at \nTibbs, which provided unprecedented insight into the nature of the controlling structures there. \nOur  2021  exploration  program  reflected  our  attention  to  detail,  aggressive  targeting,  and \nfundamental reliance on a scientific approach to advancing our projects.  \n \nFig 1. Tectonic Metals properties, Alaska, USA \n \nNext Steps  Assays Pending \nWhile positive results have been released from Tibbs Phase I programs, Tectonic eagerly awaits \nassays from Phase II of our campaign. The planning and development of our 2022 field season \nwill be informed by these results and the Company looks forward to updating the market at the \nearliest opportunity. \n \nQualified Person \nTectonics disclosure of a technical or scientific nature in this press release has been reviewed, \nverified and approved by Eric Buitenhuis, M.Sc., P.Geo., Tectonics Vice President Exploration, \nwho serves as a Qualified Person under the definition of National Instrument 43-101.  \n \nAbout Tectonic \nTectonic Metals Inc. is a mineral exploration company created and operated by an experienced \nand well-respected technical and financial team with a track record of wealth creation for \nshareholders. Key members of the Tectonic team were involved with Kaminak Gold Corporation, \nthe Company that raised C$165 million to fund the acquisition, discovery and advancement of \nthe Coffee Gold Project in the Yukon Territory through to the completion of a bankable feasibility \nstudy before selling the multi-million-ounce gold project to Goldcorp Inc. (now Newmont) for \nC$520  million  in  2016.  Tectonic  is  focused  on  the  acquisition,  exploration,  discovery  and \n\n\n \n \n \n4 \ndevelopment of mineral resources from district-scale projects in politically stable jurisdictions \nthat have the potential to host world-class orebodies.  \n \nTo learn more about Tectonic please click here. \n \nOn behalf of Tectonic Metals Inc., \n \nTony Reda \nPresident and Chief Executive Officer \n \nFor further information about Tectonic Metals Inc. or this news release, please visit our website \nat www.tectonicmetals.com or contact Tony Reda, President & CEO of Tectonic, or Bill Stormont, \nInvestor Relations, at toll-free 1.888.685.8558 or by email at info@tectonicmetals.com. \nFacebook:  https://www.facebook.com/TectonicMetals/   \nTwitter:  https://twitter.com/TectonicMetals   \nLinkedIn:  https://www.linkedin.com/company/tectonic-metals  \n \nCautionary Note Regarding Forward-Looking Statements and Historical Information \nCertain information in this news release constitutes forward-looking information and statements under \napplicable securities law. Any statements that are contained in this news release that are not statements of \nhistorical fact may be deemed to be forward-looking statements. Forward-looking statements are often \nidentified by terms such as may, should, anticipate, expect, intend and similar expressions and \ninclude, but are not limited to, statements with respect to: the payment of finders fee and issuance of \nFinders Warrants; the exercise of the Finders Warrants in accordance with their terms; and the receipt of \nany regulatory approvals, including the final approval of the TSXV.  \n \nForward-looking information is not a guarantee of future performance and is based upon a number of \nestimates and assumptions of management at the date the statements are made including, among others, \nassumptions about future prices of gold and other metal prices, currency exchange rates and interest rates, \nfavourable operating conditions, political stability, obtaining governmental  and other approvals and \nfinancing on time, obtaining required licenses and permits, labour stability, stability in market conditions, \navailability  of  equipment,  accuracy  of  any  mineral  resources,  successful  resolution  of  disputes  and \nanticipated costs and expenditures. Many assumptions are based on factors and events that are not within \nthe control of Tectonic, and there is no assurance they will prove to be correct. \n \nAlthough  Tectonic considers  these beliefs and  assumptions  to  be  reasonable based on information \ncurrently available to it, they may prove to be incorrect, and the forward-looking statements in this release \nare subject to numerous risks, uncertainties and other factors that may cause future results to differ \nmaterially  from  those  expressed  or  implied  in  such  forward-looking  statements.  Forward-looking \nstatements necessarily involve known and unknown risks, including, without limitation: the Companys \nability to implement its business strategies; risks associated with mineral exploration and production; risks \nassociated with general economic conditions; adverse industry events; marketing and transportation costs; \nloss of markets; volatility of commodity prices; inability to access sufficient capital from internal and external \nsources,  and/or  inability  to  access  sufficient  capital  on  favourable  terms;  industry  and  government \nregulation; changes in legislation, income tax and regulatory matters; competition; currency and interest \nrate fluctuations; and other risks.   \n \n\n\n \n \n \n5 \nReaders are further cautioned not to place undue reliance on forward-looking statements as there can be \nno assurance that the plans, intentions or expectations upon which they are placed will occur. Such \ninformation, although considered reasonable by management at the time of preparation, may prove to be \nincorrect and actual results may differ materially from those anticipated. Forward-looking statements \ncontained in this news release are expressly qualified by this cautionary statement. Although Tectonic has \nattempted to identify important factors that could cause actual results to differ materially from those \ncontained in forward-looking information, there may be other factors that cause results not to be as \nanticipated, estimated or intended. There can be no assurance that such information will prove to be \naccurate,  as  actual  results  and  future  events  could  differ  materially  from  those  anticipated  in  such \nstatements.  Accordingly,  readers  should  not  place  undue  reliance  on  forward-looking  information. \nTectonic  does  not  undertake  to  update  any  forward-looking  information, except  in  accordance  with \napplicable securities laws. \n \nNeither the TSX Venture Exchange nor its Regulation Service Provider (as that term is defined in the \npolicies of the TSX Venture Exchange) accepts responsibility for the adequacy or accuracy of this \nrelease.",
    "primary_commodity": "Au"
  },
  "articleProject": {
    "gid": 1132,
    "project_name": "Tibbs",
    "location": "Alaska, United States"
  },
  "articleExchange": "TSXV",
  "articleCompanyId": 436,
  "articleTicker": "TECT",
  "articleCompanyName": "Tectonic Metals Inc.",
  "allOtherCompanyProjects": [
    {
      "company_id": 436,
      "gid": 3951,
      "project_name": "Flat",
      "location": "Alaska, United States"
    },
    {
      "company_id": 436,
      "gid": 1132,
      "project_name": "Tibbs",
      "location": "Alaska, United States"
    },
    {
      "company_id": 436,
      "gid": 4937,
      "project_name": "Mt. Harper",
      "location": "Alaska, United States"
    },
    {
      "company_id": 436,
      "gid": 4936,
      "project_name": "Carrie Creek",
      "location": "Alaska, United States"
    },
    {
      "company_id": 436,
      "gid": 1133,
      "project_name": "Maple Leaf",
      "location": "Alaska, USA"
    }
  ],
  "allOtherCompanyNews": [
    {
      "id": 107818,
      "company_id": 436,
      "title": "Tectonic Metals Welcomes Dr. Richard Goldfarb, Distinguished Geologist and Global Expert in Orogenic Gold Systems and Alaskan Geology to Technical Advisory Team",
      "link": null,
      "date": "2025-06-12T12:00:00.000Z",
      "hidden": false
    },
    {
      "id": 106589,
      "company_id": 436,
      "title": "Tectonic Metals Launches Largest Drill Program to Date with Three Drill Rigs at Flat Gold Project, Alaska",
      "link": null,
      "date": "2025-06-02T12:55:00.000Z",
      "hidden": false
    },
    {
      "id": 105195,
      "company_id": 436,
      "title": "Tectonic Metals Closes $12.7 Million Financing - More Than 80% Oversubscribed - To Launch Multi-Rig Drill Program at Flat Gold Project",
      "link": null,
      "date": "2025-05-20T12:00:00.000Z",
      "hidden": false
    },
    {
      "id": 104791,
      "company_id": 436,
      "title": "Tectonic Announces Share Consolidation Effective Date",
      "link": null,
      "date": "2025-05-15T12:00:00.000Z",
      "hidden": false
    },
    {
      "id": 100829,
      "company_id": 436,
      "title": "Tectonic Metals Secures Over $5 Million in Strategic Funding Led by Crescat Capital; Launches $7 Million Financing to Fund 2025 Drilling",
      "link": null,
      "date": "2025-04-24T12:00:00.000Z",
      "hidden": false
    },
    {
      "id": 89866,
      "company_id": 436,
      "title": "Tectonic Metals Drills New Gold Discovery:  65.5 Metres of 1.2 G/T AU, Including 6.1 Metres of 6.0 G/T AU With 1.5 Metres of 21.7 G/T AU; Drilled Mineralized Strike Now 3KMS and Still Open",
      "link": "https://www.accessnewswire.com/newsroom/en/metals-and-mining/tectonic-metals-drills-new-gold-discovery-655-metres-of-12-gt-au-including-61-metr-994372",
      "date": "2025-03-03T13:00:00.000Z",
      "hidden": false
    },
    {
      "id": 77695,
      "company_id": 436,
      "title": "Tectonic Metals Surpasses C$5M In Capital Raised With Oversubscribed Private Placement To Advance Flat Gold Project",
      "link": "https://www.accesswire.com/938861/tectonic-metals-surpasses-c5m-in-capital-raised-with-oversubscribed-private-placement-to-advance-flat-gold-project",
      "date": "2024-11-04T21:00:00.000Z",
      "hidden": false
    },
    {
      "id": 73792,
      "company_id": 436,
      "title": "Tectonic Metals Closes First Tranche of Extended Private Placement Offering",
      "link": "https://www.accesswire.com/viewarticle.aspx?id=927392&lang=en",
      "date": "2024-10-04T12:00:00.000Z",
      "hidden": false
    },
    {
      "id": 72045,
      "company_id": 436,
      "title": "Tectonic Metals Announces Results Of 2024 Annual General Meeting",
      "link": "https://www.accesswire.com/viewarticle.aspx?id=920730&lang=en",
      "date": "2024-09-20T12:00:00.000Z",
      "hidden": false
    },
    {
      "id": 71920,
      "company_id": 436,
      "title": "Tectonic Metals Achieves 96% Gold Recovery from First-Ever Heap Leach Column Tests on A Mix of Oxidized and Non-Oxidized Fresh Mineralized Rock from Flat Gold Project ",
      "link": "https://www.accesswire.com/viewarticle.aspx?id=920179&lang=en",
      "date": "2024-09-19T12:00:00.000Z",
      "hidden": false
    }
  ]
}
