{
  "article": {
    "id": 37678,
    "link": "https://www.newsfilecorp.com/release/172900/Nevada-Lithium-Completes-Acquisition-of-100-Ownership-of-Bonnie-Claire-Lithium-Project-Nevada-USA-with-Robust-PEA-Economics-of-USD-1.5-Billion-NPV-After-Tax-and-Receives-Proceeds-from-11.3M-Concurrent-Financings",
    "title": "Nevada Lithium Completes Acquisition of 100% Ownership of Bonnie Claire Lithium Project, Nevada USA with Robust PEA Economics of USD $1.5 Billion NPV (After Tax) and Receives Proceeds from $11.3M Concurrent Financings",
    "description": "<img src=\"https://api.newsfilecorp.com/newsinfo/172900/367\" id=\"367\" width=\"2\" height=\"2\" style=\"width: 1px;  height: 1px;border: 0px solid;\" /><p>Vancouver, British Columbia--(Newsfile Corp. - July 10, 2023) - Nevada Lithium Resources Inc. (CSE: NVLH) (OTCQB: NVLHF) (FSE: 87K) (\"<b>Nevada Lithium</b>\") and Iconic Minerals Ltd. (TSXV: ICM) (OTCQB: BVTEF) (FSE: YQGB) (\"<b>Iconic</b>\") are pleased to announce that they have completed the previously announced plan of arrangement under the <i>Business Corporations Act</i> (British Columbia) (the \"<b>BCBCA</b>\"), whereby Nevada Lithium acquired Iconic's 50% interest in the Bonnie Claire lithium project (the \"<b>Bonnie Claire Project</b>\") located in Nye County, Nevada (the \"<b>Arrangement</b>\"). Upon completion of the Arrangement, Nevada Lithium now holds a 100% interest in the Bonnie Claire Project. In connection with the completion of the Arrangement Nevada Lithium will receive the gross proceeds from the Concurrent Offerings (as defined below) totalling $11,320,998, which included participation from several investors. </p><p>Stephen Rentschler, Chief Executive Officer of Nevada Lithium, stated: \"We are pleased to announce the completion of the previously announced transaction with Iconic resulting in 100% ownership of the Bonnie Claire lithium deposit by Nevada Lithium, and welcome the new shareholders who have been created as a result of this transaction. Nevada Lithium is currently engaged in Pre-Feasibility Study work, as well as strategic dialog with lithium end-users. Consolidation of asset ownership has been one of the key factors in discussions, and we are confident that this transaction will be instrumental in unlocking shareholder value.\"</p><p>Richard Kern, President/CEO of Ionic and Chief Operating Officer and director of Nevada Lithium, added: \"The Bonnie Claire lithium deposit has developed into a resource of potential global significance with its size, grade and location in Nevada, USA. Consolidation of 100% ownership within Nevada Lithium will provide a more efficient and effective structure for the continued advancement of the Bonnie Claire Project and allow Iconic shareholders to continue to participate in future value creation as shareholders of Nevada Lithium.\"</p><p>Mr. Rentschler continued, \"Lithium Carbonate Equivalent (LCE) prices are now many times higher than the assumed prices used in our robust Preliminary Economic Assessment, where at a base case pricing assumption of $13,400 USD / tonne LCE the Bonnie Claire Project returned an NPV of $1.5 Billion USD (ATAX 8%)<sup>1</sup>. Recent 2022 drill program results have also returned the highest lithium values ever recorded at the Bonnie Claire Project, including 3,201 ppm Li over 520 ft (158 m) within a wider interval of 1,315 ppm Li over 2,000 ft (610 m)<sup>2</sup>. With a projected annual production rate of over 30,000 tonnes of LCE, and a resource base that indicates the ability to upsize potential production further, the Bonnie Claire Project has the potential to play a significant role in meeting global lithium needs.\"</p><p><sup>1</sup>See <i>Preliminary Economic Assessment NI 43-101 Technical Report on the Bonnie Claire Lithium Project, Nye Country, Nevada </i>authored by Terre Lane, J. Todd Harvey, MBA, PhD, Hamid Samari, PhD and Rick Moritz<i> (Effective date of August 20, 2021, and Issue date of February 25, 2022)</i> as summarized in Nevada Lithium news release dated October 13, 2021, which are available on Nevada Lithium's SEDAR profile at <a href=\"https://api.newsfilecorp.com/redirect/QOrVJUbwwO\">www.sedar.com</a>. Results of the Preliminary Economic Assessment (PEA) represent forward-looking information. This economic assessment is by definition preliminary in nature, and includes inferred mineral resources that are considered too speculative to have the economic considerations applied to them that would enable them to be categorized as mineral reserves. There is no certainty that the preliminary economic assessment will be realized. Mineral resources are not mineral reserves as they do not have demonstrated economic viability. There is no certainty that all or any part of the Mineral Resources will be converted into Mineral Reserves. Assumes 68% recovery by borehole.</p><p><sup>2</sup>See Nevada Lithium news release dated December 7, 2022.</p><p><b>Bonnie Claire Project</b></p><p>The Bonnie Claire Project is located within Sarcobatus Valley, which is approximately 30 km (19 miles) long and 20 km (12 miles) wide. Quartz-rich volcanic tuffs containing anomalous amounts of lithium occur within and adjacent to the valley. Drill results from the salt flat include 2,054 ppm Li over 67.1 m (220 ft) as well as a 475 m (1560 ft) vertical intercept averaging 1153 ppm Li. Bonnie Claire is one the largest lithium resources in North America with a current NI 43-101 inferred mineral resource of 3,407 million tonnes (Mt) grading 1,013 ppm Li for 18,372 million kilograms of contained lithium carbonate equivalent (LCE), at a cut-off grade of 700 ppm Li. Mineral resources are not mineral reserves as they do not have demonstrated economic viability. </p><p>Nevada Lithium's 2022 NI 43-101 Preliminary Economic Assessment shows attractive investment metrics even at low LCE prices. At $13,400 USD per tonne LCE, the Net Present Value of the Project is $1.5 Billion USD (after tax) using an eight percent (8%) discount rate and the Bonnie Claire Project has after tax IRR of 23.8%. With an LCE price of $30,000 USD per tonne, the Net Present Value (8%) of the Bonnie Claire Project is $5.9 Billion USD and the IRR is 60.3% (after tax)<sup>3</sup>.</p><p>The gravity low that characterizes the valley is approximately 20 km (12 miles) long, and the current estimates of depth to basement rocks range from 600 to 1,200 meters (2,000 to 4,000 feet). The current claim block covers an area of 74 km2 (28.6 mi2) with potential for brine systems and further sediment resources.</p><p><sup>3</sup> See <i>Preliminary Economic Assessment NI 43-101 Technical Report on the Bonnie Claire Lithium Project, Nye Country, </i>Nevada authored by Terre Lane, J. Todd Harvey, MBA, PhD, Hamid Samari, PhD and Rick Moritz<i> (Effective date of August 20, 2021, and Issue date of February 25, 2022)</i> as summarized in Nevada Lithium news release dated October 13, 2021, which are available on Nevada Lithium's SEDAR profile at <a href=\"https://api.newsfilecorp.com/redirect/m3oqktbOOw\">www.sedar.com</a>. Results of the Preliminary Economic Assessment (PEA) represent forward-looking information. This economic assessment is by definition preliminary in nature, and includes inferred mineral resources that are considered too speculative to have the economic considerations applied to them that would enable them to be categorized as mineral reserves. There is no certainty that the preliminary economic assessment will be realized. Mineral resources are not mineral reserves as they do not have demonstrated economic viability. There is no certainty that all or any part of the Mineral Resources will be converted into Mineral Reserves. Assumes 68% recovery by borehole.</p><p><b>Summary of the Arrangement</b></p><p>The Arrangement was carried out pursuant to the terms of a definitive arrangement agreement dated March 24, 2023, as amended (the \"<b>Arrangement Agreement</b>\"), between Nevada Lithium, Iconic, a wholly-owned subsidiary of Nevada Lithium, 1406917 B.C. Ltd. (\"<b>Nevada Lithium MergeCo</b>\") and a wholly-owned subsidiary of Iconic, 1259318 B.C. Ltd. (\"<b>Iconic MergeCo</b>\"). </p><p>In connection with the completion of the Arrangement, the parties carried out, among other things, the following:</p><ol style=\"list-style-type: lower-alpha;\"><li><p>Iconic's 50% interest in the Bonnie Claire Project, that was previously held through Iconic's Nevada subsidiary, Bonaventure Nevada Inc., has been transferred to a newly incorporated Nevada subsidiary of Iconic MergeCo, Bonnie Claire Lithium Resources Corp.;</p></li><li><p>Iconic filed articles of amendment in accordance with the BCBCA to amend its authorized share structure (the \"<b>Iconic Capital Alteration</b>\") to provide for the following: </p><ol style=\"list-style-type: lower-roman;\"><li><p>all of the issued and unissued common shares in the capital of Iconic (each, an \"<b>Iconic Common Share</b>\") were renamed and redesignated as \"Class A common shares without par value\", and the special rights and restrictions attached to those shares were varied to provide the holders thereof with two votes in respect of each share held; </p></li><li><p>a new class consisting of an unlimited number of \"common shares without par value\" was created (each, an \"<b>Iconic New Common Share</b>\") with terms and special rights and restrictions identical to those of the Iconic Common Shares immediately prior to the effective time of the Arrangement; and</p></li><li><p>following the Iconic Share Exchange (as defined below), all of the issued Iconic Common Shares were cancelled and the authorized share structure of Iconic was altered by eliminating the Iconic Common Shares;</p></li></ol></li><li><p>each of the issued and outstanding Iconic Common Share (as renamed and redesignated Iconic Class A common shares) was exchanged for:</p><ol style=\"list-style-type: lower-roman;\"><li><p>one Iconic New Common Share; and</p></li><li><p>a fractional amount of an Iconic MergeCo share, such that after giving effect to the Iconic Share Exchange, each shareholder of Iconic held a proportionate interest in Iconic MergeCo, provided that Iconic retained a 10% interest in Iconic MergeCo (the \"<b>Iconic Share Exchange</b>\");</p></li></ol></li><li><p>Iconic MergeCo amalgamated with Nevada Lithium MergeCo and continued as one corporation under the BCBCA;</p></li><li><p>Nevada Lithium issued an aggregate of 66,912,827 common shares as consideration for the Arrangement (the \"<b>Consideration Shares</b>\"), of which 60,221,528 Consideration Shares were received by the Iconic shareholders and 6,691,299 were received by Iconic, representing, in the case of the Iconic shareholders, 0.4082576248 Consideration Share for each one Iconic common share held;</p></li><li><p>1406923 B.C. Ltd. (\"<b>Nevada Lithium Subco</b>\") and 1396483 B.C. Ltd. (\"<b>Nevada Lithium FinCo</b>\") amalgamated and continued as one corporation under the BCBCA.  Upon closing of the Arrangement, each Nevada Lithium FinCo common shares and each Nevada Lithium FinCo common share purchase warrant was exchanged on a one-for-one basis, respectively, for common shares in the capital of Nevada Lithium (the \"<b>Nevada Lithium Shares</b>\") and Nevada Lithium Warrants (as defined below); </p></li><li><p>Nevada Lithium issued to Iconic an aggregate of 4,000,000 Nevada Lithium warrants, each of which entitle the holder thereof to purchase one Nevada Lithium Share for a period of two years from the closing of the Arrangement at an exercise price of $0.20 per Nevada Lithium Share (the \"<b>Nevada Lithium Warrants</b>\"); </p></li><li><p>Nevada Lithium granted to certain eligible persons associated with Iconic an aggregate of 3,930,000 stock options, bearing the same terms as the Nevada Lithium stock options that were outstanding immediately prior to the completion of the Arrangement, including as to duration and exercise price;</p></li><li><p>Nevada Lithium paid to Iconic a $500,000 structuring fee and reimbursed certain expenses and contractual obligations of Iconic in respect of the Bonnie Claire Project arising prior to the effective date of the arrangement, including legal, contract management and other professional fees incurred by Iconic in connection with the Arrangement;</p></li><li><p>the board of directors of Nevada Lithium was reconstituted to consist of five members, comprised of: Stephen Rentschler, Scott Eldridge, Richard Kern, Keturah Nathe and Jerry Wang; and </p></li><li><p>Mr. Stephen Rentschler will continue to serve as CEO of Nevada Lithium; Mr. Richard Kern, the current CEO of Iconic, has been appointed the COO of Nevada Lithium; Mr. Kelvin Lee resigned as the CFO of Nevada Lithium and Ms. Catherine Lathwell was appointed as the CFO of Nevada Lithium in Mr. Lee's stead. </p></li></ol><p><b>Concurrent Financings</b></p><p>In connection with the completion of the Arrangement, the gross proceeds totaling $11,320,998, derived from Nevada Lithium's February 24, 2023 non-brokered private placement of 36,680,000 subscription receipts (\"<b>February</b> Offering\") and Nevada Lithium's June 20, 2023 non-brokered private placement offering of 41,333,333 subscription receipts (the \"<b>June Offering</b>\" and together with the February Offering, the \"<b>Concurrent</b> <b>Offerings</b>\") were released from escrow and the subscription receipts issued pursuant to the February Offering (the \"<b>February Subscription Receipts</b>\") and the subscription receipts issued pursuant to the June Offering (the \"<b>June Subscription Receipts</b>\") were automatically converted into units of Nevada Lithium, as described in Nevada Lithium's press releases dated February 24, 2023 and June 20, 2023 respectively. PowerOne Capital Markets Limited acted as finder in connection with the Concurrent Offerings.</p><p>The holders of promissory notes of Nevada Lithium (the \"<b>Promissory Notes</b>\") in the principal amount of $535,998 entered into debt conversion agreements whereby immediately prior to the closing of the Arrangement, the principal amount outstanding under the Promissory Notes was converted into units of Nevada Lithium on the same terms as the February Subscription Receipts.</p><p>Nevada Lithium intends to use the net proceeds from the February Offering and the June Offering for exploration activities at the Bonnie Claire Project as well as for working capital requirements and other general corporate purposes. </p><p>The securities distributed pursuant to the Arrangement, the February Offering and the June Offering have not and will not be registered under the U.S. Securities Act of 1933 or any U.S. state securities laws and may not be offered or sold in the United States unless the securities have been registered under the U.S. Securities Act of 1933 and any applicable state securities laws, or in compliance with the requirements of an exemption therefrom.</p><p><b>Legal Advisors </b></p><p>Garfinkle Biderman LLP acted as legal counsel to Nevada Lithium in connection with the Arrangement.</p><p>Lotz &#38; Company acted as legal counsel to Iconic in connection with the Arrangement.</p><p><b>Qualified Person </b></p><p>The technical information in the above disclosure has been reviewed and approved by the designated Qualified Person (QP) under National Instrument 43-101, Jeff Wilson, PhD, P.Geo, Director &#38; Vice President of Exploration for Nevada Lithium. Dr. Wilson is independent of Iconic but is not independent of Nevada Lithium, as he is a director and Vice President of Exploration for Nevada Lithium.</p><p><b>About Nevada Lithium Resources Inc.</b></p><p>Nevada Lithium Resources Inc. is a mineral exploration and development company focused on shareholder value creation through its core asset, the Bonnie Claire Lithium Project, located in Nye County, Nevada, where it holds a 100% interest. A recently completed NI 43-101 Preliminary Economic Assessment returned attractive investment metrics and Nevada Lithium is actively advancing the Bonnie Claire Project towards Pre-Feasibility. Learn more: <a href=\"https://api.newsfilecorp.com/redirect/kOzqQUyaaJ\">https://www.nvlithium.com</a>.</p><p><b>About Iconic Minerals Ltd. </b></p><p>Iconic is a mineral exploration and development company with several quality lithium and gold exploration projects located throughout Nevada, USA. For further information on Iconic, please visit its website at <a href=\"https://api.newsfilecorp.com/redirect/BpNDOuLkke\">www.iconicminerals.com</a>.</p><p><b>On behalf of the Board of Directors of Nevada Lithium Resources Inc.</b></p><p><i>\"Stephen Rentschler\"</i><br />Stephen Rentschler, CEO</p><p><b>On behalf of the Board of Directors of Iconic Minerals Ltd.</b></p><p><i>\"Richard Kern\"</i><br />Richard Kern, President and CEO</p><p><b>For further information, please contact:</b></p><p><b>Nevada Lithium Resources Inc.</b><br />Stephen Rentschler, CEO and Director<br />Phone: (604) 416-4099<br />Email: <a href=\"mailto:sr@nvlithium.com\">sr@nvlithium.com</a> </p><p><b>Iconic Minerals Ltd.</b><br />Keturah Nathe, VP Corporate Development<br />Phone: (604) 336-8614<br />Email: <a href=\"mailto:keturah@simcoservices.ca\">keturah@simcoservices.ca</a></p><p><i>Neither the TSX Venture Exchange nor its Regulation Services Provider (as that term is defined in the policies of the TSX Venture Exchange) or the Canadian Securities Exchange accepts responsibility for the adequacy or accuracy of this release. The TSX Venture Exchange has in no way passed upon the merits of the Arrangement and has not approved or disapproved of the contents of this news release. </i></p><p><i><b>Cautionary Note to United States Investors</b></i></p><p><i>Iconic prepares its disclosure in accordance with the requirements of securities laws in effect in Canada, which differ from the requirements of U.S. securities laws. Terms relating to mineral resources in this news release are defined in accordance with NI 43-101 under the guidelines set out in CIM Standards. The U.S. Securities and Exchange Commission (the \"SEC\") has adopted amendments effective February 25, 2019 (the \"SEC Modernization Rules\") to its disclosure rules to modernize the mineral property disclosure requirements for issuers whose securities are registered with the SEC under the U.S. Securities Exchange Act of 1934. </i></p><p><i>As a result of the adoption of the SEC Modernization Rules, the SEC will now recognize estimates of \"measured mineral resources\", \"indicated mineral resources\" and \"inferred mineral resources\", which are defined in substantially similar terms to the corresponding CIM Standards. In addition, the SEC has amended its definitions of \"proven mineral reserves\" and \"probable mineral reserves\" to be substantially similar to the corresponding CIM Standards. </i></p><p><i>U.S. investors are cautioned that while the foregoing terms are \"substantially similar\" to corresponding definitions under the CIM Standards, there are differences in the definitions under the SEC Modernization Rules and the CIM Standards. Accordingly, there is no assurance any mineral resources that Nevada Lithium may report as \"measured mineral resources\", \"indicated mineral resources\" and \"inferred mineral resources\" under NI 43-101 would be the same had Nevada Lithium prepared the resource estimates under the standards adopted under the SEC Modernization Rules.</i></p><p><i>In accordance with Canadian securities laws, estimates of \"inferred mineral resources\" cannot form the basis of feasibility or other economic studies, except in limited circumstances where permitted under NI 43-101.</i></p><p><i><b>Cautionary Note Regarding Forward-Looking Statements</b></i></p><p><i>This news release contains forward-looking statements and forward-looking information (collectively, \"forward-looking statements\") within the meaning of applicable Canadian and U.S. securities legislation. These statements relate to matters that identify future events or future performance. Often, but not always, forward looking information can be identified by words such as \"could\", \"pro forma\", \"plans\", \"expects\", \"may\", \"will\", \"should\", \"budget\", \"scheduled\", \"estimates\", \"forecasts\", \"intends\", \"anticipates\", \"believes\", \"potential\" or variations of such words including negative variations thereof, and phrases that refer to certain actions, events or results that may, could, would, might or will occur or be taken or achieved.  </i></p><p><i>The forward-looking statements contained herein include, but are not limited to statements regarding: the anticipated benefits and results of the Arrangement; the performance of the Bonnie Claire Project after the completion of the Arrangement (including, without limitation, its mineral resources, current claims and its ability to utilize global lithium needs); and the performance of lithium as a commodity, including the sustained lithium demand and prices.</i></p><p><i>In making the forward looking statements in this news release, Iconic and Nevada Lithium have applied several material assumptions, including without limitation: Iconic obtaining final TSX Venture Exchange acceptance; market fundamentals that result in sustained lithium demand and prices; the receipt of any necessary permits, licenses and regulatory approvals in connection with the future development of the Bonnie Claire Project in a timely manner; the availability of financing on suitable terms for the development; construction and continued operation of the Bonnie Claire Project; the Bonnie Claire Project containing mineral resources; and Iconic and Nevada Lithium's ability to comply with all applicable regulations and laws, including environmental, health and safety laws.</i></p><p><i>Investors are cautioned that forward-looking statements are not based on historical facts but instead reflect Iconic and Nevada Lithium's respective management's expectations, estimates or projections concerning future results or events based on the opinions, assumptions and estimates of managements considered reasonable at the date the statements are made. Although Iconic and Nevada Lithium believe that the expectations reflected in such forward-looking statements are reasonable, such information involves risks and uncertainties, and under reliance should not be placed on such information, as unknown or unpredictable factors could have material adverse effects on future results, performance or achievements expressed or implied by Iconic and Nevada Lithium. Among the key risk factors that could cause actual results to differ materially from those projected in the forward-looking statements are the following: operating and technical difficulties in connection with mineral exploration and development and mine development activities at the Bonnie Claire Project; estimation or realization of mineral reserves and mineral resources, requirements for additional capital; future prices of precious metals and lithium; changes in general economic, business and political conditions, including changes in the financial markets and in the demand and market price for commodities; possible variations in ore grade or recovery rates; possible failures of plants, equipment or processes to operate as anticipated; accidents, labour disputes and other risks of the mining industry; delays or the inability of Iconic and Nevada Lithium to obtain any necessary approvals, permits, consents or authorizations, financing or other planned activities; changes in laws, regulations and policies affecting mining operations; currency fluctuations, title disputes or claims limitations on insurance coverage and the timing and possible outcome of pending litigation, environmental issues and liabilities; risks relating to epidemics or pandemics such as COVID-19, including the impact of COVID-19 on Iconic and Nevada Lithium's business; risks related to joint venture operations; the potential impact of the announcement or consummation of the Arrangement on relationship, including with regulatory bodies, employees, suppliers, customers and competitors; and risks related to the integration of acquisitions, as well as those factors discussed under the heading \"Risk Factors\" in Iconic and Nevada Lithium's latest Management Discussion and Analysis and other filings of Iconic and Nevada Lithium with the Canadian Securities Authorities, copies of which can be found under the respective party's profile on the SEDAR website at </i><a href=\"https://api.newsfilecorp.com/redirect/55pDzuv11g\"><i>www.sedar.com</i></a><i>.</i></p><p><i>Should one or more of these risks or uncertainties materialized, or should assumptions underlying the forward-looking statements prove incorrect, actual results may vary materially from those described herein as intended, planned, anticipated, believed, estimated or expected. Although Iconic and Nevada Lithium have attempted to identify important risks, uncertainties and factors which could cause actual results to differ materially, there may be others that cause results not to be as anticipated, estimated or intended. Iconic and Nevada Lithium do not intend, and do not assume any obligation, to update this forward-looking information except as otherwise required by applicable law. <br /></i></p><p id=\"corporateNewsLogoContainer\"><img src=\"https://images.newsfilecorp.com/files/9381/172900_nevadalogo_200.jpg\" alt=\"Corporate Logo\" id=\"corporateNewsLogo\" /></p><p><a href=\"https://images.newsfilecorp.com/files/9381/172900_iconiclogo_200.jpg\"><img style=\"border-width: 0px;\" src=\"https://images.newsfilecorp.com/files/9381/172900_iconiclogo_200.jpg\" alt=\"Cannot view this image? Visit: https://images.newsfilecorp.com/files/9381/172900_iconiclogo_200.jpg\" /></a></p><p id=\"corporateLinkBack\">To view the source version of this press release, please visit <a href=\"https://api.newsfilecorp.com/redirect/LG7mVcKkkL\">https://www.newsfilecorp.com/release/172900</a></p>",
    "search_terms": "Bonnie Claire,Nevada Lithium Resources Inc.,NVLH",
    "master_gid": 1037,
    "date": "2023-07-10T11:00:00.000Z",
    "tags": "Canada,USA|Nevada||Lithium|Project Acquisition",
    "image_id": null,
    "hidden": false,
    "company_id": 1562,
    "provider": null,
    "excerpt": "Vancouver, British Columbia--(Newsfile Corp. - July 10, 2023) - Nevada Lithium Resources Inc. (CSE: NVLH) (OTCQB: NVLHF) (FSE: 87K) (\"Nevada Lithium\") and Iconic Minerals Ltd. (TSXV: ICM) (OTCQB: BVTEF) (FSE: YQGB) (\"Iconic\") are pleased to announce that they have completed the previously announced plan of arrangement under theBusiness Corporations Act(British",
    "is_regulatory": false,
    "refined_tags": [
      "Project Acquisition"
    ],
    "ftp_filename": null,
    "company_name": "Nevada Lithium Resources Inc.",
    "exchange": "TSXV",
    "root_ticker": "NVLH",
    "project_name": "Bonnie Claire",
    "gid": 1037,
    "location": null,
    "plan_id": null,
    "description_text": "Vancouver, British Columbia--(Newsfile Corp. - July 10, 2023) - Nevada Lithium Resources Inc. (CSE: NVLH) (OTCQB: NVLHF) (FSE: 87K) (\" Nevada Lithium \") and Iconic Minerals Ltd. (TSXV: ICM) (OTCQB: BVTEF) (FSE: YQGB) (\" Iconic \") are pleased to announce that they have completed the previously announced plan of arrangement under the Business Corporations Act (British Columbia) (the \" BCBCA \"), whereby Nevada Lithium acquired Iconic's 50% interest in the Bonnie Claire lithium project (the \" Bonnie Claire Project \") located in Nye County, Nevada (the \" Arrangement \"). Upon completion of the Arrangement, Nevada Lithium now holds a 100% interest in the Bonnie Claire Project. In connection with the completion of the Arrangement Nevada Lithium will receive the gross proceeds from the Concurrent Offerings (as defined below) totalling $11,320,998, which included participation from several investors. Stephen Rentschler, Chief Executive Officer of Nevada Lithium, stated: \"We are pleased to announce the completion of the previously announced transaction with Iconic resulting in 100% ownership of the Bonnie Claire lithium deposit by Nevada Lithium, and welcome the new shareholders who have been created as a result of this transaction. Nevada Lithium is currently engaged in Pre-Feasibility Study work, as well as strategic dialog with lithium end-users. Consolidation of asset ownership has been one of the key factors in discussions, and we are confident that this transaction will be instrumental in unlocking shareholder value.\" Richard Kern, President/CEO of Ionic and Chief Operating Officer and director of Nevada Lithium, added: \"The Bonnie Claire lithium deposit has developed into a resource of potential global significance with its size, grade and location in Nevada, USA. Consolidation of 100% ownership within Nevada Lithium will provide a more efficient and effective structure for the continued advancement of the Bonnie Claire Project and allow Iconic shareholders to continue to participate in future value creation as shareholders of Nevada Lithium.\" Mr. Rentschler continued, \"Lithium Carbonate Equivalent (LCE) prices are now many times higher than the assumed prices used in our robust Preliminary Economic Assessment, where at a base case pricing assumption of $13,400 USD / tonne LCE the Bonnie Claire Project returned an NPV of $1.5 Billion USD (ATAX 8%) 1 . Recent 2022 drill program results have also returned the highest lithium values ever recorded at the Bonnie Claire Project, including 3,201 ppm Li over 520 ft (158 m) within a wider interval of 1,315 ppm Li over 2,000 ft (610 m) 2 . With a projected annual production rate of over 30,000 tonnes of LCE, and a resource base that indicates the ability to upsize potential production further, the Bonnie Claire Project has the potential to play a significant role in meeting global lithium needs.\" 1 See Preliminary Economic Assessment NI 43-101 Technical Report on the Bonnie Claire Lithium Project, Nye Country, Nevada authored by Terre Lane, J. Todd Harvey, MBA, PhD, Hamid Samari, PhD and Rick Moritz (Effective date of August 20, 2021, and Issue date of February 25, 2022) as summarized in Nevada Lithium news release dated October 13, 2021, which are available on Nevada Lithium's SEDAR profile at www.sedar.com . Results of the Preliminary Economic Assessment (PEA) represent forward-looking information. This economic assessment is by definition preliminary in nature, and includes inferred mineral resources that are considered too speculative to have the economic considerations applied to them that would enable them to be categorized as mineral reserves. There is no certainty that the preliminary economic assessment will be realized. Mineral resources are not mineral reserves as they do not have demonstrated economic viability. There is no certainty that all or any part of the Mineral Resources will be converted into Mineral Reserves. Assumes 68% recovery by borehole. 2 See Nevada Lithium news release dated December 7, 2022. Bonnie Claire Project The Bonnie Claire Project is located within Sarcobatus Valley, which is approximately 30 km (19 miles) long and 20 km (12 miles) wide. Quartz-rich volcanic tuffs containing anomalous amounts of lithium occur within and adjacent to the valley. Drill results from the salt flat include 2,054 ppm Li over 67.1 m (220 ft) as well as a 475 m (1560 ft) vertical intercept averaging 1153 ppm Li. Bonnie Claire is one the largest lithium resources in North America with a current NI 43-101 inferred mineral resource of 3,407 million tonnes (Mt) grading 1,013 ppm Li for 18,372 million kilograms of contained lithium carbonate equivalent (LCE), at a cut-off grade of 700 ppm Li. Mineral resources are not mineral reserves as they do not have demonstrated economic viability. Nevada Lithium's 2022 NI 43-101 Preliminary Economic Assessment shows attractive investment metrics even at low LCE prices. At $13,400 USD per tonne LCE, the Net Present Value of the Project is $1.5 Billion USD (after tax) using an eight percent (8%) discount rate and the Bonnie Claire Project has after tax IRR of 23.8%. With an LCE price of $30,000 USD per tonne, the Net Present Value (8%) of the Bonnie Claire Project is $5.9 Billion USD and the IRR is 60.3% (after tax) 3 . The gravity low that characterizes the valley is approximately 20 km (12 miles) long, and the current estimates of depth to basement rocks range from 600 to 1,200 meters (2,000 to 4,000 feet). The current claim block covers an area of 74 km2 (28.6 mi2) with potential for brine systems and further sediment resources. 3 See Preliminary Economic Assessment NI 43-101 Technical Report on the Bonnie Claire Lithium Project, Nye Country, Nevada authored by Terre Lane, J. Todd Harvey, MBA, PhD, Hamid Samari, PhD and Rick Moritz (Effective date of August 20, 2021, and Issue date of February 25, 2022) as summarized in Nevada Lithium news release dated October 13, 2021, which are available on Nevada Lithium's SEDAR profile at www.sedar.com . Results of the Preliminary Economic Assessment (PEA) represent forward-looking information. This economic assessment is by definition preliminary in nature, and includes inferred mineral resources that are considered too speculative to have the economic considerations applied to them that would enable them to be categorized as mineral reserves. There is no certainty that the preliminary economic assessment will be realized. Mineral resources are not mineral reserves as they do not have demonstrated economic viability. There is no certainty that all or any part of the Mineral Resources will be converted into Mineral Reserves. Assumes 68% recovery by borehole. Summary of the Arrangement The Arrangement was carried out pursuant to the terms of a definitive arrangement agreement dated March 24, 2023, as amended (the \" Arrangement Agreement \"), between Nevada Lithium, Iconic, a wholly-owned subsidiary of Nevada Lithium, 1406917 B.C. Ltd. (\" Nevada Lithium MergeCo \") and a wholly-owned subsidiary of Iconic, 1259318 B.C. Ltd. (\" Iconic MergeCo \"). In connection with the completion of the Arrangement, the parties carried out, among other things, the following: Iconic's 50% interest in the Bonnie Claire Project, that was previously held through Iconic's Nevada subsidiary, Bonaventure Nevada Inc., has been transferred to a newly incorporated Nevada subsidiary of Iconic MergeCo, Bonnie Claire Lithium Resources Corp.; Iconic filed articles of amendment in accordance with the BCBCA to amend its authorized share structure (the \" Iconic Capital Alteration \") to provide for the following: all of the issued and unissued common shares in the capital of Iconic (each, an \" Iconic Common Share \") were renamed and redesignated as \"Class A common shares without par value\", and the special rights and restrictions attached to those shares were varied to provide the holders thereof with two votes in respect of each share held; a new class consisting of an unlimited number of \"common shares without par value\" was created (each, an \" Iconic New Common Share \") with terms and special rights and restrictions identical to those of the Iconic Common Shares immediately prior to the effective time of the Arrangement; and following the Iconic Share Exchange (as defined below), all of the issued Iconic Common Shares were cancelled and the authorized share structure of Iconic was altered by eliminating the Iconic Common Shares; each of the issued and outstanding Iconic Common Share (as renamed and redesignated Iconic Class A common shares) was exchanged for: one Iconic New Common Share; and a fractional amount of an Iconic MergeCo share, such that after giving effect to the Iconic Share Exchange, each shareholder of Iconic held a proportionate interest in Iconic MergeCo, provided that Iconic retained a 10% interest in Iconic MergeCo (the \" Iconic Share Exchange \"); Iconic MergeCo amalgamated with Nevada Lithium MergeCo and continued as one corporation under the BCBCA; Nevada Lithium issued an aggregate of 66,912,827 common shares as consideration for the Arrangement (the \" Consideration Shares \"), of which 60,221,528 Consideration Shares were received by the Iconic shareholders and 6,691,299 were received by Iconic, representing, in the case of the Iconic shareholders, 0.4082576248 Consideration Share for each one Iconic common share held; 1406923 B.C. Ltd. (\" Nevada Lithium Subco \") and 1396483 B.C. Ltd. (\" Nevada Lithium FinCo \") amalgamated and continued as one corporation under the BCBCA.  Upon closing of the Arrangement, each Nevada Lithium FinCo common shares and each Nevada Lithium FinCo common share purchase warrant was exchanged on a one-for-one basis, respectively, for common shares in the capital of Nevada Lithium (the \" Nevada Lithium Shares \") and Nevada Lithium Warrants (as defined below); Nevada Lithium issued to Iconic an aggregate of 4,000,000 Nevada Lithium warrants, each of which entitle the holder thereof to purchase one Nevada Lithium Share for a period of two years from the closing of the Arrangement at an exercise price of $0.20 per Nevada Lithium Share (the \" Nevada Lithium Warrants \"); Nevada Lithium granted to certain eligible persons associated with Iconic an aggregate of 3,930,000 stock options, bearing the same terms as the Nevada Lithium stock options that were outstanding immediately prior to the completion of the Arrangement, including as to duration and exercise price; Nevada Lithium paid to Iconic a $500,000 structuring fee and reimbursed certain expenses and contractual obligations of Iconic in respect of the Bonnie Claire Project arising prior to the effective date of the arrangement, including legal, contract management and other professional fees incurred by Iconic in connection with the Arrangement; the board of directors of Nevada Lithium was reconstituted to consist of five members, comprised of: Stephen Rentschler, Scott Eldridge, Richard Kern, Keturah Nathe and Jerry Wang; and Mr. Stephen Rentschler will continue to serve as CEO of Nevada Lithium; Mr. Richard Kern, the current CEO of Iconic, has been appointed the COO of Nevada Lithium; Mr. Kelvin Lee resigned as the CFO of Nevada Lithium and Ms. Catherine Lathwell was appointed as the CFO of Nevada Lithium in Mr. Lee's stead. Concurrent Financings In connection with the completion of the Arrangement, the gross proceeds totaling $11,320,998, derived from Nevada Lithium's February 24, 2023 non-brokered private placement of 36,680,000 subscription receipts (\" February Offering\") and Nevada Lithium's June 20, 2023 non-brokered private placement offering of 41,333,333 subscription receipts (the \" June Offering \" and together with the February Offering, the \" Concurrent Offerings \") were released from escrow and the subscription receipts issued pursuant to the February Offering (the \" February Subscription Receipts \") and the subscription receipts issued pursuant to the June Offering (the \" June Subscription Receipts \") were automatically converted into units of Nevada Lithium, as described in Nevada Lithium's press releases dated February 24, 2023 and June 20, 2023 respectively. PowerOne Capital Markets Limited acted as finder in connection with the Concurrent Offerings. The holders of promissory notes of Nevada Lithium (the \" Promissory Notes \") in the principal amount of $535,998 entered into debt conversion agreements whereby immediately prior to the closing of the Arrangement, the principal amount outstanding under the Promissory Notes was converted into units of Nevada Lithium on the same terms as the February Subscription Receipts. Nevada Lithium intends to use the net proceeds from the February Offering and the June Offering for exploration activities at the Bonnie Claire Project as well as for working capital requirements and other general corporate purposes. The securities distributed pursuant to the Arrangement, the February Offering and the June Offering have not and will not be registered under the U.S. Securities Act of 1933 or any U.S. state securities laws and may not be offered or sold in the United States unless the securities have been registered under the U.S. Securities Act of 1933 and any applicable state securities laws, or in compliance with the requirements of an exemption therefrom. Legal Advisors Garfinkle Biderman LLP acted as legal counsel to Nevada Lithium in connection with the Arrangement. Lotz & Company acted as legal counsel to Iconic in connection with the Arrangement. Qualified Person The technical information in the above disclosure has been reviewed and approved by the designated Qualified Person (QP) under National Instrument 43-101, Jeff Wilson, PhD, P.Geo, Director & Vice President of Exploration for Nevada Lithium. Dr. Wilson is independent of Iconic but is not independent of Nevada Lithium, as he is a director and Vice President of Exploration for Nevada Lithium. About Nevada Lithium Resources Inc. Nevada Lithium Resources Inc. is a mineral exploration and development company focused on shareholder value creation through its core asset, the Bonnie Claire Lithium Project, located in Nye County, Nevada, where it holds a 100% interest. A recently completed NI 43-101 Preliminary Economic Assessment returned attractive investment metrics and Nevada Lithium is actively advancing the Bonnie Claire Project towards Pre-Feasibility. Learn more: https://www.nvlithium.com . About Iconic Minerals Ltd. Iconic is a mineral exploration and development company with several quality lithium and gold exploration projects located throughout Nevada, USA. For further information on Iconic, please visit its website at www.iconicminerals.com . On behalf of the Board of Directors of Nevada Lithium Resources Inc. \"Stephen Rentschler\" Stephen Rentschler, CEO On behalf of the Board of Directors of Iconic Minerals Ltd. \"Richard Kern\" Richard Kern, President and CEO For further information, please contact: Nevada Lithium Resources Inc. Stephen Rentschler, CEO and Director Phone: (604) 416-4099 Email: sr@nvlithium.com Iconic Minerals Ltd. Keturah Nathe, VP Corporate Development Phone: (604) 336-8614 Email: keturah@simcoservices.ca Neither the TSX Venture Exchange nor its Regulation Services Provider (as that term is defined in the policies of the TSX Venture Exchange) or the Canadian Securities Exchange accepts responsibility for the adequacy or accuracy of this release. The TSX Venture Exchange has in no way passed upon the merits of the Arrangement and has not approved or disapproved of the contents of this news release. Cautionary Note to United States Investors Iconic prepares its disclosure in accordance with the requirements of securities laws in effect in Canada, which differ from the requirements of U.S. securities laws. Terms relating to mineral resources in this news release are defined in accordance with NI 43-101 under the guidelines set out in CIM Standards. The U.S. Securities and Exchange Commission (the \"SEC\") has adopted amendments effective February 25, 2019 (the \"SEC Modernization Rules\") to its disclosure rules to modernize the mineral property disclosure requirements for issuers whose securities are registered with the SEC under the U.S. Securities Exchange Act of 1934. As a result of the adoption of the SEC Modernization Rules, the SEC will now recognize estimates of \"measured mineral resources\", \"indicated mineral resources\" and \"inferred mineral resources\", which are defined in substantially similar terms to the corresponding CIM Standards. In addition, the SEC has amended its definitions of \"proven mineral reserves\" and \"probable mineral reserves\" to be substantially similar to the corresponding CIM Standards. U.S. investors are cautioned that while the foregoing terms are \"substantially similar\" to corresponding definitions under the CIM Standards, there are differences in the definitions under the SEC Modernization Rules and the CIM Standards. Accordingly, there is no assurance any mineral resources that Nevada Lithium may report as \"measured mineral resources\", \"indicated mineral resources\" and \"inferred mineral resources\" under NI 43-101 would be the same had Nevada Lithium prepared the resource estimates under the standards adopted under the SEC Modernization Rules. In accordance with Canadian securities laws, estimates of \"inferred mineral resources\" cannot form the basis of feasibility or other economic studies, except in limited circumstances where permitted under NI 43-101. Cautionary Note Regarding Forward-Looking Statements This news release contains forward-looking statements and forward-looking information (collectively, \"forward-looking statements\") within the meaning of applicable Canadian and U.S. securities legislation. These statements relate to matters that identify future events or future performance. Often, but not always, forward looking information can be identified by words such as \"could\", \"pro forma\", \"plans\", \"expects\", \"may\", \"will\", \"should\", \"budget\", \"scheduled\", \"estimates\", \"forecasts\", \"intends\", \"anticipates\", \"believes\", \"potential\" or variations of such words including negative variations thereof, and phrases that refer to certain actions, events or results that may, could, would, might or will occur or be taken or achieved. The forward-looking statements contained herein include, but are not limited to statements regarding: the anticipated benefits and results of the Arrangement; the performance of the Bonnie Claire Project after the completion of the Arrangement (including, without limitation, its mineral resources, current claims and its ability to utilize global lithium needs); and the performance of lithium as a commodity, including the sustained lithium demand and prices. In making the forward looking statements in this news release, Iconic and Nevada Lithium have applied several material assumptions, including without limitation: Iconic obtaining final TSX Venture Exchange acceptance; market fundamentals that result in sustained lithium demand and prices; the receipt of any necessary permits, licenses and regulatory approvals in connection with the future development of the Bonnie Claire Project in a timely manner; the availability of financing on suitable terms for the development; construction and continued operation of the Bonnie Claire Project; the Bonnie Claire Project containing mineral resources; and Iconic and Nevada Lithium's ability to comply with all applicable regulations and laws, including environmental, health and safety laws. Investors are cautioned that forward-looking statements are not based on historical facts but instead reflect Iconic and Nevada Lithium's respective management's expectations, estimates or projections concerning future results or events based on the opinions, assumptions and estimates of managements considered reasonable at the date the statements are made. Although Iconic and Nevada Lithium believe that the expectations reflected in such forward-looking statements are reasonable, such information involves risks and uncertainties, and under reliance should not be placed on such information, as unknown or unpredictable factors could have material adverse effects on future results, performance or achievements expressed or implied by Iconic and Nevada Lithium. Among the key risk factors that could cause actual results to differ materially from those projected in the forward-looking statements are the following: operating and technical difficulties in connection with mineral exploration and development and mine development activities at the Bonnie Claire Project; estimation or realization of mineral reserves and mineral resources, requirements for additional capital; future prices of precious metals and lithium; changes in general economic, business and political conditions, including changes in the financial markets and in the demand and market price for commodities; possible variations in ore grade or recovery rates; possible failures of plants, equipment or processes to operate as anticipated; accidents, labour disputes and other risks of the mining industry; delays or the inability of Iconic and Nevada Lithium to obtain any necessary approvals, permits, consents or authorizations, financing or other planned activities; changes in laws, regulations and policies affecting mining operations; currency fluctuations, title disputes or claims limitations on insurance coverage and the timing and possible outcome of pending litigation, environmental issues and liabilities; risks relating to epidemics or pandemics such as COVID-19, including the impact of COVID-19 on Iconic and Nevada Lithium's business; risks related to joint venture operations; the potential impact of the announcement or consummation of the Arrangement on relationship, including with regulatory bodies, employees, suppliers, customers and competitors; and risks related to the integration of acquisitions, as well as those factors discussed under the heading \"Risk Factors\" in Iconic and Nevada Lithium's latest Management Discussion and Analysis and other filings of Iconic and Nevada Lithium with the Canadian Securities Authorities, copies of which can be found under the respective party's profile on the SEDAR website at www.sedar.com . Should one or more of these risks or uncertainties materialized, or should assumptions underlying the forward-looking statements prove incorrect, actual results may vary materially from those described herein as intended, planned, anticipated, believed, estimated or expected. Although Iconic and Nevada Lithium have attempted to identify important risks, uncertainties and factors which could cause actual results to differ materially, there may be others that cause results not to be as anticipated, estimated or intended. Iconic and Nevada Lithium do not intend, and do not assume any obligation, to update this forward-looking information except as otherwise required by applicable law. To view the source version of this press release, please visit https://www.newsfilecorp.com/release/172900",
    "primary_commodity": "Li"
  },
  "articleProject": {
    "gid": 1037,
    "project_name": "Bonnie Claire",
    "location": null
  },
  "articleExchange": "TSXV",
  "articleCompanyId": 1562,
  "articleTicker": "NVLH",
  "articleCompanyName": "Nevada Lithium Resources Inc.",
  "allOtherCompanyProjects": [],
  "allOtherCompanyNews": [
    {
      "id": 89251,
      "company_id": 1562,
      "title": "Metallurgical Test Work confirms > 95% Lithium Extraction from Acid Leach on High-Grade Mineralization Samples from Bonnie Claire",
      "link": "https://www.globenewswire.com/news-release/2025/02/26/3032750/0/en/Metallurgical-Test-Work-confirms-95-Lithium-Extraction-from-Acid-Leach-on-High-Grade-Mineralization-Samples-from-Bonnie-Claire.html",
      "date": "2025-02-26T12:00:00.000Z",
      "hidden": false
    },
    {
      "id": 83822,
      "company_id": 1562,
      "title": "Nevada Lithium to Participate in the 2025 Mining Conference: Mining and Supplying Critical Minerals & Precious Metals",
      "link": "https://www.globenewswire.com/news-release/2025/01/13/3008319/0/en/Nevada-Lithium-to-Participate-in-the-2025-Mining-Conference-Mining-and-Supplying-Critical-Minerals-Precious-Metals.html",
      "date": "2025-01-13T12:00:00.000Z",
      "hidden": false
    },
    {
      "id": 82955,
      "company_id": 1562,
      "title": "Nevada Lithium to Commence Trading on TSX Venture Exchange Effective December 31, 2024",
      "link": "https://golddiscovery.com/legacy/user/news_details/729323-nvlhcnx-nevada-lithium-to-commence-trading-on-tsx-venture-exchange-effective-december-31-2024",
      "date": "2024-12-27T12:30:00.000Z",
      "hidden": false
    },
    {
      "id": 82460,
      "company_id": 1562,
      "title": "Nevada Lithium Announces Conditional Approval of TSX Venture Exchange Uplisting",
      "link": "https://www.globenewswire.com/news-release/2024/12/19/2999718/0/en/Nevada-Lithium-Announces-Conditional-Approval-of-TSX-Venture-Exchange-Uplisting.html",
      "date": "2024-12-19T12:00:00.000Z",
      "hidden": false
    },
    {
      "id": 82060,
      "company_id": 1562,
      "title": "Nevada Lithium files Technical Report for Bonnie Claire Project. Significantly Increases the Size and Grade of Lower Zone Inferred Lithium Mineral Resources, and Reports Maiden Lithium and Boron Indicated Resources",
      "link": "https://www.globenewswire.com/news-release/2024/12/16/2997436/0/en/Nevada-Lithium-files-Technical-Report-for-Bonnie-Claire-Project-Significantly-Increases-the-Size-and-Grade-of-Lower-Zone-Inferred-Lithium-Mineral-Resources-and-Reports-Maiden-Lithi.html",
      "date": "2024-12-16T12:47:00.000Z",
      "hidden": false
    },
    {
      "id": 78430,
      "company_id": 1562,
      "title": "Nevada Lithium Significantly Increases the Size and Grade of Lower Zone Inferred Mineral Resources at Bonnie Claire to 25.634 Mt LCE at 3,085 ppm Li. Reports Maiden Indicated Resources of 5.167 Mt LCE at 3,519 ppm Li and 2.318 Mt B at 8,404 ppm Boron",
      "link": "https://www.globenewswire.com/news-release/2024/11/12/2978877/0/en/Nevada-Lithium-Significantly-Increases-the-Size-and-Grade-of-Lower-Zone-Inferred-Mineral-Resources-at-Bonnie-Claire-to-25-634-Mt-LCE-at-3-085-ppm-Li-Reports-Maiden-Indicated-Resour.html",
      "date": "2024-11-12T12:00:00.000Z",
      "hidden": false
    },
    {
      "id": 75695,
      "company_id": 1562,
      "title": "Nevada Lithium Achieves 97% Lithium and 98% Boron Recovery on High-Grade Mineralization. Engages Fluor Enterprises, Inc. to Design Flowsheet and Process Plant for Updated PEA",
      "link": "https://www.globenewswire.com/news-release/2024/10/23/2967641/0/en/Nevada-Lithium-Achieves-97-Lithium-and-98-Boron-Recovery-on-High-Grade-Mineralization-Engages-Fluor-Enterprises-Inc-to-Design-Flowsheet-and-Process-Plant-for-Updated-PEA.html",
      "date": "2024-10-23T11:00:00.000Z",
      "hidden": false
    },
    {
      "id": 73383,
      "company_id": 1562,
      "title": "Nevada Lithium Intersects 3,024 ppm Lithium and 9,000 ppm (0.90%) Boron over 1,360 ft (414 m). Enhances Grade Confidence in Resource Area and Confirms Extension of Deep High-Grade Mineralization in Second Direction",
      "link": "https://www.globenewswire.com/news-release/2024/10/01/2955957/0/en/Nevada-Lithium-Intersects-3-024-ppm-Lithium-and-9-000-ppm-0-90-Boron-over-1-360-ft-414-m-Enhances-Grade-Confidence-in-Resource-Area-and-Confirms-Extension-of-Deep-High-Grade-Minera.html",
      "date": "2024-10-01T11:00:00.000Z",
      "hidden": false
    },
    {
      "id": 70850,
      "company_id": 1562,
      "title": "Nevada Lithium Drills Best Hole to Date at Bonnie Claire Lithium Project, Nevada; Intersects 5,105 ppm Lithium and 16,100 ppm (1.61%) Boron over 518 ft (158 m). Extends High-Grade Lithium and Boron Mineralized Zone by 1,135 ft (346 m) to a Total Length of 3,730 ft (1137 m)",
      "link": "https://www.globenewswire.com/news-release/2024/09/10/2943500/0/en/Nevada-Lithium-Drills-Best-Hole-to-Date-at-Bonnie-Claire-Lithium-Project-Nevada-Intersects-5-105-ppm-Lithium-and-16-100-ppm-1-61-Boron-over-518-ft-158-m-Extends-High-Grade-Lithium-.html",
      "date": "2024-09-10T11:00:00.000Z",
      "hidden": false
    },
    {
      "id": 68556,
      "company_id": 1562,
      "title": "Nevada Lithium Announces Closing of $6 Million Private Placement led by Strategic Investor Marcel Boekhoorn",
      "link": "https://www.globenewswire.com/news-release/2024/08/16/2931497/0/en/Nevada-Lithium-Announces-Closing-of-6-Million-Private-Placement-led-by-Strategic-Investor-Marcel-Boekhoorn.html",
      "date": "2024-08-16T12:00:00.000Z",
      "hidden": false
    }
  ]
}
