{
  "article": {
    "id": 64712,
    "link": "https://www.accesswire.com/viewarticle.aspx?id=886839&lang=en",
    "title": "Pegasus Resources Significantly Expands Land Package by Securing Exclusive Rights to Jupiter Uranium Project",
    "description": "<p><strong>VANCOUVER, BC / ACCESSWIRE / July 10, 2024</strong> / <strong>Pegasus Resources Inc. </strong>(TSXV:PEGA)(Frankfurt:0QS0)(OTC PINKSLTFF) (the &quot;Company&quot; or &quot;Pegasus&quot;) is pleased to announce that on July 3, 2024 the Company finalized an agreement (the &quot;Agreement&quot;) with KD Prospect (the &quot;Vendor&quot;) to acquire an undivided 100% right, title, and interest in the Jupiter Project (&quot;Jupiter Project&quot;), a strategic uranium Project located in Emery County, Utah, USA. This acquisition is subject to the terms and conditions specified in the agreement.</p><p>&quot;The acquisition of the Jupiter Project, along with our Energy Sands Project, presents an exceptional opportunity for Pegasus and our investors.&quot; stated CEO Chris Timmins, &quot;Energy Sands holds the potential for a discovery, supported by recent ground program findings and historical drilling data indicating a mineralized paleochannel. Meanwhile, Jupiter provides an advanced property with historical drilling, which will be instrumental in developing a future resource estimate. Together, these Projects offer a unique chance for investors to participate in both the development of a new resource and the excitement of a potential discovery.&quot;</p><p>The Jupiter claim group is located 3 kilometers north of Energy Sands and consists of 48 unpatented claims situated in part, in sections 10 and 15, Township 21 S. Range 14 E. SLPM, Emery County, Utah. The claims occur in the Bureau of Land Management, and access is obtained over a well-maintained service road which joins I-70 near Green River, Utah.</p><p>The Jupiter Project was previously held by Atlas Minerals from 1972 to 1983. During this period, the claim group consisted of 25 unpatented claims. Atlas Minerals conducted approximately 100+ drill holes on the Jupiter Project with the greatest density occurring in the vicinity of the northeast corner of section 15. The extensive drilling and exploration activities conducted by Atlas Minerals demonstrated significant potential, and the project was considered a viable mineral resource. Atlas Minerals was advancing the project towards full-scale mining before the collapse of the uranium market in the early 1980s.</p><p>The historical drill logs reveal promising results, with notable uranium intercepts. Pegasus will utilize the valuable information provided to guide our exploration program. Our goal is to create a resource estimate in accordance with the current CIM Definition Standards on Mineral Resources and Mineral Reserves. The historical data underscores the project's potential for substantial uranium mineralization.</p><p><strong>Terms of the agreement:</strong></p><ul style=\"list-style-type:disc;\"><li><p>Issuance of Shares: Pegasus will issue 2,200,000 common shares (&quot;Consideration Shares&quot;) to the Vendor within 10 business days following TSX Venture Exchange approval of the Agreement.</p></li><li><p>Cash Payments: The Company will make a payment of $25,000 USD to the Vendor within 30 days of signing the Agreement. Additionally, subject to TSX Venture Exchange approval, a further payment of $75,000 USD will be made on or before the earlier of November 1, 2024, or 10 business days following the closing of a Private Placement. By the Company.</p></li><li><p>Pegasus commits to conducting a drilling program totalling 1500 meters on the Jupiter Project within 30 days following the first anniversary of the Agreement.</p></li></ul><p>Upon completing these payments and satisfying all obligations outlined in the Agreement, Pegasus will have earned a 100% interest in the Jupiter Project. This interest is subject to Resource Bonuses (as defined below) and a Net Smelter Return Royalty in favour of the Vendor.</p><figure class=\"image\" style=\"text-align:center;margin:0.9em auto;\" width=\"100%\"><img style=\"aspect-ratio:622/436;\" src=\"https://www.accesswire.com/imagelibrary/569b0cd7-a345-4bb9-b59d-f8ceb4a88312/886839/pegagus-mapone-070924.jpg\" width=\"100%\" height=\"436\" /></figure><div style=\"clear: both\"> </div><div> </div><div> </div><div> </div><div> </div><div> </div><p><strong>Figure 1: Utah Property Map</strong></p><p><strong>Exploration Data and Future Plans:</strong> Pegasus is committed to advancing its exploration projects and enhancing shareholder value. As part of these efforts, the Company intends to conduct the necessary work to create a resource estimate in accordance with the current CIM Definition Standards on Mineral Resources and Mineral Reserves. The exploration strategy includes twinning historical drill holes, a geological relog of old drill holes, and defining new drill targets. These activities are aimed at both expanding the known resources and discovering new mineralization zones.</p><figure class=\"image\" style=\"text-align:center;margin:0.9em auto;\" width=\"100%\"><img style=\"aspect-ratio:618/437;\" src=\"https://www.accesswire.com/imagelibrary/bf2642b6-0b5f-476b-80b9-171d16f061e2/886839/pegasus-map2-070924.jpg\" width=\"100%\" height=\"437\" /></figure><div style=\"clear: both\"> </div><div> </div><p><br />This integrated approach is expected to refine the geological model of the Jupiter Project and significantly contribute to the understanding and development of the Jupiter Project.</p><p><strong>Figure 2: Historical Drill Hole Locations</strong></p><p><strong>Resource Bonus and NSR Royalty</strong>:</p><p>As Pegasus establishes additional uranium resources on the Jupiter Project, the Company will pay the Vendor a Resource Bonus of USD $100,000.00 for every increment of 500,000 lbs of uranium up to 2,500,000 lbs, as discovered on the Jupiter Project. The first Resource Bonus payment will be due within 90 days from the date the initial Resource Calculation exceeding 475,000 pounds of uranium is issued. The vendor will retain the Net Smelter Return (NSR) royalty on the resource.</p><p><strong>Historical Overview of Uranium Mining in the San Rafael River (Tidwell Bottoms) District:</strong></p><p>The San Rafael River (Tidwell Bottoms) district, located in the Green River mining area in eastern Emery County, played a pivotal role in the history of uranium and vanadium production. Operating from around 1948 to the mid-1980s, this district emerged as a major U-V producer, ranking among the largest uranium producers in the state. The historical narrative of uranium mining in the Tidwell Mineral Belt, particularly within the district encompassing the Snow and Probe mines, reflects a significant era of mineral exploration and production. These mines, alongside others such as the Black Panther, Incline No. 14, and Sahara, were central to the region's economic development during this period.</p><p>The district's geological setting proved ideal for sandstone-hosted, trend-type uranium deposits, characterized by their peneconcordant nature and channel-controlled mineralization primarily within the upper sandstone sequence of the Salt Wash Member of the Upper Jurassic Morrison Formation. Atlas Minerals played a pivotal role in the district, operating the Snow and Probe mines until their closure in 1982. The Snow Mine, operated by Atlas Minerals, began production in 1973 and closed in 1982. It produced a substantial 650,292 pounds of U3O8 at an average grade of 0.188% U3O8. The Probe Mines commissioning is not directly mentioned in the source data, but it closed in 1982, yielding 293,985 pounds of U3O8 at an average grade of 0.186% U3O8, according to data compiled by Wilbanks in 1982. The Snow and Probe mines stood out as two of the largest and most productive in the district.</p><p>Continued exploration drilling in the late 1970s and early 1980s, particularly along the northeast extension of the Snow and Lucky Mines mineralization, led to the discovery of several new mineralized zones and deposits. One notable discovery was the Deep Gold deposit by Pioneer Uravan, which was identified between 1979 and 1981. This period saw the cessation of production with the closure of these two mines, marking the end of significant uranium mining activity in the area.</p><p>The Tidwell District presents unique challenges with poorly documented historical work. A good example is the Snow Mine's original resource estimates only used surface drilling data, but the actual production exceeded initial estimates by 455% in tons of ore and 281% in pounds of U3O8. This discrepancy between expected and actual yields underscores the challenges faced in uranium mining, as noted by Wilbanks in 1982, and was a common trend for uranium mineralization in the Green River area.</p><p>In summary, as quoted by Wilbanks (1982), &quot;In the past most orebodies mined in the Green River (Tidwell District) area have ultimately produced more pounds of U3O8 than calculated in original reserves.</p><p>In relation to the current transaction, Pegasus confirms that no finder's fee will be paid. Furthermore, it is important to note that there are no relationships involving any Non-Arm's Length Party between the Company, its insiders, and the Vendors of the asset. Additionally, no further information is required to be disclosed under MI 61-101 concerning this transaction. This statement ensures transparency and compliance with the necessary regulatory standards.</p><p><strong>NI 43-101 Disclosure</strong></p><p>The technical content of this news release has been reviewed and approved by Trevor Mills, P.G., SME-RM who is a Principal Geologist for Dahrouge Geological Consulting USA Ltd., and a Qualified Person under National Instrument 43-101, who has prepared and/or reviewed the content of this press release.</p><p>The results discussed in this document are historical. Pegasus Resources nor the qualified person have not performed sufficient work or data verification of the historical data. Although the historical results may not be reliable, the Company nevertheless believes that they provide an indication of the Property's potential and are relevant for any future exploration program.</p><p>Mineralization on adjacent Properties and may no be indicative of mineralization on Pegasus Resources Inc. Properties</p><p><strong>References:</strong></p><ul><li><p>UTAH MINERAL INDUSTRY ACTIVITY REVIEW 1981-82 - UTAH GEOLOGICAL AND MINERAL SURVEY a division of Utah Department of Natural Resources Circular 72 May 1984</p></li><li><p>(Atlas Minerals Engineering Department, 1982; Gordon, 1982; Wilbanks, 1982)</p></li><li><p>Gordon, Gail, 1982, Mine Shut Down Report - Probe and North Snow Mines - Date 7-22-82: Atlas Minerals Engineering Department Unpublished Company Report, 69 p</p></li><li><p>-Wilbanks, Larry, 1982, Closure Report - Atlas Minerals Probe and Snow Mines, Emery County, Utah: Atlas Minerals Unpublished Company Report, p. 56-72.</p></li></ul><p><strong>About Pegasus Resources Inc.</strong></p><p>Pegasus Resources Inc. is a diversified Junior Canadian Mineral Exploration Company with a focus on uranium, gold, and base metal properties in North America. The Company is also actively pursuing the right opportunity in other resources to enhance shareholder value. For additional information, please visit the Company at www.pegasusresourcesinc.com.</p><p>On Behalf of the Board of Directors:</p><p>Christian Timmins<br />President, CEO and Director<br />Pegasus Resources Inc.<br />700 - 838 West Hastings Street<br />Vancouver, BC V6C 0A6<br />PH: 1-403-597-3410</p><p>X: <a rel=\"nofollow\" href=\"https://pr.report/o20\">https://twitter.com/MrChris_Timmins</a><br />X: <a rel=\"nofollow\" href=\"https://pr.report/o21\">https://twitter.com/pegasusresinc</a><br />E: <a rel=\"nofollow\" href=\"mailto:info@pegasusresourcesinc.com\">info@pegasusresourcesinc.com</a></p><p>Neither the TSX Venture Exchange nor its Regulation Services Provider (as that term is defined in the policies of the TSX Venture Exchange) accept responsibility for the adequacy or accuracy of this release.</p><p><strong>Forward Looking Statements</strong></p><p>Statements included in this announcement, including statements concerning the Company's plans, intentions, and expectations, which are not historical in nature are intended to be, and are hereby identified as, &quot;forward-looking statements.&quot; Forward-looking statements may be identified by words including &quot;anticipates,&quot; &quot;believes,&quot; &quot;intends,&quot; &quot;estimates,&quot; &quot;expects&quot; and similar expressions. The Company cautions readers that forward-looking statements, including without limitation those relating to the Company's future operations and business prospects, are subject to certain risks and uncertainties that could cause actual results to differ materially from those indicated in the forward-looking statements.</p><p><strong>SOURCE: </strong>Pegasus Resources Inc.</p><br><br>View the original <a href='https://www.accesswire.com/886839/pegasus-resources-significantly-expands-land-package-by-securing-exclusive-rights-to-jupiter-uranium-project'>press release</a> on accesswire.com<br><br><br><br>View the original <a href='https://www.accesswire.com/886839/pegasus-resources-significantly-expands-land-package-by-securing-exclusive-rights-to-jupiter-uranium-project'>press release</a> on accesswire.com<br><br>",
    "search_terms": "Jupiter,Pegasus Resources Inc.,PEGA",
    "master_gid": 7949,
    "date": "2024-07-10T12:30:00.000Z",
    "tags": "USA|Utah||Uranium|Project Acquisition",
    "image_id": null,
    "hidden": false,
    "company_id": 220,
    "provider": "accesswire",
    "excerpt": "VANCOUVER, BC / ACCESSWIRE / July 10, 2024/Pegasus Resources Inc.(TSXV:PEGA)(Frankfurt:0QS0)(OTC PINKSLTFF) (the &quot;Company&quot; or &quot;Pegasus&quot;) is pleased to announce that on July 3, 2024 the Company finalized an agreement (the &quot;Agreement&quot;) with KD Prospect (the &quot;Vendor&quot;) to acquire an undivided 100% right, title, and interest in the Jupiter Project (&quot;Jupiter",
    "is_regulatory": false,
    "refined_tags": null,
    "ftp_filename": null,
    "company_name": "Pegasus Resources Inc.",
    "exchange": "TSXV",
    "root_ticker": "PEGA",
    "project_name": "Jupiter",
    "gid": 7949,
    "location": null,
    "plan_id": "companytier2",
    "description_text": "VANCOUVER, BC / ACCESSWIRE / July 10, 2024 / Pegasus Resources Inc. (TSXV:PEGA)(Frankfurt:0QS0)(OTC PINKSLTFF) (the \"Company\" or \"Pegasus\") is pleased to announce that on July 3, 2024 the Company finalized an agreement (the \"Agreement\") with KD Prospect (the \"Vendor\") to acquire an undivided 100% right, title, and interest in the Jupiter Project (\"Jupiter Project\"), a strategic uranium Project located in Emery County, Utah, USA. This acquisition is subject to the terms and conditions specified in the agreement. \"The acquisition of the Jupiter Project, along with our Energy Sands Project, presents an exceptional opportunity for Pegasus and our investors.\" stated CEO Chris Timmins, \"Energy Sands holds the potential for a discovery, supported by recent ground program findings and historical drilling data indicating a mineralized paleochannel. Meanwhile, Jupiter provides an advanced property with historical drilling, which will be instrumental in developing a future resource estimate. Together, these Projects offer a unique chance for investors to participate in both the development of a new resource and the excitement of a potential discovery.\" The Jupiter claim group is located 3 kilometers north of Energy Sands and consists of 48 unpatented claims situated in part, in sections 10 and 15, Township 21 S. Range 14 E. SLPM, Emery County, Utah. The claims occur in the Bureau of Land Management, and access is obtained over a well-maintained service road which joins I-70 near Green River, Utah. The Jupiter Project was previously held by Atlas Minerals from 1972 to 1983. During this period, the claim group consisted of 25 unpatented claims. Atlas Minerals conducted approximately 100+ drill holes on the Jupiter Project with the greatest density occurring in the vicinity of the northeast corner of section 15. The extensive drilling and exploration activities conducted by Atlas Minerals demonstrated significant potential, and the project was considered a viable mineral resource. Atlas Minerals was advancing the project towards full-scale mining before the collapse of the uranium market in the early 1980s. The historical drill logs reveal promising results, with notable uranium intercepts. Pegasus will utilize the valuable information provided to guide our exploration program. Our goal is to create a resource estimate in accordance with the current CIM Definition Standards on Mineral Resources and Mineral Reserves. The historical data underscores the project's potential for substantial uranium mineralization. Terms of the agreement: Issuance of Shares: Pegasus will issue 2,200,000 common shares (\"Consideration Shares\") to the Vendor within 10 business days following TSX Venture Exchange approval of the Agreement. Cash Payments: The Company will make a payment of $25,000 USD to the Vendor within 30 days of signing the Agreement. Additionally, subject to TSX Venture Exchange approval, a further payment of $75,000 USD will be made on or before the earlier of November 1, 2024, or 10 business days following the closing of a Private Placement. By the Company. Pegasus commits to conducting a drilling program totalling 1500 meters on the Jupiter Project within 30 days following the first anniversary of the Agreement. Upon completing these payments and satisfying all obligations outlined in the Agreement, Pegasus will have earned a 100% interest in the Jupiter Project. This interest is subject to Resource Bonuses (as defined below) and a Net Smelter Return Royalty in favour of the Vendor. Figure 1: Utah Property Map Exploration Data and Future Plans: Pegasus is committed to advancing its exploration projects and enhancing shareholder value. As part of these efforts, the Company intends to conduct the necessary work to create a resource estimate in accordance with the current CIM Definition Standards on Mineral Resources and Mineral Reserves. The exploration strategy includes twinning historical drill holes, a geological relog of old drill holes, and defining new drill targets. These activities are aimed at both expanding the known resources and discovering new mineralization zones. This integrated approach is expected to refine the geological model of the Jupiter Project and significantly contribute to the understanding and development of the Jupiter Project. Figure 2: Historical Drill Hole Locations Resource Bonus and NSR Royalty : As Pegasus establishes additional uranium resources on the Jupiter Project, the Company will pay the Vendor a Resource Bonus of USD $100,000.00 for every increment of 500,000 lbs of uranium up to 2,500,000 lbs, as discovered on the Jupiter Project. The first Resource Bonus payment will be due within 90 days from the date the initial Resource Calculation exceeding 475,000 pounds of uranium is issued. The vendor will retain the Net Smelter Return (NSR) royalty on the resource. Historical Overview of Uranium Mining in the San Rafael River (Tidwell Bottoms) District: The San Rafael River (Tidwell Bottoms) district, located in the Green River mining area in eastern Emery County, played a pivotal role in the history of uranium and vanadium production. Operating from around 1948 to the mid-1980s, this district emerged as a major U-V producer, ranking among the largest uranium producers in the state. The historical narrative of uranium mining in the Tidwell Mineral Belt, particularly within the district encompassing the Snow and Probe mines, reflects a significant era of mineral exploration and production. These mines, alongside others such as the Black Panther, Incline No. 14, and Sahara, were central to the region's economic development during this period. The district's geological setting proved ideal for sandstone-hosted, trend-type uranium deposits, characterized by their peneconcordant nature and channel-controlled mineralization primarily within the upper sandstone sequence of the Salt Wash Member of the Upper Jurassic Morrison Formation. Atlas Minerals played a pivotal role in the district, operating the Snow and Probe mines until their closure in 1982. The Snow Mine, operated by Atlas Minerals, began production in 1973 and closed in 1982. It produced a substantial 650,292 pounds of U3O8 at an average grade of 0.188% U3O8. The Probe Mines commissioning is not directly mentioned in the source data, but it closed in 1982, yielding 293,985 pounds of U3O8 at an average grade of 0.186% U3O8, according to data compiled by Wilbanks in 1982. The Snow and Probe mines stood out as two of the largest and most productive in the district. Continued exploration drilling in the late 1970s and early 1980s, particularly along the northeast extension of the Snow and Lucky Mines mineralization, led to the discovery of several new mineralized zones and deposits. One notable discovery was the Deep Gold deposit by Pioneer Uravan, which was identified between 1979 and 1981. This period saw the cessation of production with the closure of these two mines, marking the end of significant uranium mining activity in the area. The Tidwell District presents unique challenges with poorly documented historical work. A good example is the Snow Mine's original resource estimates only used surface drilling data, but the actual production exceeded initial estimates by 455% in tons of ore and 281% in pounds of U3O8. This discrepancy between expected and actual yields underscores the challenges faced in uranium mining, as noted by Wilbanks in 1982, and was a common trend for uranium mineralization in the Green River area. In summary, as quoted by Wilbanks (1982), \"In the past most orebodies mined in the Green River (Tidwell District) area have ultimately produced more pounds of U3O8 than calculated in original reserves. In relation to the current transaction, Pegasus confirms that no finder's fee will be paid. Furthermore, it is important to note that there are no relationships involving any Non-Arm's Length Party between the Company, its insiders, and the Vendors of the asset. Additionally, no further information is required to be disclosed under MI 61-101 concerning this transaction. This statement ensures transparency and compliance with the necessary regulatory standards. NI 43-101 Disclosure The technical content of this news release has been reviewed and approved by Trevor Mills, P.G., SME-RM who is a Principal Geologist for Dahrouge Geological Consulting USA Ltd., and a Qualified Person under National Instrument 43-101, who has prepared and/or reviewed the content of this press release. The results discussed in this document are historical. Pegasus Resources nor the qualified person have not performed sufficient work or data verification of the historical data. Although the historical results may not be reliable, the Company nevertheless believes that they provide an indication of the Property's potential and are relevant for any future exploration program. Mineralization on adjacent Properties and may no be indicative of mineralization on Pegasus Resources Inc. Properties References: UTAH MINERAL INDUSTRY ACTIVITY REVIEW 1981-82 - UTAH GEOLOGICAL AND MINERAL SURVEY a division of Utah Department of Natural Resources Circular 72 May 1984 (Atlas Minerals Engineering Department, 1982; Gordon, 1982; Wilbanks, 1982) Gordon, Gail, 1982, Mine Shut Down Report - Probe and North Snow Mines - Date 7-22-82: Atlas Minerals Engineering Department Unpublished Company Report, 69 p -Wilbanks, Larry, 1982, Closure Report - Atlas Minerals Probe and Snow Mines, Emery County, Utah: Atlas Minerals Unpublished Company Report, p. 56-72. About Pegasus Resources Inc. Pegasus Resources Inc. is a diversified Junior Canadian Mineral Exploration Company with a focus on uranium, gold, and base metal properties in North America. The Company is also actively pursuing the right opportunity in other resources to enhance shareholder value. For additional information, please visit the Company at www.pegasusresourcesinc.com. On Behalf of the Board of Directors: Christian Timmins President, CEO and Director Pegasus Resources Inc. 700 - 838 West Hastings Street Vancouver, BC V6C 0A6 PH: 1-403-597-3410 X: https://twitter.com/MrChris_Timmins X: https://twitter.com/pegasusresinc E: info@pegasusresourcesinc.com Neither the TSX Venture Exchange nor its Regulation Services Provider (as that term is defined in the policies of the TSX Venture Exchange) accept responsibility for the adequacy or accuracy of this release. Forward Looking Statements Statements included in this announcement, including statements concerning the Company's plans, intentions, and expectations, which are not historical in nature are intended to be, and are hereby identified as, \"forward-looking statements.\" Forward-looking statements may be identified by words including \"anticipates,\" \"believes,\" \"intends,\" \"estimates,\" \"expects\" and similar expressions. The Company cautions readers that forward-looking statements, including without limitation those relating to the Company's future operations and business prospects, are subject to certain risks and uncertainties that could cause actual results to differ materially from those indicated in the forward-looking statements. SOURCE: Pegasus Resources Inc. View the original press release on accesswire.com View the original press release on accesswire.com",
    "primary_commodity": "U"
  },
  "articleProject": {
    "gid": 7949,
    "project_name": "Jupiter",
    "location": null
  },
  "articleExchange": "TSXV",
  "articleCompanyId": 220,
  "articleTicker": "PEGA",
  "articleCompanyName": "Pegasus Resources Inc.",
  "allOtherCompanyProjects": [
    {
      "company_id": 220,
      "gid": 3902,
      "project_name": "Energy Sands",
      "location": "Utah, United States"
    },
    {
      "company_id": 220,
      "gid": 471,
      "project_name": "Punch Bowl (Icefield)",
      "location": "British Columbia, Canada"
    },
    {
      "company_id": 220,
      "gid": 2040,
      "project_name": "Pine Channel",
      "location": "Saskatchewan, Canada"
    },
    {
      "company_id": 220,
      "gid": 470,
      "project_name": "Gold Mountain (Icefield)",
      "location": "British Columbia, Canada"
    },
    {
      "company_id": 220,
      "gid": 472,
      "project_name": "Vertebrae Ridge (Icefield)",
      "location": "British Columbia, Canada"
    },
    {
      "company_id": 220,
      "gid": 7949,
      "project_name": "Jupiter",
      "location": null
    }
  ],
  "allOtherCompanyNews": [
    {
      "id": 107717,
      "company_id": 220,
      "title": "Pegasus Announces Shares for Debt Settlement",
      "link": null,
      "date": "2025-06-11T20:30:00.000Z",
      "hidden": false
    },
    {
      "id": -200614,
      "company_id": 220,
      "title": "Pegasus Completes Disposition of Icefield Property to Ashley Gold Corp.",
      "link": null,
      "date": "2025-05-13T12:30:00.000Z",
      "hidden": false
    },
    {
      "id": 100172,
      "company_id": 220,
      "title": "Pegasus Resources Receives TSXV Conditional Approval for Strategic Sale of Icefield Property to Ashley Gold",
      "link": null,
      "date": "2025-04-17T12:30:00.000Z",
      "hidden": false
    },
    {
      "id": -175572,
      "company_id": 220,
      "title": "Canadian Investment Regulatory Organization Trade Resumption - PEGA",
      "link": "https://contentapi.cision.com/api/v1.0/releases/20250320C2252",
      "date": "2025-03-20T16:22:00.000Z",
      "hidden": false
    },
    {
      "id": 91991,
      "company_id": 220,
      "title": "Pegasus Resources Inc. Enters Purchase and Sale Agreement with Ashley Gold Corp. for Icefield Property",
      "link": null,
      "date": "2025-03-20T16:00:00.000Z",
      "hidden": false
    },
    {
      "id": -175040,
      "company_id": 220,
      "title": "Canadian Investment Regulatory Organization Trading Halt - PEGA",
      "link": "https://contentapi.cision.com/api/v1.0/releases/20250320C1433",
      "date": "2025-03-20T15:08:00.000Z",
      "hidden": false
    },
    {
      "id": 91691,
      "company_id": 220,
      "title": "Pegasus Resources Secures 75% Ownership of Drill-Ready Jupiter Uranium Project in Utah",
      "link": null,
      "date": "2025-03-18T12:30:00.000Z",
      "hidden": false
    },
    {
      "id": 91010,
      "company_id": 220,
      "title": "Pegasus Resources Secures Key Uranium Asset with Successful Private Placement",
      "link": "https://golddiscovery.com/legacy/user/news_details/743628-pegaca-pegasus-resources-secures-key-uranium-asset-with-successful-private-placement",
      "date": "2025-03-12T19:30:00.000Z",
      "hidden": false
    },
    {
      "id": 89611,
      "company_id": 220,
      "title": "Pegasus Resources Announces Private Placement for Up to C$375,000",
      "link": "https://www.accessnewswire.com/newsroom/en/metals-and-mining/pegasus-resources-announces-private-placement-for-up-to-c375000-992980",
      "date": "2025-02-27T19:00:00.000Z",
      "hidden": false
    },
    {
      "id": 86031,
      "company_id": 220,
      "title": "Pegasus Resources Provides Update on Drilling Plans and Market Strategy",
      "link": "https://www.accessnewswire.com/newsroom/en/metals-and-mining/pegasus-resources-provides-update-on-drilling-plans-and-market-strategy-976933",
      "date": "2025-01-30T18:00:00.000Z",
      "hidden": false
    }
  ]
}
