{
  "article": {
    "id": 73545,
    "link": "https://www.globenewswire.com/news-release/2024/10/02/2956826/0/en/Blue-Moon-Announces-Sale-of-Yava-Project.html",
    "title": "Blue Moon Announces Sale of Yava Project",
    "description": "<p align=\"justify\">VANCOUVER, British Columbia, Oct.  02, 2024  (GLOBE NEWSWIRE) -- <strong>Blue Moon Metals Inc. (TSXV: MOON; OTCQB: BMOOF) (the “Company”) </strong>is pleased to announce that it has agreed to sell its Yava project located in Nunavut to Honey Badger Silver Inc. (TSXV: TUF). Pursuant to the definitive agreement and subject to customary closing conditions, the Company will receive 4,250,000 common shares of Honey Badger with an implied value of approximately $340,000 (being $0.08 per share reflecting a five-day moving average) (the “<strong>Transaction</strong>”). This consideration will represent approximately 6.5% of the total issued and outstanding shares of Honey Badger. Honey Badger is a silver focused entity with a significant and growing portfolio of high-quality silver projects. The consideration will be subject to the customary four-month hold period and the Company has agreed to a twelve-month lock-up period.</p>  <p align=\"justify\">Patrick McGrath, the CEO of the ‎Company, stated “The Yava project offers an exciting silver exploration opportunity and Blue Moon will continue to participate in its future through its material ownership in Honey Badger. The Yava project is considered non-core for the Company, so we are happy to monetize the asset and continue to focus on developing our Blue Moon deposit in the United States. We are currently evaluating the next steps for Blue Moon including the commencing of a Preliminary Economic Assessment.”</p>  <p align=\"justify\"><strong>About Blue Moon Metals</strong></p>  <p align=\"justify\">Blue Moon Metals is advancing its Blue Moon polymetallic deposit which contains zinc, gold, silver and copper. The property is well located with existing local infrastructure including paved highways three miles from site; a hydroelectric power generation facility a few miles from the site, a three-hour drive to the Oakland port and a four-hour drive to the service centre of Reno. Zinc is currently on the USGS list of metals critical to the US economy and national security. More information is available on the company’s website (<a href=\"https://www.globenewswire.com/Tracker?data=tcaivLMYt4YXREO64DLYtn1Ix7WRyJxQZGUxOvWhKlA6SZ1nqOzXOnH1NOyWdNv9K7BZrw2y1apUcR4rQlcmfRIdpe_2TGhJ_sXWGTXL37k=\" rel=\"nofollow\" target=\"_blank\" title=\"\"><u>www.bluemoonmetals.com</u></a>).</p>  <p align=\"justify\">For more information, please contact:</p>  <p>Patrick McGrath, CEO <br />1-832-499-6009<br /><a href=\"https://www.globenewswire.com/Tracker?data=d27kQGZLbUqClFM_jHscdmFnu7DMui1dM7Gyz4oX0saKwooo5k24YloQL2Z56u9Tn8cqEHkGmExFlMXZc9lBcjT8G_0jSm274-joi_tDyppaGLnH_rl1ws7nkGj2Ylc6\" rel=\"nofollow\" target=\"_blank\" title=\"\"><u>pmcgrath@bluemoonmining.com</u></a></p>  <p align=\"justify\"><em>Neither</em> <em>the</em> <em>TSX</em> <em>Venture</em> <em>Exchange</em> <em>nor</em> <em>its</em> <em>Regulation</em> <em>Services</em> <em>Provider</em> <em>(as</em> <em>that</em> <em>term</em> <em>is</em> <em>defined in</em> <em>the</em> <em>policies</em> <em>of</em> <em>the TSX Venture Exchange) accepts responsibility for the adequacy or accuracy of this release.</em></p>  <p align=\"justify\"><em>This press release contains certain forward-looking statements within the meaning of applicable securities law. Forward-looking statements are frequently characterized by words such as \"plan\", \"expect\", \"project\", \"intend\", \"believe\", \"anticipate\", \"estimate\" and other similar words,</em> <em>or statements that certain events or conditions \"may\" or \"will\" occur such as completion of the Transaction. Forward-looking statements are based on the opinions and estimates of management at the date the statements</em> <em>are made and are subject to a variety of risks and uncertainties and other factors that could cause actual events or results to differ materially from those projected in the forward-looking statements. The Company cannot assure</em> <em>that</em> <em>actual</em> <em>results</em> <em>will</em> <em>be</em> <em>consistent</em> <em>with</em> <em>these</em> <em>forward-looking</em> <em>statements.</em> <em>They</em> <em>are</em> <em>made</em> <em>as</em> <em>of</em> <em>the</em> <em>date</em> <em>hereof and are subject to change and the Company assumes no obligation to revise or update them to reflect new circumstances,</em> <em>except</em> <em>as</em> <em>required by</em> <em>law.</em> <em>Prospective</em> <em>investors</em> <em>should not</em> <em>place undue</em> <em>reliance on forward looking statements. These factors include the inherent risks involved in the resource industry.</em></p>  <br /><img src='https://ml.globenewswire.com/media/ODQ3YmU5OWMtZDIzMS00YzYyLWI2MmYtNWE5ZTZiNjc4MzA1LTEyNjg3MDE=/tiny/Blue-Moon-Metals-Inc.png' referrerpolicy='no-referrer-when-downgrade' />",
    "search_terms": "Blue Moon,Blue Moon Metals Corp.,MOON",
    "master_gid": 4038,
    "date": "2024-10-02T11:15:00.000Z",
    "tags": "Canada|||Silver|Project Acquisition",
    "image_id": null,
    "hidden": false,
    "company_id": 1156,
    "provider": "globenewswire",
    "excerpt": "VANCOUVER, British Columbia, Oct. 02, 2024 (GLOBE NEWSWIRE) --Blue Moon Metals Inc. (TSXV: MOON; OTCQB: BMOOF) (the “Company”)is pleased to announce that it has agreed to sell its Yava project located in Nunavut to Honey Badger Silver Inc. (TSXV: TUF). Pursuant to the definitive agreement and subject to customary closing",
    "is_regulatory": false,
    "refined_tags": [
      "Financials"
    ],
    "ftp_filename": null,
    "company_name": "Blue Moon Metals Corp.",
    "exchange": "TSXV",
    "root_ticker": "MOON",
    "project_name": "Blue Moon",
    "gid": 4038,
    "location": "California, United States",
    "plan_id": null,
    "description_text": "VANCOUVER, British Columbia, Oct.  02, 2024  (GLOBE NEWSWIRE) -- Blue Moon Metals Inc. (TSXV: MOON; OTCQB: BMOOF) (the “Company”) is pleased to announce that it has agreed to sell its Yava project located in Nunavut to Honey Badger Silver Inc. (TSXV: TUF). Pursuant to the definitive agreement and subject to customary closing conditions, the Company will receive 4,250,000 common shares of Honey Badger with an implied value of approximately $340,000 (being $0.08 per share reflecting a five-day moving average) (the “ Transaction ”). This consideration will represent approximately 6.5% of the total issued and outstanding shares of Honey Badger. Honey Badger is a silver focused entity with a significant and growing portfolio of high-quality silver projects. The consideration will be subject to the customary four-month hold period and the Company has agreed to a twelve-month lock-up period. Patrick McGrath, the CEO of the ‎Company, stated “The Yava project offers an exciting silver exploration opportunity and Blue Moon will continue to participate in its future through its material ownership in Honey Badger. The Yava project is considered non-core for the Company, so we are happy to monetize the asset and continue to focus on developing our Blue Moon deposit in the United States. We are currently evaluating the next steps for Blue Moon including the commencing of a Preliminary Economic Assessment.” About Blue Moon Metals Blue Moon Metals is advancing its Blue Moon polymetallic deposit which contains zinc, gold, silver and copper. The property is well located with existing local infrastructure including paved highways three miles from site; a hydroelectric power generation facility a few miles from the site, a three-hour drive to the Oakland port and a four-hour drive to the service centre of Reno. Zinc is currently on the USGS list of metals critical to the US economy and national security. More information is available on the company’s website ( www.bluemoonmetals.com ). For more information, please contact: Patrick McGrath, CEO 1-832-499-6009 pmcgrath@bluemoonmining.com Neither the TSX Venture Exchange nor its Regulation Services Provider (as that term is defined in the policies of the TSX Venture Exchange) accepts responsibility for the adequacy or accuracy of this release. This press release contains certain forward-looking statements within the meaning of applicable securities law. Forward-looking statements are frequently characterized by words such as \"plan\", \"expect\", \"project\", \"intend\", \"believe\", \"anticipate\", \"estimate\" and other similar words, or statements that certain events or conditions \"may\" or \"will\" occur such as completion of the Transaction. Forward-looking statements are based on the opinions and estimates of management at the date the statements are made and are subject to a variety of risks and uncertainties and other factors that could cause actual events or results to differ materially from those projected in the forward-looking statements. The Company cannot assure that actual results will be consistent with these forward-looking statements. They are made as of the date hereof and are subject to change and the Company assumes no obligation to revise or update them to reflect new circumstances, except as required by law. Prospective investors should not place undue reliance on forward looking statements. These factors include the inherent risks involved in the resource industry.",
    "primary_commodity": "Zn"
  },
  "articleProject": {
    "gid": 4038,
    "project_name": "Blue Moon",
    "location": "California, United States"
  },
  "articleExchange": "TSXV",
  "articleCompanyId": 1156,
  "articleTicker": "MOON",
  "articleCompanyName": "Blue Moon Metals Corp.",
  "allOtherCompanyProjects": [
    {
      "company_id": 1156,
      "gid": 4038,
      "project_name": "Blue Moon",
      "location": "California, United States"
    },
    {
      "company_id": 1156,
      "gid": 9394,
      "project_name": "Nussir",
      "location": "Norway"
    },
    {
      "company_id": 1156,
      "gid": 9395,
      "project_name": "NSG (Sulitjelma)",
      "location": "Norway"
    }
  ],
  "allOtherCompanyNews": [
    {
      "id": 108102,
      "company_id": 1156,
      "title": "Blue Moon Metals Completes First Blast on Nussir Access Portal Ahead of Schedule",
      "link": null,
      "date": "2025-06-16T10:45:00.000Z",
      "hidden": false
    },
    {
      "id": 107058,
      "company_id": 1156,
      "title": "Blue Moon Metals Nussir Copper Project Receives Special Strategic Project Status from the European Union",
      "link": null,
      "date": "2025-06-05T10:45:00.000Z",
      "hidden": false
    },
    {
      "id": 103984,
      "company_id": 1156,
      "title": "Blue Moon Metals Announces Start of Mobilization for Nussir Underground Development, Follow on Equity Investment of C$1.13M From Mining Contractor and Engagement of Market Maker    ",
      "link": null,
      "date": "2025-05-08T10:45:00.000Z",
      "hidden": false
    },
    {
      "id": 100258,
      "company_id": 1156,
      "title": "Blue Moon Metals Appoints Boi Linh Doig as Vice-President, Mining",
      "link": null,
      "date": "2025-04-21T10:45:00.000Z",
      "hidden": false
    },
    {
      "id": 99804,
      "company_id": 1156,
      "title": " Blue Moon Metals Announces Graduation to the OTCQX Market",
      "link": null,
      "date": "2025-04-15T11:53:15.000Z",
      "hidden": false
    },
    {
      "id": 99763,
      "company_id": 1156,
      "title": "Blue Moon Metals Secures Congressional Support and BLM Approval for an Underground Exploration Program at the Blue Moon Critical Minerals Project in Mariposa County, California",
      "link": null,
      "date": "2025-04-15T10:30:00.000Z",
      "hidden": false
    },
    {
      "id": 99614,
      "company_id": 1156,
      "title": "Blue Moon Announces Reinstatement of Quotation on the OTCQB Following Transformational Acquisitions",
      "link": null,
      "date": "2025-04-14T10:45:00.000Z",
      "hidden": false
    },
    {
      "id": 99338,
      "company_id": 1156,
      "title": " Blue Moon Announces Maiden NI 43-101 Sulitjelma Resource of 17 Mt @ 1.06% Cu & 0.21% Zn in the Inferred Category Supporting VMS District Growth Potential ",
      "link": null,
      "date": "2025-04-10T10:30:00.000Z",
      "hidden": false
    },
    {
      "id": 91655,
      "company_id": 1156,
      "title": "Blue Moon Metals: Norwegian Ministry of Trade, Industry and Fisheries Upholds the Extended Deadline for Start-Up of Operations Pursuant to Nussir's Operating License in Final Possible Appeal",
      "link": null,
      "date": "2025-03-18T10:45:00.000Z",
      "hidden": false
    },
    {
      "id": 91155,
      "company_id": 1156,
      "title": "Blue Moon Announces Resumption of Trading, Graduation to Tier 1 on the TSX Venture Exchange and Completion of Share Consolidation Following Transformational Acquisitions",
      "link": null,
      "date": "2025-03-13T22:24:57.000Z",
      "hidden": false
    }
  ]
}
