{
  "article": {
    "id": 69723,
    "link": "https://www.accesswire.com/viewarticle.aspx?id=909364&lang=en",
    "title": "Athena Gold Corporation Completes Acquisition of the Historic Blue Dick Mine and Significantly Expands Its Flagship Excelsior Springs Gold Project in Nevada",
    "description": "<p><strong id=\"dateline\">VACAVILLE, CA / ACCESSWIRE / August 29, 2024 / </strong>Athena Gold Corporation (OTCQB:AHNR)(CSE:ATHA) <strong>(&quot;Athena&quot;</strong> or the &quot;<strong>Company&quot;)</strong> is pleased to announce that it has finalized its previously announced purchase and sale agreement dated June 1, 2024 (the &quot;Purchase Agreement&quot;) with Silver Reserve Inc. to acquire a 100% interest in 11 unpatented BLM claims covering approximately 89 hectares (220 acres) known as the <strong>Blue Dick Mine</strong> and related mineral claims (&quot;BD&quot;), together with certain technical data relating to the mining claims (the &quot;Purchased Assets&quot;). Total consideration paid was US $45,000 in cash and a 3% NSR on the acquired claims. This acquisition expands our flagship Excelsior Springs Project located in the Walker Lane Trend, Nevada. area to 1,675 hectares (4,140 acres).</p><p>The Blue Dick Mine was discovered in the 1870s and was reported as a high-grade producer of silver along with gold and base metals. According to Jack Quade, who visited the Blue Dick mine in 1982 and collected three samples on behalf of the Nevada Bureau of Mines and Geology, &quot;<i>The (Blue Dick) Mine is located near a thrust intersection of the Campito and Deep Springs Formations of lower Cambrian both of which host ore at the mine</i>.&quot; Mineralized material was transported from the adit by rail and then down Palmetto Mountain via a tram for direct shipment or processing on-site.</p><p>Quade's sample #1125<sup>i</sup> collected from a highly silicified quartzite along the tram and inside the main Blue Dick adit contained 33 ppm Gold, 1500 ppm (43.75 ounces per ton) silver, .15% Cu, 2% lead and over 1% Zinc<sup>ii</sup>.</p><p>Sampling by Silver Reserve consulting geologist Richard Milne in June 2007<sup>iii</sup> also confirmed anomalous precious and base metal values. Fourteen of the sixteen rock-chip samplesi collected by Milne (BD/M-1 through BD/M-16) are on the BD claims being acquired or on claims already held by Athena.</p><p>Highlights are listed below:</p><ul style=\"list-style-type:disc;\"><li><p>Sample BD/M-1 contained 6.4 ppm Gold, 2340 ppm Silver (69 ounces per ton),1.175% Copper and 1.34% Lead.</p></li><li><p>Sample BD/M-12 contained 92.6 ppm Silver, 25.5% Copper and 6.92% Lead.</p></li><li><p>Sample BD/M-13 contained 30 ppm Silver, 4.28% Copper and 1.37% Lead.</p></li><li><p>Sample BD/M-15 contained 49 ppm Silver and 2.06% Copper.</p></li><li><p>Sample BD/M-16 contained 7.45 ppm of Gold with .03% Copper.</p></li></ul><p>No exploration drilling or geophysical surveys have been completed on the BD claims. Additional rock and soil data acquired with the BD claims will be further analyzed and integrated into our exploration database.</p><p>John Power, President of Athena, commented &quot;<i>This is an exciting opportunity as it consolidates the heart of the Palmetto Mountain Trend (Figure 1) for the first time as part of our Excelsior Springs Project. It also provides new prospective gold, copper, and silver targets to our expanding land package. Palmetto Peak was once the end of our claim block but is now the 50-yard line with the historic Buster mine and Western Slope to the west of the peak and Lida Belle and Blue Dick to the southeast</i>.</p><p><i>&quot;Our immediate focus remains on finalizing our Phase 4 exploration plans at Excelsior Springs as we build upon the success of our Phase 1 - Phase 3 RC drilling programs completed in 2022 and 2023&quot; </i>added Power.</p><figure class=\"image image_resized\" style=\"width:100%;text-align:center;margin:0.9em auto\" width=\"100%\"><img style=\"aspect-ratio:1274/979;\" src=\"https://www.accesswire.com/imagelibrary/d1d6f723-9d9d-4725-a8d7-de5318b674b5/909364/image.png\" width=\"100%\" height=\"979\" /></figure><div style=\"clear: both\"> </div><div> </div><div> </div><p style=\"text-align:center;\"><br /><i><strong>Figure 1. Map of Palmetto Mountain Trend depicting the location of historic mines now controlled by Athena as part of its flagship Excelsior Springs Project. This trend connects the historic Palmetto and Lida Mining Districts and was the location of several reported high-grade gold and silver occurrences during the district's discovery boom in the 1870s.</strong></i></p><p><strong>Timeline of District Scale Consolidation</strong></p><p>Upon the successful close of this transaction, Athena will have completed a series of transactions over a multi-year period to consolidate all the important historic mines (Buster, Lida Belle and Blue Dick) on Palmetto Mountain (See Figures 1 and 2).</p><ul style=\"list-style-type:disc;\"><li><p>Athena acquired the Excelsior Springs project in 2021 from Nubian Resources Ltd. with its 140 unpatented BLM claims and a lease on two patented claims. This claim group included the historic Buster Mine and Western Slope (aka Upper or Tripod shaft) mines.</p></li><li><p>In 2022, Athena purchased the two patented claims (Fortunatus and Prout) that had been held under an expiring lease.</p></li><li><p>In Q4-2022, Athena staked an additional 51 unpatented BLM claims to cover the southeastern slope of Palmetto Mountain. These claims included the historic Lida Belle high grade gold occurrence and mine.</p></li><li><p>Reconnaissance sampling in the Lida Belle area returned high-grade gold and silver results. (<a rel=\"nofollow\" href=\"https://pr.report/21ew\">See the Company's news release dated October 5, 2023 here</a>).</p></li><li><p>Also, in Q4-2022, the Company staked claims to the border of the BD claims being acquired (See Figure 2).</p></li></ul><figure class=\"image image_resized\" style=\"width:100%;text-align:center;margin:0.9em auto\" width=\"100%\"><img style=\"aspect-ratio:1586/1238;\" src=\"https://www.accesswire.com/imagelibrary/a5a7d50d-43c2-46bd-9d99-b834d95878c4/909364/image.png\" width=\"100%\" height=\"1238\" /></figure><div style=\"clear: both\"> </div><div> </div><div> </div><div> </div><p style=\"text-align:center;\"><strong>Figure 2. </strong><i><strong>Map of Athena's Excelsior Springs Project depicting the original claim block and additional claims staked and acquired between 2022 - 2024.</strong></i></p><p><strong>Blue Dick Mineralization</strong></p><p>Mineralization occurs in quartz or calcite veins mostly hosted by limestone (Stewart and Albers 1972). The Deep Spring and Palmetto Formations are the main host rocks for precious and base metal mineralization on the property. Copper, gold, silver and lead mineralization sampled by Milne (2007) is found locally in thrust faults and high-angle northeast-southwest structures.</p><p>There are several important targets for future exploration including:</p><ul style=\"list-style-type:disc;\"><li><p>Sediment hosted bulk Au tonnage targets in the Palmetto formation.</p></li><li><p>Additional high-grade vein mineralization from known veins and undiscovered veins in the carbonates with two targets of Gold, Silver &amp; Copper and Silver, Gold &amp; Base Metals</p></li></ul><p><strong>Technical Information</strong></p><p>The data disclosed in this news release is related to historical exploration sampling results. The reader is cautioned that the historical results are based on prior data and reports prepared by previous property owners and other sources. Athena has not undertaken any independent investigation of the work at Blue Dick, nor has it independently analyzed the results of the historical exploration work to verify the results. The reader is cautioned not to treat them, or any part of them, as current and that a qualified person has not done sufficient work to verify the results and that they may not form a reliable guide to future results. No independent QA/QC protocols are known for these samples and as such analytical results may be unreliable. Athena's current and future exploration work includes verification of the historical data through further exploration.</p><p><strong>About Our Flagship Excelsior Springs Project</strong></p><p>The Excelsior Springs Project (the &quot;Project&quot;) lies within the prolific Walker Lane tectonic trend, a large region of northwest-trending, strike-slip fault zones that host a significant number of precious metal deposits having very strong structural control for mineralization. The Project contains numerous prospect pits, trenches, roads, surface sampling sites and 113 drill holes to date within a 300m X 3,000m wide (1,000 foot-wide and 10,000-foot-long east-west trending zone of shearing and alteration. Underground workings on the two patented claims within the Project had unverified, historical production of 19,200 troy ounces from 18,000 tons averaging 37.3 grams/ton Au (1.2 oz/ton Au).</p><p>The Walker Lane trend is experiencing a major resurgence of intense and successful exploration and development. The Walker Lane has had total production of 20+ million ounces (&quot;Moz&quot;) of gold, including the following deposits at Goldfields (5 Moz), Bullfrog (2 Moz), Tonopah (2 Moz), Mineral Ridge (1.5 Moz) and Comstock (8 Moz Au, 200 Moz Ag). Readers are cautioned that the Company has no interest in or right to acquire any interest in any of the above-mentioned properties, other than Excelsior Springs (the &quot;Project&quot;), and that the mineral deposits, and the results of any exploration or mining thereof, on adjacent or similar properties are not indicative of potential mineral deposits on the Project or any potential exploitation thereof.</p><p>Gold mineralization discovered at the Project to date occurs in quartz veins, stock-works, and silicified zones in hornfels and calc-silicate altered country rock and is generally close to porphyry dykes. The best grades and thicknesses discovered recently were found in oxidized and altered sedimentary rock immediately above porphyry dykes intruded along preexisting east- and east-northeast trending faults. The mineralized stock-work vein zones are shallow and have a relatively flat plunge, making them potentially amenable to open pit mining methods.</p><p>Based on the results of previous drilling programs, the Project has the potential with to host one or more shallow gold deposits amenable to open pit mining, along with deeper, higher grade feeder zones that may be found and could be mined by underground methods. In the opinion of management and its consultants, the Project is very promising and further exploration has the potential to expand the known mineralization and establish additional mineralized zones.</p><p><strong>Qualified Person</strong></p><p>John Hiner, SME Registered Member and Washington State Licensed Geologist is a qualified person as defined by NI 43-101 and has reviewed the scientific and technical information that forms the basis of this press release and has approved the disclosure herein. Mr. Hiner is not independent of the Company.</p><p><strong>About Athena Gold Corporation</strong></p><p>Athena is engaged in the business of mineral exploration and the acquisition of mineral property assets. Its objective is to locate and develop economic precious and base metal properties of merit and to conduct additional exploration drilling and studies on the Project.</p><p>For further information about Athena Gold Corporation and our Excelsior Springs Gold project, please visit <a rel=\"nofollow\" href=\"https://pr.report/21ex\">www.athenagoldcorp.com</a>.</p><p>On Behalf of the Board of Directors</p><p>John C. Power<br />Chief Executive Officer and President</p><p><strong>For further information, please contact:</strong></p><p>Phone: John C. Power, 707-291-6198<br />Email: <a rel=\"nofollow\" href=\"mailto:info@athenagoldcorp.com\">info@athenagoldcorp.com</a></p><p>Jason Libenson<br />President and CCO<br />Castlewood Capital Corporation<br />(647)-534-9884<br />Email: <a rel=\"nofollow\" href=\"mailto:jason@castlewoodcapital.ca\">jason@castlewoodcapital.ca</a></p><p><i><strong>Forward Looking Statements</strong></i></p><p><i>This press release contains forward-looking statements and forward-looking information (collectively, &quot;forward-looking statements&quot;) within the meaning of applicable Canadian and U.S. securities laws. All statements, other than statements of historical fact, included herein including, without limitation, statements regarding future exploration plans and the completion of a phase 2 drill program at the Project, future results from exploration, and the anticipated business plans and timing of future activities of the Company, are forward-looking statements. Although the Company believes that such statements are reasonable, it can give no assurance that such expectations will prove to be correct. Forward-looking statements are typically identified by words such as: &quot;believes&quot;, &quot;will&quot;, &quot;expects&quot;, &quot;anticipates&quot;, &quot;intends&quot;, &quot;estimates&quot;, &quot;plans&quot;, &quot;may&quot;, &quot;should&quot;, &quot;potential&quot;, &quot;scheduled&quot;, or variations of such words and phrases and similar expressions, which, by their nature, refer to future events or results that may, could, would, might or will occur or be taken or achieved. In making the forward-looking statements in this press release, the Company has applied several material assumptions, including without limitation, that there will be investor interest in future financings, market fundamentals will result in sustained precious metals demand and prices, the receipt of any necessary permits, licenses and regulatory approvals in connection with the future exploration and development of the Company's projects in a timely manner, QAQC procedures at the Project were followed, the availability of financing on suitable terms for the exploration and development of the Company's projects and the Company's ability to comply with environmental, health and safety laws.</i></p><p><i>The Company cautions investors that any forward-looking statements by the Company are not guarantees of future results or performance, and that actual results may differ materially from those in forward-looking statements as a result of various factors, including, operating and technical difficulties in connection with mineral exploration and development activities, actual results of exploration activities, the estimation or realization of mineral reserves and mineral resources, the inability of the Company to obtain the necessary financing required to conduct its business and affairs, as currently contemplated, the timing and amount of estimated future production, the costs of production, capital expenditures, the costs and timing of the development of new deposits, requirements for additional capital, future prices of precious metals, changes in general economic conditions, changes in the financial markets and in the demand and market price for commodities, lack of investor interest in future financings, accidents, labor disputes and other risks of the mining industry, delays in obtaining governmental approvals, permits or financing or in the completion of development or construction activities, risks relating to epidemics or pandemics such as COVID-19, including the impact of COVID-19 on the Company's business, financial condition and results of operations, changes in laws, regulations and policies affecting mining operations, title disputes, the inability of the Company to obtain any necessary permits, consents, approvals or authorizations, including of the Canadian Securities Exchange, the timing and possible outcome of any pending litigation, environmental issues and liabilities, and other factors and risks that are discussed in the Company's periodic filings with the SEC and disclosed in the final long form prospectus of the Company dated August 31, 2021.</i></p><p><i>Readers are cautioned not to place undue reliance on forward-looking statements. The Company undertakes no obligation to update any of the forward-looking statements in this press release or incorporated by reference herein</i></p><div><div id=\"edn1\"><p><sup>i </sup>The historical sampling and information disclosed in this press release is related to historical exploration results. The reader is cautioned that the historical sampling and information are based on prior data and reports previously prepared by third parties without the involvement of the Company. Athena has not undertaken any independent investigation of the historical sampling and information, nor has it independently analyzed the results of the historical sampling and exploration work in order to verify the results</p></div><div id=\"edn2\"><p style=\"text-align:justify;\"><sup>ii </sup>Semi-Quantitative Spectrographic Analysis by Branch Exploration Research, USGS, Denver, Colorado. Gold analysis through Atomic-Adsorption Analysis.</p></div><div id=\"edn3\"><p><sup>iii</sup> ALS Chemex Certificate of Analysis issued to Silver Reserve Corp dated July 13, 2007.</p><p><strong>SOURCE: </strong>Athena Gold Corp</p></div></div><br><br>View the original <a href='https://www.accesswire.com/909364/athena-gold-corporation-completes-acquisition-of-the-historic-blue-dick-mine-and-significantly-expands-its-flagship-excelsior-springs-gold-project-in-nevada'>press release</a> on accesswire.com<br><br>",
    "search_terms": "Excelsior Springs,Athena Gold Corporation,ATHA",
    "master_gid": 2640,
    "date": "2024-08-29T11:00:00.000Z",
    "tags": "|||Gold,Silver|Project Acquisition",
    "image_id": null,
    "hidden": false,
    "company_id": 1112,
    "provider": "accesswire",
    "excerpt": "VACAVILLE, CA / ACCESSWIRE / August 29, 2024 /Athena Gold Corporation (OTCQB:AHNR)(CSE:ATHA)(&quot;Athena&quot;or the &quot;Company&quot;)is pleased to announce that it has finalized its previously announced purchase and sale agreement dated June 1, 2024 (the &quot;Purchase Agreement&quot;) with Silver Reserve Inc. to acquire a 100% interest in 11 unpatented BLM claims covering",
    "is_regulatory": false,
    "refined_tags": [
      "Mergers & Acquisitions"
    ],
    "ftp_filename": null,
    "company_name": "Athena Gold Corporation",
    "exchange": "CSE",
    "root_ticker": "ATHA",
    "project_name": "Excelsior Springs",
    "gid": 2640,
    "location": "Nevada",
    "plan_id": null,
    "description_text": "VACAVILLE, CA / ACCESSWIRE / August 29, 2024 / Athena Gold Corporation (OTCQB:AHNR)(CSE:ATHA) (\"Athena\" or the \" Company\") is pleased to announce that it has finalized its previously announced purchase and sale agreement dated June 1, 2024 (the \"Purchase Agreement\") with Silver Reserve Inc. to acquire a 100% interest in 11 unpatented BLM claims covering approximately 89 hectares (220 acres) known as the Blue Dick Mine and related mineral claims (\"BD\"), together with certain technical data relating to the mining claims (the \"Purchased Assets\"). Total consideration paid was US $45,000 in cash and a 3% NSR on the acquired claims. This acquisition expands our flagship Excelsior Springs Project located in the Walker Lane Trend, Nevada. area to 1,675 hectares (4,140 acres). The Blue Dick Mine was discovered in the 1870s and was reported as a high-grade producer of silver along with gold and base metals. According to Jack Quade, who visited the Blue Dick mine in 1982 and collected three samples on behalf of the Nevada Bureau of Mines and Geology, \" The (Blue Dick) Mine is located near a thrust intersection of the Campito and Deep Springs Formations of lower Cambrian both of which host ore at the mine .\" Mineralized material was transported from the adit by rail and then down Palmetto Mountain via a tram for direct shipment or processing on-site. Quade's sample #1125 i collected from a highly silicified quartzite along the tram and inside the main Blue Dick adit contained 33 ppm Gold, 1500 ppm (43.75 ounces per ton) silver, .15% Cu, 2% lead and over 1% Zinc ii . Sampling by Silver Reserve consulting geologist Richard Milne in June 2007 iii also confirmed anomalous precious and base metal values. Fourteen of the sixteen rock-chip samplesi collected by Milne (BD/M-1 through BD/M-16) are on the BD claims being acquired or on claims already held by Athena. Highlights are listed below: Sample BD/M-1 contained 6.4 ppm Gold, 2340 ppm Silver (69 ounces per ton),1.175% Copper and 1.34% Lead. Sample BD/M-12 contained 92.6 ppm Silver, 25.5% Copper and 6.92% Lead. Sample BD/M-13 contained 30 ppm Silver, 4.28% Copper and 1.37% Lead. Sample BD/M-15 contained 49 ppm Silver and 2.06% Copper. Sample BD/M-16 contained 7.45 ppm of Gold with .03% Copper. No exploration drilling or geophysical surveys have been completed on the BD claims. Additional rock and soil data acquired with the BD claims will be further analyzed and integrated into our exploration database. John Power, President of Athena, commented \" This is an exciting opportunity as it consolidates the heart of the Palmetto Mountain Trend (Figure 1) for the first time as part of our Excelsior Springs Project. It also provides new prospective gold, copper, and silver targets to our expanding land package. Palmetto Peak was once the end of our claim block but is now the 50-yard line with the historic Buster mine and Western Slope to the west of the peak and Lida Belle and Blue Dick to the southeast . \"Our immediate focus remains on finalizing our Phase 4 exploration plans at Excelsior Springs as we build upon the success of our Phase 1 - Phase 3 RC drilling programs completed in 2022 and 2023\" added Power. Figure 1. Map of Palmetto Mountain Trend depicting the location of historic mines now controlled by Athena as part of its flagship Excelsior Springs Project. This trend connects the historic Palmetto and Lida Mining Districts and was the location of several reported high-grade gold and silver occurrences during the district's discovery boom in the 1870s. Timeline of District Scale Consolidation Upon the successful close of this transaction, Athena will have completed a series of transactions over a multi-year period to consolidate all the important historic mines (Buster, Lida Belle and Blue Dick) on Palmetto Mountain (See Figures 1 and 2). Athena acquired the Excelsior Springs project in 2021 from Nubian Resources Ltd. with its 140 unpatented BLM claims and a lease on two patented claims. This claim group included the historic Buster Mine and Western Slope (aka Upper or Tripod shaft) mines. In 2022, Athena purchased the two patented claims (Fortunatus and Prout) that had been held under an expiring lease. In Q4-2022, Athena staked an additional 51 unpatented BLM claims to cover the southeastern slope of Palmetto Mountain. These claims included the historic Lida Belle high grade gold occurrence and mine. Reconnaissance sampling in the Lida Belle area returned high-grade gold and silver results. ( See the Company's news release dated October 5, 2023 here ). Also, in Q4-2022, the Company staked claims to the border of the BD claims being acquired (See Figure 2). Figure 2. Map of Athena's Excelsior Springs Project depicting the original claim block and additional claims staked and acquired between 2022 - 2024. Blue Dick Mineralization Mineralization occurs in quartz or calcite veins mostly hosted by limestone (Stewart and Albers 1972). The Deep Spring and Palmetto Formations are the main host rocks for precious and base metal mineralization on the property. Copper, gold, silver and lead mineralization sampled by Milne (2007) is found locally in thrust faults and high-angle northeast-southwest structures. There are several important targets for future exploration including: Sediment hosted bulk Au tonnage targets in the Palmetto formation. Additional high-grade vein mineralization from known veins and undiscovered veins in the carbonates with two targets of Gold, Silver & Copper and Silver, Gold & Base Metals Technical Information The data disclosed in this news release is related to historical exploration sampling results. The reader is cautioned that the historical results are based on prior data and reports prepared by previous property owners and other sources. Athena has not undertaken any independent investigation of the work at Blue Dick, nor has it independently analyzed the results of the historical exploration work to verify the results. The reader is cautioned not to treat them, or any part of them, as current and that a qualified person has not done sufficient work to verify the results and that they may not form a reliable guide to future results. No independent QA/QC protocols are known for these samples and as such analytical results may be unreliable. Athena's current and future exploration work includes verification of the historical data through further exploration. About Our Flagship Excelsior Springs Project The Excelsior Springs Project (the \"Project\") lies within the prolific Walker Lane tectonic trend, a large region of northwest-trending, strike-slip fault zones that host a significant number of precious metal deposits having very strong structural control for mineralization. The Project contains numerous prospect pits, trenches, roads, surface sampling sites and 113 drill holes to date within a 300m X 3,000m wide (1,000 foot-wide and 10,000-foot-long east-west trending zone of shearing and alteration. Underground workings on the two patented claims within the Project had unverified, historical production of 19,200 troy ounces from 18,000 tons averaging 37.3 grams/ton Au (1.2 oz/ton Au). The Walker Lane trend is experiencing a major resurgence of intense and successful exploration and development. The Walker Lane has had total production of 20+ million ounces (\"Moz\") of gold, including the following deposits at Goldfields (5 Moz), Bullfrog (2 Moz), Tonopah (2 Moz), Mineral Ridge (1.5 Moz) and Comstock (8 Moz Au, 200 Moz Ag). Readers are cautioned that the Company has no interest in or right to acquire any interest in any of the above-mentioned properties, other than Excelsior Springs (the \"Project\"), and that the mineral deposits, and the results of any exploration or mining thereof, on adjacent or similar properties are not indicative of potential mineral deposits on the Project or any potential exploitation thereof. Gold mineralization discovered at the Project to date occurs in quartz veins, stock-works, and silicified zones in hornfels and calc-silicate altered country rock and is generally close to porphyry dykes. The best grades and thicknesses discovered recently were found in oxidized and altered sedimentary rock immediately above porphyry dykes intruded along preexisting east- and east-northeast trending faults. The mineralized stock-work vein zones are shallow and have a relatively flat plunge, making them potentially amenable to open pit mining methods. Based on the results of previous drilling programs, the Project has the potential with to host one or more shallow gold deposits amenable to open pit mining, along with deeper, higher grade feeder zones that may be found and could be mined by underground methods. In the opinion of management and its consultants, the Project is very promising and further exploration has the potential to expand the known mineralization and establish additional mineralized zones. Qualified Person John Hiner, SME Registered Member and Washington State Licensed Geologist is a qualified person as defined by NI 43-101 and has reviewed the scientific and technical information that forms the basis of this press release and has approved the disclosure herein. Mr. Hiner is not independent of the Company. About Athena Gold Corporation Athena is engaged in the business of mineral exploration and the acquisition of mineral property assets. Its objective is to locate and develop economic precious and base metal properties of merit and to conduct additional exploration drilling and studies on the Project. For further information about Athena Gold Corporation and our Excelsior Springs Gold project, please visit www.athenagoldcorp.com . On Behalf of the Board of Directors John C. Power Chief Executive Officer and President For further information, please contact: Phone: John C. Power, 707-291-6198 Email: info@athenagoldcorp.com Jason Libenson President and CCO Castlewood Capital Corporation (647)-534-9884 Email: jason@castlewoodcapital.ca Forward Looking Statements This press release contains forward-looking statements and forward-looking information (collectively, \"forward-looking statements\") within the meaning of applicable Canadian and U.S. securities laws. All statements, other than statements of historical fact, included herein including, without limitation, statements regarding future exploration plans and the completion of a phase 2 drill program at the Project, future results from exploration, and the anticipated business plans and timing of future activities of the Company, are forward-looking statements. Although the Company believes that such statements are reasonable, it can give no assurance that such expectations will prove to be correct. Forward-looking statements are typically identified by words such as: \"believes\", \"will\", \"expects\", \"anticipates\", \"intends\", \"estimates\", \"plans\", \"may\", \"should\", \"potential\", \"scheduled\", or variations of such words and phrases and similar expressions, which, by their nature, refer to future events or results that may, could, would, might or will occur or be taken or achieved. In making the forward-looking statements in this press release, the Company has applied several material assumptions, including without limitation, that there will be investor interest in future financings, market fundamentals will result in sustained precious metals demand and prices, the receipt of any necessary permits, licenses and regulatory approvals in connection with the future exploration and development of the Company's projects in a timely manner, QAQC procedures at the Project were followed, the availability of financing on suitable terms for the exploration and development of the Company's projects and the Company's ability to comply with environmental, health and safety laws. The Company cautions investors that any forward-looking statements by the Company are not guarantees of future results or performance, and that actual results may differ materially from those in forward-looking statements as a result of various factors, including, operating and technical difficulties in connection with mineral exploration and development activities, actual results of exploration activities, the estimation or realization of mineral reserves and mineral resources, the inability of the Company to obtain the necessary financing required to conduct its business and affairs, as currently contemplated, the timing and amount of estimated future production, the costs of production, capital expenditures, the costs and timing of the development of new deposits, requirements for additional capital, future prices of precious metals, changes in general economic conditions, changes in the financial markets and in the demand and market price for commodities, lack of investor interest in future financings, accidents, labor disputes and other risks of the mining industry, delays in obtaining governmental approvals, permits or financing or in the completion of development or construction activities, risks relating to epidemics or pandemics such as COVID-19, including the impact of COVID-19 on the Company's business, financial condition and results of operations, changes in laws, regulations and policies affecting mining operations, title disputes, the inability of the Company to obtain any necessary permits, consents, approvals or authorizations, including of the Canadian Securities Exchange, the timing and possible outcome of any pending litigation, environmental issues and liabilities, and other factors and risks that are discussed in the Company's periodic filings with the SEC and disclosed in the final long form prospectus of the Company dated August 31, 2021. Readers are cautioned not to place undue reliance on forward-looking statements. The Company undertakes no obligation to update any of the forward-looking statements in this press release or incorporated by reference herein i The historical sampling and information disclosed in this press release is related to historical exploration results. The reader is cautioned that the historical sampling and information are based on prior data and reports previously prepared by third parties without the involvement of the Company. Athena has not undertaken any independent investigation of the historical sampling and information, nor has it independently analyzed the results of the historical sampling and exploration work in order to verify the results ii Semi-Quantitative Spectrographic Analysis by Branch Exploration Research, USGS, Denver, Colorado. Gold analysis through Atomic-Adsorption Analysis. iii ALS Chemex Certificate of Analysis issued to Silver Reserve Corp dated July 13, 2007. SOURCE: Athena Gold Corp View the original press release on accesswire.com",
    "primary_commodity": "Au"
  },
  "articleProject": {
    "gid": 2640,
    "project_name": "Excelsior Springs",
    "location": "Nevada"
  },
  "articleExchange": "CSE",
  "articleCompanyId": 1112,
  "articleTicker": "ATHA",
  "articleCompanyName": "Athena Gold Corporation",
  "allOtherCompanyProjects": [
    {
      "company_id": 1112,
      "gid": 2640,
      "project_name": "Excelsior Springs",
      "location": "Nevada"
    }
  ],
  "allOtherCompanyNews": [
    {
      "id": 107894,
      "company_id": 1112,
      "title": "Athena Gold Grants Stock Options",
      "link": "https://app.quotemedia.com/data/downloadFiling?webmasterId=104408&ref=684b5d50a88c9a58ae7aaba1&type=PDFC&formType=002-002-001089-003001&formDescription=News+release&dateFiled=2025-06-12",
      "date": "2025-06-12T23:05:52.000Z",
      "hidden": false
    },
    {
      "id": 106518,
      "company_id": 1112,
      "title": "Athena Gold Provides Option on Excelsior Springs and Kicks off 2025 Field Season at Laird Lake",
      "link": null,
      "date": "2025-06-02T11:00:00.000Z",
      "hidden": false
    },
    {
      "id": 105540,
      "company_id": 1112,
      "title": "Athena Gold Extends Closing Of Private Placement",
      "link": "https://app.quotemedia.com/data/downloadFiling?webmasterId=104408&ref=682f2e39a5731f21bd306001&type=PDFC&formType=002-002-001089-003001&formDescription=News+release&dateFiled=2025-05-22",
      "date": "2025-05-22T14:01:29.000Z",
      "hidden": false
    },
    {
      "id": 104630,
      "company_id": 1112,
      "title": "Athena Reports Results From 2024 Prospecting Program at Excelsior Springs, Outlines New Targets, and Expands Land Package",
      "link": null,
      "date": "2025-05-14T12:00:00.000Z",
      "hidden": false
    },
    {
      "id": 103705,
      "company_id": 1112,
      "title": "Athena Gold Announces Resumption of Trading and New Ticker Symbol on OTCQB",
      "link": null,
      "date": "2025-05-06T19:55:00.000Z",
      "hidden": false
    },
    {
      "id": 101911,
      "company_id": 1112,
      "title": "Athena Gold Closes Oversubscribed Flow-Through Financing",
      "link": null,
      "date": "2025-04-28T20:45:00.000Z",
      "hidden": false
    },
    {
      "id": -197688,
      "company_id": 1112,
      "title": "ATHENA GOLD UPSIZES FLOW-THROUGH PRIVATE PLACEMENT, ANNOUNCES CONCURRENT HARD DOLLAR UNIT OFFERING",
      "link": "https://app.quotemedia.com/data/downloadFiling?webmasterId=104408&ref=68065d9542e70815dd3da2d1&type=PDFC&formType=002-002-001089-003001&formDescription=News+release&dateFiled=2025-04-21",
      "date": "2025-04-21T08:00:37.000Z",
      "hidden": false
    },
    {
      "id": 100159,
      "company_id": 1112,
      "title": "Athena Announces 2025 Plans for Laird Lake Project in Red Lake, Ontario, and Provides Update on Nevada Projects",
      "link": null,
      "date": "2025-04-17T12:00:00.000Z",
      "hidden": false
    },
    {
      "id": 100049,
      "company_id": 1112,
      "title": "Athena Gold Completes Redomiciliation To Canada",
      "link": null,
      "date": "2025-04-16T18:30:00.000Z",
      "hidden": false
    },
    {
      "id": 102227,
      "company_id": 1112,
      "title": "Athena Gold Announces $500,000 Flow-Through Private Placement",
      "link": "https://app.quotemedia.com/data/downloadFiling?webmasterId=104408&ref=67f4364d8d8acc69d84e17d6&type=PDFC&formType=002-002-001089-003001&formDescription=News+release&dateFiled=2025-04-07",
      "date": "2025-04-07T13:32:13.000Z",
      "hidden": false
    }
  ]
}
