{
  "article": {
    "id": 71890,
    "link": "https://www.thenewswire.com/press-releases?id=1k98FG18D",
    "title": "Adamera Acquires New Gold Project - Drilling Expected To Begin In October",
    "description": "<table style='width:fit-content; border: none;'><tr style='background: none;'><td colspan='10' style='padding: 0; margin: 0; border: none; background: none;' valign='bottom'><a target='_blank' href='https://www.adamera.com/'><img src=\"https://www.thenewswire.com/data/tnw/clients/logos/LymFV9RL.png?t=1537923535\" alt=\"Adamera Minerals Corp.\" /></a></td></tr><tr style='background: none;'><td style='width: 34px; padding: 0; margin: 0; border: none; background: none;' valign='bottom'><a target='_blank' href='https://thenewswire.com/api/apps/tnw/r?i=LymFV9RL&amp;m=twi'><img src=\"https://www.thenewswire.com/data/tnw/img/twi.png\" /></a></td><td style='width: 34px; padding: 0; margin: 0; border: none; background: none;' valign='bottom'><a target='_blank' href='https://thenewswire.com/api/apps/tnw/r?i=LymFV9RL&amp;m=you'><img src=\"https://www.thenewswire.com/data/tnw/img/you.png\" /></a></td><td style='padding: 0; margin: 0; border: none; background: none;'></td></tr></table>\n\n\n \n\n<p style='text-align:justify; '>\n<span style='font-weight:bold; '>Vancouver, British Columbia, September 19, 2024 – </span><span style='font-weight:bold; '>TheNewswire</span><span style='font-weight:bold; '> – </span><span style='font-weight:bold; '>Adamera Minerals Corp. (“Adamera” or the “Company”) (TSX-V: ADZ; OTC: DDNFF</span><span style=''>) has acquired the rights to explore the Flag Hill South gold property just south of Adamera’s Flag Hill Gold Property near the town of Republic in Washington State. </span>\n</p>\n\n\n\n<p style='text-align:justify; '>\n<span style=''>Adamera has identified, mapped and sampled five individual epithermal quartz veins on the property to date. One vein, the C3 vein, exposed in a shallow adit, measures 3m in width. On surface it has been traced for more than 200m. A rock sample collected from the adit assayed 9.1 g/t gold over 1.2m. There is no evidence suggesting this vein or any other veins on the property have ever been tested by drilling. The veins exhibit textures and geochemistry suggesting they represent high-level emplacement of a low sulphidation epithermal gold system. Adamera’s upcoming drill program will target potential high-grade gold in “boiling zone” portions of the system which is believed to be preserved at shallow depths.</span>\n</p>\n\n\n\n<p style='text-align:justify; '>\n<span style=''>The project was acquired from a private landowner. Under the terms of the agreement, Adamera has the right to explore the property by way of a two-year lease at a cost of USD$5,000 per year. Adamera has the right to purchase the entire property for USD$1 million by the end of the third year in two payments. The landowner is entitled to a 2% production royalty which can be purchased for a total of USD$1.5 million. Access and logistics for the project are excellent. The elevation of the project is 800m above sea level. At this elevation drilling can be completed year-round.</span>\n</p>\n\n\n\n<p style='text-align:left; '>\n<span style=''><span style=''>The property is in the Republic Gold District, the largest gold producing area in Washington State.</span></span> <span style=''><span style=''>Reported district production is +4 million ounces of gold (average grade 24g/t) and 15.8 million ounces of silver (average grade 110 g/t)</span></span> <span style=''><span style=''>from epithermal veins similar to those mapped on Adamera’s Flag Hill and Flag Hill South projects.</span></span> <span style=''><span style=''>Mining in this district ceased in 1996 when</span></span> <span style=''><span style=''>Hecla Mining</span></span> <span style=''><span style=''>suspended</span></span> <span style=''><span style=''>operations.</span></span> <span style=''><span style=''>The property is approximately</span></span> <span style=''><span style=''>10 km from the Kinross Kettle River Gold Mill</span></span> <span style=''><span style=''>and minutes from the historic town of Republic.</span></span>\n</p>\n\n\n\n<p style='text-align:justify; '>\n<span style=''>Drilling is planned to begin in early October 2024 as government drill permits are not required for early stage drilling on private land. The objective of the program is to test multiple veins at depth.</span>\n</p>\n\n\n\n<p style='text-align:justify; '>\n<span style='font-style:italic; '>“This project provides Adamera with a low entry cost opportunity to drill untested epithermal veins within a large high-grade gold district. It complements our nearby Flag Hill property where Adamera is seeking BLM approval for a spring 2025 drilling program. It amazes me that such veins were prospected in the early days but not drilled by the existing producer. Due to the project’s excellent logistics, it can be drilled at low cost, year-round without having to attain drill permits. The financing currently being completed will fund the first phase of drilling,</span><span style=''>” says Mark Kolebaba President and CEO of Adamera.</span>\n</p>\n\n\n\n<p style='text-align:left; '>\n<span style=''>Jim Ebisch, P.Geol is the Qualified Person as defined by National Instrument 43-101 reviewing the data in this release. The historical information in this release is from private reports and has not been verified by the Company, however, it appears to have been completed under standard best practices consistent with the time and appears to be of reasonable quality.</span>\n</p>\n\n\n\n<p style='text-align:justify; '>\n<span style='font-weight:bold; '>About Adamera</span>\n</p>\n\n\n\n<p style='text-align:justify; '>\n<span style=''>Adamera Minerals Corp. is exploring for a high-grade gold deposit near Republic Washington. This area has reportedly produced 8 million ounces of gold averaging 14.5 g/t. Adamera is the dominant regional explorer in the area. </span>\n</p>\n\n\n\n<p style='text-align:left; '>\n<span style=''>On behalf of the Board of Directors,<br />\nMark Kolebaba<br />\nPresident &amp; CEO </span>\n</p>\n\n\n\n<p style='text-align:left; '>\n<span style=''>For additional information please contact: </span>\n</p>\n\n\n\n<p style='text-align:left; '>\n<span style=''>Email: </span><span style=''>info@Adamera.com</span><span style=''><br />\nWebsite: </span><span style=''>www.Adamera.com</span><span style=''> <br />\nPhone: (604) 689-2010</span>\n</p>\n\n\n\n<p style='text-align:justify; '>\n<span style='font-style:italic; '>The TSX Venture Exchange has not reviewed and does not accept responsibility for the adequacy or accuracy of this release. Statements in this press release, other than purely historical information, including statements relating to the Company’s future plans and objectives or expected results, may include forward-looking statements. Forward-looking statements are based on numerous assumptions and are subject to all of the risks and uncertainties inherent in resource exploration and development. As a result, actual results may vary materially from those described in the forward-looking statements.</span>\n</p>\n\n\n\n<p>Copyright (c) 2024 TheNewswire - All rights reserved.</p>\n",
    "search_terms": "Flag Hill,Adamera Minerals Corp.,ADZ",
    "master_gid": 8597,
    "date": "2024-09-19T11:00:00.000Z",
    "tags": "USA|Washington||Gold|Planned Drilling,Project Acquisition",
    "image_id": null,
    "hidden": false,
    "company_id": 1020,
    "provider": "thenewswire",
    "excerpt": "Vancouver, British Columbia, September 19, 2024 –TheNewswire–Adamera Minerals Corp. (“Adamera” or the “Company”) (TSX-V: ADZ; OTC: DDNFF) has acquired the rights to explore the Flag Hill South gold property just south of Adamera’s Flag Hill Gold Property near the town of Republic in Washington State.Adamera has identified, mapped and sampled",
    "is_regulatory": false,
    "refined_tags": [],
    "ftp_filename": null,
    "company_name": "Adamera Minerals Corp.",
    "exchange": "TSXV",
    "root_ticker": "ADZ",
    "project_name": "Flag Hill",
    "gid": 8597,
    "location": null,
    "plan_id": null,
    "description_text": "Vancouver, British Columbia, September 19, 2024 – TheNewswire – Adamera Minerals Corp. (“Adamera” or the “Company”) (TSX-V: ADZ; OTC: DDNFF ) has acquired the rights to explore the Flag Hill South gold property just south of Adamera’s Flag Hill Gold Property near the town of Republic in Washington State. Adamera has identified, mapped and sampled five individual epithermal quartz veins on the property to date. One vein, the C3 vein, exposed in a shallow adit, measures 3m in width. On surface it has been traced for more than 200m. A rock sample collected from the adit assayed 9.1 g/t gold over 1.2m. There is no evidence suggesting this vein or any other veins on the property have ever been tested by drilling. The veins exhibit textures and geochemistry suggesting they represent high-level emplacement of a low sulphidation epithermal gold system. Adamera’s upcoming drill program will target potential high-grade gold in “boiling zone” portions of the system which is believed to be preserved at shallow depths. The project was acquired from a private landowner. Under the terms of the agreement, Adamera has the right to explore the property by way of a two-year lease at a cost of USD$5,000 per year. Adamera has the right to purchase the entire property for USD$1 million by the end of the third year in two payments. The landowner is entitled to a 2% production royalty which can be purchased for a total of USD$1.5 million. Access and logistics for the project are excellent. The elevation of the project is 800m above sea level. At this elevation drilling can be completed year-round. The property is in the Republic Gold District, the largest gold producing area in Washington State. Reported district production is +4 million ounces of gold (average grade 24g/t) and 15.8 million ounces of silver (average grade 110 g/t) from epithermal veins similar to those mapped on Adamera’s Flag Hill and Flag Hill South projects. Mining in this district ceased in 1996 when Hecla Mining suspended operations. The property is approximately 10 km from the Kinross Kettle River Gold Mill and minutes from the historic town of Republic. Drilling is planned to begin in early October 2024 as government drill permits are not required for early stage drilling on private land. The objective of the program is to test multiple veins at depth. “This project provides Adamera with a low entry cost opportunity to drill untested epithermal veins within a large high-grade gold district. It complements our nearby Flag Hill property where Adamera is seeking BLM approval for a spring 2025 drilling program. It amazes me that such veins were prospected in the early days but not drilled by the existing producer. Due to the project’s excellent logistics, it can be drilled at low cost, year-round without having to attain drill permits. The financing currently being completed will fund the first phase of drilling, ” says Mark Kolebaba President and CEO of Adamera. Jim Ebisch, P.Geol is the Qualified Person as defined by National Instrument 43-101 reviewing the data in this release. The historical information in this release is from private reports and has not been verified by the Company, however, it appears to have been completed under standard best practices consistent with the time and appears to be of reasonable quality. About Adamera Adamera Minerals Corp. is exploring for a high-grade gold deposit near Republic Washington. This area has reportedly produced 8 million ounces of gold averaging 14.5 g/t. Adamera is the dominant regional explorer in the area. On behalf of the Board of Directors, Mark Kolebaba President & CEO For additional information please contact: Email: info@Adamera.com Website: www.Adamera.com Phone: (604) 689-2010 The TSX Venture Exchange has not reviewed and does not accept responsibility for the adequacy or accuracy of this release. Statements in this press release, other than purely historical information, including statements relating to the Company’s future plans and objectives or expected results, may include forward-looking statements. Forward-looking statements are based on numerous assumptions and are subject to all of the risks and uncertainties inherent in resource exploration and development. As a result, actual results may vary materially from those described in the forward-looking statements. Copyright (c) 2024 TheNewswire - All rights reserved.",
    "primary_commodity": "Au"
  },
  "articleProject": {
    "gid": 8597,
    "project_name": "Flag Hill",
    "location": null
  },
  "articleExchange": "TSXV",
  "articleCompanyId": 1020,
  "articleTicker": "ADZ",
  "articleCompanyName": "Adamera Minerals Corp.",
  "allOtherCompanyProjects": [
    {
      "company_id": 1020,
      "gid": 3315,
      "project_name": "Lamefoot South",
      "location": "Washington, United States"
    },
    {
      "company_id": 1020,
      "gid": 4541,
      "project_name": "South Hedley",
      "location": "British Columbia, Canada"
    },
    {
      "company_id": 1020,
      "gid": 2305,
      "project_name": "Buckhorn 2.0",
      "location": "Washington, USA"
    },
    {
      "company_id": 1020,
      "gid": 8597,
      "project_name": "Flag Hill",
      "location": null
    }
  ],
  "allOtherCompanyNews": [
    {
      "id": 89429,
      "company_id": 1020,
      "title": "Adamera Intersects Gold and Silver In First Three Drill Holes at Flag Hill South, Washington State.",
      "link": "https://www.thenewswire.com/press-releases?id=1BQPFKVO3",
      "date": "2025-02-27T12:30:00.000Z",
      "hidden": false
    },
    {
      "id": -162824,
      "company_id": 1020,
      "title": "Adamera Minerals Grants Stock Options",
      "link": "https://www.thenewswire.com/press-releases?id=1AMqFarxK",
      "date": "2024-12-31T00:25:00.000Z",
      "hidden": false
    },
    {
      "id": 82790,
      "company_id": 1020,
      "title": "Adamera Completes Initial Three Core Drill Holes In Washington State Gold Program",
      "link": "https://www.thenewswire.com/press-releases?id=1LmPFdWOG",
      "date": "2024-12-23T13:00:00.000Z",
      "hidden": false
    },
    {
      "id": 81410,
      "company_id": 1020,
      "title": "Adamera Closes Final Tranche Of Financing",
      "link": "https://www.thenewswire.com/press-releases?id=1kVGF5b6Q",
      "date": "2024-12-09T22:00:00.000Z",
      "hidden": false
    },
    {
      "id": 79647,
      "company_id": 1020,
      "title": "Adamera Closes First Tranche of Financing",
      "link": "https://www.thenewswire.com/press-releases?id=1kogFvN9Y",
      "date": "2024-11-21T22:00:00.000Z",
      "hidden": false
    },
    {
      "id": 77926,
      "company_id": 1020,
      "title": "Adamera Financing",
      "link": "https://www.thenewswire.com/press-releases?id=1AD4Fg84G",
      "date": "2024-11-06T13:30:00.000Z",
      "hidden": false
    },
    {
      "id": 75569,
      "company_id": 1020,
      "title": "Adamera Begins Drilling on Flag Hill South Gold Property",
      "link": "https://www.thenewswire.com/press-releases?id=1kZaFze8V",
      "date": "2024-10-22T12:30:00.000Z",
      "hidden": false
    },
    {
      "id": 74199,
      "company_id": 1020,
      "title": "Adamera to Drill New Flag Hill South Gold Property",
      "link": "https://www.thenewswire.com/press-releases?id=1L5PFv4Kl",
      "date": "2024-10-09T11:00:00.000Z",
      "hidden": false
    },
    {
      "id": 72718,
      "company_id": 1020,
      "title": "Adamera Announced September 2024 Financing Fully Subscribed",
      "link": "https://www.thenewswire.com/press-releases?id=1BglFWdKg",
      "date": "2024-09-26T15:45:00.000Z",
      "hidden": false
    },
    {
      "id": 71890,
      "company_id": 1020,
      "title": "Adamera Acquires New Gold Project - Drilling Expected To Begin In October",
      "link": "https://www.thenewswire.com/press-releases?id=1k98FG18D",
      "date": "2024-09-19T11:00:00.000Z",
      "hidden": false
    }
  ]
}
