{
  "article": {
    "id": 53955,
    "link": "https://www.newsfilecorp.com/release/209422/Great-Eagle-Gold-Commits-US-18376904-for-MultiMillion-Ounce-NI-43101-Certified-GoldSilver-Deposit-in-California",
    "title": "Great Eagle Gold Commits US $18,376,904 for Multi-Million Ounce NI 43-101 Certified Gold-Silver Deposit in California",
    "description": "<img src=\"https://api.newsfilecorp.com/newsinfo/209422/367\" id=\"367\" width=\"2\" height=\"2\" style=\"width: 1px;  height: 1px;border: 0px solid;\" /><p><b>Burnaby, British Columbia--(Newsfile Corp. - May 16, 2024) - Great Eagle Gold Corp. (CSE: GEGC) (FSE: GI8) (\"Great Eagle\") </b>is pleased to announce the signing of a binding letter of intent (\"LOI\") with Teras Resources Inc. (\"Teras\") to acquire 100% of the subsurface mineral rights pertaining to a U.S. Patented Land Claim package, located in Imperial County, California, collectively known as the Cahuilla gold project. Great Eagle has agreed to pay an immediate US $50,000 standstill payment to Teras.</p><p>Cahuilla is a historic gold deposit well-known within the gold mining industry. It has undergone extensive exploration since the 1980s, involving seven different mining companies including major gold producers such as Homestake, Newmont, Kennecott, and most recently, Teras Resources. Teras alone has invested more than $26 million in the property.</p><p>Great Eagle CEO and Director, Andrew Fletcher, declared emphatically, \"Over the past several months, we've scrutinized dozens of U.S. Patented Land Claims, all boasting NI 43-101 certified gold resources. However, it was the Cahuilla gold project that captured our full attention and enthusiasm. This marquee gold project seamlessly aligns with every criterion set forth by the International NatGold Council for tokenization alongside New York-based OroEx Corp. With its perpetual title protection, absence of ongoing state fees or taxes, and fully transferable title, the Cahuilla gold project represents the ideal acquisition for us. We are thrilled with this landmark purchase-it fully meets all our expectations.\"</p><p>The 1,680-acre Cahuilla gold project contains a multi-million ounce, tokenization-ready deposit of certified gold and silver resources, as detailed in a National Instrument 43-101 (NI 43-101) technical report. This NI 43-101 report certifies:</p><ul><li>1,261,364 ounces of indicated gold resources.</li><li>14,336,659 ounces of indicated silver resources.</li><li>74,870 ounces of inferred gold resources.</li><li>685,520 ounces of inferred silver resources.</li></ul><p>The Cahuilla gold project straddles two land packages, being subdivided into two separate gold/silver deposits, with each deposit pertaining to a two-phase acquisition deal. The first phase acquisition (<b>\"Phase 1\"</b>) is a binding agreement that Teras is in a position to sell to Great Eagle for US $8,616,660. The second phase (<b>\"Phase 2\"</b>) Great Eagle has agreed to purchase for US $9,760,243. <b>The total agreed purchase price for the entire Cahuilla gold project is US $18,376,904.</b></p><p>However, Great Eagle is only able to purchase Phase 1 at this time, as Teras is still in the process of negotiating the severability of subsurface rights from surface rights with the other partners to the land pertaining to the Phase 2 transaction. Great Eagle Gold is confident Teras will successfully complete the Phase 2 acquisition negotiations; however, in the meantime, the Teras Resources technical team, together with the Great Eagle Gold technical team, have agreed to split the total gold deposit into two distinct subdivisions and to allocate the respective portions of the overall gold and silver resources delineated in the NI 43-101 report to their respective acquisition phase, respectively, with separate mineral rights titles pertaining to each Phase independent of the other. The geological 3D modeling and resource allocation process involves oversight and confirmation by Qualified Persons as defined by National Instrument 43-101- Standards of Disclosure for Mineral Projects.</p><p><b>The Phase 1 Mineral Rights purchase price of US $8,616,660 breaks down as follows:</b></p><ul><li>592,841 ounces of indicated gold resources, valued at US $12.50 per ounce, at a cost of US $7,410,513.</li><li>6,594,863 ounces of indicated silver resources, which at a 90:1 gold-silver ratio, equals 73,276 ounces of gold equivalent indicated resources, valued at US $12.50 per ounce, at a cost of $915,953.</li><li>35,189 ounces of inferred gold resources, valued at US $7.50 per ounce, at a cost of US $263,918.</li><li>315,339 ounces of inferred silver resources, which at a 90:1 gold-silver ratio, equals 3,504 ounces of gold equivalent inferred resources, valued at US $7.50 per ounce, at a cost of US $26,278.</li></ul><p><b>The Phase 2 Mineral Rights purchase price of US $9,760,243 breaks down as follows:</b></p><ul><li>668,523 ounces of indicated gold resources, valued at US $12.50 per ounce, at a cost of US $8,356,538.</li><li>7,741,796 ounces of indicated silver resources, which at a 90:1 gold-silver ratio, equals 86,020 ounces of gold equivalent indicated resources, valued at US $12.50 per ounce, at a cost of $1,075,249.</li><li>39,681 ounces of inferred gold resources, valued at US $7.50 per ounce, at a cost of US $297,608.</li><li>370,181 ounces of inferred silver resources, which at a 90:1 gold-silver ratio, equals 4,113 ounces of gold equivalent inferred resources, valued at US $7.50 per ounce, at a cost of US $30,848.</li></ul><p><b>Financial Terms</b></p><p>The parties have agreed to enter into a Definitive Agreement for the acquisition within thirty days, with a proposed closing date for the transaction scheduled for July 15, 2024, subject to the completion of satisfactory due diligence and compliance with all required regulatory requirements. If the transaction does not close by July 15, 2024 as a result of any action or inaction of Great Eagle, Great Eagle shall pay Teras a late closing penalty of $50,000, which payment shall be credited towards the initial Phase 1 purchase payment.</p><p>In addition, Great Eagle has agreed to pay a finder's fee consisting of 10% of the consideration payable for the Phase 1 acquisition of the Cahuilla gold project. This fee will be payable in three installments according to the same percentages outlined in the property payment schedule below. The finder's fee can be paid in cash and/or common shares, at the election of the Company.</p><p>Following the execution of the Definitive Agreement, scheduled for June 15th, 2024, Teras will receive 20% of the total purchase price of the resource pertaining to the Phase 1 Mineral Rights (US $1,723,332) within 30 days. An additional 30% of the purchase price (US $2,584,998) will be due within 180 days of the Definitive Agreement, with the remaining 50% (US $4,308,331) payable on or before 12 months from the Definitive Agreement date.</p><p>In the event that Great Eagle Gold is delayed in making any scheduled payment as established in the Binding Letter of Intent, a cure period of 30 days will be granted to address the delayed payment. During this period, an interest penalty, which will be specified in the Definitive Agreement, will be applied. Should Great Eagle fail to fulfill any payment obligation on or before the expiration of the Cure Period, it will forfeit all payments made and all rights outlined in the Definitive Agreement, effectively nullifying the Agreement.</p><p><b>Additional NI 43-101 Phase 3 Resource Opportunity</b></p><p>A <b>Phase 3</b> deal has been negotiated, where Great Eagle has agreed to pay Teras $7.50 per ounce for any new gold resources discovered and certified in the project area, with Teras funding all associated costs. Teras is granted the right to explore and develop an additional inferred gold resource located outside the existing NI 43-101 technical report area, which currently outlines gold and silver resources. Great Eagle acknowledges that all exploration and mineral resource certification by Teras will be confined to the U.S. Patented Land Claim boundary that houses the existing NI 43-101 deposit. Teras has the exclusive right to undertake exploration activities at its own expense within the designated boundary, excluding the area covered by the current NI 43-101 deposit, for a period of 6-9 months following the signing of the Definitive Agreement. Furthermore, Great Eagle Gold commits to paying Teras $7.50 per ounce for any inferred gold resources delineated under the NI 43-101 guidelines during this period.</p><p>Teras acknowledges and agrees that upon the formal closing of the transaction, which includes the conveyance of 100% of the subsurface rights of the Phase 1 Mineral Rights portion of the NI 43-101 certified gold deposit contained in the U.S. Patented Land Claims, no further exploration or development will be conducted within or on these claims. However, Teras retains the right to explore any adjacent or connecting properties to the patented claims.</p><p><b>About Great Eagle Gold Corp.</b></p><p>Great Eagle Gold Corp. (CSE: GEGC | FRA: GI8), a Canadian public company, is the world's premier NatGold miner. Championed by the Geneva-based International NatGold Council, NatGold represents a pioneering fusion of ESG principles, gold investment security, and digital asset innovation, positioning itself at the forefront of a super-trend that merges these three domains into one unparalleled real-world asset-backed investment opportunity. NatGold captures gold's intrinsic value via a novel, legislatively supported, ESG-friendly digital mining process instead of traditional physical extraction.</p><p>Great Eagle's unique strategy centers on acquiring NI 43-101 certified gold resources to digitally mine NatGold coins within the cutting-edge NatGold tokenization and monetization ecosystem, operated by New York-based OroEx Corp. This approach allows Great Eagle Gold to adopt an innovative, ESG-friendly method to monetize gold's intrinsic value. The company's immediate focus is on acquiring tokenization-ready U.S. Patented Land Claims containing NI 43-101 certified gold resources. </p><p><b>Great Eagle Gold Corp.</b> <br />Andrew Fletcher, President &#38; CEO <br /><br /><b>For further information please contact: </b><br />Email: <a href=\"mailto:info@greateaglegold.com\">info@GreatEagleGold.com</a>  <br />Website: <a href=\"https://api.newsfilecorp.com/redirect/2EG7AhoOp5\">www.GreatEagleGold.com</a>  <br />Phone Number: +1 (778) 372-9723</p><p><b>Investor inquiries: </b><br />NatGold Communications<br />Phone Number: +1 (754) 946-4527 <br />Email: <a href=\"mailto:Info@NatGoldIR.com\">Info@NatGoldIR.com</a> </p><p><i><b>The securities referred to herein will not be or have not been registered under the United States Securities Act of 1933, as amended, and may not be offered or sold in the United States absent registration or an applicable exemption from registration requirements.</b></i></p><p><i><b>Neither the Canadian Securities Exchange (CSE), nor the Frankfurt Stock Exchange (FSE), nor their Regulation Services Providers accepts responsibility for the adequacy or accuracy of this release.</b></i></p><p><i>This news release includes certain statements that may be deemed \"forward-looking statements\" within the meaning of applicable Canadian securities legislation. Forward-looking statements include, but are not limited to, statements with respect to Great Eagle's operations and the acquisition of NI 43- 101 certified gold resources, the ability to digitally mine NatGold coins, the viability of the NatGold tokenization and monetization ecosystem, and development plans, expansion plans, estimates, expectations, forecasts, objectives, predictions and projections of the future. Specifically, this news release contains forward-looking statements with respect to Great Eagle's proposed operations, acquiring and developing certified gold resources and their tokenization, and the receipt of required approvals. Generally, forward-looking statements can be identified by the forward-looking terminology such as \"plans\", \"expects\" or \"does not expect\", \"is expected\", \"budget\", \"scheduled\", \"estimates\", \"projects\", \"intends\", \"anticipates\", or \"does not anticipate\", or \"believes\", or \"variations of such words and phrases or state that certain actions, events or results \"may\", \"can\", \"could\", \"would\", \"might\", or \"will\" be taken\", \"occur\" or \"be achieved\". Forward-looking statements are subject to known and unknown risks, uncertainties and other factors that may cause the actual results, level of activity, performance or achievements of Great Eagle to be materially different from those expressed or implied by such forward-looking statements, including but not limited to: risks related to the exploration and development and operation of Great Eagle's projects, the actual results of current exploration, development activities, conclusions of economic evaluations, changes in project parameters as plans continue to be refined, future precious metals prices, as well as those factors discussed in the sections relating to risk factors of our business filed in Great Eagle's required securities filings on SEDAR+. Although Great Eagle has attempted to identify important factors that could cause results to differ materially from those contained in forward-looking statements, there may be other factors that cause results to be materially different from those anticipated, described, estimated, assessed or intended. </i></p><p><i>The forward-looking statements contained in this news release are made as of the date of this news release. Except as required by law, the Company disclaims any intention and assumes no obligation to update or revise any forward-looking statements, whether as a result of new information, future events or otherwise, except as required by applicable securities law. Additionally, the Company undertakes no obligation to comment on the expectations of, or statements made, by third parties in respect of the matters discussed above. </i></p><p id=\"corporateNewsLogoContainer\"><img src=\"https://images.newsfilecorp.com/files/10244/209422_07908e6324979b6e_logo.jpg\" id=\"corporateNewsLogo\" alt=\"Corporate Logo\" /></p><p id=\"corporateLinkBack\">To view the source version of this press release, please visit <a href=\"https://api.newsfilecorp.com/redirect/MAoYgczoNg\">https://www.newsfilecorp.com/release/209422</a></p>",
    "search_terms": "Cahuilla,Great Eagle Gold Corp.,GEGC",
    "master_gid": 6935,
    "date": "2024-05-16T07:05:00.000Z",
    "tags": "USA|California||Gold|Project Acquisition",
    "image_id": null,
    "hidden": false,
    "company_id": 2066,
    "provider": null,
    "excerpt": "Burnaby, British Columbia--(Newsfile Corp. - May 16, 2024) - Great Eagle Gold Corp. (CSE: GEGC) (FSE: GI8) (\"Great Eagle\")is pleased to announce the signing of a binding letter of intent (\"LOI\") with Teras Resources Inc. (\"Teras\") to acquire 100% of the subsurface mineral rights pertaining to a U.S. Patented Land",
    "is_regulatory": false,
    "refined_tags": [
      "Project Acquisition"
    ],
    "ftp_filename": null,
    "company_name": "Great Eagle Gold Corp.",
    "exchange": "CSE",
    "root_ticker": "GEGC",
    "project_name": "Cahuilla",
    "gid": 6935,
    "location": "California, United States",
    "plan_id": null,
    "description_text": "Burnaby, British Columbia--(Newsfile Corp. - May 16, 2024) - Great Eagle Gold Corp. (CSE: GEGC) (FSE: GI8) (\"Great Eagle\") is pleased to announce the signing of a binding letter of intent (\"LOI\") with Teras Resources Inc. (\"Teras\") to acquire 100% of the subsurface mineral rights pertaining to a U.S. Patented Land Claim package, located in Imperial County, California, collectively known as the Cahuilla gold project. Great Eagle has agreed to pay an immediate US $50,000 standstill payment to Teras. Cahuilla is a historic gold deposit well-known within the gold mining industry. It has undergone extensive exploration since the 1980s, involving seven different mining companies including major gold producers such as Homestake, Newmont, Kennecott, and most recently, Teras Resources. Teras alone has invested more than $26 million in the property. Great Eagle CEO and Director, Andrew Fletcher, declared emphatically, \"Over the past several months, we've scrutinized dozens of U.S. Patented Land Claims, all boasting NI 43-101 certified gold resources. However, it was the Cahuilla gold project that captured our full attention and enthusiasm. This marquee gold project seamlessly aligns with every criterion set forth by the International NatGold Council for tokenization alongside New York-based OroEx Corp. With its perpetual title protection, absence of ongoing state fees or taxes, and fully transferable title, the Cahuilla gold project represents the ideal acquisition for us. We are thrilled with this landmark purchase-it fully meets all our expectations.\" The 1,680-acre Cahuilla gold project contains a multi-million ounce, tokenization-ready deposit of certified gold and silver resources, as detailed in a National Instrument 43-101 (NI 43-101) technical report. This NI 43-101 report certifies: 1,261,364 ounces of indicated gold resources. 14,336,659 ounces of indicated silver resources. 74,870 ounces of inferred gold resources. 685,520 ounces of inferred silver resources. The Cahuilla gold project straddles two land packages, being subdivided into two separate gold/silver deposits, with each deposit pertaining to a two-phase acquisition deal. The first phase acquisition ( \"Phase 1\" ) is a binding agreement that Teras is in a position to sell to Great Eagle for US $8,616,660. The second phase ( \"Phase 2\" ) Great Eagle has agreed to purchase for US $9,760,243. The total agreed purchase price for the entire Cahuilla gold project is US $18,376,904. However, Great Eagle is only able to purchase Phase 1 at this time, as Teras is still in the process of negotiating the severability of subsurface rights from surface rights with the other partners to the land pertaining to the Phase 2 transaction. Great Eagle Gold is confident Teras will successfully complete the Phase 2 acquisition negotiations; however, in the meantime, the Teras Resources technical team, together with the Great Eagle Gold technical team, have agreed to split the total gold deposit into two distinct subdivisions and to allocate the respective portions of the overall gold and silver resources delineated in the NI 43-101 report to their respective acquisition phase, respectively, with separate mineral rights titles pertaining to each Phase independent of the other. The geological 3D modeling and resource allocation process involves oversight and confirmation by Qualified Persons as defined by National Instrument 43-101- Standards of Disclosure for Mineral Projects. The Phase 1 Mineral Rights purchase price of US $8,616,660 breaks down as follows: 592,841 ounces of indicated gold resources, valued at US $12.50 per ounce, at a cost of US $7,410,513. 6,594,863 ounces of indicated silver resources, which at a 90:1 gold-silver ratio, equals 73,276 ounces of gold equivalent indicated resources, valued at US $12.50 per ounce, at a cost of $915,953. 35,189 ounces of inferred gold resources, valued at US $7.50 per ounce, at a cost of US $263,918. 315,339 ounces of inferred silver resources, which at a 90:1 gold-silver ratio, equals 3,504 ounces of gold equivalent inferred resources, valued at US $7.50 per ounce, at a cost of US $26,278. The Phase 2 Mineral Rights purchase price of US $9,760,243 breaks down as follows: 668,523 ounces of indicated gold resources, valued at US $12.50 per ounce, at a cost of US $8,356,538. 7,741,796 ounces of indicated silver resources, which at a 90:1 gold-silver ratio, equals 86,020 ounces of gold equivalent indicated resources, valued at US $12.50 per ounce, at a cost of $1,075,249. 39,681 ounces of inferred gold resources, valued at US $7.50 per ounce, at a cost of US $297,608. 370,181 ounces of inferred silver resources, which at a 90:1 gold-silver ratio, equals 4,113 ounces of gold equivalent inferred resources, valued at US $7.50 per ounce, at a cost of US $30,848. Financial Terms The parties have agreed to enter into a Definitive Agreement for the acquisition within thirty days, with a proposed closing date for the transaction scheduled for July 15, 2024, subject to the completion of satisfactory due diligence and compliance with all required regulatory requirements. If the transaction does not close by July 15, 2024 as a result of any action or inaction of Great Eagle, Great Eagle shall pay Teras a late closing penalty of $50,000, which payment shall be credited towards the initial Phase 1 purchase payment. In addition, Great Eagle has agreed to pay a finder's fee consisting of 10% of the consideration payable for the Phase 1 acquisition of the Cahuilla gold project. This fee will be payable in three installments according to the same percentages outlined in the property payment schedule below. The finder's fee can be paid in cash and/or common shares, at the election of the Company. Following the execution of the Definitive Agreement, scheduled for June 15th, 2024, Teras will receive 20% of the total purchase price of the resource pertaining to the Phase 1 Mineral Rights (US $1,723,332) within 30 days. An additional 30% of the purchase price (US $2,584,998) will be due within 180 days of the Definitive Agreement, with the remaining 50% (US $4,308,331) payable on or before 12 months from the Definitive Agreement date. In the event that Great Eagle Gold is delayed in making any scheduled payment as established in the Binding Letter of Intent, a cure period of 30 days will be granted to address the delayed payment. During this period, an interest penalty, which will be specified in the Definitive Agreement, will be applied. Should Great Eagle fail to fulfill any payment obligation on or before the expiration of the Cure Period, it will forfeit all payments made and all rights outlined in the Definitive Agreement, effectively nullifying the Agreement. Additional NI 43-101 Phase 3 Resource Opportunity A Phase 3 deal has been negotiated, where Great Eagle has agreed to pay Teras $7.50 per ounce for any new gold resources discovered and certified in the project area, with Teras funding all associated costs. Teras is granted the right to explore and develop an additional inferred gold resource located outside the existing NI 43-101 technical report area, which currently outlines gold and silver resources. Great Eagle acknowledges that all exploration and mineral resource certification by Teras will be confined to the U.S. Patented Land Claim boundary that houses the existing NI 43-101 deposit. Teras has the exclusive right to undertake exploration activities at its own expense within the designated boundary, excluding the area covered by the current NI 43-101 deposit, for a period of 6-9 months following the signing of the Definitive Agreement. Furthermore, Great Eagle Gold commits to paying Teras $7.50 per ounce for any inferred gold resources delineated under the NI 43-101 guidelines during this period. Teras acknowledges and agrees that upon the formal closing of the transaction, which includes the conveyance of 100% of the subsurface rights of the Phase 1 Mineral Rights portion of the NI 43-101 certified gold deposit contained in the U.S. Patented Land Claims, no further exploration or development will be conducted within or on these claims. However, Teras retains the right to explore any adjacent or connecting properties to the patented claims. About Great Eagle Gold Corp. Great Eagle Gold Corp. (CSE: GEGC | FRA: GI8), a Canadian public company, is the world's premier NatGold miner. Championed by the Geneva-based International NatGold Council, NatGold represents a pioneering fusion of ESG principles, gold investment security, and digital asset innovation, positioning itself at the forefront of a super-trend that merges these three domains into one unparalleled real-world asset-backed investment opportunity. NatGold captures gold's intrinsic value via a novel, legislatively supported, ESG-friendly digital mining process instead of traditional physical extraction. Great Eagle's unique strategy centers on acquiring NI 43-101 certified gold resources to digitally mine NatGold coins within the cutting-edge NatGold tokenization and monetization ecosystem, operated by New York-based OroEx Corp. This approach allows Great Eagle Gold to adopt an innovative, ESG-friendly method to monetize gold's intrinsic value. The company's immediate focus is on acquiring tokenization-ready U.S. Patented Land Claims containing NI 43-101 certified gold resources. Great Eagle Gold Corp. Andrew Fletcher, President & CEO For further information please contact: Email: info@GreatEagleGold.com Website: www.GreatEagleGold.com Phone Number: +1 (778) 372-9723 Investor inquiries: NatGold Communications Phone Number: +1 (754) 946-4527 Email: Info@NatGoldIR.com The securities referred to herein will not be or have not been registered under the United States Securities Act of 1933, as amended, and may not be offered or sold in the United States absent registration or an applicable exemption from registration requirements. Neither the Canadian Securities Exchange (CSE), nor the Frankfurt Stock Exchange (FSE), nor their Regulation Services Providers accepts responsibility for the adequacy or accuracy of this release. This news release includes certain statements that may be deemed \"forward-looking statements\" within the meaning of applicable Canadian securities legislation. Forward-looking statements include, but are not limited to, statements with respect to Great Eagle's operations and the acquisition of NI 43- 101 certified gold resources, the ability to digitally mine NatGold coins, the viability of the NatGold tokenization and monetization ecosystem, and development plans, expansion plans, estimates, expectations, forecasts, objectives, predictions and projections of the future. Specifically, this news release contains forward-looking statements with respect to Great Eagle's proposed operations, acquiring and developing certified gold resources and their tokenization, and the receipt of required approvals. Generally, forward-looking statements can be identified by the forward-looking terminology such as \"plans\", \"expects\" or \"does not expect\", \"is expected\", \"budget\", \"scheduled\", \"estimates\", \"projects\", \"intends\", \"anticipates\", or \"does not anticipate\", or \"believes\", or \"variations of such words and phrases or state that certain actions, events or results \"may\", \"can\", \"could\", \"would\", \"might\", or \"will\" be taken\", \"occur\" or \"be achieved\". Forward-looking statements are subject to known and unknown risks, uncertainties and other factors that may cause the actual results, level of activity, performance or achievements of Great Eagle to be materially different from those expressed or implied by such forward-looking statements, including but not limited to: risks related to the exploration and development and operation of Great Eagle's projects, the actual results of current exploration, development activities, conclusions of economic evaluations, changes in project parameters as plans continue to be refined, future precious metals prices, as well as those factors discussed in the sections relating to risk factors of our business filed in Great Eagle's required securities filings on SEDAR+. Although Great Eagle has attempted to identify important factors that could cause results to differ materially from those contained in forward-looking statements, there may be other factors that cause results to be materially different from those anticipated, described, estimated, assessed or intended. The forward-looking statements contained in this news release are made as of the date of this news release. Except as required by law, the Company disclaims any intention and assumes no obligation to update or revise any forward-looking statements, whether as a result of new information, future events or otherwise, except as required by applicable securities law. Additionally, the Company undertakes no obligation to comment on the expectations of, or statements made, by third parties in respect of the matters discussed above. To view the source version of this press release, please visit https://www.newsfilecorp.com/release/209422",
    "primary_commodity": "Au"
  },
  "articleProject": {
    "gid": 6935,
    "project_name": "Cahuilla",
    "location": "California, United States"
  },
  "articleExchange": "CSE",
  "articleCompanyId": 2066,
  "articleTicker": "GEGC",
  "articleCompanyName": "Great Eagle Gold Corp.",
  "allOtherCompanyProjects": [],
  "allOtherCompanyNews": [
    {
      "id": -200626,
      "company_id": 2066,
      "title": "Great Eagle Gold Corp. Announces Private Placement to Expand Tokenization-Ready Mineral Property Portfolio",
      "link": "https://app.quotemedia.com/data/downloadFiling?webmasterId=104408&ref=68236e679b3add68e9542ba3&type=PDFC&formType=002-002-001089-003001&formDescription=News+release&dateFiled=2025-05-13",
      "date": "2025-05-13T16:08:07.000Z",
      "hidden": false
    },
    {
      "id": -197844,
      "company_id": 2066,
      "title": "Great Eagle Gold Corp. Announces Investor Relations Arrangement, Results of Shareholders Meeting and Management Changes",
      "link": "https://app.quotemedia.com/data/downloadFiling?webmasterId=104408&ref=67fe827dd74f5620de6c2cf1&type=PDFC&formType=002-002-001089-003001&formDescription=News+release&dateFiled=2025-04-15",
      "date": "2025-04-15T08:59:57.000Z",
      "hidden": false
    },
    {
      "id": -185783,
      "company_id": 2066,
      "title": "Great Eagle Files National Instrument 43-101 Technical Geological Report on its North Shore Gold Property",
      "link": "https://app.quotemedia.com/data/downloadFiling?webmasterId=104408&ref=67d85dd24113e84332486b61&type=PDFC&formType=002-002-001089-003001&formDescription=News+release&dateFiled=2025-03-17",
      "date": "2025-03-17T17:37:22.000Z",
      "hidden": false
    },
    {
      "id": 87588,
      "company_id": 2066,
      "title": "Great Eagle Gold Corp. Announces Definitive Agreement to Acquire Patented Mineral Rights Titles Containing NI 43-101 Inferred Gold Resources",
      "link": "https://www.newsfilecorp.com/release/240531/Great-Eagle-Gold-Corp.-Announces-Definitive-Agreement-to-Acquire-Patented-Mineral-Rights-Titles-Containing-NI-43101-Inferred-Gold-Resources",
      "date": "2025-02-12T12:00:00.000Z",
      "hidden": false
    },
    {
      "id": -167774,
      "company_id": 2066,
      "title": "Canadian Investment Regulatory Organization Trade Resumption - GEGC",
      "link": "https://contentapi.cision.com/api/v1.0/releases/20250204C3017",
      "date": "2025-02-04T18:20:00.000Z",
      "hidden": false
    },
    {
      "id": 86852,
      "company_id": 2066,
      "title": "Clarification to News Release Entitled \"Great Eagle Gold Corp. Announces LOI to Acquire Patented Mineral Rights Titles Containing NI 43-101 Certified Gold Resources\"",
      "link": "https://www.newsfilecorp.com/release/239598/Clarification-to-News-Release-Entitled-Great-Eagle-Gold-Corp.-Announces-LOI-to-Acquire-Patented-Mineral-Rights-Titles-Containing-NI-43101-Certified-Gold-Resources",
      "date": "2025-02-04T18:10:00.000Z",
      "hidden": false
    },
    {
      "id": -167522,
      "company_id": 2066,
      "title": "Canadian Investment Regulatory Organization Trading Halt - GEGC",
      "link": "https://contentapi.cision.com/api/v1.0/releases/20250203C5399",
      "date": "2025-02-03T13:50:00.000Z",
      "hidden": false
    },
    {
      "id": 85246,
      "company_id": 2066,
      "title": "Great Eagle Gold Corp. Announces LOI to Acquire Patented Mineral Rights Titles Containing NI 43-101 Certified Gold Resources",
      "link": "https://www.newsfilecorp.com/release/238402/Great-Eagle-Gold-Corp.-Announces-LOI-to-Acquire-Patented-Mineral-Rights-Titles-Containing-NI-43101-Certified-Gold-Resources",
      "date": "2025-01-27T11:00:00.000Z",
      "hidden": false
    },
    {
      "id": -163775,
      "company_id": 2066,
      "title": "Great Eagle Gold Corp. and NatGold Digital Ltd. Strengthen Strategic Partnership with New Agreement; GEGC Announces Financing Update",
      "link": "https://www.newsfilecorp.com/release/236535/Great-Eagle-Gold-Corp.-and-NatGold-Digital-Ltd.-Strengthen-Strategic-Partnership-with-New-Agreement-GEGC-Announces-Financing-Update",
      "date": "2025-01-09T08:05:00.000Z",
      "hidden": false
    },
    {
      "id": -185782,
      "company_id": 2066,
      "title": "GREAT EAGLE ANNOUNCES MANAGEMENT CEASE TRADE ORDER UPDATE",
      "link": "https://app.quotemedia.com/data/downloadFiling?webmasterId=104408&ref=6758a78157db1909c826dae1&type=PDFC&formType=002-002-001089-003001&formDescription=News+release&dateFiled=2024-12-10",
      "date": "2024-12-10T20:41:37.000Z",
      "hidden": false
    }
  ]
}
