{
  "article": {
    "id": 79082,
    "link": "https://www.newsfilecorp.com/release/230311/American-Pacific-Receives-US10-Million-and-100-Interest-in-the-Palmer-VMS-Project-in-Alaska",
    "title": "American Pacific Receives US$10 Million and 100% Interest in the Palmer VMS Project in Alaska",
    "description": "<img src=\"https://api.newsfilecorp.com/newsinfo/230311/367\" id=\"367\" width=\"2\" height=\"2\" style=\"width: 1px;  height: 1px;border: 0px solid;\" /><p>Vancouver, British Columbia--(Newsfile Corp. - November 18, 2024) - <b>American Pacific Mining Corp. (CSE: USGD) (FSE: 1QC) (OTCQX: USGDF) </b>(\"<b>American Pacific</b>\" or the \"<b>Company</b>\") announced today that it has entered into an agreement (the \"<b>Purchase Agreement</b>\") with Constantine North Inc. (\"<b>CNI</b>\") and Dowa Metals &#38; Mining Alaska Ltd. (\"<b>Dowa</b>\") to acquire Dowa's interest in Constantine Mining LLC (the \"<b>Dowa Interest</b>\"), the holder of the Palmer VMS Project (\"<b>Palmer</b>\" or the \"<b>Project</b>\"). Pursuant to the terms of the Purchase Agreement executed November 15<sup>th</sup>, 2024, CNI, a wholly-owned subsidiary of American Pacific, will acquire the Dowa Interest from Dowa and Dowa will pay US$10,000,000 to American Pacific in exchange for providing Dowa with an option to acquire up to 50% of the zinc concentrate produced at the Project for the initial year of production and each subsequent year of production at the Project and the provision of certain indemnities in the Purchase Agreement. The completion of the transactions contemplated by the Purchase Agreement are subject to customary conditions precedent in favour of American Pacific, CNI and Dowa. Following the acquisition of the Dowa Interest, American Pacific will have consolidated a 100%-interest in the Project.</p><p>American Pacific would like to thank Dowa for its collaborative approach to work at Palmer over the years. Given the differing corporate priorities of Dowa and American Pacific, the Company is pleased to have regained 100%-ownership and control of Palmer. </p><p>Warwick Smith, American Pacific's Chief Executive Officer stated:</p><p>\"<i>This is a transformative transaction for American Pacific. American Pacific receives a significant injection of capital and 100%-control of a Project that has an established mineral resource with significant exploration upside throughout the district.\" </i></p><p><i>\"An updated mineral resource estimate (MRE) is underway, and this transition consolidates ownership and provides a clear path forward with a renewed focus on advanced exploration and resource expansion, which we believe will create significant value for a Project that currently includes a small fraction of the known VMS showings in the current MRE.\"   </i></p><p>Following the closing, American Pacific is expected to have more than CDN$16 million in cash and two 100%-controlled flagship assets in the Madison Project in Montana and Palmer in Alaska. The transaction is expected to close during the fourth quarter of 2024.</p><p><b>Transaction Update Webinar</b></p><p>A transaction update webinar is scheduled for 10:00am Pacific Time (1:00pm Eastern Time) today, November 18<sup>th</sup>, 2024.  </p><p>To join, the webinar, click the Zoom Webinar Access link below, or contact <a href=\"mailto:info@americanpacific.ca\">info@americanpacific.ca</a>.</p><p><a href=\"https://api.newsfilecorp.com/redirect/oLYVyHMYMj\">ZOOM WEBINAR ACCESS</a></p><p><b>Palmer VMS Project</b></p><p>The Palmer VMS Project is an advanced stage copper-zinc-gold-silver exploration project in Southeast Alaska with road access and located only 60 kilometres (37 miles) from the deep seaport at Haines, Alaska. More than US$116 million has been spent to-date at Palmer, with NI-43-101 mineral resources defined at the Palmer and AG Deposits. Recent drilling (2023-2024) has highlighted the potential to define extremely rich copper zones and the Palmer Project includes numerous drill-ready, high-grade prospects that define more than 15 kilometres of favourable mineral trends, all hallmarks of a significant massive sulphide system.</p><p><b>Qualified Person Statement </b></p><p>The technical information in this news release regarding the Palmer Project has been reviewed and approved by Michael Vande Guchte, P.Geo., Vice President of Exploration for the Palmer Project and a Qualified Person (QP) as defined by National Instrument 43-101, Standards of Disclosure for Mineral Projects. </p><p><b>About American Pacific Mining Corp.</b></p><p>American Pacific Mining Corp. is a precious and base metals explorer and developer focused on opportunities in the Western United States. The Company has two flagship assets: 100%-owned Palmer Project, a Volcanic Massive Sulphide-Sulphate (VMS) project in Alaska, and the 100%-owned Madison Project, a past-producing copper-gold project in Montana. For the Madison transaction, American Pacific was selected as a finalist in both 2021 and 2022 for 'Deal of the Year' at the S&#38;P Global Platts Global Metals Awards, an annual program that recognizes exemplary accomplishments in 16 performance categories. Also, in American Pacific's asset portfolio are three high-grade, precious metals projects located in key mining districts of Nevada, USA: the Ziggurat Gold project, the Gooseberry Silver-Gold project; and the Tuscarora Gold-Silver project. The Company's mission is to grow by the drill bit and by acquisition.</p><p><b>On behalf of the American Pacific Mining Corp Board of Directors:</b></p><div id=\"contactInfo\"><p><b>Warwick Smith, CEO &#38; Director</b><br />Corporate Office: Suite 910 - 510 Burrard Street <br />Vancouver, BC, V6C 3A8 Canada</p><p><b>Investor relations contact:</b></p><p><b>Kristina Pillon, High Tide Consulting Corp.</b><br />604.908.1695 / <a href=\"mailto:Kristina@americanpacific.ca\">Kristina@americanpacific.ca</a></p><p><b>Media relations contact:</b></p><p><b>Adam Bello, Primoris Group Inc.</b><br />416.489.0092 / <a href=\"mailto:media@primorisgroup.com\">media@primorisgroup.com</a></p></div><p>Full disclosure can be found in our NI 43-101 Technical Report for the Palmer Project at <a href=\"https://api.newsfilecorp.com/redirect/PLp5EHLkLW\">www.americanpacificmining.com</a>.</p><p><i><b>The Canadian Securities Exchange has neither approved nor disapproved the contents of this news release. </b></i></p><p id=\"corporateNewsLogoContainer\"><img src=\"https://images.newsfilecorp.com/files/10322/230311_66dc5693a4244bce_logo.jpg\" id=\"corporateNewsLogo\" alt=\"Corporate Logo\" /></p><p id=\"corporateLinkBack\">To view the source version of this press release, please visit <a href=\"https://api.newsfilecorp.com/redirect/O3gBRf7V7V\">https://www.newsfilecorp.com/release/230311</a></p>",
    "search_terms": "Palmer,American Pacific Mining Corp.,USGD",
    "master_gid": 1140,
    "date": "2024-11-18T12:00:00.000Z",
    "tags": "USA|Alaska|||Project Acquisition",
    "image_id": null,
    "hidden": false,
    "company_id": 180,
    "provider": "newsfilecorp",
    "excerpt": "Vancouver, British Columbia--(Newsfile Corp. - November 18, 2024) -American Pacific Mining Corp. (CSE: USGD) (FSE: 1QC) (OTCQX: USGDF)(\"American Pacific\" or the \"Company\") announced today that it has entered into an agreement (the \"Purchase Agreement\") with Constantine North Inc. (\"CNI\") and Dowa Metals &#38; Mining Alaska Ltd. (\"Dowa\") to acquire Dowa's",
    "is_regulatory": false,
    "refined_tags": [],
    "ftp_filename": null,
    "company_name": "American Pacific Mining Corp.",
    "exchange": "CSE",
    "root_ticker": "USGD",
    "project_name": "Palmer",
    "gid": 1140,
    "location": null,
    "plan_id": "companytier2",
    "description_text": "Vancouver, British Columbia--(Newsfile Corp. - November 18, 2024) - American Pacific Mining Corp. (CSE: USGD) (FSE: 1QC) (OTCQX: USGDF) (\" American Pacific \" or the \" Company \") announced today that it has entered into an agreement (the \" Purchase Agreement \") with Constantine North Inc. (\" CNI \") and Dowa Metals & Mining Alaska Ltd. (\" Dowa \") to acquire Dowa's interest in Constantine Mining LLC (the \" Dowa Interest \"), the holder of the Palmer VMS Project (\" Palmer \" or the \" Project \"). Pursuant to the terms of the Purchase Agreement executed November 15 th , 2024, CNI, a wholly-owned subsidiary of American Pacific, will acquire the Dowa Interest from Dowa and Dowa will pay US$10,000,000 to American Pacific in exchange for providing Dowa with an option to acquire up to 50% of the zinc concentrate produced at the Project for the initial year of production and each subsequent year of production at the Project and the provision of certain indemnities in the Purchase Agreement. The completion of the transactions contemplated by the Purchase Agreement are subject to customary conditions precedent in favour of American Pacific, CNI and Dowa. Following the acquisition of the Dowa Interest, American Pacific will have consolidated a 100%-interest in the Project. American Pacific would like to thank Dowa for its collaborative approach to work at Palmer over the years. Given the differing corporate priorities of Dowa and American Pacific, the Company is pleased to have regained 100%-ownership and control of Palmer. Warwick Smith, American Pacific's Chief Executive Officer stated: \" This is a transformative transaction for American Pacific. American Pacific receives a significant injection of capital and 100%-control of a Project that has an established mineral resource with significant exploration upside throughout the district.\" \"An updated mineral resource estimate (MRE) is underway, and this transition consolidates ownership and provides a clear path forward with a renewed focus on advanced exploration and resource expansion, which we believe will create significant value for a Project that currently includes a small fraction of the known VMS showings in the current MRE.\" Following the closing, American Pacific is expected to have more than CDN$16 million in cash and two 100%-controlled flagship assets in the Madison Project in Montana and Palmer in Alaska. The transaction is expected to close during the fourth quarter of 2024. Transaction Update Webinar A transaction update webinar is scheduled for 10:00am Pacific Time (1:00pm Eastern Time) today, November 18 th , 2024. To join, the webinar, click the Zoom Webinar Access link below, or contact info@americanpacific.ca . ZOOM WEBINAR ACCESS Palmer VMS Project The Palmer VMS Project is an advanced stage copper-zinc-gold-silver exploration project in Southeast Alaska with road access and located only 60 kilometres (37 miles) from the deep seaport at Haines, Alaska. More than US$116 million has been spent to-date at Palmer, with NI-43-101 mineral resources defined at the Palmer and AG Deposits. Recent drilling (2023-2024) has highlighted the potential to define extremely rich copper zones and the Palmer Project includes numerous drill-ready, high-grade prospects that define more than 15 kilometres of favourable mineral trends, all hallmarks of a significant massive sulphide system. Qualified Person Statement The technical information in this news release regarding the Palmer Project has been reviewed and approved by Michael Vande Guchte, P.Geo., Vice President of Exploration for the Palmer Project and a Qualified Person (QP) as defined by National Instrument 43-101, Standards of Disclosure for Mineral Projects. About American Pacific Mining Corp. American Pacific Mining Corp. is a precious and base metals explorer and developer focused on opportunities in the Western United States. The Company has two flagship assets: 100%-owned Palmer Project, a Volcanic Massive Sulphide-Sulphate (VMS) project in Alaska, and the 100%-owned Madison Project, a past-producing copper-gold project in Montana. For the Madison transaction, American Pacific was selected as a finalist in both 2021 and 2022 for 'Deal of the Year' at the S&P Global Platts Global Metals Awards, an annual program that recognizes exemplary accomplishments in 16 performance categories. Also, in American Pacific's asset portfolio are three high-grade, precious metals projects located in key mining districts of Nevada, USA: the Ziggurat Gold project, the Gooseberry Silver-Gold project; and the Tuscarora Gold-Silver project. The Company's mission is to grow by the drill bit and by acquisition. On behalf of the American Pacific Mining Corp Board of Directors: Warwick Smith, CEO & Director Corporate Office: Suite 910 - 510 Burrard Street Vancouver, BC, V6C 3A8 Canada Investor relations contact: Kristina Pillon, High Tide Consulting Corp. 604.908.1695 / Kristina@americanpacific.ca Media relations contact: Adam Bello, Primoris Group Inc. 416.489.0092 / media@primorisgroup.com Full disclosure can be found in our NI 43-101 Technical Report for the Palmer Project at www.americanpacificmining.com . The Canadian Securities Exchange has neither approved nor disapproved the contents of this news release. To view the source version of this press release, please visit https://www.newsfilecorp.com/release/230311",
    "primary_commodity": "Cu"
  },
  "articleProject": {
    "gid": 1140,
    "project_name": "Palmer",
    "location": null
  },
  "articleExchange": "CSE",
  "articleCompanyId": 180,
  "articleTicker": "USGD",
  "articleCompanyName": "American Pacific Mining Corp.",
  "allOtherCompanyProjects": [
    {
      "company_id": 180,
      "gid": 2453,
      "project_name": "Madison",
      "location": null
    },
    {
      "company_id": 180,
      "gid": 5271,
      "project_name": "Danny Boy",
      "location": null
    },
    {
      "company_id": 180,
      "gid": 895,
      "project_name": "Tuscarora",
      "location": null
    },
    {
      "company_id": 180,
      "gid": 9668,
      "project_name": "Ziggurat",
      "location": "Nevada, United States"
    },
    {
      "company_id": 180,
      "gid": 951,
      "project_name": "Gooseberry",
      "location": null
    },
    {
      "company_id": 180,
      "gid": 1054,
      "project_name": "South Lida",
      "location": null
    },
    {
      "company_id": 180,
      "gid": 922,
      "project_name": "Red Hill",
      "location": null
    }
  ],
  "allOtherCompanyNews": [
    {
      "id": 107872,
      "company_id": 180,
      "title": "American Pacific Completes Phase I Drill Program at Madison Copper-Gold Project in Montana",
      "link": null,
      "date": "2025-06-12T20:15:00.000Z",
      "hidden": false
    },
    {
      "id": 100383,
      "company_id": 180,
      "title": "American Pacific Commences Drill Program at the Madison Copper-Gold Project in Montana",
      "link": null,
      "date": "2025-04-22T11:00:00.000Z",
      "hidden": false
    },
    {
      "id": 93041,
      "company_id": 180,
      "title": "American Pacific Receives Updated Permit and Prepares to Commence Next Phase of Drilling at the Madison Copper-Gold Project",
      "link": null,
      "date": "2025-03-31T11:00:00.000Z",
      "hidden": false
    },
    {
      "id": 89794,
      "company_id": 180,
      "title": "American Pacific Files Updated Technical Report for its Palmer Copper-Zinc VMS Project in Southeast Alaska",
      "link": "https://www.newsfilecorp.com/release/242968/American-Pacific-Files-Updated-Technical-Report-for-its-Palmer-CopperZinc-VMS-Project-in-Southeast-Alaska",
      "date": "2025-03-03T12:00:00.000Z",
      "hidden": false
    },
    {
      "id": 89423,
      "company_id": 180,
      "title": "American Pacific Mining Positioned to Benefit from Growing US Copper Demand Driven by Tariff Uncertainty",
      "link": "https://www.newsfilecorp.com/release/242574/American-Pacific-Mining-Positioned-to-Benefit-from-Growing-US-Copper-Demand-Driven-by-Tariff-Uncertainty",
      "date": "2025-02-27T12:00:00.000Z",
      "hidden": false
    },
    {
      "id": 84552,
      "company_id": 180,
      "title": "American Pacific Reports Significant Increase in Contained Copper with Updated Mineral Resource Estimate for its Palmer Copper-Zinc VMS Project in Southeast Alaska",
      "link": "https://www.newsfilecorp.com/release/237762/American-Pacific-Reports-Significant-Increase-in-Contained-Copper-with-Updated-Mineral-Resource-Estimate-for-its-Palmer-CopperZinc-VMS-Project-in-Southeast-Alaska",
      "date": "2025-01-20T12:00:00.000Z",
      "hidden": false
    },
    {
      "id": 80547,
      "company_id": 180,
      "title": "American Pacific Closes Transaction to Gain USD$10M and 100% Interest in the Palmer VMS Project in Alaska",
      "link": "https://www.newsfilecorp.com/release/231954/American-Pacific-Closes-Transaction-to-Gain-USD10M-and-100-Interest-in-the-Palmer-VMS-Project-in-Alaska",
      "date": "2024-12-02T12:00:00.000Z",
      "hidden": false
    },
    {
      "id": 80134,
      "company_id": 180,
      "title": "American Pacific Reports up to 80.6 g/t Gold, 5.2% Copper and 136 g/t Silver from the 2024 Field Program at its Madison Project",
      "link": "https://www.newsfilecorp.com/release/231547/American-Pacific-Reports-up-to-80.6-gt-Gold-5.2-Copper-and-136-gt-Silver-from-the-2024-Field-Program-at-its-Madison-Project",
      "date": "2024-11-27T12:00:00.000Z",
      "hidden": false
    },
    {
      "id": 79082,
      "company_id": 180,
      "title": "American Pacific Receives US$10 Million and 100% Interest in the Palmer VMS Project in Alaska",
      "link": "https://www.newsfilecorp.com/release/230311/American-Pacific-Receives-US10-Million-and-100-Interest-in-the-Palmer-VMS-Project-in-Alaska",
      "date": "2024-11-18T12:00:00.000Z",
      "hidden": false
    },
    {
      "id": 77879,
      "company_id": 180,
      "title": "American Pacific Reports 18.0 Metres of 1.5% Copper and 5.4% Zinc (4.4% CuEq) from Zone 2-3 at Palmer Copper-Zinc VMS Project in Southeast Alaska",
      "link": "https://www.newsfilecorp.com/release/229018/American-Pacific-Reports-18.0-Metres-of-1.5-Copper-and-5.4-Zinc-4.4-CuEq-from-Zone-23-at-Palmer-CopperZinc-VMS-Project-in-Southeast-Alaska",
      "date": "2024-11-06T12:00:00.000Z",
      "hidden": false
    }
  ]
}
