{
  "article": {
    "id": 80547,
    "link": "https://www.newsfilecorp.com/release/231954/American-Pacific-Closes-Transaction-to-Gain-USD10M-and-100-Interest-in-the-Palmer-VMS-Project-in-Alaska",
    "title": "American Pacific Closes Transaction to Gain USD$10M and 100% Interest in the Palmer VMS Project in Alaska",
    "description": "<img src=\"https://api.newsfilecorp.com/newsinfo/231954/367\" id=\"367\" width=\"2\" height=\"2\" style=\"width: 1px;  height: 1px;border: 0px solid;\" /><p>Vancouver, British Columbia--(Newsfile Corp. - December 2, 2024) - <b>American Pacific Mining Corp. (CSE: USGD) (OTCQX: USGDF) (FSE: 1QC1) </b>(\"<b>American Pacific</b>\" or the \"<b>Company</b>\") announced today that it has closed its previously announced transaction with Dowa Metals &#38; Mining Alaska Ltd. (\"<b>Dowa</b>\") to acquire Dowa's interest in Constantine Mining LLC, the holder of the Palmer VMS Project (\"<b>Palmer</b>\" or the \"<b>Project</b>\"). American Pacific would once again like to thank Dowa for its collaborative approach to work at Palmer over the years. </p><p><b>Transaction Terms</b></p><p>Pursuant to the terms of the Purchase Agreement executed November 15th, 2024, Constantine North Inc., a wholly-owned subsidiary of American Pacific, has acquired Dowa's interest in Constantine Mining LLC (the \"<b>Dowa Interest</b>\") and Dowa has paid American Pacific USD$10,000,000 in exchange for providing an affiliate of Dowa with an option to acquire up to 50% of the zinc concentrate produced for the initial year of production and each subsequent year of production at the Project and the provision of certain indemnities in the Purchase Agreement. With the close of the acquisition of the Dowa Interest, American Pacific has a consolidated 100%-interest in the Project. </p><p>\"This transaction marks a pivotal moment for American Pacific,\" commented American Pacific's Chief Executive Officer, Warwick Smith. \"We've now obtained full ownership of a project with proven mineral resources and vast untapped regional discovery potential, while also securing substantial funding to ramp up exploration of key assets across our portfolio, paving the way for significant resource growth.\" </p><p><b>Palmer VMS Project</b></p><p>The Palmer VMS Project is an advanced stage copper-zinc-gold-silver exploration project in Southeast Alaska with road access and located only 60 kilometres (37 miles) from the deep sea port at Haines, Alaska. More than USD$116M has been spent to-date at Palmer, with NI-43-101 mineral resources defined at the Palmer and AG deposits. Recent drilling (2023-2024) has highlighted the potential to define extremely rich copper zones and the Palmer Project includes numerous drill-ready, high-grade prospects that define more than 15 kilometres of favourable mineral trends, all hallmarks of a significant massive sulphide system.</p><p><b>Qualified Person Statement </b></p><p>The technical information in this news release regarding the Palmer Project has been reviewed and approved by Michael Vande Guchte, P.Geo., Vice President of Exploration for the Palmer Project and a Qualified Person (QP) as defined by National Instrument 43-101, Standards of Disclosure for Mineral Projects. </p><p><b>About American Pacific Mining Corp.</b></p><p>American Pacific Mining Corp. is a precious and base metals explorer and developer focused on opportunities in the Western United States. The Company has two flagship assets: 100%-owned Palmer Project, a Volcanic Massive Sulphide-Sulphate (VMS) project in Alaska, and the 100%-owned Madison Project, a past-producing copper-gold project in Montana. For the Madison transaction, American Pacific was selected as a finalist in both 2021 and 2022 for 'Deal of the Year' at the S&#38;P Global Platts Metals Awards, an annual program that recognizes exemplary accomplishments in 16 performance categories. Also in American Pacific's asset portfolio, are three high-grade, precious metals projects located in key mining districts of Nevada, USA: the Ziggurat Gold project, the Gooseberry Silver-Gold project; and the Tuscarora Gold-Silver project. The Company's mission is to grow by the drill bit and by acquisition.</p><p><b>On behalf of the American Pacific Mining Corp Board of Directors:</b></p><div id=\"contactInfo\"><p><b>Warwick Smith, CEO &#38; Director</b><br />Corporate Office: Suite 910&#160;&#8211; 510 Burrard Street <br />Vancouver, BC, V6C 3A8 Canada</p><p><b>Investor relations contact:</b></p><p><b>Kristina Pillon, High Tide Consulting Corp.</b><br />604.908.1695 / <a href=\"mailto:Kristina@americanpacific.ca\">Kristina@americanpacific.ca</a></p><p><b>Media relations contact:</b></p><p><b>Adam Bello, Primoris Group Inc.</b><br />416.489.0092 / <a href=\"mailto:media@primorisgroup.com\">media@primorisgroup.com</a></p></div><p>Full disclosure can be found in our NI 43-101 Technical Report for the Palmer Project at <a href=\"https://api.newsfilecorp.com/redirect/GmLR3TaGOb\">www.americanpacificmining.com</a>.</p><p><i><b>Forward-looking Information</b></i></p><p><i>This news release includes certain statements that may be deemed to be \"forward-looking information\" within the meaning of Canadian securities legislation. All statements in this news release, other than statements of historical facts are forward looking statements. Forward-looking statements are often, but not always, identified by the use of words such as \"seek\", \"anticipate\", \"plan\", \"continue\", \"estimate\", \"expect\", \"may\", \"will\", \"project\", \"predict\", \"potential\", \"targeting\", \"intend\", \"could\", \"might\", \"should\", \"believe\" and similar expressions. These statements involve known and unknown risks, uncertainties and other factors that may cause actual results or events to differ materially from those anticipated in such forward-looking statements. Although APM believes the expectations expressed in such forward-looking statements are based on reasonable assumptions, such statements are not guarantees of future performance and actual results or developments may differ materially from those in the forward-looking statements. Factors that could cause actual results to differ materially from those in forward-looking statements include, but are not limited to, timing of receipt of required permits, changes in applicable laws, changes in commodities prices, changes in mineral production performance, exploitation and exploration successes, as applicable, continued availability of capital and financing, and general economic, market or business conditions, political risk, currency risk and capital cost inflation. In addition, forward-looking statements are subject to various risks, including that data is incomplete and considerable additional work will be required to complete further evaluation, including but not limited to drilling, engineering and socio-economic studies and investment. The reader is referred to the APM's filings with the Canadian securities regulators for disclosure regarding these and other risk factors. There is no certainty that any forward-looking statement will come to pass, and investors should not place undue reliance upon forward-looking statements.</i></p><p>The CSE has neither approved nor disapproved the contents of this news release.</p><p id=\"corporateNewsLogoContainer\"><img src=\"https://images.newsfilecorp.com/files/10322/231954_b838b71b54e62b0a_logo.jpg\" id=\"corporateNewsLogo\" alt=\"Corporate Logo\" /></p><p id=\"corporateLinkBack\">To view the source version of this press release, please visit <a href=\"https://api.newsfilecorp.com/redirect/QOWZYt2mP5\">https://www.newsfilecorp.com/release/231954</a></p>",
    "search_terms": "Palmer,American Pacific Mining Corp.,USGD",
    "master_gid": 1140,
    "date": "2024-12-02T12:00:00.000Z",
    "tags": "USA|Alaska|||Project Acquisition",
    "image_id": null,
    "hidden": false,
    "company_id": 180,
    "provider": "newsfilecorp",
    "excerpt": "Vancouver, British Columbia--(Newsfile Corp. - December 2, 2024) -American Pacific Mining Corp. (CSE: USGD) (OTCQX: USGDF) (FSE: 1QC1)(\"American Pacific\" or the \"Company\") announced today that it has closed its previously announced transaction with Dowa Metals &#38; Mining Alaska Ltd. (\"Dowa\") to acquire Dowa's interest in Constantine Mining LLC, the holder",
    "is_regulatory": false,
    "refined_tags": [],
    "ftp_filename": null,
    "company_name": "American Pacific Mining Corp.",
    "exchange": "CSE",
    "root_ticker": "USGD",
    "project_name": "Palmer",
    "gid": 1140,
    "location": null,
    "plan_id": "companytier2",
    "description_text": "Vancouver, British Columbia--(Newsfile Corp. - December 2, 2024) - American Pacific Mining Corp. (CSE: USGD) (OTCQX: USGDF) (FSE: 1QC1) (\" American Pacific \" or the \" Company \") announced today that it has closed its previously announced transaction with Dowa Metals & Mining Alaska Ltd. (\" Dowa \") to acquire Dowa's interest in Constantine Mining LLC, the holder of the Palmer VMS Project (\" Palmer \" or the \" Project \"). American Pacific would once again like to thank Dowa for its collaborative approach to work at Palmer over the years. Transaction Terms Pursuant to the terms of the Purchase Agreement executed November 15th, 2024, Constantine North Inc., a wholly-owned subsidiary of American Pacific, has acquired Dowa's interest in Constantine Mining LLC (the \" Dowa Interest \") and Dowa has paid American Pacific USD$10,000,000 in exchange for providing an affiliate of Dowa with an option to acquire up to 50% of the zinc concentrate produced for the initial year of production and each subsequent year of production at the Project and the provision of certain indemnities in the Purchase Agreement. With the close of the acquisition of the Dowa Interest, American Pacific has a consolidated 100%-interest in the Project. \"This transaction marks a pivotal moment for American Pacific,\" commented American Pacific's Chief Executive Officer, Warwick Smith. \"We've now obtained full ownership of a project with proven mineral resources and vast untapped regional discovery potential, while also securing substantial funding to ramp up exploration of key assets across our portfolio, paving the way for significant resource growth.\" Palmer VMS Project The Palmer VMS Project is an advanced stage copper-zinc-gold-silver exploration project in Southeast Alaska with road access and located only 60 kilometres (37 miles) from the deep sea port at Haines, Alaska. More than USD$116M has been spent to-date at Palmer, with NI-43-101 mineral resources defined at the Palmer and AG deposits. Recent drilling (2023-2024) has highlighted the potential to define extremely rich copper zones and the Palmer Project includes numerous drill-ready, high-grade prospects that define more than 15 kilometres of favourable mineral trends, all hallmarks of a significant massive sulphide system. Qualified Person Statement The technical information in this news release regarding the Palmer Project has been reviewed and approved by Michael Vande Guchte, P.Geo., Vice President of Exploration for the Palmer Project and a Qualified Person (QP) as defined by National Instrument 43-101, Standards of Disclosure for Mineral Projects. About American Pacific Mining Corp. American Pacific Mining Corp. is a precious and base metals explorer and developer focused on opportunities in the Western United States. The Company has two flagship assets: 100%-owned Palmer Project, a Volcanic Massive Sulphide-Sulphate (VMS) project in Alaska, and the 100%-owned Madison Project, a past-producing copper-gold project in Montana. For the Madison transaction, American Pacific was selected as a finalist in both 2021 and 2022 for 'Deal of the Year' at the S&P Global Platts Metals Awards, an annual program that recognizes exemplary accomplishments in 16 performance categories. Also in American Pacific's asset portfolio, are three high-grade, precious metals projects located in key mining districts of Nevada, USA: the Ziggurat Gold project, the Gooseberry Silver-Gold project; and the Tuscarora Gold-Silver project. The Company's mission is to grow by the drill bit and by acquisition. On behalf of the American Pacific Mining Corp Board of Directors: Warwick Smith, CEO & Director Corporate Office: Suite 910 – 510 Burrard Street Vancouver, BC, V6C 3A8 Canada Investor relations contact: Kristina Pillon, High Tide Consulting Corp. 604.908.1695 / Kristina@americanpacific.ca Media relations contact: Adam Bello, Primoris Group Inc. 416.489.0092 / media@primorisgroup.com Full disclosure can be found in our NI 43-101 Technical Report for the Palmer Project at www.americanpacificmining.com . Forward-looking Information This news release includes certain statements that may be deemed to be \"forward-looking information\" within the meaning of Canadian securities legislation. All statements in this news release, other than statements of historical facts are forward looking statements. Forward-looking statements are often, but not always, identified by the use of words such as \"seek\", \"anticipate\", \"plan\", \"continue\", \"estimate\", \"expect\", \"may\", \"will\", \"project\", \"predict\", \"potential\", \"targeting\", \"intend\", \"could\", \"might\", \"should\", \"believe\" and similar expressions. These statements involve known and unknown risks, uncertainties and other factors that may cause actual results or events to differ materially from those anticipated in such forward-looking statements. Although APM believes the expectations expressed in such forward-looking statements are based on reasonable assumptions, such statements are not guarantees of future performance and actual results or developments may differ materially from those in the forward-looking statements. Factors that could cause actual results to differ materially from those in forward-looking statements include, but are not limited to, timing of receipt of required permits, changes in applicable laws, changes in commodities prices, changes in mineral production performance, exploitation and exploration successes, as applicable, continued availability of capital and financing, and general economic, market or business conditions, political risk, currency risk and capital cost inflation. In addition, forward-looking statements are subject to various risks, including that data is incomplete and considerable additional work will be required to complete further evaluation, including but not limited to drilling, engineering and socio-economic studies and investment. The reader is referred to the APM's filings with the Canadian securities regulators for disclosure regarding these and other risk factors. There is no certainty that any forward-looking statement will come to pass, and investors should not place undue reliance upon forward-looking statements. The CSE has neither approved nor disapproved the contents of this news release. To view the source version of this press release, please visit https://www.newsfilecorp.com/release/231954",
    "primary_commodity": "Cu"
  },
  "articleProject": {
    "gid": 1140,
    "project_name": "Palmer",
    "location": null
  },
  "articleExchange": "CSE",
  "articleCompanyId": 180,
  "articleTicker": "USGD",
  "articleCompanyName": "American Pacific Mining Corp.",
  "allOtherCompanyProjects": [
    {
      "company_id": 180,
      "gid": 2453,
      "project_name": "Madison",
      "location": null
    },
    {
      "company_id": 180,
      "gid": 5271,
      "project_name": "Danny Boy",
      "location": null
    },
    {
      "company_id": 180,
      "gid": 895,
      "project_name": "Tuscarora",
      "location": null
    },
    {
      "company_id": 180,
      "gid": 9668,
      "project_name": "Ziggurat",
      "location": "Nevada, United States"
    },
    {
      "company_id": 180,
      "gid": 951,
      "project_name": "Gooseberry",
      "location": null
    },
    {
      "company_id": 180,
      "gid": 1054,
      "project_name": "South Lida",
      "location": null
    },
    {
      "company_id": 180,
      "gid": 922,
      "project_name": "Red Hill",
      "location": null
    }
  ],
  "allOtherCompanyNews": [
    {
      "id": 107872,
      "company_id": 180,
      "title": "American Pacific Completes Phase I Drill Program at Madison Copper-Gold Project in Montana",
      "link": null,
      "date": "2025-06-12T20:15:00.000Z",
      "hidden": false
    },
    {
      "id": 100383,
      "company_id": 180,
      "title": "American Pacific Commences Drill Program at the Madison Copper-Gold Project in Montana",
      "link": null,
      "date": "2025-04-22T11:00:00.000Z",
      "hidden": false
    },
    {
      "id": 93041,
      "company_id": 180,
      "title": "American Pacific Receives Updated Permit and Prepares to Commence Next Phase of Drilling at the Madison Copper-Gold Project",
      "link": null,
      "date": "2025-03-31T11:00:00.000Z",
      "hidden": false
    },
    {
      "id": 89794,
      "company_id": 180,
      "title": "American Pacific Files Updated Technical Report for its Palmer Copper-Zinc VMS Project in Southeast Alaska",
      "link": "https://www.newsfilecorp.com/release/242968/American-Pacific-Files-Updated-Technical-Report-for-its-Palmer-CopperZinc-VMS-Project-in-Southeast-Alaska",
      "date": "2025-03-03T12:00:00.000Z",
      "hidden": false
    },
    {
      "id": 89423,
      "company_id": 180,
      "title": "American Pacific Mining Positioned to Benefit from Growing US Copper Demand Driven by Tariff Uncertainty",
      "link": "https://www.newsfilecorp.com/release/242574/American-Pacific-Mining-Positioned-to-Benefit-from-Growing-US-Copper-Demand-Driven-by-Tariff-Uncertainty",
      "date": "2025-02-27T12:00:00.000Z",
      "hidden": false
    },
    {
      "id": 84552,
      "company_id": 180,
      "title": "American Pacific Reports Significant Increase in Contained Copper with Updated Mineral Resource Estimate for its Palmer Copper-Zinc VMS Project in Southeast Alaska",
      "link": "https://www.newsfilecorp.com/release/237762/American-Pacific-Reports-Significant-Increase-in-Contained-Copper-with-Updated-Mineral-Resource-Estimate-for-its-Palmer-CopperZinc-VMS-Project-in-Southeast-Alaska",
      "date": "2025-01-20T12:00:00.000Z",
      "hidden": false
    },
    {
      "id": 80547,
      "company_id": 180,
      "title": "American Pacific Closes Transaction to Gain USD$10M and 100% Interest in the Palmer VMS Project in Alaska",
      "link": "https://www.newsfilecorp.com/release/231954/American-Pacific-Closes-Transaction-to-Gain-USD10M-and-100-Interest-in-the-Palmer-VMS-Project-in-Alaska",
      "date": "2024-12-02T12:00:00.000Z",
      "hidden": false
    },
    {
      "id": 80134,
      "company_id": 180,
      "title": "American Pacific Reports up to 80.6 g/t Gold, 5.2% Copper and 136 g/t Silver from the 2024 Field Program at its Madison Project",
      "link": "https://www.newsfilecorp.com/release/231547/American-Pacific-Reports-up-to-80.6-gt-Gold-5.2-Copper-and-136-gt-Silver-from-the-2024-Field-Program-at-its-Madison-Project",
      "date": "2024-11-27T12:00:00.000Z",
      "hidden": false
    },
    {
      "id": 79082,
      "company_id": 180,
      "title": "American Pacific Receives US$10 Million and 100% Interest in the Palmer VMS Project in Alaska",
      "link": "https://www.newsfilecorp.com/release/230311/American-Pacific-Receives-US10-Million-and-100-Interest-in-the-Palmer-VMS-Project-in-Alaska",
      "date": "2024-11-18T12:00:00.000Z",
      "hidden": false
    },
    {
      "id": 77879,
      "company_id": 180,
      "title": "American Pacific Reports 18.0 Metres of 1.5% Copper and 5.4% Zinc (4.4% CuEq) from Zone 2-3 at Palmer Copper-Zinc VMS Project in Southeast Alaska",
      "link": "https://www.newsfilecorp.com/release/229018/American-Pacific-Reports-18.0-Metres-of-1.5-Copper-and-5.4-Zinc-4.4-CuEq-from-Zone-23-at-Palmer-CopperZinc-VMS-Project-in-Southeast-Alaska",
      "date": "2024-11-06T12:00:00.000Z",
      "hidden": false
    }
  ]
}
