{
  "article": {
    "id": 48563,
    "link": "https://www.newsfilecorp.com/release/197137/Basin-Uranium-Stakes-New-Uranium-Project",
    "title": "Basin Uranium Stakes New Uranium Project",
    "description": "<img src=\"https://api.newsfilecorp.com/newsinfo/197137/367\" id=\"367\" width=\"2\" height=\"2\" style=\"width: 1px;  height: 1px;border: 0px solid;\" /><p>Vancouver, British Columbia--(Newsfile Corp. - February 7, 2024) - <b>BASIN URANIUM CORP. (CSE: NCLR) (CNSX: NCLR.CN) </b>(\"<b>Basin Uranium</b>\" or the \"<b>Company</b>\") is pleased to announce it has acquired the Wolf Canyon Uranium Project (the \"<b>Project</b>\" or \"<b>Wolf Canyon</b>\") located in Fall River County, South Dakota, USA. The Project, which was acquired through direct staking by the Company, is comprised of 80 unpatented mineral lode claims totaling 1,600 acres located two miles east of US Hwy-18 and approximately eight miles east of the Company's flagship Chord project.</p><p>\"The staking of Wolf Canyon represents our continued expansion into the USA, focused on acquiring strategic assets located in prolific mining districts with extensive historical exploration,\" commented Mike Blady, CEO of Basin Uranium. \"The recent tabling of House Bill 1071, efforts are underway to allow the governor to agree with the Nuclear Regulatory Commission to bring uranium mining and nuclear energy back to the Rushmore State (South Dakota) which has nearly 300 historic mines and prospects in the western portion of the state alone.\"</p><p style=\"text-align: center;\"><a rel=\"nofollow\" href=\"https://images.newsfilecorp.com/files/8416/197137_2d4bc826f4d8c899_001full.jpg\"><img src=\"https://images.newsfilecorp.com/files/8416/197137_2d4bc826f4d8c899_001.jpg\" style=\"border-width: 0px;\" alt=\"Cannot view this image? Visit: https://images.newsfilecorp.com/files/8416/197137_2d4bc826f4d8c899_001.jpg\" /></a><br /><u>Figure 1: Wolf Canyon Project Map</u></p><p style=\"text-align: center;\">To view an enhanced version of this graphic, please visit:<br /><a rel=\"nofollow\" href=\"https://images.newsfilecorp.com/files/8416/197137_2d4bc826f4d8c899_001full.jpg\">https://images.newsfilecorp.com/files/8416/197137_2d4bc826f4d8c899_001full.jpg</a></p><p><b>Wolf Canyon Project, South Dakota</b></p><p>The Wolf Canyon Uranium Project is comprised of 1,600 acres of contiguous claims (80 unpatented mineral lode claims) located 10 miles east of Edgemont, South Dakota. Access to the property is facilitated through US Highway 18, located two miles to the west, with year-round gravel and ATV roads servicing the claims. The Wolf Canyon project lies within the northeast trending Long Mountain structural zone with uranium mineralization hosted in the Inyan Kara sedimentary group. The uranium deposits of southwest South Dakota are roll-front style typically found in paleo-fluvial channels similar to those found in Wyoming and other productive districts. Exploration on Wolf Canyon dates back to the 1970's with several large companies having drilled numerous wells on the property. Specifically, resource drilling by Union Carbide Corp. in the 1970's reported uranium mineralization significant enough to commission an internal resource, however additional verification and validation must be performed by the Company's Qualified Person before being disclosed publicly.  </p><p><b>Qualified Person:</b></p><p>R. Tim Henneberry, PGeo (B.C.), a technical advisor to the Company, is the Qualified Person as defined by National Instrument 43-101 who has reviewed and approved the technical data in this news release.</p><p><b>Option and Restricted Share Unit Grant</b></p><p>The Company has granted a total of 267,211 stock options under the Company's stock option plan to various business consultants. The options vest immediately and are exercisable for a period of five years at an exercise price of $0.33. </p><p>In addition, the Company has also issued an aggregate of 305,000 restricted share units (\"RSUs\") to certain officers, directors and consultants of the Company. The RSUs vest immediately and are exercisable for a period of five years. The incentive options and RSUs are subject to a hold period of four months and a day from issuance in accordance with the Canadian Securities Exchange Policy 6. </p><p><b>Investor Relations</b></p><p>The Company has entered into an agreement dated February 6, 2024 (the \"<b>IR Agreement</b>\") with Brisco Capital Partners Corp. (\"<b>Brisco</b>\") pursuant to which Brisco will provide the Company with marketing and investor relations services to expand investor awareness of the Company's business and to communicate with the investment community (the \"<b>Promotional Activity</b>\"). The Promotional Activity will include liaising with the investment community, introducing the management of the Company to investors, assisting in the presentation of information to those potential investors, and may also include the organization of roadshows. The Company has engaged Brisco for a term of 12 months, unless extended by the parties, and the Promotional Activity is expected to commence on February 6, 2024 and is expected to end on or around February 6, 2025. The Company is permitted to terminate the IR Agreement at any time upon giving 30 days of notice to Brisco.</p><p>As consideration for the provision of the Promotional Activity, and pursuant to the terms and conditions of the IR Agreement, the Company has agreed to (i) pay Brisco a monthly fee of $7,500, (ii) grant Brisco 250,000 stock options (the \"<b>Brisco Options</b>\"), and (iii) reimburse Brisco for all reasonable out of pocket expenses. The Brisco Options, 25% of which will vest every three months following the date of grant, will be exercisable to acquire common shares at a price of $0.33 for a period of five years from the date of grant.  </p><p>Brisco is an Alberta-based, full-service investor relations firm with more than two decades of experience working with publicly listed Canadian issuers, with a particular focus on resource companies. Brisco assists its clients with formulating and implementing an investor relations and communication strategy, including introducing its clients to a broad network of high-net-worth investors, retail brokers, institutional buyside portfolio managers and industry-specific analysts. Scott Koyich, the principal of Brisco, with an address located at 400, 505 8th Avenue SW. Calgary, Alberta, T2P 1G2 and who can be contacted at (403) 619-2200 and <a href=\"mailto:scott@briscocapital.com\">scott@briscocapital.com</a>, will be involved in conducting the Promotional Activity.  Brisco and Scott Koyich are arm's length from the Company.</p><p><b>About Basin Uranium Corp. </b></p><p>Basin Uranium is a Canadian junior exploration company focused on mineral exploration and development in the green energy sector. The company has three advanced-stage uranium projects located in the United States, namely the Chord and Wolf Canyon project in South Dakota, the South Pass project in Wyoming, and the Wray Mesa project in Utah. All four projects have seen extensive historical exploration and are located in prospective development areas. The Company also has the Mann Lake uranium project, located in the world-class Athabasca basin of Northern Saskatchewan, Canada, in addition to the CHG gold project in south-central British Columbia.</p><p>For further information, please contact Mr. Mike Blady or view the Company's filings at <a href=\"https://api.newsfilecorp.com/redirect/gOqn2fm4Do\">www.sedar.com</a>. </p><p>On Behalf of the Board of Directors<br />Mike Blady<br />Chief Executive Officer<br /><a href=\"mailto:info@basinuranium.ca\">info@basinuranium.ca<br /></a>604-722-9842</p><p><i><b>Neither the Canadian Securities Exchange nor its regulation services provider accepts responsibility for the adequacy or accuracy of this news release</b></i><b>. </b></p><p><b>FORWARD-LOOKING STATEMENTS: </b></p><p><i>Cautionary Note Regarding Forward-Looking Statements: This news release includes certain statements and information that may constitute forward-looking information within the meaning of applicable Canadian securities laws. All statements in this news release, other than statements of historical facts, including statements regarding future estimates, plans, objectives, timing, assumptions or expectations of future performance are forward-looking statements and contain forward-looking information. Generally, forward-looking statements and information can be identified by the use of forward-looking terminology such as \"intends\" or \"anticipates\", or variations of such words and phrases or statements that certain actions, events or results \"may\", \"could\", \"should\", \"would\" or \"occur\". Forward-Looking statements are based on certain material assumptions and analysis made by the Company and the opinions and estimates of management as of the date of this news release. These forward-looking statements are subject to known and unknown risks, uncertainties and other factors that may cause the actual results, level of activity, performance or achievements of the Company to be materially different from those expressed or implied by such forward-looking statements or forward-looking information. Important factors that may cause actual results to vary include, without limitation, uncertainties affecting the expected use of proceeds. Although management of the Company has attempted to identify important factors that could cause actual results to differ materially from those contained in forward-looking statements or forward-looking information, there may be other factors that cause results not to be as anticipated, estimated or intended. There can be no assurance that such statements will prove to be accurate, as actual results and future events could differ materially from those anticipated in such statements. Accordingly, readers should not place undue reliance on forward-looking statements and forward-looking information. Readers are cautioned that reliance on such information may not be appropriate for other purposes. The Company does not undertake to update any forward-looking statement, forward-looking information or financial out-look that are incorporated by reference herein, except in accordance with applicable securities laws. </i></p><p id=\"corporateLinkBack\">To view the source version of this press release, please visit <a href=\"https://api.newsfilecorp.com/redirect/pEqXAfjEQY\">https://www.newsfilecorp.com/release/197137</a></p>",
    "search_terms": "Wolf Canyon,Basin Uranium Corp,NCLR",
    "master_gid": 6343,
    "date": "2024-02-07T14:00:00.000Z",
    "tags": "USA|South Dakota||Uranium|Project Acquisition",
    "image_id": null,
    "hidden": false,
    "company_id": 1142,
    "provider": null,
    "excerpt": "Vancouver, British Columbia--(Newsfile Corp. - February 7, 2024) -BASIN URANIUM CORP. (CSE: NCLR) (CNSX: NCLR.CN)(\"Basin Uranium\" or the \"Company\") is pleased to announce it has acquired the Wolf Canyon Uranium Project (the \"Project\" or \"Wolf Canyon\") located in Fall River County, South Dakota, USA. The Project, which was acquired through",
    "is_regulatory": false,
    "refined_tags": [
      "Project Acquisition"
    ],
    "ftp_filename": null,
    "company_name": "Basin Uranium Corp",
    "exchange": "CSE",
    "root_ticker": "NCLR",
    "project_name": "Wolf Canyon",
    "gid": 6343,
    "location": "South Dakota, United States",
    "plan_id": null,
    "description_text": "Vancouver, British Columbia--(Newsfile Corp. - February 7, 2024) - BASIN URANIUM CORP. (CSE: NCLR) (CNSX: NCLR.CN) (\" Basin Uranium \" or the \" Company \") is pleased to announce it has acquired the Wolf Canyon Uranium Project (the \" Project \" or \" Wolf Canyon \") located in Fall River County, South Dakota, USA. The Project, which was acquired through direct staking by the Company, is comprised of 80 unpatented mineral lode claims totaling 1,600 acres located two miles east of US Hwy-18 and approximately eight miles east of the Company's flagship Chord project. \"The staking of Wolf Canyon represents our continued expansion into the USA, focused on acquiring strategic assets located in prolific mining districts with extensive historical exploration,\" commented Mike Blady, CEO of Basin Uranium. \"The recent tabling of House Bill 1071, efforts are underway to allow the governor to agree with the Nuclear Regulatory Commission to bring uranium mining and nuclear energy back to the Rushmore State (South Dakota) which has nearly 300 historic mines and prospects in the western portion of the state alone.\" Figure 1: Wolf Canyon Project Map To view an enhanced version of this graphic, please visit: https://images.newsfilecorp.com/files/8416/197137_2d4bc826f4d8c899_001full.jpg Wolf Canyon Project, South Dakota The Wolf Canyon Uranium Project is comprised of 1,600 acres of contiguous claims (80 unpatented mineral lode claims) located 10 miles east of Edgemont, South Dakota. Access to the property is facilitated through US Highway 18, located two miles to the west, with year-round gravel and ATV roads servicing the claims. The Wolf Canyon project lies within the northeast trending Long Mountain structural zone with uranium mineralization hosted in the Inyan Kara sedimentary group. The uranium deposits of southwest South Dakota are roll-front style typically found in paleo-fluvial channels similar to those found in Wyoming and other productive districts. Exploration on Wolf Canyon dates back to the 1970's with several large companies having drilled numerous wells on the property. Specifically, resource drilling by Union Carbide Corp. in the 1970's reported uranium mineralization significant enough to commission an internal resource, however additional verification and validation must be performed by the Company's Qualified Person before being disclosed publicly. Qualified Person: R. Tim Henneberry, PGeo (B.C.), a technical advisor to the Company, is the Qualified Person as defined by National Instrument 43-101 who has reviewed and approved the technical data in this news release. Option and Restricted Share Unit Grant The Company has granted a total of 267,211 stock options under the Company's stock option plan to various business consultants. The options vest immediately and are exercisable for a period of five years at an exercise price of $0.33. In addition, the Company has also issued an aggregate of 305,000 restricted share units (\"RSUs\") to certain officers, directors and consultants of the Company. The RSUs vest immediately and are exercisable for a period of five years. The incentive options and RSUs are subject to a hold period of four months and a day from issuance in accordance with the Canadian Securities Exchange Policy 6. Investor Relations The Company has entered into an agreement dated February 6, 2024 (the \" IR Agreement \") with Brisco Capital Partners Corp. (\" Brisco \") pursuant to which Brisco will provide the Company with marketing and investor relations services to expand investor awareness of the Company's business and to communicate with the investment community (the \" Promotional Activity \"). The Promotional Activity will include liaising with the investment community, introducing the management of the Company to investors, assisting in the presentation of information to those potential investors, and may also include the organization of roadshows. The Company has engaged Brisco for a term of 12 months, unless extended by the parties, and the Promotional Activity is expected to commence on February 6, 2024 and is expected to end on or around February 6, 2025. The Company is permitted to terminate the IR Agreement at any time upon giving 30 days of notice to Brisco. As consideration for the provision of the Promotional Activity, and pursuant to the terms and conditions of the IR Agreement, the Company has agreed to (i) pay Brisco a monthly fee of $7,500, (ii) grant Brisco 250,000 stock options (the \" Brisco Options \"), and (iii) reimburse Brisco for all reasonable out of pocket expenses. The Brisco Options, 25% of which will vest every three months following the date of grant, will be exercisable to acquire common shares at a price of $0.33 for a period of five years from the date of grant. Brisco is an Alberta-based, full-service investor relations firm with more than two decades of experience working with publicly listed Canadian issuers, with a particular focus on resource companies. Brisco assists its clients with formulating and implementing an investor relations and communication strategy, including introducing its clients to a broad network of high-net-worth investors, retail brokers, institutional buyside portfolio managers and industry-specific analysts. Scott Koyich, the principal of Brisco, with an address located at 400, 505 8th Avenue SW. Calgary, Alberta, T2P 1G2 and who can be contacted at (403) 619-2200 and scott@briscocapital.com , will be involved in conducting the Promotional Activity.  Brisco and Scott Koyich are arm's length from the Company. About Basin Uranium Corp. Basin Uranium is a Canadian junior exploration company focused on mineral exploration and development in the green energy sector. The company has three advanced-stage uranium projects located in the United States, namely the Chord and Wolf Canyon project in South Dakota, the South Pass project in Wyoming, and the Wray Mesa project in Utah. All four projects have seen extensive historical exploration and are located in prospective development areas. The Company also has the Mann Lake uranium project, located in the world-class Athabasca basin of Northern Saskatchewan, Canada, in addition to the CHG gold project in south-central British Columbia. For further information, please contact Mr. Mike Blady or view the Company's filings at www.sedar.com . On Behalf of the Board of Directors Mike Blady Chief Executive Officer info@basinuranium.ca 604-722-9842 Neither the Canadian Securities Exchange nor its regulation services provider accepts responsibility for the adequacy or accuracy of this news release . FORWARD-LOOKING STATEMENTS: Cautionary Note Regarding Forward-Looking Statements: This news release includes certain statements and information that may constitute forward-looking information within the meaning of applicable Canadian securities laws. All statements in this news release, other than statements of historical facts, including statements regarding future estimates, plans, objectives, timing, assumptions or expectations of future performance are forward-looking statements and contain forward-looking information. Generally, forward-looking statements and information can be identified by the use of forward-looking terminology such as \"intends\" or \"anticipates\", or variations of such words and phrases or statements that certain actions, events or results \"may\", \"could\", \"should\", \"would\" or \"occur\". Forward-Looking statements are based on certain material assumptions and analysis made by the Company and the opinions and estimates of management as of the date of this news release. These forward-looking statements are subject to known and unknown risks, uncertainties and other factors that may cause the actual results, level of activity, performance or achievements of the Company to be materially different from those expressed or implied by such forward-looking statements or forward-looking information. Important factors that may cause actual results to vary include, without limitation, uncertainties affecting the expected use of proceeds. Although management of the Company has attempted to identify important factors that could cause actual results to differ materially from those contained in forward-looking statements or forward-looking information, there may be other factors that cause results not to be as anticipated, estimated or intended. There can be no assurance that such statements will prove to be accurate, as actual results and future events could differ materially from those anticipated in such statements. Accordingly, readers should not place undue reliance on forward-looking statements and forward-looking information. Readers are cautioned that reliance on such information may not be appropriate for other purposes. The Company does not undertake to update any forward-looking statement, forward-looking information or financial out-look that are incorporated by reference herein, except in accordance with applicable securities laws. To view the source version of this press release, please visit https://www.newsfilecorp.com/release/197137",
    "primary_commodity": "U"
  },
  "articleProject": {
    "gid": 6343,
    "project_name": "Wolf Canyon",
    "location": "South Dakota, United States"
  },
  "articleExchange": "CSE",
  "articleCompanyId": 1142,
  "articleTicker": "NCLR",
  "articleCompanyName": "Basin Uranium Corp",
  "allOtherCompanyProjects": [
    {
      "company_id": 1142,
      "gid": 6936,
      "project_name": "Great Divide Basin (GDB)",
      "location": "Wyoming, United States"
    },
    {
      "company_id": 1142,
      "gid": 5855,
      "project_name": "South Pass",
      "location": "Wyoming, United States"
    },
    {
      "company_id": 1142,
      "gid": 1969,
      "project_name": "Mann Lake",
      "location": "Saskatchewan, Canada"
    },
    {
      "company_id": 1142,
      "gid": 3522,
      "project_name": "Wray Mesa",
      "location": "Utah, United States"
    },
    {
      "company_id": 1142,
      "gid": 5254,
      "project_name": "Chord",
      "location": "South Dakota, United States"
    },
    {
      "company_id": 1142,
      "gid": 6343,
      "project_name": "Wolf Canyon",
      "location": "South Dakota, United States"
    }
  ],
  "allOtherCompanyNews": [
    {
      "id": 85035,
      "company_id": 1142,
      "title": "Basin Uranium Closes Previously Announced Non-brokered Private Placement of Units",
      "link": "https://www.newsfilecorp.com/release/238155/Basin-Uranium-Closes-Previously-Announced-Nonbrokered-Private-Placement-of-Units",
      "date": "2025-01-23T01:16:00.000Z",
      "hidden": false
    },
    {
      "id": 82892,
      "company_id": 1142,
      "title": "Basin Uranium Announces Non-Brokered Private Placement of Units",
      "link": "https://www.newsfilecorp.com/release/234992/Basin-Uranium-Announces-NonBrokered-Private-Placement-of-Units",
      "date": "2024-12-23T23:00:00.000Z",
      "hidden": false
    },
    {
      "id": 73434,
      "company_id": 1142,
      "title": "Basin Uranium Receives South Pass Project Approval",
      "link": "https://www.newsfilecorp.com/release/224691/Basin-Uranium-Receives-South-Pass-Project-Approval",
      "date": "2024-10-01T13:00:00.000Z",
      "hidden": false
    },
    {
      "id": 71508,
      "company_id": 1142,
      "title": "Basin Uranium Provides Chord Permitting Update",
      "link": "https://www.newsfilecorp.com/release/223142/Basin-Uranium-Provides-Chord-Permitting-Update",
      "date": "2024-09-16T13:00:00.000Z",
      "hidden": false
    },
    {
      "id": 63499,
      "company_id": 1142,
      "title": "Basin Uranium Kicks off Field Surveys at Chord",
      "link": "https://www.newsfilecorp.com/release/214377/Basin-Uranium-Kicks-off-Field-Surveys-at-Chord",
      "date": "2024-06-26T07:05:00.000Z",
      "hidden": false
    },
    {
      "id": 55441,
      "company_id": 1142,
      "title": "Basin Uranium Permits for Additional Drilling and ISR Testing at Chord",
      "link": "https://www.newsfilecorp.com/release/212347/Basin-Uranium-Permits-for-Additional-Drilling-and-ISR-Testing-at-Chord",
      "date": "2024-06-11T07:05:00.000Z",
      "hidden": false
    },
    {
      "id": 54531,
      "company_id": 1142,
      "title": "Basin Uranium Announces Submission of Permit at South Pass",
      "link": "https://www.newsfilecorp.com/release/210703/Basin-Uranium-Announces-Submission-of-Permit-at-South-Pass",
      "date": "2024-05-28T07:05:00.000Z",
      "hidden": false
    },
    {
      "id": 54246,
      "company_id": 1142,
      "title": "Basin Uranium Announces Filing of Technical Report Including Maiden Resource Estimate for Chord",
      "link": "https://www.newsfilecorp.com/release/210036/Basin-Uranium-Announces-Filing-of-Technical-Report-Including-Maiden-Resource-Estimate-for-Chord",
      "date": "2024-05-22T07:05:00.000Z",
      "hidden": false
    },
    {
      "id": 53956,
      "company_id": 1142,
      "title": "Basin Uranium Stakes Uranium Project in the Great Divide Basin, Wyoming",
      "link": "https://www.newsfilecorp.com/release/209419/Basin-Uranium-Stakes-Uranium-Project-in-the-Great-Divide-Basin-Wyoming",
      "date": "2024-05-16T07:05:00.000Z",
      "hidden": false
    },
    {
      "id": 53715,
      "company_id": 1142,
      "title": "Basin Uranium Announces Acceleration of Warrant Expiry Date",
      "link": "https://www.newsfilecorp.com/release/208830/Basin-Uranium-Announces-Acceleration-of-Warrant-Expiry-Date",
      "date": "2024-05-10T20:39:00.000Z",
      "hidden": false
    }
  ]
}
