{
  "article": {
    "id": 54151,
    "link": "https://www.newsfilecorp.com/release/209691/Gold79-Completes-Acquisition-of-the-Tip-Top-Gold-Project",
    "title": "Gold79 Completes Acquisition of the Tip Top Gold Project",
    "description": "<img src=\"https://api.newsfilecorp.com/newsinfo/209691/367\" id=\"367\" width=\"2\" height=\"2\" style=\"width: 1px;  height: 1px;border: 0px solid;\" /><p>Ottawa, Ontario--(Newsfile Corp. - May 21, 2024) - Gold79 Mines Ltd. (TSXV: AUU) (OTCQB: AUSVF) (\"Gold79\" or the \"Company\") is pleased to announce that it has made the final acquisition payment of US$25,000 to the vendor of the Tip Top project. Gold79 now owns 100% of the Tip Top Project in Nevada. </p><p>Derek Macpherson, President and CEO stated, \"<i>When I joined Gold79 three years ago, my view was that any one of our projects could justify our market capitalization at that time. This included the Tip Top project where the 154 historical drill holes included results of 4.57m at 16.31 g/t Au (T98-12) and 9.14m at 14.42 g/t Au (T98-14) within a plus 5-kilometre gold-in-soil anomaly.\"</i> Mr. Macpherson continued, \"<i>While work has been limited over the last three years, we continue to believe that Tip Top is a prospective project and Gold79 continues to look at ways to maximize its value for shareholders, as we focus our current resources on the Gold Chain project.</i>\" </p><p><b>Tip Top Project, Nevada</b></p><p>The Tip Top project is located in Esmeralda County, Nevada at the north end of the White Mountains, five miles south of Montgomery Pass, which is on U.S. Highway 6 between Bishop, CA and Tonopah, NV. The project is approximately 60 km south-south east of the past producing Borealis Mine (approximately 500,000 ounces of gold produced), now operated by Borealis Mining; the past producing Aurora Mine (approximately 1.9M ounces of gold produced), owned by Hecla; and, Headwater Gold's Spring Peak project, where Headwater is partnered with Newmont Gold.</p><p>The project contains several low-sulfidation oxide gold-silver epithermal veins that are peripheral to an altered rhyodacite intrusion emplaced into Jurassic-Cretaceous intrusive and a bimodal package of volcanic rocks. Two of the veins historically produced a total of 6,900 ounces of gold and some silver. Since 1980, the property has been drilled by five companies, with 154 drill holes totaling 7,315 metres.</p><p>Selected historical high-grade drill hole intercepts from the Tip Top Gold project include the following:</p><ul style=\"list-style-type: disc;\"><li>TTD-02 returned 2.44m of 19.82 g/t Au from 20.20m (Hecla 2001)</li><li>TTD-04 returned 2.59m of 7.89 g/t Au from 32.00m (Hecla 2001)</li><li>T98-12 returned 4.57m of 16.31 g/t Au from 28.97m (Dos Amigos 1998)</li><li>T98-14 returned 9.14m of 14.42 g/t Au from 21.34m (Dos Amigos 1998)</li></ul><p>Gold bearing intercepts above are drilled intervals and true width cannot be determined at this time. Historical drilling along the Tip Top vein, and particularly around the Tip Top adit, has identified gold-bearing veins and there is a good possibility of expanding the known mineralization along strike and to depth. </p><p>In 2020, Gold79 completed an extensive mapping and sampling program at Tip Top. Soil sampling revealed multi-kilometre gold-in-soil (Figure 1) and mercury-in-soil (Figure 2) anomalies trending Northeast from where most of the drilling has been completed. Mapping helped identify structural controls of the gold mineralization (Figure 3). Sampling across the known veins in the area of the Tip Top vein returned 6.7m of 11.8 g/t Au and 4.37m of 10.3 g/t Au (Figure 1).</p><p style=\"text-align: center;\"><a rel=\"nofollow\" href=\"https://images.newsfilecorp.com/files/5717/209691_969d52a4f4d5182e_001full.jpg\"><img src=\"https://images.newsfilecorp.com/files/5717/209691_969d52a4f4d5182e_001.jpg\" style=\"border-width: 0px;\" alt=\"Cannot view this image? Visit: https://images.newsfilecorp.com/files/5717/209691_969d52a4f4d5182e_001.jpg\" /></a></p><p style=\"text-align: center;\"><b>Figure 1. Gold-in-Soil Anomaly at the Tip Top Project</b><br /><br />To view an enhanced version of this graphic, please visit:<br /><a rel=\"nofollow\" href=\"https://images.newsfilecorp.com/files/5717/209691_969d52a4f4d5182e_001full.jpg\">https://images.newsfilecorp.com/files/5717/209691_969d52a4f4d5182e_001full.jpg</a></p><p style=\"text-align: center;\"><a rel=\"nofollow\" href=\"https://images.newsfilecorp.com/files/5717/209691_969d52a4f4d5182e_002full.jpg\"><img src=\"https://images.newsfilecorp.com/files/5717/209691_969d52a4f4d5182e_002.jpg\" style=\"border-width: 0px;\" alt=\"Cannot view this image? Visit: https://images.newsfilecorp.com/files/5717/209691_969d52a4f4d5182e_002.jpg\" /></a></p><p style=\"text-align: center;\"><b>Figure 2. Mercury-in-Soil Anomaly at the Tip Top Project</b><br /><br />To view an enhanced version of this graphic, please visit:<br /><a rel=\"nofollow\" href=\"https://images.newsfilecorp.com/files/5717/209691_969d52a4f4d5182e_002full.jpg\">https://images.newsfilecorp.com/files/5717/209691_969d52a4f4d5182e_002full.jpg</a></p><p style=\"text-align: center;\"><a rel=\"nofollow\" href=\"https://images.newsfilecorp.com/files/5717/209691_969d52a4f4d5182e_003full.jpg\"><img src=\"https://images.newsfilecorp.com/files/5717/209691_969d52a4f4d5182e_003.jpg\" style=\"border-width: 0px;\" alt=\"Cannot view this image? Visit: https://images.newsfilecorp.com/files/5717/209691_969d52a4f4d5182e_003.jpg\" /></a></p><p style=\"text-align: center;\"><b>Figure 3. Geological Map with Rock Sampling Results in the Central Zone of the Tip Top Project</b><br /><br />To view an enhanced version of this graphic, please visit:<br /><a rel=\"nofollow\" href=\"https://images.newsfilecorp.com/files/5717/209691_969d52a4f4d5182e_003full.jpg\">https://images.newsfilecorp.com/files/5717/209691_969d52a4f4d5182e_003full.jpg</a></p><p><b>Tip Top Agreement</b></p><p>With the final payment of US$25,000 on May 9, 2024, Gold79 has completed its acquisition of the Tip Top project. The Vendor retains a 1% net smelter return royalty on the property and the Company is obligated to pay the vendor a cash payment of US$200,000 within 30 days of completion of a bankable feasibility study. The Company may purchase the NSR royalty at any time prior to commercial production for US$1,000,000.</p><p><b>Qualified Person / Quality Control and Quality Assurance</b></p><p>Robert Johansing, M.Sc. Econ. Geol., P. Geo., the Company's Vice President, Exploration is a qualified person (\"QP\") as defined by NI 43-101 and has reviewed and approved the technical content of this press release. The QP has not completed sufficient work to verify the historical information on the property, particularly in regards to historical drill results. However, the QP believes that prior drilling and analytical results were completed to industry standard practices.</p><p><b>About Gold79 Mines Ltd.</b></p><p>Gold79 Mines Ltd.  is a TSX Venture listed company focused on building ounces in the Southwest USA. Gold79 has four gold projects, two of which are partnered with major gold producers (Kinross at Jefferson Canyon and Agnico at Greyhound). Gold79 is focused on establishing a maiden resource at its Gold Chain project in Arizona and advancing its Tip Top project in Nevada. </p><p><b>For further information regarding this press release contact:</b> </p><p>Derek Macpherson, President &#38; CEO<br />Phone: 416-294-6713<br />Email: <a href=\"mailto:dm@gold79mines.com\">dm@gold79mines.com</a><br />Website: <a href=\"https://api.newsfilecorp.com/redirect/O3PD0T4yxv\">www.gold79mines.com</a>.</p><p>Book a 30-minute meeting with our CEO <a href=\"https://api.newsfilecorp.com/redirect/PLNrRhV1Za\">here</a>. </p><p>FORWARD-LOOKING STATEMENTS:</p><p><i>This press release may contain forward looking statements that are made as of the date hereof and are based on current expectations, forecasts and assumptions which involve risks and uncertainties associated with our business including any future private placement financing, the uncertainty as to whether further exploration will result in the target(s) being delineated as a mineral resource, capital expenditures, operating costs, mineral resources, recovery rates, grades and prices, estimated goals, expansion and growth of the business and operations, plans and references to the Company's future successes with its business and the economic environment in which the business operates. All such statements are made pursuant to the 'safe harbour' provisions of, and are intended to be forward-looking statements under, applicable Canadian securities legislation. Any statements contained herein that are statements of historical facts may be deemed to be forward-looking statements. By their nature, forward-looking statements require us to make assumptions and are subject to inherent risks and uncertainties. We caution readers of this news release not to place undue reliance on our forward-looking statements as a number of factors could cause actual results or conditions to differ materially from current expectations. Please refer to the risks set forth in the Company's most recent annual MD&#38;A and the Company's continuous disclosure documents that can be found on SEDAR at <a href=\"https://api.newsfilecorp.com/redirect/wW0yDhAmPo\">www.sedarplus.ca</a>. Gold79 does not intend, and disclaims any obligation, except as required by law, to update or revise any forward-looking statements whether as a result of new information, future events or otherwise.</i> </p><p><i>Neither the TSX Venture Exchange nor its Regulation Services Provider (as that term is defined in the policies of the TSX Venture Exchange) accepts responsibility for the adequacy or accuracy of this release.</i></p><p id=\"corporateNewsLogoContainer\"><img src=\"https://images.newsfilecorp.com/files/5717/209691_969d52a4f4d5182e_logo.jpg\" id=\"corporateNewsLogo\" alt=\"Corporate Logo\" /></p><p id=\"corporateLinkBack\">To view the source version of this press release, please visit <a href=\"https://api.newsfilecorp.com/redirect/gORqMixgPn\">https://www.newsfilecorp.com/release/209691</a></p>",
    "search_terms": "Tip Top,West Point Gold Corp.,AUU",
    "master_gid": 4558,
    "date": "2024-05-21T11:00:00.000Z",
    "tags": "USA|Nevada|||Project Acquisition",
    "image_id": null,
    "hidden": false,
    "company_id": 1356,
    "provider": "newsfilecorp",
    "excerpt": "Ottawa, Ontario--(Newsfile Corp. - May 21, 2024) - Gold79 Mines Ltd. (TSXV: AUU) (OTCQB: AUSVF) (\"Gold79\" or the \"Company\") is pleased to announce that it has made the final acquisition payment of US$25,000 to the vendor of the Tip Top project. Gold79 now owns 100% of the Tip Top Project",
    "is_regulatory": false,
    "refined_tags": [
      "Project Acquisition"
    ],
    "ftp_filename": null,
    "company_name": "West Point Gold Corp.",
    "exchange": "TSXV",
    "root_ticker": "WPG",
    "project_name": "Tip Top",
    "gid": 4558,
    "location": "Nevada, United States",
    "plan_id": null,
    "description_text": "Ottawa, Ontario--(Newsfile Corp. - May 21, 2024) - Gold79 Mines Ltd. (TSXV: AUU) (OTCQB: AUSVF) (\"Gold79\" or the \"Company\") is pleased to announce that it has made the final acquisition payment of US$25,000 to the vendor of the Tip Top project. Gold79 now owns 100% of the Tip Top Project in Nevada. Derek Macpherson, President and CEO stated, \" When I joined Gold79 three years ago, my view was that any one of our projects could justify our market capitalization at that time. This included the Tip Top project where the 154 historical drill holes included results of 4.57m at 16.31 g/t Au (T98-12) and 9.14m at 14.42 g/t Au (T98-14) within a plus 5-kilometre gold-in-soil anomaly.\" Mr. Macpherson continued, \" While work has been limited over the last three years, we continue to believe that Tip Top is a prospective project and Gold79 continues to look at ways to maximize its value for shareholders, as we focus our current resources on the Gold Chain project. \" Tip Top Project, Nevada The Tip Top project is located in Esmeralda County, Nevada at the north end of the White Mountains, five miles south of Montgomery Pass, which is on U.S. Highway 6 between Bishop, CA and Tonopah, NV. The project is approximately 60 km south-south east of the past producing Borealis Mine (approximately 500,000 ounces of gold produced), now operated by Borealis Mining; the past producing Aurora Mine (approximately 1.9M ounces of gold produced), owned by Hecla; and, Headwater Gold's Spring Peak project, where Headwater is partnered with Newmont Gold. The project contains several low-sulfidation oxide gold-silver epithermal veins that are peripheral to an altered rhyodacite intrusion emplaced into Jurassic-Cretaceous intrusive and a bimodal package of volcanic rocks. Two of the veins historically produced a total of 6,900 ounces of gold and some silver. Since 1980, the property has been drilled by five companies, with 154 drill holes totaling 7,315 metres. Selected historical high-grade drill hole intercepts from the Tip Top Gold project include the following: TTD-02 returned 2.44m of 19.82 g/t Au from 20.20m (Hecla 2001) TTD-04 returned 2.59m of 7.89 g/t Au from 32.00m (Hecla 2001) T98-12 returned 4.57m of 16.31 g/t Au from 28.97m (Dos Amigos 1998) T98-14 returned 9.14m of 14.42 g/t Au from 21.34m (Dos Amigos 1998) Gold bearing intercepts above are drilled intervals and true width cannot be determined at this time. Historical drilling along the Tip Top vein, and particularly around the Tip Top adit, has identified gold-bearing veins and there is a good possibility of expanding the known mineralization along strike and to depth. In 2020, Gold79 completed an extensive mapping and sampling program at Tip Top. Soil sampling revealed multi-kilometre gold-in-soil (Figure 1) and mercury-in-soil (Figure 2) anomalies trending Northeast from where most of the drilling has been completed. Mapping helped identify structural controls of the gold mineralization (Figure 3). Sampling across the known veins in the area of the Tip Top vein returned 6.7m of 11.8 g/t Au and 4.37m of 10.3 g/t Au (Figure 1). Figure 1. Gold-in-Soil Anomaly at the Tip Top Project To view an enhanced version of this graphic, please visit: https://images.newsfilecorp.com/files/5717/209691_969d52a4f4d5182e_001full.jpg Figure 2. Mercury-in-Soil Anomaly at the Tip Top Project To view an enhanced version of this graphic, please visit: https://images.newsfilecorp.com/files/5717/209691_969d52a4f4d5182e_002full.jpg Figure 3. Geological Map with Rock Sampling Results in the Central Zone of the Tip Top Project To view an enhanced version of this graphic, please visit: https://images.newsfilecorp.com/files/5717/209691_969d52a4f4d5182e_003full.jpg Tip Top Agreement With the final payment of US$25,000 on May 9, 2024, Gold79 has completed its acquisition of the Tip Top project. The Vendor retains a 1% net smelter return royalty on the property and the Company is obligated to pay the vendor a cash payment of US$200,000 within 30 days of completion of a bankable feasibility study. The Company may purchase the NSR royalty at any time prior to commercial production for US$1,000,000. Qualified Person / Quality Control and Quality Assurance Robert Johansing, M.Sc. Econ. Geol., P. Geo., the Company's Vice President, Exploration is a qualified person (\"QP\") as defined by NI 43-101 and has reviewed and approved the technical content of this press release. The QP has not completed sufficient work to verify the historical information on the property, particularly in regards to historical drill results. However, the QP believes that prior drilling and analytical results were completed to industry standard practices. About Gold79 Mines Ltd. Gold79 Mines Ltd.  is a TSX Venture listed company focused on building ounces in the Southwest USA. Gold79 has four gold projects, two of which are partnered with major gold producers (Kinross at Jefferson Canyon and Agnico at Greyhound). Gold79 is focused on establishing a maiden resource at its Gold Chain project in Arizona and advancing its Tip Top project in Nevada. For further information regarding this press release contact: Derek Macpherson, President & CEO Phone: 416-294-6713 Email: dm@gold79mines.com Website: www.gold79mines.com . Book a 30-minute meeting with our CEO here . FORWARD-LOOKING STATEMENTS: This press release may contain forward looking statements that are made as of the date hereof and are based on current expectations, forecasts and assumptions which involve risks and uncertainties associated with our business including any future private placement financing, the uncertainty as to whether further exploration will result in the target(s) being delineated as a mineral resource, capital expenditures, operating costs, mineral resources, recovery rates, grades and prices, estimated goals, expansion and growth of the business and operations, plans and references to the Company's future successes with its business and the economic environment in which the business operates. All such statements are made pursuant to the 'safe harbour' provisions of, and are intended to be forward-looking statements under, applicable Canadian securities legislation. Any statements contained herein that are statements of historical facts may be deemed to be forward-looking statements. By their nature, forward-looking statements require us to make assumptions and are subject to inherent risks and uncertainties. We caution readers of this news release not to place undue reliance on our forward-looking statements as a number of factors could cause actual results or conditions to differ materially from current expectations. Please refer to the risks set forth in the Company's most recent annual MD&A and the Company's continuous disclosure documents that can be found on SEDAR at www.sedarplus.ca . Gold79 does not intend, and disclaims any obligation, except as required by law, to update or revise any forward-looking statements whether as a result of new information, future events or otherwise. Neither the TSX Venture Exchange nor its Regulation Services Provider (as that term is defined in the policies of the TSX Venture Exchange) accepts responsibility for the adequacy or accuracy of this release. To view the source version of this press release, please visit https://www.newsfilecorp.com/release/209691",
    "primary_commodity": "Au"
  },
  "articleProject": {
    "gid": 4558,
    "project_name": "Tip Top",
    "location": "Nevada, United States"
  },
  "articleExchange": "TSXV",
  "articleCompanyId": 1356,
  "articleTicker": "WPG",
  "articleCompanyName": "West Point Gold Corp.",
  "allOtherCompanyProjects": [
    {
      "company_id": 1356,
      "gid": 3730,
      "project_name": "Gold Chain",
      "location": "Arizona, United States"
    },
    {
      "company_id": 1356,
      "gid": 4558,
      "project_name": "Tip Top",
      "location": "Nevada, United States"
    },
    {
      "company_id": 1356,
      "gid": 3624,
      "project_name": "Jefferson Canyon",
      "location": "Nevada, United States"
    },
    {
      "company_id": 1356,
      "gid": 10512,
      "project_name": "Jefferson North",
      "location": "Nevada, United States"
    }
  ],
  "allOtherCompanyNews": [
    {
      "id": 108280,
      "company_id": 1356,
      "title": "West Point Gold Drills 32.0m of 2.01 g/t Au; Expands Defined High Grade Zone North to 190 metres of Strike",
      "link": null,
      "date": "2025-06-17T11:00:00.000Z",
      "hidden": false
    },
    {
      "id": 107565,
      "company_id": 1356,
      "title": "West Point Gold Completes C$8 Million Financing",
      "link": null,
      "date": "2025-06-10T15:48:00.000Z",
      "hidden": false
    },
    {
      "id": 106359,
      "company_id": 1356,
      "title": "WEST POINT GOLD ANNOUNCES C$7 MILLION PRIVATE PLACEMENT",
      "link": "https://contentapi.cision.com/api/v1.0/releases/20250529C1581",
      "date": "2025-05-29T22:37:00.000Z",
      "hidden": false
    },
    {
      "id": 104753,
      "company_id": 1356,
      "title": "West Point Gold Announces Additional Drill Results from Gold Chain Project, Arizona",
      "link": null,
      "date": "2025-05-15T11:00:00.000Z",
      "hidden": false
    },
    {
      "id": 102999,
      "company_id": 1356,
      "title": "West Point Gold Eliminates Royalty and Future Payment on Tip Top Project, Nevada",
      "link": null,
      "date": "2025-05-01T11:00:00.000Z",
      "hidden": false
    },
    {
      "id": -191536,
      "company_id": 1356,
      "title": "Canadian Investment Regulatory Organization Trade Resumption - WPG",
      "link": "https://contentapi.cision.com/api/v1.0/releases/20250422C8943",
      "date": "2025-04-22T14:03:00.000Z",
      "hidden": false
    },
    {
      "id": 100456,
      "company_id": 1356,
      "title": "West Point Gold Drills 30.48m of 9.05 g/t Au, 33.52m of 5.46 g/t Au, and 28.96m of 6.02 g/t Au",
      "link": null,
      "date": "2025-04-22T13:52:00.000Z",
      "hidden": false
    },
    {
      "id": -191526,
      "company_id": 1356,
      "title": "Canadian Investment Regulatory Organization Trading Halt - WPG",
      "link": "https://contentapi.cision.com/api/v1.0/releases/20250422C3727",
      "date": "2025-04-22T12:12:00.000Z",
      "hidden": false
    },
    {
      "id": 99974,
      "company_id": 1356,
      "title": "West Point Gold Intersects 22.86m of 3.34 g/t Au and 28.95m of 1.92 g/t Au at Gold Chain Project, Arizona",
      "link": null,
      "date": "2025-04-16T11:00:00.000Z",
      "hidden": false
    },
    {
      "id": 98599,
      "company_id": 1356,
      "title": "West Point Gold Intersects 41.15m of 0.83 g/t Au and 22.86m of 1.43 g/t Au at Gold Chain Project, Arizona",
      "link": null,
      "date": "2025-04-03T11:00:00.000Z",
      "hidden": false
    }
  ]
}
