{
  "article": {
    "id": 45379,
    "link": "https://www.newsfilecorp.com/release/190026/Basin-Uranium-Stakes-Significant-New-Uranium-Project-in-Wyoming",
    "title": "Basin Uranium Stakes Significant New Uranium Project in Wyoming",
    "description": "<img src=\"https://api.newsfilecorp.com/newsinfo/190026/367\" id=\"367\" width=\"2\" height=\"2\" style=\"width: 1px;  height: 1px;border: 0px solid;\" /><p>Vancouver, British Columbia--(Newsfile Corp. - December 6, 2023) - <b>BASIN URANIUM CORP. (CSE: NCLR) </b>(\"<b>Basin Uranium</b>\" or the \"<b>Company</b>\") is pleased to announce it has acquired the South Pass Property Uranium Project (the \"<b>Project</b>\" or \"<b>South Pass</b>\") located in Fremont and Sublette County, Wyoming, USA. The Project, which was acquired through direct staking by the Company, is comprised of 151 unpatented mineral lode claims totaling 3,775 acres located along the perimeter of the Great Divide Basin of Wyoming (see Figure 1). Wyoming is home to both the largest uranium reserves and top producing state in US<sup>1</sup>, with the Great Divide Basin representing the least exploited of Wyoming's basins estimated to contain over 270 million pounds of uranium<sup>2</sup>.</p><p>\"The staking of the South Pass property represents our continued expansion into the USA, focused on acquiring strategic assets located in in prolific mining districts with extensive historical exploration,\" commented Mike Blady, CEO of Basin Uranium. \"Preliminary review of historical exploration records for South Pass dating back to the 1960's indicates the potential to host ISR-amendable uranium mineralization. Wyoming represents one of the premiere exploration and mining jurisdictions for uranium within the USA which provides for a clearly defined and expedient pathway for permitting and development.\"</p><p style=\"text-align: center;\"><a rel=\"nofollow\" href=\"https://images.newsfilecorp.com/files/8416/190026_70125bf5f4a45bce_001full.jpg\"><img src=\"https://images.newsfilecorp.com/files/8416/190026_70125bf5f4a45bce_001.jpg\" style=\"border-width: 0px;\" alt=\"Cannot view this image? Visit: https://images.newsfilecorp.com/files/8416/190026_70125bf5f4a45bce_001.jpg\" /></a></p><p style=\"text-align: center;\"><u>Figure 1: South Pass Project Map</u><br /><br />To view an enhanced version of this graphic, please visit:<br /><a rel=\"nofollow\" href=\"https://images.newsfilecorp.com/files/8416/190026_70125bf5f4a45bce_001full.jpg\">https://images.newsfilecorp.com/files/8416/190026_70125bf5f4a45bce_001full.jpg</a></p><p><b>South Pass Project, Wyoming</b></p><p>The South Pass Uranium Project is comprised of 3,775 acres of contiguous claims (151 unpatented mineral lode claims) located 45 miles southwest of Lander, Wyoming. Access to the property is facilitated through State Highway 28, located within 5 miles to the southeast, with year-round gravel and ATV roads servicing the claims. Exploration dates back to the 1960's and 1970's with several large companies having drilled numerous wells along a 12-mile-long trend that bisects the long axis of the property. Specifically, close-spaced drilling by Rocky Mountain Energy Corp. (a subsidiary of Union Pacific Railway) in the 1980's reported uranium mineralization at depths of over 400 feet - depths which would be potentially amenable to in-situ recovery (ISR) methods. Evaluation of historical records also indicated a historic resource was calculated on at least two parts of the claims currently comprising the South Pass project, however additional verification and validation must be performed by the Company's Qualified Person before being disclosed publicly. </p><p><i>The reader is cautioned that at this time it is too early to assess the feasibility of these recovery methods at South Pass however mineralization at this depth typically lies within the parameters of ISR mining and recovery.</i></p><p><b>Qualified Person:</b></p><p>R. Tim Henneberry, PGeo (B.C.), a technical advisor to the Company, is the Qualified Person as defined by National Instrument 43-101 who has reviewed and approved the technical data in this news release.</p><p><b>About Basin Uranium Corp. </b></p><p>Basin Uranium is a Canadian junior exploration company focused on mineral exploration and development in the green energy sector. The Company has three advanced-stage uranium projects located in the United States, namely the Chord project in South Dakota, the South Pass project in Wyoming, and the Wray Mesa project in Utah. All three projects have seen extensive historical exploration and are located in prospective development areas. The Company also has the Mann Lake uranium project, located in the world-class Athabasca basin of Northern Saskatchewan, Canada, in addition to the CHG gold project in south-central British Columbia.</p><p>For further information, please contact Mr. Mike Blady or view the Company's filings at <a href=\"https://api.newsfilecorp.com/redirect/eL7vaS2JwM\">www.sedarplus.ca</a>.</p><p>On Behalf of the Board of Directors<br />Mike Blady<br />Chief Executive Officer<br /><a href=\"mailto:info@basinuranium.ca\">info@basinuranium.ca</a><br />604-722-9842</p><p><i><b>Neither the Canadian Securities Exchange nor its regulation services provider accepts responsibility for the adequacy or accuracy of this news release</b></i><b>. </b></p><p><b>FORWARD-LOOKING STATEMENTS: </b></p><p><i>Cautionary Note Regarding Forward-Looking Statements: This news release includes certain statements and information that may constitute forward-looking information within the meaning of applicable Canadian securities laws. All statements in this news release, other than statements of historical facts, including statements regarding future estimates, plans, objectives, timing, assumptions or expectations of future performance are forward-looking statements and contain forward-looking information. Generally, forward-looking statements and information can be identified by the use of forward-looking terminology such as \"intends\" or \"anticipates\", or variations of such words and phrases or statements that certain actions, events or results \"may\", \"could\", \"should\", \"would\" or \"occur\". Forward-looking statements are based on certain material assumptions and analysis made by the Company and the opinions and estimates of management as of the date of this news release. These forward-looking statements are subject to known and unknown risks, uncertainties and other factors that may cause the actual results, level of activity, performance or achievements of the Company to be materially different from those expressed or implied by such forward-looking statements or forward-looking information. Important factors that may cause actual results to vary include, without limitation, uncertainties affecting the expected use of proceeds. Although management of the Company has attempted to identify important factors that could cause actual results to differ materially from those contained in forward-looking statements or forward-looking information, there may be other factors that cause results not to be as anticipated, estimated or intended. There can be no assurance that such statements will prove to be accurate, as actual results and future events could differ materially from those anticipated in such statements. Accordingly, readers should not place undue reliance on forward-looking statements and forward-looking information. Readers are cautioned that reliance on such information may not be appropriate for other purposes. The Company does not undertake to update any forward-looking statement, forward-looking information or financial out-look that are incorporated by reference herein, except in accordance with applicable securities laws. </i></p><hr style=\"width: 33%; margin-left: 0px; border-top: 1px solid #000000;\" /><p><sup>1</sup>Domestic Uranium Production Report - Q2/2023, US Energy Information Administration <a href=\"https://api.newsfilecorp.com/redirect/852OPheG2m\">https://www.eia.gov/uranium/production/quarterly/qupdtable1.php</a><br /><sup>2</sup>Applied Exploration Geology and Uranium Resources of Great Divide Basin, Wyoming <a href=\"https://api.newsfilecorp.com/redirect/yE25Luw1ea\">https://pubs.geoscienceworld.org/aapgbull/article-abstract/63/5/822/558172/Applied-Exploration-Geology-and-Uranium-Resources</a></p><p id=\"corporateLinkBack\">To view the source version of this press release, please visit <a href=\"https://api.newsfilecorp.com/redirect/1p2v3fBrK0\">https://www.newsfilecorp.com/release/190026</a></p>",
    "search_terms": "South Pass,Basin Uranium Corp,NCLR",
    "master_gid": 5855,
    "date": "2023-12-06T08:02:00.000Z",
    "tags": "USA|Wyoming||Uranium|Project Acquisition",
    "image_id": null,
    "hidden": false,
    "company_id": 1142,
    "provider": null,
    "excerpt": "Vancouver, British Columbia--(Newsfile Corp. - December 6, 2023) -BASIN URANIUM CORP. (CSE: NCLR)(\"Basin Uranium\" or the \"Company\") is pleased to announce it has acquired the South Pass Property Uranium Project (the \"Project\" or \"South Pass\") located in Fremont and Sublette County, Wyoming, USA. The Project, which was acquired through direct",
    "is_regulatory": false,
    "refined_tags": [
      "Project Acquisition"
    ],
    "ftp_filename": null,
    "company_name": "Basin Uranium Corp",
    "exchange": "CSE",
    "root_ticker": "NCLR",
    "project_name": "South Pass",
    "gid": 5855,
    "location": "Wyoming, United States",
    "plan_id": null,
    "description_text": "Vancouver, British Columbia--(Newsfile Corp. - December 6, 2023) - BASIN URANIUM CORP. (CSE: NCLR) (\" Basin Uranium \" or the \" Company \") is pleased to announce it has acquired the South Pass Property Uranium Project (the \" Project \" or \" South Pass \") located in Fremont and Sublette County, Wyoming, USA. The Project, which was acquired through direct staking by the Company, is comprised of 151 unpatented mineral lode claims totaling 3,775 acres located along the perimeter of the Great Divide Basin of Wyoming (see Figure 1). Wyoming is home to both the largest uranium reserves and top producing state in US 1 , with the Great Divide Basin representing the least exploited of Wyoming's basins estimated to contain over 270 million pounds of uranium 2 . \"The staking of the South Pass property represents our continued expansion into the USA, focused on acquiring strategic assets located in in prolific mining districts with extensive historical exploration,\" commented Mike Blady, CEO of Basin Uranium. \"Preliminary review of historical exploration records for South Pass dating back to the 1960's indicates the potential to host ISR-amendable uranium mineralization. Wyoming represents one of the premiere exploration and mining jurisdictions for uranium within the USA which provides for a clearly defined and expedient pathway for permitting and development.\" Figure 1: South Pass Project Map To view an enhanced version of this graphic, please visit: https://images.newsfilecorp.com/files/8416/190026_70125bf5f4a45bce_001full.jpg South Pass Project, Wyoming The South Pass Uranium Project is comprised of 3,775 acres of contiguous claims (151 unpatented mineral lode claims) located 45 miles southwest of Lander, Wyoming. Access to the property is facilitated through State Highway 28, located within 5 miles to the southeast, with year-round gravel and ATV roads servicing the claims. Exploration dates back to the 1960's and 1970's with several large companies having drilled numerous wells along a 12-mile-long trend that bisects the long axis of the property. Specifically, close-spaced drilling by Rocky Mountain Energy Corp. (a subsidiary of Union Pacific Railway) in the 1980's reported uranium mineralization at depths of over 400 feet - depths which would be potentially amenable to in-situ recovery (ISR) methods. Evaluation of historical records also indicated a historic resource was calculated on at least two parts of the claims currently comprising the South Pass project, however additional verification and validation must be performed by the Company's Qualified Person before being disclosed publicly. The reader is cautioned that at this time it is too early to assess the feasibility of these recovery methods at South Pass however mineralization at this depth typically lies within the parameters of ISR mining and recovery. Qualified Person: R. Tim Henneberry, PGeo (B.C.), a technical advisor to the Company, is the Qualified Person as defined by National Instrument 43-101 who has reviewed and approved the technical data in this news release. About Basin Uranium Corp. Basin Uranium is a Canadian junior exploration company focused on mineral exploration and development in the green energy sector. The Company has three advanced-stage uranium projects located in the United States, namely the Chord project in South Dakota, the South Pass project in Wyoming, and the Wray Mesa project in Utah. All three projects have seen extensive historical exploration and are located in prospective development areas. The Company also has the Mann Lake uranium project, located in the world-class Athabasca basin of Northern Saskatchewan, Canada, in addition to the CHG gold project in south-central British Columbia. For further information, please contact Mr. Mike Blady or view the Company's filings at www.sedarplus.ca . On Behalf of the Board of Directors Mike Blady Chief Executive Officer info@basinuranium.ca 604-722-9842 Neither the Canadian Securities Exchange nor its regulation services provider accepts responsibility for the adequacy or accuracy of this news release . FORWARD-LOOKING STATEMENTS: Cautionary Note Regarding Forward-Looking Statements: This news release includes certain statements and information that may constitute forward-looking information within the meaning of applicable Canadian securities laws. All statements in this news release, other than statements of historical facts, including statements regarding future estimates, plans, objectives, timing, assumptions or expectations of future performance are forward-looking statements and contain forward-looking information. Generally, forward-looking statements and information can be identified by the use of forward-looking terminology such as \"intends\" or \"anticipates\", or variations of such words and phrases or statements that certain actions, events or results \"may\", \"could\", \"should\", \"would\" or \"occur\". Forward-looking statements are based on certain material assumptions and analysis made by the Company and the opinions and estimates of management as of the date of this news release. These forward-looking statements are subject to known and unknown risks, uncertainties and other factors that may cause the actual results, level of activity, performance or achievements of the Company to be materially different from those expressed or implied by such forward-looking statements or forward-looking information. Important factors that may cause actual results to vary include, without limitation, uncertainties affecting the expected use of proceeds. Although management of the Company has attempted to identify important factors that could cause actual results to differ materially from those contained in forward-looking statements or forward-looking information, there may be other factors that cause results not to be as anticipated, estimated or intended. There can be no assurance that such statements will prove to be accurate, as actual results and future events could differ materially from those anticipated in such statements. Accordingly, readers should not place undue reliance on forward-looking statements and forward-looking information. Readers are cautioned that reliance on such information may not be appropriate for other purposes. The Company does not undertake to update any forward-looking statement, forward-looking information or financial out-look that are incorporated by reference herein, except in accordance with applicable securities laws. 1 Domestic Uranium Production Report - Q2/2023, US Energy Information Administration https://www.eia.gov/uranium/production/quarterly/qupdtable1.php 2 Applied Exploration Geology and Uranium Resources of Great Divide Basin, Wyoming https://pubs.geoscienceworld.org/aapgbull/article-abstract/63/5/822/558172/Applied-Exploration-Geology-and-Uranium-Resources To view the source version of this press release, please visit https://www.newsfilecorp.com/release/190026",
    "primary_commodity": "U"
  },
  "articleProject": {
    "gid": 5855,
    "project_name": "South Pass",
    "location": "Wyoming, United States"
  },
  "articleExchange": "CSE",
  "articleCompanyId": 1142,
  "articleTicker": "NCLR",
  "articleCompanyName": "Basin Uranium Corp",
  "allOtherCompanyProjects": [
    {
      "company_id": 1142,
      "gid": 6936,
      "project_name": "Great Divide Basin (GDB)",
      "location": "Wyoming, United States"
    },
    {
      "company_id": 1142,
      "gid": 5855,
      "project_name": "South Pass",
      "location": "Wyoming, United States"
    },
    {
      "company_id": 1142,
      "gid": 1969,
      "project_name": "Mann Lake",
      "location": "Saskatchewan, Canada"
    },
    {
      "company_id": 1142,
      "gid": 3522,
      "project_name": "Wray Mesa",
      "location": "Utah, United States"
    },
    {
      "company_id": 1142,
      "gid": 5254,
      "project_name": "Chord",
      "location": "South Dakota, United States"
    },
    {
      "company_id": 1142,
      "gid": 6343,
      "project_name": "Wolf Canyon",
      "location": "South Dakota, United States"
    }
  ],
  "allOtherCompanyNews": [
    {
      "id": 85035,
      "company_id": 1142,
      "title": "Basin Uranium Closes Previously Announced Non-brokered Private Placement of Units",
      "link": "https://www.newsfilecorp.com/release/238155/Basin-Uranium-Closes-Previously-Announced-Nonbrokered-Private-Placement-of-Units",
      "date": "2025-01-23T01:16:00.000Z",
      "hidden": false
    },
    {
      "id": 82892,
      "company_id": 1142,
      "title": "Basin Uranium Announces Non-Brokered Private Placement of Units",
      "link": "https://www.newsfilecorp.com/release/234992/Basin-Uranium-Announces-NonBrokered-Private-Placement-of-Units",
      "date": "2024-12-23T23:00:00.000Z",
      "hidden": false
    },
    {
      "id": 73434,
      "company_id": 1142,
      "title": "Basin Uranium Receives South Pass Project Approval",
      "link": "https://www.newsfilecorp.com/release/224691/Basin-Uranium-Receives-South-Pass-Project-Approval",
      "date": "2024-10-01T13:00:00.000Z",
      "hidden": false
    },
    {
      "id": 71508,
      "company_id": 1142,
      "title": "Basin Uranium Provides Chord Permitting Update",
      "link": "https://www.newsfilecorp.com/release/223142/Basin-Uranium-Provides-Chord-Permitting-Update",
      "date": "2024-09-16T13:00:00.000Z",
      "hidden": false
    },
    {
      "id": 63499,
      "company_id": 1142,
      "title": "Basin Uranium Kicks off Field Surveys at Chord",
      "link": "https://www.newsfilecorp.com/release/214377/Basin-Uranium-Kicks-off-Field-Surveys-at-Chord",
      "date": "2024-06-26T07:05:00.000Z",
      "hidden": false
    },
    {
      "id": 55441,
      "company_id": 1142,
      "title": "Basin Uranium Permits for Additional Drilling and ISR Testing at Chord",
      "link": "https://www.newsfilecorp.com/release/212347/Basin-Uranium-Permits-for-Additional-Drilling-and-ISR-Testing-at-Chord",
      "date": "2024-06-11T07:05:00.000Z",
      "hidden": false
    },
    {
      "id": 54531,
      "company_id": 1142,
      "title": "Basin Uranium Announces Submission of Permit at South Pass",
      "link": "https://www.newsfilecorp.com/release/210703/Basin-Uranium-Announces-Submission-of-Permit-at-South-Pass",
      "date": "2024-05-28T07:05:00.000Z",
      "hidden": false
    },
    {
      "id": 54246,
      "company_id": 1142,
      "title": "Basin Uranium Announces Filing of Technical Report Including Maiden Resource Estimate for Chord",
      "link": "https://www.newsfilecorp.com/release/210036/Basin-Uranium-Announces-Filing-of-Technical-Report-Including-Maiden-Resource-Estimate-for-Chord",
      "date": "2024-05-22T07:05:00.000Z",
      "hidden": false
    },
    {
      "id": 53956,
      "company_id": 1142,
      "title": "Basin Uranium Stakes Uranium Project in the Great Divide Basin, Wyoming",
      "link": "https://www.newsfilecorp.com/release/209419/Basin-Uranium-Stakes-Uranium-Project-in-the-Great-Divide-Basin-Wyoming",
      "date": "2024-05-16T07:05:00.000Z",
      "hidden": false
    },
    {
      "id": 53715,
      "company_id": 1142,
      "title": "Basin Uranium Announces Acceleration of Warrant Expiry Date",
      "link": "https://www.newsfilecorp.com/release/208830/Basin-Uranium-Announces-Acceleration-of-Warrant-Expiry-Date",
      "date": "2024-05-10T20:39:00.000Z",
      "hidden": false
    }
  ]
}
