{
  "article": {
    "id": 38184,
    "link": "https://www.newsfilecorp.com/release/174008/Spearmint-Acquires-the-Clayton-Ridge-Project-in-Clayton-Valley-Nevada",
    "title": "Spearmint Acquires the Clayton Ridge Project in Clayton Valley, Nevada",
    "description": "<img src=\"https://api.newsfilecorp.com/newsinfo/174008/367\" id=\"367\" width=\"2\" height=\"2\" style=\"width: 1px;  height: 1px;border: 0px solid;\" /><p>Vancouver, British Columbia--(Newsfile Corp. - July 19, 2023) - <b>Spearmint Resources Inc. (CSE: SPMT) (OTC Pink: SPMTF) (FSE: A2AHL5) (the \"Company\" or \"Spearmint\")</b> wishes to announce the Company has acquired the Clayton Ridge Project in Clayton Valley, Nevada, comprising 35 contiguous claims totalling approximately 721 acres. Plans are currently being formulated for a 2023 drill program in Clayton Valley. Management cautions that past results or discoveries on properties in proximity to Spearmint may not necessarily be indicative to the presence of mineralization on the Company's properties.</p><p style=\"text-align: center;\"><a rel=\"nofollow\" href=\"https://images.newsfilecorp.com/files/4360/174008_a5ae11ac04d3eace_002full.jpg\"><img src=\"https://images.newsfilecorp.com/files/4360/174008_a5ae11ac04d3eace_002.jpg\" style=\"border-width: 0px;\" alt=\"Cannot view this image? Visit: https://images.newsfilecorp.com/files/4360/174008_a5ae11ac04d3eace_002.jpg\" /></a></p><p style=\"text-align: center;\">Spearmint Resources Ownership Map<br /><br />To view an enhanced version of this graphic, please visit:<br /><a rel=\"nofollow\" href=\"https://images.newsfilecorp.com/files/4360/174008_a5ae11ac04d3eace_002full.jpg\">https://images.newsfilecorp.com/files/4360/174008_a5ae11ac04d3eace_002full.jpg</a></p><p>James Nelson, President of Spearmint Resources stated, \"We are pleased to add another project to our Clayton Valley Nevada portfolio at a time when there are potentially several exciting lithium developments ahead. SLB (formerly Schlumberger Limited) is nearing the final stages of testing their lithium brine processing plant on Pure Energy's brine project, where Spearmint's Elon Lithium Brine Project is completely surrounded by Pure Energy's property. Also, regarding Spearmint's McGee Lithium project, which directly borders Century Lithium Corp.'s Clayton Valley Lithium Project, we are expecting developments on Century's collaboration with Koch Technology Solutions on their application of the Li-Pro process for direct lithium extraction. With all these significant developments happening around us in Clayton Valley, combined with our planned upcoming drilling, we feel the second half of 2023 could have a significant impact for our shareholders.\"</p><p>On June 17, 2022, the Company announced that it has received the updated Technical Report and Mineral Resource estimate for the 100-per-cent-owned McGee Lithium Clay Deposit in Clayton Valley, Nevada.  The Technical Report included an updated Mineral Resource estimate of 1,369,000 indicated tonnes and 723,000 inferred tonnes of lithium carbonate equivalent (LCE) for a total of 2,092,000 tonnes of LCE, more than doubling the maiden resource estimate announced on June 11, 2021. The Technical Report and Mineral Resource Estimate was prepared by Derek Loveday, P.Geo. and Mariea Kartick, P.Geo. of Stantec Consulting Services Ltd. (\"Stantec\") in conformity with CIM \"Estimation of Mineral Resource and Mineral Reserves Best Practices\" guidelines and were reported in accordance with the Canadian Securities Administrators NI 43-101. </p><p>The Clayton Ridge Project has been acquired via staking.</p><p><b>Qualified Person</b></p><p>Mr. Frank Bain, P.Geo., a Qualified Person as defined by National Instrument 43-101 has reviewed and approved the scientific and technical disclosure contained within this news release. </p><p><b>About Spearmint Resources</b></p><p>Spearmint's primary projects include four projects in Clayton Valley, Nevada; the McGee lithium clay deposit, which has a resource estimate of 1,369,000 indicated tonnes and 723,000 inferred tonnes of lithium carbonate equivalent (LCE) for a total of 2,092,000 tonnes of LCE, directly bordering Pure Energy Minerals &#38; Century Lithium Corp.; the Elon lithium brine project, which has access to some of the deepest parts of the only lithium brine basin in production in North America; and the recently acquired Green Clay lithium project comprising 97 contiguous claims totalling approximately 2,000 acres, and the Clayton Ridge project comprising 35 contiguous claims totalling approximately 721 acres.</p><p>Spearmint's other primary projects include the Perron-East gold project consisting of five mineral claim blocks covering 11,608 acres located in the Abitibi greenstone belt of Northwestern Quebec in the direct vicinity of Amex Exploration Inc.'s Perron property and past-producing Normetal mine. For a complete list of Spearmint's projects please visit <a href=\"https://api.newsfilecorp.com/redirect/V7mzbc7L2p\">spearmintresources.ca</a>. Management cautions that past results or discoveries on properties in proximity to Spearmint may not necessarily be indicative to the presence of mineralization on the Company's properties.</p><p>If you would like to be added to Spearmint's news distribution list, please send your email address to <a href=\"mailto:info@spearmintresources.ca\">info@spearmintresources.ca</a></p><p>Contact Information<br />Tel: 1604646-6903<br /><a href=\"https://api.newsfilecorp.com/redirect/zEWrRHnqxD\">www.spearmintresources.ca</a></p><p>\"James Nelson\"<br />President<br />Spearmint Resources Inc.</p><p><i>The CSE has not reviewed and does not accept responsibility for the adequacy or accuracy of the content of this release.</i></p><p id=\"corporateNewsLogoContainer\"><img src=\"https://images.newsfilecorp.com/files/4360/174008_a5ae11ac04d3eace_logo.jpg\" id=\"corporateNewsLogo\" alt=\"Corporate Logo\" /></p><p id=\"corporateLinkBack\">To view the source version of this press release, please visit <a href=\"https://api.newsfilecorp.com/redirect/4QWJPUoVn7\">https://www.newsfilecorp.com/release/174008</a></p>",
    "search_terms": "Clayton Ridge,Spearmint Resources Inc.,SPMT",
    "master_gid": 5146,
    "date": "2023-07-19T07:01:00.000Z",
    "tags": "USA|Nevada|||Project Acquisition",
    "image_id": null,
    "hidden": false,
    "company_id": 813,
    "provider": null,
    "excerpt": "Vancouver, British Columbia--(Newsfile Corp. - July 19, 2023) -Spearmint Resources Inc. (CSE: SPMT) (OTC Pink: SPMTF) (FSE: A2AHL5) (the \"Company\" or \"Spearmint\")wishes to announce the Company has acquired the Clayton Ridge Project in Clayton Valley, Nevada, comprising 35 contiguous claims totalling approximately 721 acres. Plans are currently being formulated for",
    "is_regulatory": false,
    "refined_tags": [
      "Project Acquisition"
    ],
    "ftp_filename": null,
    "company_name": "Spearmint Resources Inc.",
    "exchange": "CSE",
    "root_ticker": "SPMT",
    "project_name": "Clayton Ridge",
    "gid": 5146,
    "location": "Nevada, United States",
    "plan_id": null,
    "description_text": "Vancouver, British Columbia--(Newsfile Corp. - July 19, 2023) - Spearmint Resources Inc. (CSE: SPMT) (OTC Pink: SPMTF) (FSE: A2AHL5) (the \"Company\" or \"Spearmint\") wishes to announce the Company has acquired the Clayton Ridge Project in Clayton Valley, Nevada, comprising 35 contiguous claims totalling approximately 721 acres. Plans are currently being formulated for a 2023 drill program in Clayton Valley. Management cautions that past results or discoveries on properties in proximity to Spearmint may not necessarily be indicative to the presence of mineralization on the Company's properties. Spearmint Resources Ownership Map To view an enhanced version of this graphic, please visit: https://images.newsfilecorp.com/files/4360/174008_a5ae11ac04d3eace_002full.jpg James Nelson, President of Spearmint Resources stated, \"We are pleased to add another project to our Clayton Valley Nevada portfolio at a time when there are potentially several exciting lithium developments ahead. SLB (formerly Schlumberger Limited) is nearing the final stages of testing their lithium brine processing plant on Pure Energy's brine project, where Spearmint's Elon Lithium Brine Project is completely surrounded by Pure Energy's property. Also, regarding Spearmint's McGee Lithium project, which directly borders Century Lithium Corp.'s Clayton Valley Lithium Project, we are expecting developments on Century's collaboration with Koch Technology Solutions on their application of the Li-Pro process for direct lithium extraction. With all these significant developments happening around us in Clayton Valley, combined with our planned upcoming drilling, we feel the second half of 2023 could have a significant impact for our shareholders.\" On June 17, 2022, the Company announced that it has received the updated Technical Report and Mineral Resource estimate for the 100-per-cent-owned McGee Lithium Clay Deposit in Clayton Valley, Nevada.  The Technical Report included an updated Mineral Resource estimate of 1,369,000 indicated tonnes and 723,000 inferred tonnes of lithium carbonate equivalent (LCE) for a total of 2,092,000 tonnes of LCE, more than doubling the maiden resource estimate announced on June 11, 2021. The Technical Report and Mineral Resource Estimate was prepared by Derek Loveday, P.Geo. and Mariea Kartick, P.Geo. of Stantec Consulting Services Ltd. (\"Stantec\") in conformity with CIM \"Estimation of Mineral Resource and Mineral Reserves Best Practices\" guidelines and were reported in accordance with the Canadian Securities Administrators NI 43-101. The Clayton Ridge Project has been acquired via staking. Qualified Person Mr. Frank Bain, P.Geo., a Qualified Person as defined by National Instrument 43-101 has reviewed and approved the scientific and technical disclosure contained within this news release. About Spearmint Resources Spearmint's primary projects include four projects in Clayton Valley, Nevada; the McGee lithium clay deposit, which has a resource estimate of 1,369,000 indicated tonnes and 723,000 inferred tonnes of lithium carbonate equivalent (LCE) for a total of 2,092,000 tonnes of LCE, directly bordering Pure Energy Minerals & Century Lithium Corp.; the Elon lithium brine project, which has access to some of the deepest parts of the only lithium brine basin in production in North America; and the recently acquired Green Clay lithium project comprising 97 contiguous claims totalling approximately 2,000 acres, and the Clayton Ridge project comprising 35 contiguous claims totalling approximately 721 acres. Spearmint's other primary projects include the Perron-East gold project consisting of five mineral claim blocks covering 11,608 acres located in the Abitibi greenstone belt of Northwestern Quebec in the direct vicinity of Amex Exploration Inc.'s Perron property and past-producing Normetal mine. For a complete list of Spearmint's projects please visit spearmintresources.ca . Management cautions that past results or discoveries on properties in proximity to Spearmint may not necessarily be indicative to the presence of mineralization on the Company's properties. If you would like to be added to Spearmint's news distribution list, please send your email address to info@spearmintresources.ca Contact Information Tel: 1604646-6903 www.spearmintresources.ca \"James Nelson\" President Spearmint Resources Inc. The CSE has not reviewed and does not accept responsibility for the adequacy or accuracy of the content of this release. To view the source version of this press release, please visit https://www.newsfilecorp.com/release/174008",
    "primary_commodity": "Li"
  },
  "articleProject": {
    "gid": 5146,
    "project_name": "Clayton Ridge",
    "location": "Nevada, United States"
  },
  "articleExchange": "CSE",
  "articleCompanyId": 813,
  "articleTicker": "SPMT",
  "articleCompanyName": "Spearmint Resources Inc.",
  "allOtherCompanyProjects": [
    {
      "company_id": 813,
      "gid": 2280,
      "project_name": "Elon",
      "location": "Nevada, USA"
    },
    {
      "company_id": 813,
      "gid": 2281,
      "project_name": "McGee",
      "location": "Nevada, USA"
    },
    {
      "company_id": 813,
      "gid": 2279,
      "project_name": "Green Clay",
      "location": "Nevada, USA"
    },
    {
      "company_id": 813,
      "gid": 2230,
      "project_name": "Goose",
      "location": "Newfoundland and Labrador, Canada"
    },
    {
      "company_id": 813,
      "gid": 5146,
      "project_name": "Clayton Ridge",
      "location": "Nevada, United States"
    },
    {
      "company_id": 813,
      "gid": 2225,
      "project_name": "Perron-East",
      "location": null
    },
    {
      "company_id": 813,
      "gid": 9837,
      "project_name": "Sisson North Tungsten",
      "location": "New Brunswick, Canada"
    }
  ],
  "allOtherCompanyNews": [
    {
      "id": -202194,
      "company_id": 813,
      "title": "Spearmint Proposes Share Consolidation",
      "link": null,
      "date": "2025-05-27T13:15:00.000Z",
      "hidden": false
    },
    {
      "id": 99598,
      "company_id": 813,
      "title": "Spearmint Significantly Increases Acreage on the Sisson North Tungsten Project in New Brunswick",
      "link": null,
      "date": "2025-04-14T07:01:00.000Z",
      "hidden": false
    },
    {
      "id": -169160,
      "company_id": 813,
      "title": "Spearmint Acquires the Sisson North Tungsten Project",
      "link": "https://www.newsfilecorp.com/release/240730/Spearmint-Acquires-the-Sisson-North-Tungsten-Project",
      "date": "2025-02-13T08:01:00.000Z",
      "hidden": false
    },
    {
      "id": -164658,
      "company_id": 813,
      "title": "Spearmint More Than Doubles its Crypto Exposure",
      "link": "https://www.newsfilecorp.com/release/237376/Spearmint-More-Than-Doubles-its-Crypto-Exposure",
      "date": "2025-01-16T08:01:00.000Z",
      "hidden": false
    },
    {
      "id": -160478,
      "company_id": 813,
      "title": "Spearmint More Than Doubles the Acreage of the George Lake South Antimony Project in New Brunswick, Canada",
      "link": "https://www.newsfilecorp.com/release/233645/Spearmint-More-Than-Doubles-the-Acreage-of-the-George-Lake-South-Antimony-Project-in-New-Brunswick-Canada",
      "date": "2024-12-13T08:01:00.000Z",
      "hidden": false
    },
    {
      "id": -160253,
      "company_id": 813,
      "title": "Spearmint Announces Arrangements to Address Mailing Delays Resulting from Canada Post Strike",
      "link": "https://www.newsfilecorp.com/release/233566/Spearmint-Announces-Arrangements-to-Address-Mailing-Delays-Resulting-from-Canada-Post-Strike",
      "date": "2024-12-12T19:14:00.000Z",
      "hidden": false
    },
    {
      "id": -159472,
      "company_id": 813,
      "title": "Spearmint Makes Initial Entrance into the Crypto Space with Solana",
      "link": "https://www.newsfilecorp.com/release/232987/Spearmint-Makes-Initial-Entrance-into-the-Crypto-Space-with-Solana",
      "date": "2024-12-09T14:20:00.000Z",
      "hidden": false
    },
    {
      "id": -158859,
      "company_id": 813,
      "title": "RETRANSMISSION: Spearmint Comments on China's Ban of Critical Mineral Exports to the USA, including Antimony",
      "link": "https://www.newsfilecorp.com/release/232561/RETRANSMISSION-Spearmint-Comments-on-Chinas-Ban-of-Critical-Mineral-Exports-to-the-USA-including-Antimony",
      "date": "2024-12-05T08:01:00.000Z",
      "hidden": false
    },
    {
      "id": -158573,
      "company_id": 813,
      "title": "Spearmint Comments on China's Ban of Critical Mineral Exports to the USA, including Antimony",
      "link": "https://www.newsfilecorp.com/release/232427/Spearmint-Comments-on-Chinas-Ban-of-Critical-Mineral-Exports-to-the-USA-including-Antimony",
      "date": "2024-12-04T08:01:00.000Z",
      "hidden": false
    },
    {
      "id": -157100,
      "company_id": 813,
      "title": "RETRANSMISSION: Spearmint Acquires the George Lake South Antimony Project in New Brunswick, Canada",
      "link": "https://www.newsfilecorp.com/release/231725/RETRANSMISSION-Spearmint-Acquires-the-George-Lake-South-Antimony-Project-in-New-Brunswick-Canada",
      "date": "2024-11-28T08:01:00.000Z",
      "hidden": false
    }
  ]
}
