{
  "article": {
    "id": 73530,
    "link": "https://www.accesswire.com/viewarticle.aspx?id=926560&lang=en",
    "title": "Pulsar Significantly Increases Land Position at the Topaz Helium Project In Minnesota",
    "description": "<p><i><strong>THIS ANNOUNCEMENT AND THE INFORMATION CONTAINED HEREIN IS RESTRICTED AND IS NOT FOR RELEASE, PUBLICATION OR DISTRIBUTION, IN WHOLE OR IN PART, DIRECTLY OR INDIRECTLY, IN, INTO OR FROM THE UNITED STATES OF AMERICA, AUSTRALIA, JAPAN OR SOUTH AFRICA OR TO BE TRANSMITTED, DISTRIBUTED TO, OR SENT BY, ANY NATIONAL OR RESIDENT OR CITIZEN OF ANY SUCH COUNTRIES OR ANY OTHER JURISDICTION IN WHICH SUCH RELEASE, PUBLICATION OR DISTRIBUTION MAY CONTRAVENE LOCAL SECURITIES LAWS OR REGULATIONS.</strong></i></p><p><i>This announcement is an advertisement and not an admission document or a prospectus and does not constitute or form part of an offer to sell or issue or a solicitation of an offer to subscribe for or buy any securities nor should it be relied upon in connection with any contract or commitment whatsoever in any jurisdiction. Potential investors should not purchase or subscribe for any transferable securities referred to in this announcement except on the basis of the information in the final form of an admission document (the &quot;<strong>Admission Document</strong>&quot;) which may be published in due course in connection with the proposed admission of its issued and to be issued common shares (&quot;<strong>CommonShares</strong>&quot;) to trading on AIM, a market operated by London Stock Exchange plc (&quot;<strong>AIM</strong>&quot;) (&quot;<strong>Admission</strong>&quot;). Upon such publication the Admission Document will supersede this announcement and the information contained herein in its entirety and your investment decision, if any, must be made only on the basis of the information contained therein. It should be noted that an investment in any transferable securities referred to in this announcement carries a number of risks and that the value of investments may go down as well as up. Investors should take independent advice from a person experienced in advising on investment in securities such as those referred to in this announcement if they are in doubt.</i></p><p><i><strong>Follows successful Resource Evaluation &amp; drilling of Jetstream #1 Helium Well at Topaz Helium Project</strong></i></p><p><strong>CASCAIS, PORTUGAL / ACCESSWIRE / October 2, 2024 / </strong>Pulsar Helium Inc. (TSXV:PLSR) &amp; (OTCQB:PSRHF) (&quot;<strong>Pulsar</strong>&quot; or the &quot;<strong>Company</strong>&quot;), the helium development company, is pleased to announce that it has increased its net land position by c.100% at the Topaz Helium Project (the &quot;Topaz Project&quot;) in the State of Minnesota, USA. This expansion follows the successful drilling of the Jetstream #1 well and the release of an independent resource report that underscores the Topaz Project's existing resource with high helium concentration and upside potential. The Company is also pursuing additional acreage to secure district-wide control of what it believes to be a newly emerging helium reservoir that is regional in scale.</p><p><strong>HIGHLIGHTS</strong></p><ul style=\"list-style-type:disc;\"><li><p>A c.100% increase in land position expands the Company's interest in Topaz Project from 2,089 to 4,181 net acres.</p></li><li><p>The terms state that after the initial 5-year lease extension, any developed tract can be extended further as long as Topaz continues producing gas.</p></li><li><p>Pulsar is also pursuing additional acreage through the newly legislated State leasing process.</p></li></ul><p><i><strong>Thomas Abraham-James, President &amp; CEO of Pulsar, commented: </strong>&quot;Based on existing data demonstrating the continuity of the system, along with the Sproule resource report, which highlighted the helium resource of one prospect in the area, we believe the Topaz Project has district size scalability. Accordingly, as part of our growth strategy, we are actively securing key land positions. Following this option exercise, we are pleased to have almost doubled our net acreage and are now targeting additional land acquisitions, guided by well-defined geological insights.&quot;</i></p><p><i>&quot;These are exciting times for Pulsar, especially at the Topaz Project, where our next steps include deepening the Jetstream #1 well, which we believe will positively influence our resource update, then assessing drilling step-out wells, and the completion of additional seismic studies. These efforts will enhance our understanding of this dual-commodity project, which benefits from strong domestic demand for both helium and CO<sub>2</sub>. I look forward to regularly updating shareholders as we execute our project plan and continue to build value for all stakeholders.&quot;</i></p><p><strong>DETAILS</strong></p><p>Following the successful drilling and testing of the Jetstream #1 well, Sproule International Limited (&quot;Sproule&quot;) completed an independent resource update for the Topaz Project confirming the presence of commercial concentrations of both helium and CO<sub>2</sub>, with no significant environmental or logistical barriers to commercialization. Coupled with data from multiple geophysical, geological, and seismic studies, the Company is confident in the Topaz Project's district-scale potential. As a result, the Board is actively expanding its land holdings to capitalize on this opportunity.</p><p>The initial expansion of the land package is through the exercise of its exclusive option with a private mineral right holder over 2,092 net acres for USD$313,800 or USD$150 per acre. The primary term for this land package is 5 years for undeveloped land, which is extendable for the term of production and carries a 20% royalty. The Company already has 2,089 net acres leased with private mineral right holders within the Topaz Project area.</p><p>In addition to the option exercise, the Company is in discussion with the State of Minnesota (the &quot;State&quot;) to increase the Company's acreage in the Topaz Project area. New legislation was passed in May 2024 that allows the State to lease mineral rights for helium for the first time. The Minnesota Department for Natural Resources and the Department of Iron Range Resources &amp; Rehabilitation recently visited the Topaz Project and underlined their enthusiasm for its advancement, which is recognised as having a positive economic impact to the local and regional area. Furthermore, the support for resource development within the State has been emphasised by the recently passed legislation.</p><p>The Company's land acquisition programme is running in tandem with plans to accelerate the development of the Topaz Project, which entails the deepening of the Jetstream #1 well, drilling step out wells and acquiring additional seismic surveys to further ascertain the true scale of the project. Sproule's recently completed Prospective resource statement (refer to the Company's announcement of August 21, 2024) estimated 2.8 Bcf Helium (P10) and 21.3 Bcf CO<sub>2</sub> (P10) gross gas recoverable prior to the planned deepening of the Jetstream #1 well by a further c.500m seeking to intersect the full anticipated height of the reservoir.</p><p><strong>About Pulsar Helium Inc.</strong></p><p>Pulsar Helium Inc. is a publicly traded company listed on the TSX Venture Exchange with the ticker PLSR and on the OTCQB with the ticker PSRHF. Pulsar's portfolio consists of its flagship Topaz helium project in Minnesota, USA, and the Tunu helium project in Greenland. Pulsar is the first mover in both locations with primary helium occurrences not associated with the production of hydrocarbons identified at each. For further information visit <a rel=\"nofollow\" href=\"https://pr.report/36qj\">https://pulsarhelium.com</a>, follow us on X <a rel=\"nofollow\" href=\"https://pr.report/36qk\">https://twitter.com/pulsarhelium?lang=en</a> and LinkedIn <a rel=\"nofollow\" href=\"https://pr.report/36ql\">https://ca.linkedin.com/company/pulsar-helium-inc</a>.</p><p>On behalf Pulsar Helium Inc.</p><p>&quot;Thomas Abraham-James&quot;<br />President, CEO and Director</p><p><strong>Further Information:</strong></p><p>Pulsar Helium Inc.<br /><a rel=\"nofollow\" href=\"mailto:connect@pulsarhelium.com\">connect@pulsarhelium.com</a><br />+ 1 (604) 599-0310<br />OAK Securities*<br /><a rel=\"nofollow\" href=\"mailto:info@oak-securities.com\">info@OAK-securities.com</a><br />+44 203 973 3678</p><p><i>Neither TSX Venture Exchange nor its Regulation Services Provider (as that term is defined in the policies of the TSX Venture Exchange) accepts responsibility for the adequacy or accuracy of this release.</i></p><p><strong>IMPORTANT INFORMATION</strong></p><p>The communication of this announcement is not being made, and has not been approved, by an authorised person for the purposes of section 21 of the UK Financial Services and Markets Act 2000.</p><p>The contents of this announcement, which has been prepared by and is the sole responsibility of the Company, has not been approved by either of Strand Hanson Limited (&quot;<strong>Strand</strong>&quot;) or OAK Securities (a trading name of Merlin Partners LLP) (&quot;<strong>OAK</strong>&quot;) for the purposes of section 21(2)(b) of the Financial Services and Markets Act 2000 (as amended).</p><p>Neither this announcement nor any copy of it may be taken or transmitted, published or distributed, directly or indirectly, in, into or from any restricted jurisdiction or to any persons in any of those jurisdictions or any other jurisdiction where to do so would constitute a violation of the relevant securities laws of such jurisdiction. Any failure to comply with this restriction may constitute a violation of United States, Australian, Japanese or South African securities laws.</p><p>This announcement does not constitute, or form part of, any offer or invitation to sell or issue, or any solicitation of any offer to purchase or subscribe for any shares or other securities in any restricted jurisdiction. The distribution of this announcement and other information in connection with the Admission in certain jurisdictions may be restricted by law and persons into whose possession this announcement, any document or other information referred to herein comes should inform themselves about and observe any such restrictions. Any failure to comply with these restrictions may constitute a violation of the securities laws of any such jurisdiction. Neither this announcement nor any part of it nor the fact of its distribution shall form the basis of or be relied on in connection with or act as an inducement to enter into any contract or commitment whatsoever.</p><p><strong>This announcement is directed only at persons whose ordinary activities involve them in acquiring, holding, managing and disposing of investments (as principal or agent) for the purposes of their business and who have professional experience in matters relating to investments and are: (i) if in a member state of the European Economic Area (&quot;EEA&quot;), Qualified Investors as defined in article 2(e) of Regulation (EU) 2017/1129 (the &quot;EU Prospectus Regulation&quot;); (ii) if in the United Kingdom, are Qualified Investors as defined in article 2(e) of the EU Prospectus Regulation as it forms part of domestic law pursuant to the European Union (Withdrawal) Act 2018 and (a) fall within article 19(5) of the Financial Services and Markets Act 2000 (Financial Promotion) Order 2005, as amended (the &quot;Order&quot;) or (b) are persons who fall within article 49(2)(a) to (d) of the Order, or (c) to whom it may otherwise be lawfully distributed (all such persons together being referred to as &quot;Relevant Persons&quot;).</strong></p><p>This announcement must not be acted on or relied on by persons who are not Relevant Persons. Persons distributing this announcement must satisfy themselves that it is lawful to do so. Any investment or investment activity to which this announcement relates is available only to Relevant Persons and will be engaged in only with Relevant Persons. This announcement does not itself constitute an offer for sale or subscription of any securities in the Company.</p><p>The Common Shares referred to in this Announcement have not been and will not be registered under the US Securities Act of 1933, as amended (the &quot;<strong>US Securities Act</strong>&quot;) or with any securities regulatory authority of any state or other jurisdiction of the United States. The securities may not be offered or sold in the United States absent registration under the US Securities Act or an available exemption from, or in a transaction not subject to, the registration requirements of the US Securities Act and in compliance with any applicable securities laws of any state or other jurisdiction of the United States. There will be no public offer of securities in the United States.</p><p>Any subscription for or purchase of Common Shares should be made solely on the basis of the information contained in the final Admission Document to be published by the Company in connection with the Admission. The information in this announcement is for background purposes only and does not purport to be full or complete. No reliance may or should be placed for any purposes whatsoever on the information contained in this announcement or its accuracy, completeness or fairness. The information in this announcement is subject to change. However, the Company does not undertake to provide the recipient of this announcement with any additional information, or to update this announcement or to correct any inaccuracies, and the distribution of this announcement shall not be deemed to be any form of commitment on the part of the Company to proceed with the Admission or any transaction or arrangement referred to in this announcement. This announcement has not been approved by any competent regulatory authority.</p><p>Strand and/or OAK and any of their respective affiliates, acting as investors for their own accounts, may subscribe for or purchase Common Shares and in that capacity may retain, purchase, sell, offer to sell or otherwise deal for their own accounts in such Common Shares and other securities of the Company or related investments in connection with the Admission or otherwise. Accordingly, references in the Admission Document, once published, to the Common Shares being offered, subscribed, acquired, placed or otherwise dealt in should be read as including any offer to, or subscription, acquisition, placing or dealing by Strand and/or OAK and any of their respective affiliates acting as investors for their own accounts. In addition, Strand and/or OAK or their respective affiliates may enter into financing arrangements and swaps in connection with which it or its affiliates may from time to time acquire, hold or dispose of Common Shares. Neither Strand nor OAK has any intention to disclose the extent of any such investment or transactions otherwise than in accordance with any legal or regulatory obligations to do so.</p><p>Strand, which is authorised and regulated by the Financial Conduct Authority in the United Kingdom is acting exclusively for the Company as the Company's nominated adviser for the purposes of the AIM Rules for Companies (&quot;<strong>AIM Rules</strong>&quot;) and no one else in connection with the Admission, and Strand will not be responsible to anyone other than the Company for providing the protections afforded to its clients or for providing advice in relation to the Admission or any other matters referred to in this announcement.</p><p>OAK, which is authorised and regulated by the Financial Conduct Authority in the United Kingdom is acting exclusively for the Company as the Company's broker for the purposes of the AIM Rules and no one else in connection with the Admission, and OAK will not be responsible to anyone other than the Company for providing the protections afforded to its clients or for providing advice in relation to the Admission or any other matters referred to in this announcement.</p><p>Neither Strand, nor OAK nor any of their respective subsidiary undertakings, affiliates or any of their respective directors, officers, employees, advisers, agents or any other person accepts any responsibility or liability whatsoever for, or makes any representation or warranty, express or implied, as to the truth, accuracy, completeness or fairness of the information or opinions contained in this announcement (or whether any information has been omitted from the announcement) or any other information relating to the Company, its subsidiaries or associated companies, whether written, oral or in a visual or electronic form, and howsoever transmitted or made available or for any loss howsoever arising from any use of this announcement or its contents or otherwise arising in connection therewith and any liability therefore is expressly disclaimed.</p><p>The anticipated timetable for Admission, including the publication of the Admission Document and/or the date of Admission, may be influenced by a range of circumstances, including market conditions. There is no guarantee that the Admission Document will be published or that Admission will occur and investors should not base their financial decisions on the Company's intentions in relation to the Admission at this stage.</p><p>The price of shares and any income expected from them may go down as well as up and investors may not get back the full amount invested upon disposal of the shares. Past performance is no guide to future performance, and persons needing advice should consult an independent financial adviser. Certain figures contained in this announcement, including financial information, have been subject to rounding adjustments. Accordingly, in certain instances, the sum or percentage change of the numbers contained in this announcement may not conform exactly to the total figure given.</p><p>Neither the content of the Company's website nor any website accessible by hyperlinks on the Company's website is incorporated in, or forms part of, this announcement.</p><p>Solely for the purposes of Paragraph 3.2.7R regarding the responsibilities of UK Manufacturers under the Product Governance requirements contained within Chapter 3 of the FCA Handbook Product Intervention and Product Governance Sourcebook (the &quot;<strong>UK Product Governance Requirements</strong>&quot;), and disclaiming all and any liability, whether arising in tort, contract or otherwise, which any &quot;manufacturer&quot; (for the purposes of the UK Product Governance Requirements) may otherwise have with respect thereto, the Common Shares have been subject to a product approval process, which has determined that the Common Shares are: (i) compatible with an end target market of (a) retail investors, (b) investors who meet the criteria of professional clients and (c) eligible counterparties, each as defined in UK Product Governance Requirements; and (ii) eligible for distribution through all distribution channels as are permitted by UK Product Governance Requirements (the &quot;<strong>Target Market Assessment</strong>&quot;). Notwithstanding the Target Market Assessment, distributors should note that: the price of the Common Shares may decline and investors could lose all or part of their investment; the Common Shares offer no guaranteed income and no capital protection; and an investment in the Common Shares is compatible only with investors who do not need a guaranteed income or capital protection, who (either alone or in conjunction with an appropriate financial or other adviser) are capable of evaluating the merits and risks of such an investment and who have sufficient resources to be able to bear any losses that may result therefrom. The Target Market Assessment is without prejudice to the requirements of any contractual, legal or regulatory selling restrictions in relation to the Fundraising. For the avoidance of doubt, the Target Market Assessment does not constitute: (a) an assessment of suitability or appropriateness for the purposes of the UK Product Governance Requirements; or (b) a recommendation to any investor or group of investors to invest in, or purchase, or take any other action whatsoever with respect to, the Common Shares.</p><p>For the avoidance of doubt, the Target Market Assessment does not constitute: (a) an assessment of suitability or appropriateness for the purposes of MiFID II; or (b) a recommendation to any investor or group of investors to invest in, or purchase, or take any other action whatsoever with respect to the Placing Shares.</p><p>Each distributor is responsible for undertaking its own target market assessment in respect of the Placing Shares and determining appropriate distribution channels.</p><p><strong>EU Product Governance Requirements</strong></p><p>Solely for the purposes of the product governance requirements contained within: (a) EU Directive 2014/65/EU on markets in financial instruments, as amended (&quot;<strong>EU MiFID II</strong>&quot;); (b) Articles 9 and 10 of Commission Delegated Directive (EU) 2017/593 supplementing EU MiFID II; and (c) local implementing measures (together, the &quot;<strong>EU MiFID II Product Governance Requirements</strong>&quot;), and disclaiming all and any liability, whether arising in tort, contract or otherwise, which any 'manufacturer' (for the purposes of the EU MiFID II Product Governance Requirements) may otherwise have with respect thereto, the Common Shares have been subject to a product approval process, which has determined that the Common Shares are: (i) compatible with an end target market of retail clients and investors who meet the criteria of professional clients and eligible counterparties, each as defined in MiFID II; and (ii) eligible for distribution through all distribution channels as are permitted by EU MiFID II (the &quot;<strong>EU Target Market Assessment</strong>&quot;). Notwithstanding the EU Target Market Assessment, distributors should note that: the price of the Common Shares may decline and investors could lose all or part of their investment; the Common Shares offer no guaranteed income and no capital protection; and an investment in the Common Shares is compatible only with investors who do not need a guaranteed income or capital protection, who (either alone or in conjunction with an appropriate financial or other adviser) are capable of evaluating the merits and risks of such an investment and who have sufficient resources to be able to bear any losses that may result therefrom.</p><p>The EU Target Market Assessment is without prejudice to any contractual, legal or regulatory selling restrictions in relation to the possible Offer. Furthermore, it is noted that, notwithstanding the EU Target Market Assessment, the Investment Firms will only procure investors who meet the criteria of professional clients and eligible counterparties. For the avoidance of doubt, the EU Target Market Assessment does not constitute: (a) an assessment of suitability or appropriateness for the purposes of EU MiFID II; or (b) a recommendation to any investor or group of investors to invest in, or purchase, or take any other action whatsoever with respect to the Common Shares. Each distributor is responsible for undertaking its own target market assessment in respect of the Common Shares and determining appropriate distribution channels.</p><p><strong>Forward-Looking Statements</strong></p><p>This news release and the interview contains forward-looking information within the meaning of Canadian securities legislation (collectively, &quot;<strong>forward-looking statements</strong>&quot;) that relate to the Company's current expectations and views of future events. Any statements that express, or involve discussions as to, expectations, beliefs, plans, objectives, assumptions or future events or performance (often, but not always, through the use of words or phrases such as &quot;will likely result&quot;, &quot;are expected to&quot;, &quot;expects&quot;, &quot;will continue&quot;, &quot;is anticipated&quot;, &quot;anticipates&quot;, &quot;believes&quot;, &quot;estimated&quot;, &quot;intends&quot;, &quot;plans&quot;, &quot;forecast&quot;, &quot;projection&quot;, &quot;strategy&quot;, &quot;objective&quot; and &quot;outlook&quot;) are not historical facts and may be forward-looking statements. Forward-looking statements herein include, but are not limited to, statements relating to the Company's intention to apply for admission to trading of the Company's common shares on the AIM Market of the London Stock Exchange and the timing of its targeted admission; the independent resource estimate for helium and CO<sub>2 </sub>at Topaz; the potential of CO<sub>2</sub> as a valuable by-product of the Company's future helium production; the estimated Geological Chance of Success for the Prospective Resources and the Chance of Commerciality of Topaz; the potential for deepening Jetstream #1 and the potential impact of such deepening on the next iteration of the resource estimate; the Company's expectation that its application on an additional 32,949 acres for the extraction of non-hydrocarbon gases will be granted in the near term; and the intended use of proceeds from the AIM IPO. Forward-looking statements may involve estimates and are based upon assumptions made by management of the Company, including, but not limited to, the Company's capital cost estimates, management's expectations regarding the availability of capital to fund the Company's future capital and operating requirements and the ability to obtain all requisite regulatory approvals.</p><p>No reserves have been assigned in connection with the Company's property interests to date, given their early stage of development. The future value of the Company is therefore dependent on the success or otherwise of its activities, which are principally directed toward the future exploration, appraisal and development of its assets, and potential acquisition of property interests in the future. Un-risked Contingent and Prospective Helium Volumes have been defined at the Topaz Project. However, estimating helium volumes is subject to significant uncertainties associated with technical data and the interpretation of that data, future commodity prices, and development and operating costs. There can be no guarantee that the Company will successfully convert its helium volume to reserves and produce that estimated volume. Estimates may alter significantly or become more uncertain when new information becomes available due to for example, additional drilling or production tests over the life of field. As estimates change, development and production plans may also vary. Downward revision of helium volume estimates may adversely affect the Company's operational or financial performance.</p><p>Helium volume estimates are expressions of judgement based on knowledge, experience and industry practice. These estimates are imprecise and depend to some extent on interpretations, which may ultimately prove to be inaccurate and require adjustment or, even if valid when originally calculated, may alter significantly when new information or techniques become available. As further information becomes available through additional drilling and analysis the estimates are likely to change. Any adjustments to volume could affect the Company's exploration and development plans which may, in turn, affect the Company's performance. The process of estimating helium resources is complex and requires significant decisions and assumptions to be made in evaluating the reliability of available geological, geophysical, engineering, and economic date for each property. Different engineers may make different estimates of resources, cash flows, or other variables based on the same available data.</p><p>Forward-looking statements are subject to a number of risks and uncertainties, many of which are beyond the Company's control, which could cause actual results and events to differ materially from those that are disclosed in or implied by such forward- looking statements. Such risks and uncertainties include, but are not limited to, that Pulsar may be unsuccessful in drilling commercially productive wells; the uncertainty of resource estimation; operational risks in conducting exploration, including that drill costs may be higher than estimates and the potential for delays in the commencement of drilling; commodity prices; health, safety and environmental factors; and other factors set forth above as well as under &quot;Cautionary Note Regarding Forward Looking Statements and Market and Industry Data&quot; and &quot;Risk Factors&quot; in the Final Prospectus dated July 31, 2023 filed on the Company's profile on www.sedarplus.ca. Forward-looking statements contained in this news release are as of the date of this news release, and the Company undertakes no obligation to update or revise any forward-looking statements, whether as a result of new information, future events or otherwise, except as may be required by law. New factors emerge from time to time, and it is not possible for the Company to predict all of them or assess the impact of each such factor or the extent to which any factor, or combination of factors, may cause results to differ materially from those contained in any forward-looking statement. No assurance can be given that the forward-looking statements herein will prove to be correct and, accordingly, investors should not place undue reliance on forward-looking statements. Any forward-looking statements contained in this news release and interview are expressly qualified in their entirety by this cautionary statement.</p><p><strong>SOURCE: </strong>Pulsar Helium Inc.</p>",
    "search_terms": "Topaz,Pulsar Helium,PLSR",
    "master_gid": 6053,
    "date": "2024-10-02T10:00:00.000Z",
    "tags": "Australia,Japan,South Africa,United States of America||||Project Acquisition",
    "image_id": null,
    "hidden": false,
    "company_id": 3406,
    "provider": "accesswire",
    "excerpt": "THIS ANNOUNCEMENT AND THE INFORMATION CONTAINED HEREIN IS RESTRICTED AND IS NOT FOR RELEASE, PUBLICATION OR DISTRIBUTION, IN WHOLE OR IN PART, DIRECTLY OR INDIRECTLY, IN, INTO OR FROM THE UNITED STATES OF AMERICA, AUSTRALIA, JAPAN OR SOUTH AFRICA OR TO BE TRANSMITTED, DISTRIBUTED TO, OR SENT BY, ANY NATIONAL",
    "is_regulatory": false,
    "refined_tags": [],
    "ftp_filename": null,
    "company_name": "Pulsar Helium",
    "exchange": "TSXV",
    "root_ticker": "PLSR",
    "project_name": "Topaz",
    "gid": 6053,
    "location": "Minnesota, United States",
    "plan_id": null,
    "description_text": "THIS ANNOUNCEMENT AND THE INFORMATION CONTAINED HEREIN IS RESTRICTED AND IS NOT FOR RELEASE, PUBLICATION OR DISTRIBUTION, IN WHOLE OR IN PART, DIRECTLY OR INDIRECTLY, IN, INTO OR FROM THE UNITED STATES OF AMERICA, AUSTRALIA, JAPAN OR SOUTH AFRICA OR TO BE TRANSMITTED, DISTRIBUTED TO, OR SENT BY, ANY NATIONAL OR RESIDENT OR CITIZEN OF ANY SUCH COUNTRIES OR ANY OTHER JURISDICTION IN WHICH SUCH RELEASE, PUBLICATION OR DISTRIBUTION MAY CONTRAVENE LOCAL SECURITIES LAWS OR REGULATIONS. This announcement is an advertisement and not an admission document or a prospectus and does not constitute or form part of an offer to sell or issue or a solicitation of an offer to subscribe for or buy any securities nor should it be relied upon in connection with any contract or commitment whatsoever in any jurisdiction. Potential investors should not purchase or subscribe for any transferable securities referred to in this announcement except on the basis of the information in the final form of an admission document (the \" Admission Document \") which may be published in due course in connection with the proposed admission of its issued and to be issued common shares (\" CommonShares \") to trading on AIM, a market operated by London Stock Exchange plc (\" AIM \") (\" Admission \"). Upon such publication the Admission Document will supersede this announcement and the information contained herein in its entirety and your investment decision, if any, must be made only on the basis of the information contained therein. It should be noted that an investment in any transferable securities referred to in this announcement carries a number of risks and that the value of investments may go down as well as up. Investors should take independent advice from a person experienced in advising on investment in securities such as those referred to in this announcement if they are in doubt. Follows successful Resource Evaluation & drilling of Jetstream #1 Helium Well at Topaz Helium Project CASCAIS, PORTUGAL / ACCESSWIRE / October 2, 2024 / Pulsar Helium Inc. (TSXV:PLSR) & (OTCQB:PSRHF) (\" Pulsar \" or the \" Company \"), the helium development company, is pleased to announce that it has increased its net land position by c.100% at the Topaz Helium Project (the \"Topaz Project\") in the State of Minnesota, USA. This expansion follows the successful drilling of the Jetstream #1 well and the release of an independent resource report that underscores the Topaz Project's existing resource with high helium concentration and upside potential. The Company is also pursuing additional acreage to secure district-wide control of what it believes to be a newly emerging helium reservoir that is regional in scale. HIGHLIGHTS A c.100% increase in land position expands the Company's interest in Topaz Project from 2,089 to 4,181 net acres. The terms state that after the initial 5-year lease extension, any developed tract can be extended further as long as Topaz continues producing gas. Pulsar is also pursuing additional acreage through the newly legislated State leasing process. Thomas Abraham-James, President & CEO of Pulsar, commented: \"Based on existing data demonstrating the continuity of the system, along with the Sproule resource report, which highlighted the helium resource of one prospect in the area, we believe the Topaz Project has district size scalability. Accordingly, as part of our growth strategy, we are actively securing key land positions. Following this option exercise, we are pleased to have almost doubled our net acreage and are now targeting additional land acquisitions, guided by well-defined geological insights.\" \"These are exciting times for Pulsar, especially at the Topaz Project, where our next steps include deepening the Jetstream #1 well, which we believe will positively influence our resource update, then assessing drilling step-out wells, and the completion of additional seismic studies. These efforts will enhance our understanding of this dual-commodity project, which benefits from strong domestic demand for both helium and CO 2 . I look forward to regularly updating shareholders as we execute our project plan and continue to build value for all stakeholders.\" DETAILS Following the successful drilling and testing of the Jetstream #1 well, Sproule International Limited (\"Sproule\") completed an independent resource update for the Topaz Project confirming the presence of commercial concentrations of both helium and CO 2 , with no significant environmental or logistical barriers to commercialization. Coupled with data from multiple geophysical, geological, and seismic studies, the Company is confident in the Topaz Project's district-scale potential. As a result, the Board is actively expanding its land holdings to capitalize on this opportunity. The initial expansion of the land package is through the exercise of its exclusive option with a private mineral right holder over 2,092 net acres for USD$313,800 or USD$150 per acre. The primary term for this land package is 5 years for undeveloped land, which is extendable for the term of production and carries a 20% royalty. The Company already has 2,089 net acres leased with private mineral right holders within the Topaz Project area. In addition to the option exercise, the Company is in discussion with the State of Minnesota (the \"State\") to increase the Company's acreage in the Topaz Project area. New legislation was passed in May 2024 that allows the State to lease mineral rights for helium for the first time. The Minnesota Department for Natural Resources and the Department of Iron Range Resources & Rehabilitation recently visited the Topaz Project and underlined their enthusiasm for its advancement, which is recognised as having a positive economic impact to the local and regional area. Furthermore, the support for resource development within the State has been emphasised by the recently passed legislation. The Company's land acquisition programme is running in tandem with plans to accelerate the development of the Topaz Project, which entails the deepening of the Jetstream #1 well, drilling step out wells and acquiring additional seismic surveys to further ascertain the true scale of the project. Sproule's recently completed Prospective resource statement (refer to the Company's announcement of August 21, 2024) estimated 2.8 Bcf Helium (P10) and 21.3 Bcf CO 2 (P10) gross gas recoverable prior to the planned deepening of the Jetstream #1 well by a further c.500m seeking to intersect the full anticipated height of the reservoir. About Pulsar Helium Inc. Pulsar Helium Inc. is a publicly traded company listed on the TSX Venture Exchange with the ticker PLSR and on the OTCQB with the ticker PSRHF. Pulsar's portfolio consists of its flagship Topaz helium project in Minnesota, USA, and the Tunu helium project in Greenland. Pulsar is the first mover in both locations with primary helium occurrences not associated with the production of hydrocarbons identified at each. For further information visit https://pulsarhelium.com , follow us on X https://twitter.com/pulsarhelium?lang=en and LinkedIn https://ca.linkedin.com/company/pulsar-helium-inc . On behalf Pulsar Helium Inc. \"Thomas Abraham-James\" President, CEO and Director Further Information: Pulsar Helium Inc. connect@pulsarhelium.com + 1 (604) 599-0310 OAK Securities* info@OAK-securities.com +44 203 973 3678 Neither TSX Venture Exchange nor its Regulation Services Provider (as that term is defined in the policies of the TSX Venture Exchange) accepts responsibility for the adequacy or accuracy of this release. IMPORTANT INFORMATION The communication of this announcement is not being made, and has not been approved, by an authorised person for the purposes of section 21 of the UK Financial Services and Markets Act 2000. The contents of this announcement, which has been prepared by and is the sole responsibility of the Company, has not been approved by either of Strand Hanson Limited (\" Strand \") or OAK Securities (a trading name of Merlin Partners LLP) (\" OAK \") for the purposes of section 21(2)(b) of the Financial Services and Markets Act 2000 (as amended). Neither this announcement nor any copy of it may be taken or transmitted, published or distributed, directly or indirectly, in, into or from any restricted jurisdiction or to any persons in any of those jurisdictions or any other jurisdiction where to do so would constitute a violation of the relevant securities laws of such jurisdiction. Any failure to comply with this restriction may constitute a violation of United States, Australian, Japanese or South African securities laws. This announcement does not constitute, or form part of, any offer or invitation to sell or issue, or any solicitation of any offer to purchase or subscribe for any shares or other securities in any restricted jurisdiction. The distribution of this announcement and other information in connection with the Admission in certain jurisdictions may be restricted by law and persons into whose possession this announcement, any document or other information referred to herein comes should inform themselves about and observe any such restrictions. Any failure to comply with these restrictions may constitute a violation of the securities laws of any such jurisdiction. Neither this announcement nor any part of it nor the fact of its distribution shall form the basis of or be relied on in connection with or act as an inducement to enter into any contract or commitment whatsoever. This announcement is directed only at persons whose ordinary activities involve them in acquiring, holding, managing and disposing of investments (as principal or agent) for the purposes of their business and who have professional experience in matters relating to investments and are: (i) if in a member state of the European Economic Area (\"EEA\"), Qualified Investors as defined in article 2(e) of Regulation (EU) 2017/1129 (the \"EU Prospectus Regulation\"); (ii) if in the United Kingdom, are Qualified Investors as defined in article 2(e) of the EU Prospectus Regulation as it forms part of domestic law pursuant to the European Union (Withdrawal) Act 2018 and (a) fall within article 19(5) of the Financial Services and Markets Act 2000 (Financial Promotion) Order 2005, as amended (the \"Order\") or (b) are persons who fall within article 49(2)(a) to (d) of the Order, or (c) to whom it may otherwise be lawfully distributed (all such persons together being referred to as \"Relevant Persons\"). This announcement must not be acted on or relied on by persons who are not Relevant Persons. Persons distributing this announcement must satisfy themselves that it is lawful to do so. Any investment or investment activity to which this announcement relates is available only to Relevant Persons and will be engaged in only with Relevant Persons. This announcement does not itself constitute an offer for sale or subscription of any securities in the Company. The Common Shares referred to in this Announcement have not been and will not be registered under the US Securities Act of 1933, as amended (the \" US Securities Act \") or with any securities regulatory authority of any state or other jurisdiction of the United States. The securities may not be offered or sold in the United States absent registration under the US Securities Act or an available exemption from, or in a transaction not subject to, the registration requirements of the US Securities Act and in compliance with any applicable securities laws of any state or other jurisdiction of the United States. There will be no public offer of securities in the United States. Any subscription for or purchase of Common Shares should be made solely on the basis of the information contained in the final Admission Document to be published by the Company in connection with the Admission. The information in this announcement is for background purposes only and does not purport to be full or complete. No reliance may or should be placed for any purposes whatsoever on the information contained in this announcement or its accuracy, completeness or fairness. The information in this announcement is subject to change. However, the Company does not undertake to provide the recipient of this announcement with any additional information, or to update this announcement or to correct any inaccuracies, and the distribution of this announcement shall not be deemed to be any form of commitment on the part of the Company to proceed with the Admission or any transaction or arrangement referred to in this announcement. This announcement has not been approved by any competent regulatory authority. Strand and/or OAK and any of their respective affiliates, acting as investors for their own accounts, may subscribe for or purchase Common Shares and in that capacity may retain, purchase, sell, offer to sell or otherwise deal for their own accounts in such Common Shares and other securities of the Company or related investments in connection with the Admission or otherwise. Accordingly, references in the Admission Document, once published, to the Common Shares being offered, subscribed, acquired, placed or otherwise dealt in should be read as including any offer to, or subscription, acquisition, placing or dealing by Strand and/or OAK and any of their respective affiliates acting as investors for their own accounts. In addition, Strand and/or OAK or their respective affiliates may enter into financing arrangements and swaps in connection with which it or its affiliates may from time to time acquire, hold or dispose of Common Shares. Neither Strand nor OAK has any intention to disclose the extent of any such investment or transactions otherwise than in accordance with any legal or regulatory obligations to do so. Strand, which is authorised and regulated by the Financial Conduct Authority in the United Kingdom is acting exclusively for the Company as the Company's nominated adviser for the purposes of the AIM Rules for Companies (\" AIM Rules \") and no one else in connection with the Admission, and Strand will not be responsible to anyone other than the Company for providing the protections afforded to its clients or for providing advice in relation to the Admission or any other matters referred to in this announcement. OAK, which is authorised and regulated by the Financial Conduct Authority in the United Kingdom is acting exclusively for the Company as the Company's broker for the purposes of the AIM Rules and no one else in connection with the Admission, and OAK will not be responsible to anyone other than the Company for providing the protections afforded to its clients or for providing advice in relation to the Admission or any other matters referred to in this announcement. Neither Strand, nor OAK nor any of their respective subsidiary undertakings, affiliates or any of their respective directors, officers, employees, advisers, agents or any other person accepts any responsibility or liability whatsoever for, or makes any representation or warranty, express or implied, as to the truth, accuracy, completeness or fairness of the information or opinions contained in this announcement (or whether any information has been omitted from the announcement) or any other information relating to the Company, its subsidiaries or associated companies, whether written, oral or in a visual or electronic form, and howsoever transmitted or made available or for any loss howsoever arising from any use of this announcement or its contents or otherwise arising in connection therewith and any liability therefore is expressly disclaimed. The anticipated timetable for Admission, including the publication of the Admission Document and/or the date of Admission, may be influenced by a range of circumstances, including market conditions. There is no guarantee that the Admission Document will be published or that Admission will occur and investors should not base their financial decisions on the Company's intentions in relation to the Admission at this stage. The price of shares and any income expected from them may go down as well as up and investors may not get back the full amount invested upon disposal of the shares. Past performance is no guide to future performance, and persons needing advice should consult an independent financial adviser. Certain figures contained in this announcement, including financial information, have been subject to rounding adjustments. Accordingly, in certain instances, the sum or percentage change of the numbers contained in this announcement may not conform exactly to the total figure given. Neither the content of the Company's website nor any website accessible by hyperlinks on the Company's website is incorporated in, or forms part of, this announcement. Solely for the purposes of Paragraph 3.2.7R regarding the responsibilities of UK Manufacturers under the Product Governance requirements contained within Chapter 3 of the FCA Handbook Product Intervention and Product Governance Sourcebook (the \" UK Product Governance Requirements \"), and disclaiming all and any liability, whether arising in tort, contract or otherwise, which any \"manufacturer\" (for the purposes of the UK Product Governance Requirements) may otherwise have with respect thereto, the Common Shares have been subject to a product approval process, which has determined that the Common Shares are: (i) compatible with an end target market of (a) retail investors, (b) investors who meet the criteria of professional clients and (c) eligible counterparties, each as defined in UK Product Governance Requirements; and (ii) eligible for distribution through all distribution channels as are permitted by UK Product Governance Requirements (the \" Target Market Assessment \"). Notwithstanding the Target Market Assessment, distributors should note that: the price of the Common Shares may decline and investors could lose all or part of their investment; the Common Shares offer no guaranteed income and no capital protection; and an investment in the Common Shares is compatible only with investors who do not need a guaranteed income or capital protection, who (either alone or in conjunction with an appropriate financial or other adviser) are capable of evaluating the merits and risks of such an investment and who have sufficient resources to be able to bear any losses that may result therefrom. The Target Market Assessment is without prejudice to the requirements of any contractual, legal or regulatory selling restrictions in relation to the Fundraising. For the avoidance of doubt, the Target Market Assessment does not constitute: (a) an assessment of suitability or appropriateness for the purposes of the UK Product Governance Requirements; or (b) a recommendation to any investor or group of investors to invest in, or purchase, or take any other action whatsoever with respect to, the Common Shares. For the avoidance of doubt, the Target Market Assessment does not constitute: (a) an assessment of suitability or appropriateness for the purposes of MiFID II; or (b) a recommendation to any investor or group of investors to invest in, or purchase, or take any other action whatsoever with respect to the Placing Shares. Each distributor is responsible for undertaking its own target market assessment in respect of the Placing Shares and determining appropriate distribution channels. EU Product Governance Requirements Solely for the purposes of the product governance requirements contained within: (a) EU Directive 2014/65/EU on markets in financial instruments, as amended (\" EU MiFID II \"); (b) Articles 9 and 10 of Commission Delegated Directive (EU) 2017/593 supplementing EU MiFID II; and (c) local implementing measures (together, the \" EU MiFID II Product Governance Requirements \"), and disclaiming all and any liability, whether arising in tort, contract or otherwise, which any 'manufacturer' (for the purposes of the EU MiFID II Product Governance Requirements) may otherwise have with respect thereto, the Common Shares have been subject to a product approval process, which has determined that the Common Shares are: (i) compatible with an end target market of retail clients and investors who meet the criteria of professional clients and eligible counterparties, each as defined in MiFID II; and (ii) eligible for distribution through all distribution channels as are permitted by EU MiFID II (the \" EU Target Market Assessment \"). Notwithstanding the EU Target Market Assessment, distributors should note that: the price of the Common Shares may decline and investors could lose all or part of their investment; the Common Shares offer no guaranteed income and no capital protection; and an investment in the Common Shares is compatible only with investors who do not need a guaranteed income or capital protection, who (either alone or in conjunction with an appropriate financial or other adviser) are capable of evaluating the merits and risks of such an investment and who have sufficient resources to be able to bear any losses that may result therefrom. The EU Target Market Assessment is without prejudice to any contractual, legal or regulatory selling restrictions in relation to the possible Offer. Furthermore, it is noted that, notwithstanding the EU Target Market Assessment, the Investment Firms will only procure investors who meet the criteria of professional clients and eligible counterparties. For the avoidance of doubt, the EU Target Market Assessment does not constitute: (a) an assessment of suitability or appropriateness for the purposes of EU MiFID II; or (b) a recommendation to any investor or group of investors to invest in, or purchase, or take any other action whatsoever with respect to the Common Shares. Each distributor is responsible for undertaking its own target market assessment in respect of the Common Shares and determining appropriate distribution channels. Forward-Looking Statements This news release and the interview contains forward-looking information within the meaning of Canadian securities legislation (collectively, \" forward-looking statements \") that relate to the Company's current expectations and views of future events. Any statements that express, or involve discussions as to, expectations, beliefs, plans, objectives, assumptions or future events or performance (often, but not always, through the use of words or phrases such as \"will likely result\", \"are expected to\", \"expects\", \"will continue\", \"is anticipated\", \"anticipates\", \"believes\", \"estimated\", \"intends\", \"plans\", \"forecast\", \"projection\", \"strategy\", \"objective\" and \"outlook\") are not historical facts and may be forward-looking statements. Forward-looking statements herein include, but are not limited to, statements relating to the Company's intention to apply for admission to trading of the Company's common shares on the AIM Market of the London Stock Exchange and the timing of its targeted admission; the independent resource estimate for helium and CO 2 at Topaz; the potential of CO 2 as a valuable by-product of the Company's future helium production; the estimated Geological Chance of Success for the Prospective Resources and the Chance of Commerciality of Topaz; the potential for deepening Jetstream #1 and the potential impact of such deepening on the next iteration of the resource estimate; the Company's expectation that its application on an additional 32,949 acres for the extraction of non-hydrocarbon gases will be granted in the near term; and the intended use of proceeds from the AIM IPO. Forward-looking statements may involve estimates and are based upon assumptions made by management of the Company, including, but not limited to, the Company's capital cost estimates, management's expectations regarding the availability of capital to fund the Company's future capital and operating requirements and the ability to obtain all requisite regulatory approvals. No reserves have been assigned in connection with the Company's property interests to date, given their early stage of development. The future value of the Company is therefore dependent on the success or otherwise of its activities, which are principally directed toward the future exploration, appraisal and development of its assets, and potential acquisition of property interests in the future. Un-risked Contingent and Prospective Helium Volumes have been defined at the Topaz Project. However, estimating helium volumes is subject to significant uncertainties associated with technical data and the interpretation of that data, future commodity prices, and development and operating costs. There can be no guarantee that the Company will successfully convert its helium volume to reserves and produce that estimated volume. Estimates may alter significantly or become more uncertain when new information becomes available due to for example, additional drilling or production tests over the life of field. As estimates change, development and production plans may also vary. Downward revision of helium volume estimates may adversely affect the Company's operational or financial performance. Helium volume estimates are expressions of judgement based on knowledge, experience and industry practice. These estimates are imprecise and depend to some extent on interpretations, which may ultimately prove to be inaccurate and require adjustment or, even if valid when originally calculated, may alter significantly when new information or techniques become available. As further information becomes available through additional drilling and analysis the estimates are likely to change. Any adjustments to volume could affect the Company's exploration and development plans which may, in turn, affect the Company's performance. The process of estimating helium resources is complex and requires significant decisions and assumptions to be made in evaluating the reliability of available geological, geophysical, engineering, and economic date for each property. Different engineers may make different estimates of resources, cash flows, or other variables based on the same available data. Forward-looking statements are subject to a number of risks and uncertainties, many of which are beyond the Company's control, which could cause actual results and events to differ materially from those that are disclosed in or implied by such forward- looking statements. Such risks and uncertainties include, but are not limited to, that Pulsar may be unsuccessful in drilling commercially productive wells; the uncertainty of resource estimation; operational risks in conducting exploration, including that drill costs may be higher than estimates and the potential for delays in the commencement of drilling; commodity prices; health, safety and environmental factors; and other factors set forth above as well as under \"Cautionary Note Regarding Forward Looking Statements and Market and Industry Data\" and \"Risk Factors\" in the Final Prospectus dated July 31, 2023 filed on the Company's profile on www.sedarplus.ca. Forward-looking statements contained in this news release are as of the date of this news release, and the Company undertakes no obligation to update or revise any forward-looking statements, whether as a result of new information, future events or otherwise, except as may be required by law. New factors emerge from time to time, and it is not possible for the Company to predict all of them or assess the impact of each such factor or the extent to which any factor, or combination of factors, may cause results to differ materially from those contained in any forward-looking statement. No assurance can be given that the forward-looking statements herein will prove to be correct and, accordingly, investors should not place undue reliance on forward-looking statements. Any forward-looking statements contained in this news release and interview are expressly qualified in their entirety by this cautionary statement. SOURCE: Pulsar Helium Inc.",
    "primary_commodity": "He"
  },
  "articleProject": {
    "gid": 6053,
    "project_name": "Topaz",
    "location": "Minnesota, United States"
  },
  "articleExchange": "TSXV",
  "articleCompanyId": 3406,
  "articleTicker": "PLSR",
  "articleCompanyName": "Pulsar Helium",
  "allOtherCompanyProjects": [
    {
      "company_id": 3406,
      "gid": 6053,
      "project_name": "Topaz",
      "location": "Minnesota, United States"
    }
  ],
  "allOtherCompanyNews": [
    {
      "id": 108252,
      "company_id": 3406,
      "title": "Pulsar Helium Announces Update for Jetstream Well Testing Program at Topaz, Minnesota",
      "link": null,
      "date": "2025-06-17T06:00:00.000Z",
      "hidden": false
    },
    {
      "id": 106184,
      "company_id": 3406,
      "title": "Pulsar Announces Financial and Operating Results for the Six Months Ended March 31, 2025",
      "link": null,
      "date": "2025-05-29T06:00:00.000Z",
      "hidden": false
    },
    {
      "id": 103601,
      "company_id": 3406,
      "title": "Pulsar Helium Announces Results of 2025 Annual General and Special Meeting of Shareholders",
      "link": null,
      "date": "2025-05-06T06:00:00.000Z",
      "hidden": false
    },
    {
      "id": 101794,
      "company_id": 3406,
      "title": "Pulsar Helium Announces an Update for Well-Testing at the Topaz Helium Project in Minnesota",
      "link": null,
      "date": "2025-04-28T06:00:00.000Z",
      "hidden": false
    },
    {
      "id": 98971,
      "company_id": 3406,
      "title": "Pulsar Helium Announces Execution of US$4 Million Project Finance Facility Line of Credit Note",
      "link": null,
      "date": "2025-04-08T06:00:00.000Z",
      "hidden": false
    },
    {
      "id": 98833,
      "company_id": 3406,
      "title": "Pulsar Helium Announces Notice of 2025 Annual General and Special Meeting of Shareholders",
      "link": null,
      "date": "2025-04-07T06:00:00.000Z",
      "hidden": false
    },
    {
      "id": 98432,
      "company_id": 3406,
      "title": "Pulsar Helium Announces the Commencement of Well-Testing  at the Topaz Helium Project in Minnesota",
      "link": null,
      "date": "2025-04-02T06:00:00.000Z",
      "hidden": false
    },
    {
      "id": 92193,
      "company_id": 3406,
      "title": "Pulsar Helium Announces Project Finance Facility and Closing of Final Tranche of Private Placement",
      "link": null,
      "date": "2025-03-24T06:00:00.000Z",
      "hidden": false
    },
    {
      "id": 89401,
      "company_id": 3406,
      "title": "Pulsar Announces Financial and Operating Results for the First Quarter Ended December 31, 2024",
      "link": "https://www.accessnewswire.com/newsroom/en/metals-and-mining/pulsar-announces-financial-and-operating-results-for-the-first-quarter-ended-decem-992477",
      "date": "2025-02-27T07:00:00.000Z",
      "hidden": false
    },
    {
      "id": 88948,
      "company_id": 3406,
      "title": "Pulsar Helium Inc Announces Participation in Red Cloud's 13th Annual Pre-PDAC Mining Showcase",
      "link": "https://www.newsfilecorp.com/release/240394/Pulsar-Helium-Inc-Announces-Participation-in-Red-Clouds-13th-Annual-PrePDAC-Mining-Showcase",
      "date": "2025-02-24T12:00:00.000Z",
      "hidden": false
    }
  ]
}
