{
  "article": {
    "id": 91947,
    "link": null,
    "title": "NevGold Increases the Size of the Zeus Copper Project by Approximately 50% Or 1,000 Hectares  in the Hercules Copper District, Idaho",
    "description": "<div class=\"mw_release\"><p align=\"justify\">Vancouver, British Columbia, March  20, 2025  (GLOBE NEWSWIRE) -- NevGold Corp. (“<b>NevGold</b>” or the “<b>Company</b>”) <b>(TSXV:NAU) (OTCQX:NAUFF) (Frankfurt:5E50</b>) is pleased to announce that it has staked an additional 147 claims, approximately 1,000 hectares or 10 square kilometers, with strong geological prospectivity at the Zeus Copper Project in the emerging Hercules Copper Trend of southwestern Idaho. As highlighted in NevGold’s previous News Releases from 2024 and 2025 to date (<a href=\"https://www.globenewswire.com/Tracker?data=JJaDYuwN8Te-PUwHIP01c_m1SfUy8qZWIvLj6hciT0piqHhL4JpQXU-YHdqzhvm-8OSsunCfyxj_AXFF6d3gU3lBoGbHKY7jd6SAwPHttG0=\" rel=\"nofollow\" target=\"_blank\"><i>see NevGold News Releases</i></a>)<b>, </b>the <b>Zeus Copper Project</b> shares many <b>geological similarities</b> with <b>Hercules Metals Corp.’s (“Hercules Metals”, TSXV:BIG)</b> copper porphyry discovery at the <b>Hercules Project</b> (<a href=\"https://www.globenewswire.com/Tracker?data=fKr1dkePKj7ycK3RwWX6z624wv60gyYnIvYpcYHNwXGBvxWi5Eb0zescXqHw7yIyIoskiLWplUcFG1P1pMTzVORL9mEfFrth7r-2SB0Enpds-wtXfbOCc4T_inYMFYH8\" rel=\"nofollow\" target=\"_blank\"><i>see Hercules Metals News Releases</i></a>), including <b>comparable soil survey geochemical results (see Figure 1, Figure 4)</b>. </p>   <p align=\"justify\"> </p>   <p align=\"justify\"><b><u>Key Highlights </u></b></p>   <ul type=\"disc\"><li><b>Zeus Copper Project now encompasses 392 claims, approximately 2,900 hectares or 29 square kilometers</b>, of highly <b>strategic</b> and <b>prospective</b> ground in the Hercules Copper Trend </li></ul>   <ul type=\"disc\"><li>New additional ground staked by the NevGold team is<b> underlain by the two primary host rocks of copper mineralization in the Hercules Copper Trend, the Lower Huntington Formation and Triassic age intrusive rocks</b></li></ul>   <ul type=\"disc\"><li>Strong similarities are noted between the Zeus Copper Project and the Hercules Metals copper porphyry discovery at the Hercules Project</li></ul>   <ul type=\"disc\"><li><b>Field programs will advance including planned geophysical surveys to identify drill targets </b></li></ul>   <p align=\"justify\"> </p>   <p align=\"center\"> </p>  <p />  <p align=\"center\"><i>Figure 1 – Zeus Copper Project land position and geology of the Hercules Copper Trend. The </i><b><i>newly staked claims contain Lower Huntington Formation shown in purple, and Triassic age intrusive rocks (plutons) shown in brown, both are known to host copper mineralization</i></b><i> on the Hercules Copper Trend. Modified from (Henricksen, 1975), (Fankhauser, 1968), (Skurla, 1974), (Lund, 2021), (Adair, 1985). </i><a href=\"https://www.globenewswire.com/Tracker?data=0-lteoPT3X1HUJP9BDBmTsxbnAjVi_sZC4NkDiexcEgX6RmA2fekTiBt1VJx82-Sq9tjb1KTCVPnewVIKhRkFSm57f97LzyG_NFwd85gY6g3CmtviUB0snGuCezYDfFGFpQIPStO4UyOyKDVCGJj7FZwHrDJOq_ed7qpNNEDv9aQWjKYq4RYCLn7qd6enQai\" rel=\"nofollow\" target=\"_blank\"><i><u>To view image please click here</u></i></a></p>   <p align=\"justify\"> </p>   <p align=\"justify\"><b>NevGold CEO, Brandon Bonifacio, comments: </b><i>“We are very pleased to have added additional ground with all of the </i><b><i>right geologic signatures at our Zeus Copper Project. After our recent soil survey results, it is positive we were able to acquire more ground adjacent to our initial claim block, in an area that looks to be an emerging copper trend. </i></b><i>The recently staked ground is also </i><b><i>adjacent to a large claim block that Barrick Gold Corp. (NYSE:GOLD, TSX:ABX) has established on the trend (see Figure 1 and Figure 2)</i></b><i>. There continues to be a high level of activity on the Hercules Copper Trend, and we have been a first-mover and have continued to strategically add some of the most prospective ground in the district. Along with adding to our land position, we have also actively continued our field work program, and due to positive results, we will continue with our geophysical program to define drill targets by the 2025 summer field season.” </i></p>   <p align=\"justify\"> </p>   <p align=\"justify\"><b>NevGold VP Exploration, Greg French, comments: </b><i>“We are very excited about the additional ground that we have been able to stake in this emerging copper trend in the Western USA. The </i><b><i>land that we recently staked contains one of the last available erosional windows through post-mineral basalts. These windows expose the highly-prospective Lower Huntington Formation and Triassic plutons, the main hosts of porphyry copper mineralization on the Hercules Copper Trend</i></b><i>. Our technical team has gained a strong understanding of the district geology over the past year, and we will continue to leverage this competitive advantage as we advance our highly prospective Zeus Copper Project.” </i></p>   <p align=\"justify\"> </p>   <p align=\"justify\"><b><u>Newly-Staked Zeus Claims</u></b></p>   <p align=\"justify\"> </p>   <p align=\"center\"> </p>  <p />  <p align=\"center\"><i>Figure 2 – Geology of expanded NevGold Zeus Copper Project land position. The newly staked claims contain Lower Huntington Formation (purple) and Triassic age plutons (brown), both are known to host copper mineralization on the Hercules Copper Trend. Post-mineral basalts and sediments (tan) cover a significant portion of the Hercules Copper Trend and obscure any potential mineralization. Modified from (</i><i>Henricksen, 1975), (Fankhauser, 1968), (Skurla, 1974), (Lund, 2021), (Adair, 1985). </i><a href=\"https://www.globenewswire.com/Tracker?data=0-lteoPT3X1HUJP9BDBmTsxbnAjVi_sZC4NkDiexcEgUgDnPMqK9w_km8gO_h3hZqVTr62qCQ96UMIQ69hKO2J48BUef10ZJSHuxMeY_Yi30_IZ7Vdk-TM6cIWASLucDAMiHeMO3XYlJrfjI4fFfXkJTxGvtUzHuljd13Tndhjz2nnsckDisKsGY_m0oJQKs\" rel=\"nofollow\" target=\"_blank\"><i><u>To view image please click here</u></i></a></p>   <p align=\"justify\"> </p>   <p align=\"justify\">The newly staked claims are southwest and on trend with the existing Zeus Copper Project and cover an area with outcropping Lower Huntington Formation and Triassic age intrusive rocks (plutons). Both of these rock units are highly prospective for copper mineralization and are believed to be the main hosts of porphyry copper mineralization in the Hercules Copper Trend. This area is an important erosional window through the post-mineral basalt cover rocks, which conceal most of the prospective rock units in the Hercules Copper Trend. Additionally, most of the surrounding ground around Zeus has been staked by Barrick Gold Corp. (NYSE:GOLD, TSX:ABX) who have been conducting a very aggressive exploration campaign throughout the Hercules Copper Trend. </p>   <p align=\"center\"> </p>   <p align=\"center\"> </p>  <p />  <p align=\"center\"><i> Figure 3 – Stratigraphy of the Hercules Copper Trend. The stratigraphy that is considered the most prospective to host porphyry copper mineralization includes the Lower Huntington Formation (purple) and Triassic age plutons (brown). Silver mineralization is known to be hosted in Upper Huntington Formation (blue), including the Hercules Rhyolite, as well as the underlying (older) stratigraphy. </i><a href=\"https://www.globenewswire.com/Tracker?data=0-lteoPT3X1HUJP9BDBmTsxbnAjVi_sZC4NkDiexcEhVWc_YzLH46FRwUxzAHCJ0aHPj0bMzCT_a3OjKVP3TqYhcYZ9QxbKxokX6BjgrrkeqUTGcCiMQ9f2vieV91XF6D-alrvl79hjwMYfqoF4b3FsHMVAnNR2NHq_GQ2ceu-NdQcc_YlluPaBsHcFFT-XV\" rel=\"nofollow\" target=\"_blank\"><i><u>To view image please click here</u></i></a></p>   <p align=\"justify\"> </p>   <p align=\"justify\"><b><u>Planned 2025 Activities / Status Update</u></b></p>   <p align=\"justify\">NevGold will continue its active exploration program at Zeus in 2025 including: </p>   <ul type=\"disc\"><li>Geological database review <b>(completed)</b>; </li></ul>   <ul type=\"disc\"><li>Geological mapping <b>(continuous)</b>;</li></ul>   <ul type=\"disc\"><li>Comprehensive surface geochemical sampling <b>(completed)</b>;</li></ul>   <ul type=\"disc\"><li>Ground geophysical program <b>(in preparation)</b>; </li></ul>   <ul type=\"disc\"><li>Application for drill permit, Notice of Intent “NOI”<b> (in preparation)</b>; and,</li></ul>   <ul type=\"disc\"><li>Drill testing copper targets identified by the above activities <b>(results warranted)</b>. </li></ul>   <p align=\"justify\"> </p>   <p align=\"justify\"> </p>   <p align=\"justify\"> </p>   <p align=\"justify\"> </p>   <p align=\"justify\"> </p>   <p align=\"justify\"> </p>   <p align=\"justify\"> </p>   <p align=\"center\"> </p>  <p />  <p align=\"center\"><i>Figure 4 – Copper analysis of Zeus Copper Project and Hercules Copper Project surface soil samples at similar scale. Zones greater than 100 ppm copper-in-soils are outlined in solid black lines. Early Jurassic-aged Upper Huntington Formation (purple polygons) and Late-Triassic-aged intrusive complexes (maroon polygons) are both key copper hosts. A schematic Cu-in-Soils footprint of the Zeus (red) and Hercules (black) Projects is outlined in the green box at the bottom of the Figure. </i><a href=\"https://www.globenewswire.com/Tracker?data=0-lteoPT3X1HUJP9BDBmTsxbnAjVi_sZC4NkDiexcEg96iB96JAW2tI9W2dXukAOqwgLptfYO-mQQGVKXTmeN_iXvwm-Yo-WLPQwH916pzSCEMVjlnGUhTUPJPuDkLYlcNO3PibD7KQMogV60nGaERQ8nDkLua18Knjt1uasUb4=\" rel=\"nofollow\" target=\"_blank\"><i><u>To view image please click here</u></i></a></p>   <p align=\"justify\"> </p>   <p align=\"center\"> </p>  <p />  <p align=\"center\"><i>Figure 5 - Zeus Project Location and Hercules Copper Trend. </i><a href=\"https://www.globenewswire.com/Tracker?data=0-lteoPT3X1HUJP9BDBmTsxbnAjVi_sZC4NkDiexcEjzkSfp3fHhV7J5nLyrw4cJLU-ftM7rYh7Au8aAEk2fv4m-MMkYIMk4Opw1nGYUd8Z4A-4eGnWVj5YmGqHU50CRhVe-Dvd6xtqjMJOZN1CVEyJGqF09zLBsqTjZm7G-y0H33q1TQh5eyqDKWibQ-oNi\" rel=\"nofollow\" target=\"_blank\"><i><u>To view image please click here</u></i></a></p>   <p align=\"justify\"> </p>   <p align=\"left\"><b>ON BEHALF OF THE BOARD</b></p>   <p align=\"left\"><b><i>“Signed”</i></b></p>   <p align=\"left\"> </p>   <p align=\"left\"><b>Brandon Bonifacio, President &amp; CEO </b></p>   <p align=\"left\"> </p>   <p align=\"left\">For further information, please contact Brandon Bonifacio at bbonifacio@nev-gold.com, call 604-337-4997, or visit our website at <a href=\"https://www.globenewswire.com/Tracker?data=Lu5UEWHQUD3uWqzff0UAbDfwVVav6mqY5bQk61-zcJ9lBqL5xhnq0a2HcWNQijdnXsPhCJ-UtrWbfz8IKns5IOE5B0m4VKlyPy4MJGwAWgI=\" rel=\"nofollow\" target=\"_blank\"><u>www.nev-gold.com</u></a>.</p>   <p align=\"left\"> </p>   <p align=\"justify\">Technical information contained in this news release has been reviewed and approved by Greg French, CPG, the Company’s Vice President, Exploration, who is NevGold’s Qualified Person under National Instrument 43-101 and responsible for technical matters of this release.</p>   <p align=\"left\"><b><u>About the Company</u></b></p>   <p align=\"justify\">NevGold is an exploration and development company targeting large-scale mineral systems in the proven districts of Nevada and Idaho. NevGold owns a 100% interest in the Limousine Butte and Cedar Wash gold projects in Nevada, and the Nutmeg Mountain gold project and Zeus copper project in Idaho. </p>   <p align=\"justify\"> </p>   <p align=\"justify\"><b>Neither the TSX Venture Exchange nor its Regulation Services Provider (as that term is defined in the policies of the TSX Venture Exchange) accepts responsibility for the adequacy or accuracy of this release.</b></p>   <p align=\"center\"><b><i>Cautionary Note Regarding Forward Looking Statements</i></b></p>   <p align=\"justify\"><i>This news release contains forward-looking statements that are based on the Company’s current expectations and estimates. Forward-looking statements are frequently characterized by words such as “plan”, “expect”, “project”, “intend”, “believe”, “anticipate”, “estimate”, “suggest”, “indicate” and other similar words or statements that certain events or conditions “may” or “will” occur. Forward-looking statements include, but are not limited to, the proposed work programs at Zeus, and the exploration potential at Zeus. Such forward-looking statements involve known and unknown risks, uncertainties and other factors that could cause actual events or results to differ materially from estimated or anticipated events or results implied or expressed in such forward-looking statements. Such risks include, but are not limited to, general economic, market and business conditions, and the ability to obtain all necessary regulatory approvals. There is some risk that the forward-looking statements will not prove to be accurate, that the management’s assumptions may not be correct or that actual results may differ materially from such forward-looking statements. Accordingly, readers should not place undue reliance on the forward-looking statements. Any forward-looking statement speaks only as of the date on which it is made and, except as may be required by applicable securities laws, the Company disclaims any intent or obligation to update any forward-looking statement, whether as a result of new information, future </i><i>events or results or otherwise. Forward-looking statements are not guarantees of future performance and accordingly undue reliance should not be put on such statements due to the inherent uncertainty therein.</i></p>   <p align=\"justify\"> </p>   <p align=\"justify\"> </p>    <p> </p> <img alt=\"\" class=\"__GNW8366DE3E__IMG\" src=\"https://www.globenewswire.com/newsroom/ti?nf=OTM5NzY4MCM2ODE1Mjc1IzUwMDAyNDM2Nw==\" /> <br/><img  alt=\"\" src=\"https://ml.globenewswire.com/media/YmRhMmVkMmEtOTY5Zi00NTNkLTgwNmMtZmM2MDBiZmY4NjEwLTUwMDAyNDM2Ny0yMDI1LTAzLTIwLWVu/tiny/NevGold-Corp-.png\" referrerpolicy=\"no-referrer-when-downgrade\" /></div>",
    "search_terms": "Zeus,Nevgold Corp.,NAU",
    "master_gid": 6637,
    "date": "2025-03-20T12:00:00.000Z",
    "tags": "USA|Idaho||Copper|Project Acquisition",
    "image_id": null,
    "hidden": false,
    "company_id": 23,
    "provider": "globenewswire",
    "excerpt": "NevGold Corp. (“NevGold” or the “Company”) (TSXV:NAU) (OTCQX:NAUFF) (Frankfurt:5E50) is pleased to announce that it has staked an additional 147 claims, approximately 1,000 hectares or 10 square kilometers, with strong geological prospectivity at...",
    "is_regulatory": false,
    "refined_tags": [],
    "ftp_filename": "202503209397680-en",
    "company_name": "Nevgold Corp.",
    "exchange": "TSXV",
    "root_ticker": "NAU",
    "project_name": "Zeus",
    "gid": 6637,
    "location": "Idaho, United States",
    "plan_id": null,
    "description_text": "Vancouver, British Columbia, March  20, 2025  (GLOBE NEWSWIRE) -- NevGold Corp. (“ NevGold ” or the “ Company ”) (TSXV:NAU) (OTCQX:NAUFF) (Frankfurt:5E50 ) is pleased to announce that it has staked an additional 147 claims, approximately 1,000 hectares or 10 square kilometers, with strong geological prospectivity at the Zeus Copper Project in the emerging Hercules Copper Trend of southwestern Idaho. As highlighted in NevGold’s previous News Releases from 2024 and 2025 to date ( see NevGold News Releases ) , the Zeus Copper Project shares many geological similarities with Hercules Metals Corp.’s (“Hercules Metals”, TSXV:BIG) copper porphyry discovery at the Hercules Project ( see Hercules Metals News Releases ), including comparable soil survey geochemical results (see Figure 1, Figure 4) . Key Highlights Zeus Copper Project now encompasses 392 claims, approximately 2,900 hectares or 29 square kilometers , of highly strategic and prospective ground in the Hercules Copper Trend New additional ground staked by the NevGold team is underlain by the two primary host rocks of copper mineralization in the Hercules Copper Trend, the Lower Huntington Formation and Triassic age intrusive rocks Strong similarities are noted between the Zeus Copper Project and the Hercules Metals copper porphyry discovery at the Hercules Project Field programs will advance including planned geophysical surveys to identify drill targets Figure 1 – Zeus Copper Project land position and geology of the Hercules Copper Trend. The newly staked claims contain Lower Huntington Formation shown in purple, and Triassic age intrusive rocks (plutons) shown in brown, both are known to host copper mineralization on the Hercules Copper Trend. Modified from (Henricksen, 1975), (Fankhauser, 1968), (Skurla, 1974), (Lund, 2021), (Adair, 1985). To view image please click here NevGold CEO, Brandon Bonifacio, comments: “We are very pleased to have added additional ground with all of the right geologic signatures at our Zeus Copper Project. After our recent soil survey results, it is positive we were able to acquire more ground adjacent to our initial claim block, in an area that looks to be an emerging copper trend. The recently staked ground is also adjacent to a large claim block that Barrick Gold Corp. (NYSE:GOLD, TSX:ABX) has established on the trend (see Figure 1 and Figure 2) . There continues to be a high level of activity on the Hercules Copper Trend, and we have been a first-mover and have continued to strategically add some of the most prospective ground in the district. Along with adding to our land position, we have also actively continued our field work program, and due to positive results, we will continue with our geophysical program to define drill targets by the 2025 summer field season.” NevGold VP Exploration, Greg French, comments: “We are very excited about the additional ground that we have been able to stake in this emerging copper trend in the Western USA. The land that we recently staked contains one of the last available erosional windows through post-mineral basalts. These windows expose the highly-prospective Lower Huntington Formation and Triassic plutons, the main hosts of porphyry copper mineralization on the Hercules Copper Trend . Our technical team has gained a strong understanding of the district geology over the past year, and we will continue to leverage this competitive advantage as we advance our highly prospective Zeus Copper Project.” Newly-Staked Zeus Claims Figure 2 – Geology of expanded NevGold Zeus Copper Project land position. The newly staked claims contain Lower Huntington Formation (purple) and Triassic age plutons (brown), both are known to host copper mineralization on the Hercules Copper Trend. Post-mineral basalts and sediments (tan) cover a significant portion of the Hercules Copper Trend and obscure any potential mineralization. Modified from ( Henricksen, 1975), (Fankhauser, 1968), (Skurla, 1974), (Lund, 2021), (Adair, 1985). To view image please click here The newly staked claims are southwest and on trend with the existing Zeus Copper Project and cover an area with outcropping Lower Huntington Formation and Triassic age intrusive rocks (plutons). Both of these rock units are highly prospective for copper mineralization and are believed to be the main hosts of porphyry copper mineralization in the Hercules Copper Trend. This area is an important erosional window through the post-mineral basalt cover rocks, which conceal most of the prospective rock units in the Hercules Copper Trend. Additionally, most of the surrounding ground around Zeus has been staked by Barrick Gold Corp. (NYSE:GOLD, TSX:ABX) who have been conducting a very aggressive exploration campaign throughout the Hercules Copper Trend. Figure 3 – Stratigraphy of the Hercules Copper Trend. The stratigraphy that is considered the most prospective to host porphyry copper mineralization includes the Lower Huntington Formation (purple) and Triassic age plutons (brown). Silver mineralization is known to be hosted in Upper Huntington Formation (blue), including the Hercules Rhyolite, as well as the underlying (older) stratigraphy. To view image please click here Planned 2025 Activities / Status Update NevGold will continue its active exploration program at Zeus in 2025 including: Geological database review (completed) ; Geological mapping (continuous) ; Comprehensive surface geochemical sampling (completed) ; Ground geophysical program (in preparation) ; Application for drill permit, Notice of Intent “NOI” (in preparation) ; and, Drill testing copper targets identified by the above activities (results warranted) . Figure 4 – Copper analysis of Zeus Copper Project and Hercules Copper Project surface soil samples at similar scale. Zones greater than 100 ppm copper-in-soils are outlined in solid black lines. Early Jurassic-aged Upper Huntington Formation (purple polygons) and Late-Triassic-aged intrusive complexes (maroon polygons) are both key copper hosts. A schematic Cu-in-Soils footprint of the Zeus (red) and Hercules (black) Projects is outlined in the green box at the bottom of the Figure. To view image please click here Figure 5 - Zeus Project Location and Hercules Copper Trend. To view image please click here ON BEHALF OF THE BOARD “Signed” Brandon Bonifacio, President & CEO For further information, please contact Brandon Bonifacio at bbonifacio@nev-gold.com, call 604-337-4997, or visit our website at www.nev-gold.com . Technical information contained in this news release has been reviewed and approved by Greg French, CPG, the Company’s Vice President, Exploration, who is NevGold’s Qualified Person under National Instrument 43-101 and responsible for technical matters of this release. About the Company NevGold is an exploration and development company targeting large-scale mineral systems in the proven districts of Nevada and Idaho. NevGold owns a 100% interest in the Limousine Butte and Cedar Wash gold projects in Nevada, and the Nutmeg Mountain gold project and Zeus copper project in Idaho. Neither the TSX Venture Exchange nor its Regulation Services Provider (as that term is defined in the policies of the TSX Venture Exchange) accepts responsibility for the adequacy or accuracy of this release. Cautionary Note Regarding Forward Looking Statements This news release contains forward-looking statements that are based on the Company’s current expectations and estimates. Forward-looking statements are frequently characterized by words such as “plan”, “expect”, “project”, “intend”, “believe”, “anticipate”, “estimate”, “suggest”, “indicate” and other similar words or statements that certain events or conditions “may” or “will” occur. Forward-looking statements include, but are not limited to, the proposed work programs at Zeus, and the exploration potential at Zeus. Such forward-looking statements involve known and unknown risks, uncertainties and other factors that could cause actual events or results to differ materially from estimated or anticipated events or results implied or expressed in such forward-looking statements. Such risks include, but are not limited to, general economic, market and business conditions, and the ability to obtain all necessary regulatory approvals. There is some risk that the forward-looking statements will not prove to be accurate, that the management’s assumptions may not be correct or that actual results may differ materially from such forward-looking statements. Accordingly, readers should not place undue reliance on the forward-looking statements. Any forward-looking statement speaks only as of the date on which it is made and, except as may be required by applicable securities laws, the Company disclaims any intent or obligation to update any forward-looking statement, whether as a result of new information, future events or results or otherwise. Forward-looking statements are not guarantees of future performance and accordingly undue reliance should not be put on such statements due to the inherent uncertainty therein.",
    "primary_commodity": "Cu"
  },
  "articleProject": {
    "gid": 6637,
    "project_name": "Zeus",
    "location": "Idaho, United States"
  },
  "articleExchange": "TSXV",
  "articleCompanyId": 23,
  "articleTicker": "NAU",
  "articleCompanyName": "Nevgold Corp.",
  "allOtherCompanyProjects": [
    {
      "company_id": 23,
      "gid": 3013,
      "project_name": "Limousine Butte",
      "location": "Nevada, United States"
    },
    {
      "company_id": 23,
      "gid": 385,
      "project_name": "Ptarmigan",
      "location": "British Columbia, Canada"
    },
    {
      "company_id": 23,
      "gid": 4229,
      "project_name": "Nutmeg Mountain",
      "location": "Idaho, United States"
    },
    {
      "company_id": 23,
      "gid": 4695,
      "project_name": "Cedar Wash",
      "location": "Nevada, United States"
    },
    {
      "company_id": 23,
      "gid": 6637,
      "project_name": "Zeus",
      "location": "Idaho, United States"
    }
  ],
  "allOtherCompanyNews": [
    {
      "id": 107781,
      "company_id": 23,
      "title": "NevGold Extends Oxide Gold-Antimony Mineralization Over 1.7 Kilometers at Cadillac Valley Target: 2.28 g/t AuEq Over 30.5 Meters (1.29 g/t Au And 0.22% Antimony) Within 1.61 g/t AuEq Over 61.0 Meters (1.08 g/t Au And 0.12% Antimony)",
      "link": null,
      "date": "2025-06-12T10:00:00.000Z",
      "hidden": false
    },
    {
      "id": 106989,
      "company_id": 23,
      "title": "NevGold Adds More Significant Oxide Gold-Antimony Results:  7.04 g/t AuEq Over 15.2 Meters (6.37 g/t Au And 0.15% Antimony) Within 4.14 g/t AuEq Over 29.0 Meters (3.56 g/t Au And 0.13% Antimony), and Expands Gold-Antimony Mineralization Over 400 Meters Along Strike at the Limousine Butte Project, Nevada",
      "link": null,
      "date": "2025-06-04T21:36:35.000Z",
      "hidden": false
    },
    {
      "id": 106825,
      "company_id": 23,
      "title": "NevGold Adds More Significant Oxide Gold-Antimony Results: 1.47 g/t AuEq Over 74.7 Meters (0.23% Antimony And 0.45 g/t Au), Including 3.59 g/t AuEq Over 18.2 Meters (0.60% Antimony And 0.92 g/t Au), and Also Including 4.61 g/t AuEq Over 6.0 Meters (0.96% Antimony And 0.31 g/t Au) at the Limousine Butte Project, Nevada ",
      "link": null,
      "date": "2025-06-03T20:15:00.000Z",
      "hidden": false
    },
    {
      "id": 106286,
      "company_id": 23,
      "title": "NevGold Announces Closing of Upsized C$6.0M Brokered Private Placement Financing",
      "link": null,
      "date": "2025-05-29T18:49:18.000Z",
      "hidden": false
    },
    {
      "id": 105901,
      "company_id": 23,
      "title": "NevGold Announces Upsize to C$6M Brokered Private Placement Financing",
      "link": null,
      "date": "2025-05-27T12:00:30.000Z",
      "hidden": false
    },
    {
      "id": 105498,
      "company_id": 23,
      "title": "NevGold Announces Upsize to C$5.5M Brokered Private Placement Financing",
      "link": null,
      "date": "2025-05-22T12:00:19.000Z",
      "hidden": false
    },
    {
      "id": 104810,
      "company_id": 23,
      "title": "NevGold Announces C$5M Brokered Private Placement Financing",
      "link": null,
      "date": "2025-05-15T12:52:25.000Z",
      "hidden": false
    },
    {
      "id": 104478,
      "company_id": 23,
      "title": "NEVGOLD ADDS MORE SIGNIFICANT OXIDE GOLD-ANTIMONY RESULTS:  2.19 G/T AUEQ OVER 64.0 METERS (0.72 G/T AU AND 0.33% ANTIMONY), INCLUDING 4.17 G/T AUEQ OVER 24.1 METERS (1.47 G/T AU AND 0.60% ANTIMONY), AND ALSO INCLUDING 10.86 G/T AUEQ OVER 4.50 METERS (1.43 G/T AU AND 2.10% ANTIMONY) AT THE LIMOUSINE BUTTE PROJECT, NEVADA",
      "link": null,
      "date": "2025-05-13T12:00:00.000Z",
      "hidden": false
    },
    {
      "id": 100824,
      "company_id": 23,
      "title": "NevGold Discovers More Significant Oxide Gold-Antimony Results:  2.11 g/t AuEq Over 67.1 Meters (1.30 g/t Au And 0.18% Antimony), Including 4.29 g/t AuEq Over 30.5 Meters (2.79 g/t Au And 0.33% Antimony), and Also Including 7.12 g/t AuEq Over 16.8 Meters (5.05 g/t Au And 0.46% Antimony) at the Limousine Butte Project, Nevada",
      "link": null,
      "date": "2025-04-24T12:00:00.000Z",
      "hidden": false
    },
    {
      "id": 103042,
      "company_id": 23,
      "title": "NEVGOLD DISCOVERS MORE SIGNIFICANT OXIDE GOLD-ANTIMONY RESULTS AT THE LIMOUSINE BUTTE PROJECT, NEVADA",
      "link": "https://app.quotemedia.com/data/downloadFiling?webmasterId=104408&ref=680a28662b557f7b15251b91&type=PDFC&formType=002-002-001089-003001&formDescription=News+release&dateFiled=2025-04-24",
      "date": "2025-04-24T05:02:46.000Z",
      "hidden": false
    }
  ]
}
