{
  "article": {
    "id": 31233,
    "link": "https://www.accesswire.com/viewarticle.aspx?id=739414&lang=en",
    "title": "Fuse Battery Metals Expands its Land Holdings by Adding a Lithium Exploration Project in Nevada",
    "description": "<p><strong>COQUITLAM, BC / ACCESSWIRE / February 15, 2023 / Fuse Battery Metals Inc.</strong> (\"the Company \"or \"Fuse\") <strong>(TSXV:FUSE)(OTCQB:FUSEF)(FRA:43W3)</strong> is pleased to announce the expansion of our exploration land holdings with the inclusion of a new lithium exploration project in Nevada, the Lithium Springs Project.</p><p>The Company has entered into a Purchase and Sale Agreement dated February 14, 2023, to acquire a 100% interest in 108 placer claims (BRD1 - BRD108) from Malcolm J. Bell (the \"Vendor\"). The claims cover approximately 858 hectares of playa and alluvial fan located at the south end of the Black Rock Desert outside of the hamlet of Gerlach in Washoe County, Nevada, known as the Lithium Springs Property (the \"Transaction\").</p><p><strong>Terms of the Transaction:</strong></p><ol><li>The Company agrees to the following:</li><li>(a) reimburse the staking and recording costs to the Vendor in the amount of US$33,982 upon signing the Agreement; and</li><li>(b) issuing to the Vendor 500,000 fully paid and non-assessable common shares in the capital of the Company upon TSX Venture Exchange acceptance of the Transaction.</li></ol><p>All securities issued in connection with the Transaction are subject to a four month and a day hold period in accordance with Canadian Securities Laws.</p><p><strong>About the Lithium Springs Property</strong></p><p>The project is located at the southern end of Black Rock Desert, Nevada, about 132 air-line km north-northeast of Reno, Nevada in Sections 1, 2, 11, and 12 Township 32 North, Range 23. The center of the property is about 40.676&deg; North Latitude, 119.331&deg; West Longitude, (40&deg; 40' 33\" N, 119&deg; 19' 52\"): UTM X 302,900 UTMY 4,505,400 NAD 27; Zone 11 N.</p><p>Black Rock Desert basin is about 110 km long and up to 25 km wide at the widest point. The central playa measures about 50 km northeast - southwest and 10 km southeast - northwest. The western arm of the Black Rock Desert covers an area of about 2,000 square kilometers and contains 5 of the 30 currently listed Known Geothermal Resource Areas in Nevada.</p><p>The property covers an area of playa underlain by a moderately deep basin interpreted from gravity and seismic surveys indicating a maximum thickness of valley-fill deposits of about 1,200 m/ 3,600 ft. A high salt content prevents any significant vegetation from growing on the playa surface. Locally, the basin is being fed in part by boiling springs and siliceous sinter containing strongly anomalous Lithium values (up to 3.5 ppm) that flank the property on the west side. (U.S. GEOLOGICAL SURVEY Open-File Report 81-918.) While these lithium values are well below those of producing lithium bines, they do represent a significant source of metal available for evaporative concentration within the playa basin.</p><p><strong>Past Exploration Work and Proposed Exploration Plan</strong></p><p>Prior work completed on this property included a grid soil sampling program in 2016 where samples were collected on 200-meter intervals on lines spaced 400 meters apart for a total of 170 sites. Values ranged from 82.8 to 520 ppm lithium with a median value of 182 ppm. These values are significantly above the background in the adjoining ranges and indicate concentration of lithium in the playa silts and salt crust. Following the completion of this work, a shallow sampling program was completed followed by high resolution geophysical program to define potential drill targets.</p><p>The local geologic setting combined with the presence of lithium in both active geothermal fluids and surface salts within the Black Rock Desert property position match characteristics of lithium brine deposits at Clayton Valley, Nevada and in South America. The nearby geothermal fluids draining into the claims contain lithium in the 3 to 5 mg per liter range and most likely contributed to surface sampling values up to 520 ppm lithium. These preliminary results warrant continued exploration for a Clayton Valley type brine and/or clay deposit.</p><p>A reasonable expectation for a First Phase exploration program by the Company would be to re-sample the area, complete a geophysical survey and undertake a phased exploration program of surface sampling, auger or push drill water sampling, and geophysical work to choose drill sites for an initial drill test of the property. A subsequent Phase two exploration program could involve additional surface and sub-surface sampling and test drilling the property for lithium bearing brine and/or lithium bearing clay deposits.</p><p>Mr. Tim Fernback, Fuse Interim President &amp; CEO comments <i>\"The Black Rock Desert holds substantial lithium exploration potential due to the proximity of geothermal activity in the immediate area. It is the Company's intention to rapidly evaluate the lithium brine and lithium clay potential of this well-located property. Fuse is in the process of completing the initial NI #43-101 Technical Report on the property.\"</i></p><p><strong>Qualified Person as Defined Under National Instrument 43-101</strong></p><p>Alan J. Morris, CPG of Spring Creek, Nevada, a Qualified Person as defined under Nation Instrument 43-101 has reviewed and approved the technical aspects of this news release.</p><p><strong>About Fuse Battery Metals Inc.</strong> <a href=\"https://pr.report/Qef1Gxwn\">https://fusecobalt.com/</a></p><p>Fuse Battery Metals Inc. is a Canadian based exploration company that trades under the symbol FUSE on the TSX Venture Exchange. The Company's focus is on exploration for high value metals required for the manufacturing of batteries.</p><p><strong>Ontario Cobalt Properties</strong></p><p>Fuse owns a 100% interest its Glencore Bucke Property, situated in Bucke Township, 6 km east-northeast of Cobalt, Ontario, subject to a back-in provision, production royalty and off-take agreement. The Glencore Bucke Property consists of 16.2 hectares and sits along the west boundary of Fuse's Teledyne Cobalt Project. The Company also owns a 100% interest, subject to a royalty, in the Teledyne Project located near Cobalt, Ontario. The Teledyne Property adjoins the south and west boundaries of claims that hosted the Agnico Mine.</p><p><strong>Glencore Bucke/Teledyne Property</strong></p><p>Situated in Bucke Township, 6 km east-northeast of Cobalt, Ontario the Glencore Bucke Property adjoins, on its northeast corner, the former cobalt producing Agaunico Mine. From 1905 through to 1961, the Agaunico Mine produced a total of 4,350,000 lbs. of cobalt (\"Co\"), and 980,000 oz of silver (\"Ag\") (Cunningham-Dunlop, 1979). <strong>The amount of cobalt produced from the Agaunico Mine is greater than that of any other mine in the Cobalt Mining Camp.</strong> Production ceased in 1961 due to depressed Co prices and over-supply (Thomson, 1964). The Glencore property is 100% owned by Fuse Battery subject to a back-in provision, production royalty and off-take agreement.</p><p>The associated Teledyne Property, located in Bucke and Lorrain Townships, consists of five patented mining claims totaling 79.1 ha, and 46 unpatented mining claim cells totaling approximately 700 ha. The Property is easily accessible by highway 567 and a well-maintained secondary road<strong>.</strong></p><p>Cumulatively, over $25 million has been spent on exploration thus far, (2020 dollars inflation-adjusted) on the Teledyne Property resulting in valuable infrastructure including a development ramp and a modern decline going down 500 ft parallel to the main cobalt mineralized vein. The Teledyne Property is subject to a production royalty in favor of New Found Gold and an off-take agreement in favor of Glencore Canada Corp., while the Glencore Bucke Property is subject to a back-in provision, production royalty, and an off-take agreement in favor of Glencore Canada Corp. Glencore PLC is the world's largest producer of cobalt. <strong>A sizable portion of the cobalt produced at the Agaunico Mine was located along structures (Vein #15) that extended southward towards the northern boundary of the Teledyne Cobalt Property, </strong>currently 100% owned by FUSE. Mineralization was located within 125 ft (38.1 m) above the Huronian/Archean unconformity. Stoping widths of up to 50 ft (15.2 m) were not unusual at the Agaunico Mine (Cunningham-Dunlop, 1979).</p><p><strong>On Behalf of the Board of Directors</strong><br><i>\"Tim Fernback\"</i></p><p><strong>Tim Fernback, Interim President &amp; CEO</strong><br>Contact Information:<br>Email: <a href=\"mailto:info@fusecobalt.com\">info@fusecobalt.com</a><br>Phone: 236-521-0207</p><p><i>Neither the TSX Venture Exchange nor its Regulation Services Provider (as that term is defined in the policies of the TSX Venture Exchange) accepts responsibility for the adequacy or accuracy of this release. This news release may contain forward-looking statements which include, but are not limited to, comments that involve future events and conditions, which are subject to various risks and uncertainties. Except for statements of historical facts, comments that address resource potential, upcoming work programs, geological interpretations, receipt and security of mineral property titles, availability of funds, and others are forward-looking. Forward-looking statements are not guarantees of future performance and actual results may vary materially from those statements. General business conditions are factors that could cause actual results to vary materially from forward-looking statements.</i></p><p><strong>SOURCE:</strong> Fuse Battery Metals Inc</p><br><br>View source version on accesswire.com: <br><a href='https://www.accesswire.com/739414/Fuse-Battery-Metals-Expands-its-Land-Holdings-by-Adding-a-Lithium-Exploration-Project-in-Nevada'>https://www.accesswire.com/739414/Fuse-Battery-Metals-Expands-its-Land-Holdings-by-Adding-a-Lithium-Exploration-Project-in-Nevada</a><br><br>",
    "search_terms": "Lithium Springs,Fuse Battery Metals Inc,FUSE",
    "master_gid": 4056,
    "date": "2023-02-15T12:30:00.000Z",
    "tags": "USA|Nevada||Lithium|Project Acquisition",
    "image_id": null,
    "hidden": false,
    "company_id": 1327,
    "provider": "accesswire",
    "excerpt": "COQUITLAM, BC / ACCESSWIRE / February 15, 2023 / Fuse Battery Metals Inc.(\"the Company \"or \"Fuse\")(TSXV:FUSE)(OTCQB:FUSEF)(FRA:43W3)is pleased to announce the expansion of our exploration land holdings with the inclusion of a new lithium exploration project in Nevada, the Lithium Springs Project.The Company has entered into a Purchase and Sale Agreement",
    "is_regulatory": false,
    "refined_tags": [
      "Project Acquisition"
    ],
    "ftp_filename": null,
    "company_name": "Fuse Battery Metals Inc",
    "exchange": "TSXV",
    "root_ticker": "FUSE",
    "project_name": "Lithium Springs",
    "gid": 4056,
    "location": "Nevada, United States",
    "plan_id": null,
    "description_text": "COQUITLAM, BC / ACCESSWIRE / February 15, 2023 / Fuse Battery Metals Inc. (\"the Company \"or \"Fuse\") (TSXV:FUSE)(OTCQB:FUSEF)(FRA:43W3) is pleased to announce the expansion of our exploration land holdings with the inclusion of a new lithium exploration project in Nevada, the Lithium Springs Project. The Company has entered into a Purchase and Sale Agreement dated February 14, 2023, to acquire a 100% interest in 108 placer claims (BRD1 - BRD108) from Malcolm J. Bell (the \"Vendor\"). The claims cover approximately 858 hectares of playa and alluvial fan located at the south end of the Black Rock Desert outside of the hamlet of Gerlach in Washoe County, Nevada, known as the Lithium Springs Property (the \"Transaction\"). Terms of the Transaction: The Company agrees to the following: (a) reimburse the staking and recording costs to the Vendor in the amount of US$33,982 upon signing the Agreement; and (b) issuing to the Vendor 500,000 fully paid and non-assessable common shares in the capital of the Company upon TSX Venture Exchange acceptance of the Transaction. All securities issued in connection with the Transaction are subject to a four month and a day hold period in accordance with Canadian Securities Laws. About the Lithium Springs Property The project is located at the southern end of Black Rock Desert, Nevada, about 132 air-line km north-northeast of Reno, Nevada in Sections 1, 2, 11, and 12 Township 32 North, Range 23. The center of the property is about 40.676째 North Latitude, 119.331째 West Longitude, (40째 40' 33\" N, 119째 19' 52\"): UTM X 302,900 UTMY 4,505,400 NAD 27; Zone 11 N. Black Rock Desert basin is about 110 km long and up to 25 km wide at the widest point. The central playa measures about 50 km northeast - southwest and 10 km southeast - northwest. The western arm of the Black Rock Desert covers an area of about 2,000 square kilometers and contains 5 of the 30 currently listed Known Geothermal Resource Areas in Nevada. The property covers an area of playa underlain by a moderately deep basin interpreted from gravity and seismic surveys indicating a maximum thickness of valley-fill deposits of about 1,200 m/ 3,600 ft. A high salt content prevents any significant vegetation from growing on the playa surface. Locally, the basin is being fed in part by boiling springs and siliceous sinter containing strongly anomalous Lithium values (up to 3.5 ppm) that flank the property on the west side. (U.S. GEOLOGICAL SURVEY Open-File Report 81-918.) While these lithium values are well below those of producing lithium bines, they do represent a significant source of metal available for evaporative concentration within the playa basin. Past Exploration Work and Proposed Exploration Plan Prior work completed on this property included a grid soil sampling program in 2016 where samples were collected on 200-meter intervals on lines spaced 400 meters apart for a total of 170 sites. Values ranged from 82.8 to 520 ppm lithium with a median value of 182 ppm. These values are significantly above the background in the adjoining ranges and indicate concentration of lithium in the playa silts and salt crust. Following the completion of this work, a shallow sampling program was completed followed by high resolution geophysical program to define potential drill targets. The local geologic setting combined with the presence of lithium in both active geothermal fluids and surface salts within the Black Rock Desert property position match characteristics of lithium brine deposits at Clayton Valley, Nevada and in South America. The nearby geothermal fluids draining into the claims contain lithium in the 3 to 5 mg per liter range and most likely contributed to surface sampling values up to 520 ppm lithium. These preliminary results warrant continued exploration for a Clayton Valley type brine and/or clay deposit. A reasonable expectation for a First Phase exploration program by the Company would be to re-sample the area, complete a geophysical survey and undertake a phased exploration program of surface sampling, auger or push drill water sampling, and geophysical work to choose drill sites for an initial drill test of the property. A subsequent Phase two exploration program could involve additional surface and sub-surface sampling and test drilling the property for lithium bearing brine and/or lithium bearing clay deposits. Mr. Tim Fernback, Fuse Interim President & CEO comments \"The Black Rock Desert holds substantial lithium exploration potential due to the proximity of geothermal activity in the immediate area. It is the Company's intention to rapidly evaluate the lithium brine and lithium clay potential of this well-located property. Fuse is in the process of completing the initial NI #43-101 Technical Report on the property.\" Qualified Person as Defined Under National Instrument 43-101 Alan J. Morris, CPG of Spring Creek, Nevada, a Qualified Person as defined under Nation Instrument 43-101 has reviewed and approved the technical aspects of this news release. About Fuse Battery Metals Inc. https://fusecobalt.com/ Fuse Battery Metals Inc. is a Canadian based exploration company that trades under the symbol FUSE on the TSX Venture Exchange. The Company's focus is on exploration for high value metals required for the manufacturing of batteries. Ontario Cobalt Properties Fuse owns a 100% interest its Glencore Bucke Property, situated in Bucke Township, 6 km east-northeast of Cobalt, Ontario, subject to a back-in provision, production royalty and off-take agreement. The Glencore Bucke Property consists of 16.2 hectares and sits along the west boundary of Fuse's Teledyne Cobalt Project. The Company also owns a 100% interest, subject to a royalty, in the Teledyne Project located near Cobalt, Ontario. The Teledyne Property adjoins the south and west boundaries of claims that hosted the Agnico Mine. Glencore Bucke/Teledyne Property Situated in Bucke Township, 6 km east-northeast of Cobalt, Ontario the Glencore Bucke Property adjoins, on its northeast corner, the former cobalt producing Agaunico Mine. From 1905 through to 1961, the Agaunico Mine produced a total of 4,350,000 lbs. of cobalt (\"Co\"), and 980,000 oz of silver (\"Ag\") (Cunningham-Dunlop, 1979). The amount of cobalt produced from the Agaunico Mine is greater than that of any other mine in the Cobalt Mining Camp. Production ceased in 1961 due to depressed Co prices and over-supply (Thomson, 1964). The Glencore property is 100% owned by Fuse Battery subject to a back-in provision, production royalty and off-take agreement. The associated Teledyne Property, located in Bucke and Lorrain Townships, consists of five patented mining claims totaling 79.1 ha, and 46 unpatented mining claim cells totaling approximately 700 ha. The Property is easily accessible by highway 567 and a well-maintained secondary road . Cumulatively, over $25 million has been spent on exploration thus far, (2020 dollars inflation-adjusted) on the Teledyne Property resulting in valuable infrastructure including a development ramp and a modern decline going down 500 ft parallel to the main cobalt mineralized vein. The Teledyne Property is subject to a production royalty in favor of New Found Gold and an off-take agreement in favor of Glencore Canada Corp., while the Glencore Bucke Property is subject to a back-in provision, production royalty, and an off-take agreement in favor of Glencore Canada Corp. Glencore PLC is the world's largest producer of cobalt. A sizable portion of the cobalt produced at the Agaunico Mine was located along structures (Vein #15) that extended southward towards the northern boundary of the Teledyne Cobalt Property, currently 100% owned by FUSE. Mineralization was located within 125 ft (38.1 m) above the Huronian/Archean unconformity. Stoping widths of up to 50 ft (15.2 m) were not unusual at the Agaunico Mine (Cunningham-Dunlop, 1979). On Behalf of the Board of Directors \"Tim Fernback\" Tim Fernback, Interim President & CEO Contact Information: Email: info@fusecobalt.com Phone: 236-521-0207 Neither the TSX Venture Exchange nor its Regulation Services Provider (as that term is defined in the policies of the TSX Venture Exchange) accepts responsibility for the adequacy or accuracy of this release. This news release may contain forward-looking statements which include, but are not limited to, comments that involve future events and conditions, which are subject to various risks and uncertainties. Except for statements of historical facts, comments that address resource potential, upcoming work programs, geological interpretations, receipt and security of mineral property titles, availability of funds, and others are forward-looking. Forward-looking statements are not guarantees of future performance and actual results may vary materially from those statements. General business conditions are factors that could cause actual results to vary materially from forward-looking statements. SOURCE: Fuse Battery Metals Inc View source version on accesswire.com: https://www.accesswire.com/739414/Fuse-Battery-Metals-Expands-its-Land-Holdings-by-Adding-a-Lithium-Exploration-Project-in-Nevada",
    "primary_commodity": "Li"
  },
  "articleProject": {
    "gid": 4056,
    "project_name": "Lithium Springs",
    "location": "Nevada, United States"
  },
  "articleExchange": "TSXV",
  "articleCompanyId": 1327,
  "articleTicker": "FUSE",
  "articleCompanyName": "Fuse Battery Metals Inc",
  "allOtherCompanyProjects": [
    {
      "company_id": 1327,
      "gid": 4298,
      "project_name": "Monitor Valley North",
      "location": "Nevada, United States"
    },
    {
      "company_id": 1327,
      "gid": 4056,
      "project_name": "Lithium Springs",
      "location": "Nevada, United States"
    },
    {
      "company_id": 1327,
      "gid": 3492,
      "project_name": "Glencore Bucke",
      "location": "Ontario, Canada"
    },
    {
      "company_id": 1327,
      "gid": 3493,
      "project_name": "Teledyne",
      "location": "Ontario, Canada"
    }
  ],
  "allOtherCompanyNews": [
    {
      "id": 54767,
      "company_id": 1327,
      "title": "Fuse Battery Announces Effective Date of Share Consolidation",
      "link": "https://www.thenewswire.com/press-releases?id=1kx7FREDp",
      "date": "2024-05-30T11:30:00.000Z",
      "hidden": false
    },
    {
      "id": 53145,
      "company_id": 1327,
      "title": "Fuse Battery Announces Consolidation",
      "link": "https://www.thenewswire.com/press-releases?id=1ArbF2EDZ",
      "date": "2024-05-01T22:20:00.000Z",
      "hidden": false
    },
    {
      "id": 51096,
      "company_id": 1327,
      "title": "Fuse Battery Metals Provides a 2024 Exploration Update for its Nevada Lithium Properties",
      "link": "https://www.accesswire.com/viewarticle.aspx?id=847228&lang=en",
      "date": "2024-03-27T11:30:00.000Z",
      "hidden": false
    },
    {
      "id": 46400,
      "company_id": 1327,
      "title": "Fuse Battery Metals Provides a Year End Update for its Shareholders",
      "link": "https://www.thenewswire.com/press-releases?id=1Bz4FxxGz",
      "date": "2023-12-21T19:25:00.000Z",
      "hidden": false
    },
    {
      "id": 43104,
      "company_id": 1327,
      "title": "Fuse Battery Metals Completes Phase 1 of its Exploration Plan at the Monitor Valley Nevada Lithium Project",
      "link": "https://www.thenewswire.com/press-releases?id=1AwGFxQ2x",
      "date": "2023-10-26T11:30:00.000Z",
      "hidden": false
    },
    {
      "id": 42929,
      "company_id": 1327,
      "title": "Fuse Battery Metals Announces its Plan to Spin-out and List its Subsidiary on the TSX Venture Exchange",
      "link": "https://www.thenewswire.com/press-releases?id=1BglFlD0q",
      "date": "2023-10-24T11:30:00.000Z",
      "hidden": false
    },
    {
      "id": 40329,
      "company_id": 1327,
      "title": "Fuse Battery Metals intercepted 7.75% Co and 5.44% Ni over 0.42m at Glencore-Bucke",
      "link": "https://www.thenewswire.com/press-releases?id=1Be9FJrVP",
      "date": "2023-09-05T21:25:00.000Z",
      "hidden": false
    },
    {
      "id": -56882,
      "company_id": 1327,
      "title": "Fuse Battery Metals Adds Industry Veteran Ryan Cheung CPA, CA to its Board of Directors",
      "link": "https://www.thenewswire.com/press-releases?id=1LYzFZVr8",
      "date": "2023-04-17T11:30:00.000Z",
      "hidden": false
    },
    {
      "id": -56123,
      "company_id": 1327,
      "title": "The Power Play by The Market Herald Releases New Interviews with Trillion Energy, Fuse Battery Metals and ARway Discussing Their Latest News",
      "link": "https://www.accesswire.com/viewarticle.aspx?id=746278&lang=en",
      "date": "2023-03-28T18:30:00.000Z",
      "hidden": false
    },
    {
      "id": 32894,
      "company_id": 1327,
      "title": "The Fuse Team is Actively Assessing Lithium Projects and Adds Another Lithium Exploration Project in Nevada",
      "link": "https://www.thenewswire.com/press-releases?id=1BKRFwqQM",
      "date": "2023-03-27T11:30:00.000Z",
      "hidden": false
    }
  ]
}
