{
  "article": {
    "id": 90128,
    "link": "https://contentapi.cision.com/api/v1.0/releases/20250303C4965",
    "title": "Nuclear Fuels Acquires TenSleep Uranium Project with Athabasca Basin-Style Mineralization in Wyoming's Powder River Basin",
    "description": "\n\n<p class=\"prntar\"><b>CSE:NF<br></br>OTCQX:NFUNF</b></p>\n<p><span class=\"legendSpanClass\"><span class=\"xn-location\">VANCOUVER, BC</span></span>, <span class=\"legendSpanClass\"><span class=\"xn-chron\">March 3, 2025</span></span> /CNW/ - <b>Nuclear Fuels Inc. </b>(CSE: NF) (OTCQX: NFUNF)<b> (\"Nuclear Fuels\" or the \"Company\")</b> announced today the acquisition of the TenSleep Uranium Project, located approximately 10 miles (16 kilometers) west of the town of <span class=\"xn-location\">Kaycee</span>, in <span class=\"xn-location\">Johnson County</span>, Wyoming.  The TenSleep Project is a unique uranium project in <span class=\"xn-location\">Wyoming</span>, displaying geological characteristics similar to the deposits in <span class=\"xn-location\">Saskatchewan's</span> prolific <span class=\"xn-location\">Athabasca</span> Basin rather than the typical roll front sandstone-hosted uranium deposits of the United States.  <span class=\"xn-location\">Athabasca</span> or \"unconformity\" uranium deposits occur along the contact of two different rock types in the vicinity of one or more high-angle faults providing the pathway for the mineralizing fluids to deposit uranium along the contact. These deposits are typically larger and higher grade than roll-front types. The Company is currently developing an exploration program with drilling planned for late 2025 or early 2026.</p>\n\n    <div class=\"PRN_ImbeddedAssetReference\" id=\"DivAssetPlaceHolder1\">\n                <p>\n                        <a href=\"https://mma.prnewswire.com/media/2631355/Nuclear_Fuels_Inc__Nuclear_Fuels_Acquires%C2%A0TenSleep_Uranium_Proje.html\" rel=\"nofollow\" target=\"_blank\">\n                    <img alt=\"Nuclear Fuels logo (CNW Group/Nuclear Fuels Inc.)\" src=\"https://mma.prnewswire.com/media/2631355/Nuclear_Fuels_Inc__Nuclear_Fuels_Acquires%C2%A0TenSleep_Uranium_Proje.jpg\" title=\"Nuclear Fuels logo (CNW Group/Nuclear Fuels Inc.)\"></img>\n                        </a>\n                </p>\n\n    </div>\n<p><span class=\"xn-person\">Greg Huffman</span>, Chief Executive Officer, stated: \"The TenSleep Uranium Project represents an exciting addition to Nuclear Fuels' portfolio given it is located less than 20 miles from our priority Kaycee Uranium Project in <span class=\"xn-location\">Wyoming</span>, and is known to host uranium mineralization based on historical production and exploration work.  The fact that uranium mineralization at TenSleep occurs in a geological setting similar to the very high grade unconformity-hosted uranium ore bodies in <span class=\"xn-location\">Saskatchewan's</span> <span class=\"xn-location\">Athabasca</span> Basin, yet has never been explored with this model in mind, presents an excellent opportunity for the discovery of an exciting new type of potentially In-Situ Recovery-amenable uranium in <span class=\"xn-location\">Wyoming</span>.\"  </p>\n<p>To view project maps, please visit: <a href=\"https://c212.net/c/link/?t=0&amp;l=en&amp;o=4373879-1&amp;h=3215577113&amp;u=https%3A%2F%2Furl.avanan.click%2Fv2%2F___https%3A%2Fbit.ly%2F4kczDnT___.YXAzOmVuY29yZWVuZXJneTphOm86ZjM0ZTc4MzMzZjIzMmM1Y2Q5YmZhMDdlN2RkYzI2Nzg6NjpjYmE5OjQyZTA3OThjZmNlNWViNjBiZjMwNjFmZGIyODRlNDdiODNjY2FmOWU4MGQ0OTZlMDEzMGQ4YTAyMDZjNDBlMGE6cDpUOk4&amp;a=https%3A%2F%2Fbit.ly%2F4kczDnT\" rel=\"nofollow\" target=\"_blank\">https://bit.ly/4kczDnT</a> .</p>\n<p>Specific Highlights Include:</p>\n<ul type=\"disc\"><li>The Jeri-Marie mine was an underground operation located on the TenSleep Project, extracting uranium ore via an adit in the late 1950s; </li><li>Outcropping uranium mineralization on the TenSleep Project is associated with the contact between basal sandstones of the TenSleep Formation and the younger overlying Phosphoria Formation, an organic rich marine unit containing siltstone, sandstone, limestone and dolomite enriched in a number of elements including uranium.  Similar \"unconformity\" geological contacts are important host environments for the high grade uranium ore bodies found in <span class=\"xn-location\">Saskatchewan's</span> <span class=\"xn-location\">Athabasca</span> Basin, commonly referred to as \"unconformity-type uranium deposits;\"</li><li>The TenSleep Formation is approximately 380 feet thick and composed of fine- to medium-grained sandstone.  Exploration drilling on the TenSleep Project in the early 1970s demonstrated that both the upper and lower contacts of the TenSleep Formation host uranium mineralization believed to be leached from the Phosphoria Formation above.  The high-grade unconformity-type uranium deposits of the <span class=\"xn-location\">Athabasca</span> Basin also occur at the lower contact of a thick sandstone sequence; </li><li>The majority of the historic drilling was shallow in nature to test only the upper zone of mineralization, only ten holes penetrating the entire TenSleep Formation.  Eight of the ten deeper holes were pervasively mineralized or anomalous at the lower contact (unconformity) of the TenSleep Formation;<sup>1</sup></li><li>The lower contact of the TenSleep Formation represents an exciting target for additional unconformity-style mineralization, an exploration concept which has not been previously targeted at the TenSleep Project;</li><li>In-Situ Recovery (\"ISR\") offers a minimally intrusive, eco-friendly, and economically competitive approach to mineral extraction replacing the need for conventional mining. </li></ul><p><b>The TenSleep Uranium Project </b></p>\n<p>The Company acquired the road-accessible TenSleep Uranium Project via the staking of 188 mineral claims and the granting of two state mineral leases, for a total area of approximately 3,000 acres.</p>\n<p>Uranium mineralization on the Project was originally discovered, explored and extracted on a small scale at the shallow underground Jeri-Marie mine by private operators in the late 1950s.  Aquarius Resources, Inc. conducted the first modern exploration drilling on the Project in 1971 and 1972 with their joint venture partner, Northwestern Energy Company, a subsidiary of Montana Power Company.  The historic drill program consisted of at least 111 drill holes, with 17 holes drilled for stratigraphic information and ten holes testing the entire approximately 380 foot thick TenSleep Formation.  This drill program identified two zones of uranium mineralization, one at the top of the TenSleep Formation along the unconformable contact (i.e. the boundary between rocks of different ages) with the younger Permian-aged Phosphoria Formation, and a second zone at the basal unconformable contact of the TenSleep Formation with the limestones of the Mississippian-aged Madison Limestone.  </p>\n<p>Following the recognition and development of the unconformity model of uranium deposition in the <span class=\"xn-location\">Athabasca</span> Basin later in the 1970s, Cherokee Exploration Inc. staked the TenSleep Project in 1978.   In early 1980 they acquired copies of the available data from the Aquarius drilling, including maps, cross sections, and logs for 96 holes, totaling 36,000 feet.  Based on this data, the Cherokee reports from the early 1980s were the first to recognize the potential for unconformity style uranium mineralization at the TenSleep Project and recommended an exploration program targeting this unconformity-hosted model.  However, these recommendations were never followed up on due to market conditions.  Nuclear Fuels is currently reviewing the historical data for the TenSleep Project to develop an exploration program that would include delineating the extent of the unconformity style uranium known to occur at both the top and bottom contacts of the TenSleep formation. Additional testing would include assessing the uranium mineralization for its amenability to In-Situ Recovery (\"ISR\"). </p>\n<p>The technical content of this news release has been reviewed and approved by <span class=\"xn-person\">Mark Travis</span>, CPG., a contractor to the Company, and a Qualified Person as defined in National Instrument 43-101.</p>\n<div><table border=\"0\" cellpadding=\"1\" cellspacing=\"0\" class=\"prnbcc\"><tr><td class=\"prngen2\" colspan=\"1\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\">____________________________</span></p>\n</td></tr><tr><td class=\"prngen2\" colspan=\"1\" rowspan=\"1\"><p class=\"prnml4\"><span class=\"prnews_span\"><sup>1</sup> Supplement to Growth Minerals Corp.'s Red Fork Prospect Report for Cherokee Exploration, Inc., October 1978</span></p>\n</td></tr></table></div><p><b><br></br>About Nuclear Fuels Inc.</b></p>\n<p>Nuclear Fuels Inc. is a uranium exploration company advancing early-stage, district-scale In-Situ Recovery (\"ISR\") amenable uranium projects towards production in <span class=\"xn-location\">the United States</span> of America.  Leveraging extensive proprietary historical databases and deep industry expertise, Nuclear Fuels is well-positioned in a sector poised for significant and sustained growth on the back of strong government support. Nuclear Fuels has consolidated the <span class=\"xn-location\">Kaycee</span> district under single-company control for the first time since the early 1980s. Currently planning its 2025 drill program following successful 2023 and 2024 drilling, the Company aims to expand on historic resources across a 35-mile trend with over 430 miles of mapped roll-fronts defined by 3,800 drill holes.  The Company's strategic relationship with enCore Energy Corp., America's Clean Energy Company™, offers a mutually beneficial \"pathway to production,\" with enCore owning an equity interest and retaining the right to back-in to 51% ownership in the flagship Kaycee Project in <span class=\"xn-location\">Wyoming's</span> prolific <span class=\"xn-location\">Powder River</span> Basin.</p>\n<p>W: <a href=\"https://c212.net/c/link/?t=0&amp;l=en&amp;o=4373879-1&amp;h=1093710662&amp;u=http%3A%2F%2Fwww.nfuranium.com%2F&amp;a=www.nfuranium.com\" rel=\"nofollow\" target=\"_blank\">www.nfuranium.com</a></p>\n<p><b><i>Forward-Looking Information<br></br></i></b><i>The Canadian Securities Exchange has not reviewed this press release and does not accept responsibility for the adequacy or accuracy of this news release.</i></p>\n<p><i>Certain information in this news release constitutes forward-looking statements under applicable securities laws. Any statements that are contained in this news release that are not statements of historical fact may be deemed to be forward-looking statements. Forward-looking statements are often identified by terms such as \"may\", \"should\", \"anticipate\", \"expect\", \"potential\", \"believe\", \"intend\" or the negative of these terms and similar expressions. Forward-looking statements in this news release include, but are not limited to, statements relating to planned exploration programs and the results of additional exploration work in seeking to establish mineral resources as defined in NI43-101 on any of our properties. Forward-looking statements necessarily involve known and unknown risks, including, without limitation, risks associated with the completing planned exploration programs and the results of those programs; the ability to access additional capital to fund planned and future operations; regulatory risks including exploration permitting; risks associated with title to our mineral projects; the ability of the company to implement its business strategies; and other risks including risks contained in documents available for review at <a href=\"http://www.sedar.com\" rel=\"nofollow\">www.sedar.com</a> under the Company's profile. Readers are cautioned not to place undue reliance on forward-looking statements as there can be no assurance that the plans, intentions or expectations upon which they are placed will occur. Such information, although considered reasonable by management at the time of preparation, may prove to be incorrect and actual results may differ materially from those anticipated. Forward-looking statements contained in this news release are expressly qualified by this cautionary statement.</i></p>\n\n\n\n\n\n\n<p id=\"PURL\"><img alt=\"Cision\" height=\"12\" src=\"https://c212.net/c/img/favicon.png?sn=TO31198&amp;sd=2025-03-03\" title=\"Cision\" width=\"12\"></img> View original content to download multimedia:<a href=\"https://www.prnewswire.com/news-releases/nuclear-fuels-acquires-tensleep-uranium-project-with-athabasca-basin-style-mineralization-in-wyomings-powder-river-basin-302389611.html\" id=\"PRNURL\" rel=\"nofollow\" target=\"_blank\">https://www.prnewswire.com/news-releases/nuclear-fuels-acquires-tensleep-uranium-project-with-athabasca-basin-style-mineralization-in-wyomings-powder-river-basin-302389611.html</a></p>\n<p>SOURCE  Nuclear Fuels Inc.</p>\n<img alt=\"\" src=\"https://rt.newswire.ca/rt.gif?NewsItemId=C4965&amp;Transmission_Id=202503030700CANADANWCANADAPR_C4965&amp;DateId=20250303\" style=\"border:0px; width:1px; height:1px;\"></img>\n\n",
    "search_terms": "TenSleep,Nuclear Fuels Inc.,NF",
    "master_gid": 9951,
    "date": "2025-03-03T12:00:00.000Z",
    "tags": "USA|Wyoming||Uranium|Project Acquisition",
    "image_id": null,
    "hidden": false,
    "company_id": 2582,
    "provider": "cision",
    "excerpt": "CSE:NFOTCQX:NFUNFVANCOUVER, BC,March 3, 2025/CNW/ -Nuclear Fuels Inc.(CSE: NF) (OTCQX: NFUNF)(\"Nuclear Fuels\" or the \"Company\")announced today the acquisition of the TenSleep Uranium Project, located approximately 10 miles (16 kilometers) west of the town ofKaycee, inJohnson County, Wyoming.  The TenSleep Project is a unique uranium project inWyoming, displaying geological characteristics similar to",
    "is_regulatory": false,
    "refined_tags": null,
    "ftp_filename": null,
    "company_name": "Nuclear Fuels Inc.",
    "exchange": "CSE",
    "root_ticker": "NF",
    "project_name": "TenSleep",
    "gid": 9951,
    "location": "Wyoming, United States",
    "plan_id": null,
    "description_text": "CSE:NF OTCQX:NFUNF VANCOUVER, BC , March 3, 2025 /CNW/ - Nuclear Fuels Inc. (CSE: NF) (OTCQX: NFUNF) (\"Nuclear Fuels\" or the \"Company\") announced today the acquisition of the TenSleep Uranium Project, located approximately 10 miles (16 kilometers) west of the town of Kaycee , in Johnson County , Wyoming.  The TenSleep Project is a unique uranium project in Wyoming , displaying geological characteristics similar to the deposits in Saskatchewan's prolific Athabasca Basin rather than the typical roll front sandstone-hosted uranium deposits of the United States. Athabasca or \"unconformity\" uranium deposits occur along the contact of two different rock types in the vicinity of one or more high-angle faults providing the pathway for the mineralizing fluids to deposit uranium along the contact. These deposits are typically larger and higher grade than roll-front types. The Company is currently developing an exploration program with drilling planned for late 2025 or early 2026. Greg Huffman , Chief Executive Officer, stated: \"The TenSleep Uranium Project represents an exciting addition to Nuclear Fuels' portfolio given it is located less than 20 miles from our priority Kaycee Uranium Project in Wyoming , and is known to host uranium mineralization based on historical production and exploration work.  The fact that uranium mineralization at TenSleep occurs in a geological setting similar to the very high grade unconformity-hosted uranium ore bodies in Saskatchewan's Athabasca Basin, yet has never been explored with this model in mind, presents an excellent opportunity for the discovery of an exciting new type of potentially In-Situ Recovery-amenable uranium in Wyoming .\" To view project maps, please visit: https://bit.ly/4kczDnT . Specific Highlights Include: The Jeri-Marie mine was an underground operation located on the TenSleep Project, extracting uranium ore via an adit in the late 1950s; Outcropping uranium mineralization on the TenSleep Project is associated with the contact between basal sandstones of the TenSleep Formation and the younger overlying Phosphoria Formation, an organic rich marine unit containing siltstone, sandstone, limestone and dolomite enriched in a number of elements including uranium.  Similar \"unconformity\" geological contacts are important host environments for the high grade uranium ore bodies found in Saskatchewan's Athabasca Basin, commonly referred to as \"unconformity-type uranium deposits;\" The TenSleep Formation is approximately 380 feet thick and composed of fine- to medium-grained sandstone.  Exploration drilling on the TenSleep Project in the early 1970s demonstrated that both the upper and lower contacts of the TenSleep Formation host uranium mineralization believed to be leached from the Phosphoria Formation above.  The high-grade unconformity-type uranium deposits of the Athabasca Basin also occur at the lower contact of a thick sandstone sequence; The majority of the historic drilling was shallow in nature to test only the upper zone of mineralization, only ten holes penetrating the entire TenSleep Formation.  Eight of the ten deeper holes were pervasively mineralized or anomalous at the lower contact (unconformity) of the TenSleep Formation; 1 The lower contact of the TenSleep Formation represents an exciting target for additional unconformity-style mineralization, an exploration concept which has not been previously targeted at the TenSleep Project; In-Situ Recovery (\"ISR\") offers a minimally intrusive, eco-friendly, and economically competitive approach to mineral extraction replacing the need for conventional mining. The TenSleep Uranium Project The Company acquired the road-accessible TenSleep Uranium Project via the staking of 188 mineral claims and the granting of two state mineral leases, for a total area of approximately 3,000 acres. Uranium mineralization on the Project was originally discovered, explored and extracted on a small scale at the shallow underground Jeri-Marie mine by private operators in the late 1950s.  Aquarius Resources, Inc. conducted the first modern exploration drilling on the Project in 1971 and 1972 with their joint venture partner, Northwestern Energy Company, a subsidiary of Montana Power Company.  The historic drill program consisted of at least 111 drill holes, with 17 holes drilled for stratigraphic information and ten holes testing the entire approximately 380 foot thick TenSleep Formation.  This drill program identified two zones of uranium mineralization, one at the top of the TenSleep Formation along the unconformable contact (i.e. the boundary between rocks of different ages) with the younger Permian-aged Phosphoria Formation, and a second zone at the basal unconformable contact of the TenSleep Formation with the limestones of the Mississippian-aged Madison Limestone. Following the recognition and development of the unconformity model of uranium deposition in the Athabasca Basin later in the 1970s, Cherokee Exploration Inc. staked the TenSleep Project in 1978.   In early 1980 they acquired copies of the available data from the Aquarius drilling, including maps, cross sections, and logs for 96 holes, totaling 36,000 feet.  Based on this data, the Cherokee reports from the early 1980s were the first to recognize the potential for unconformity style uranium mineralization at the TenSleep Project and recommended an exploration program targeting this unconformity-hosted model.  However, these recommendations were never followed up on due to market conditions.  Nuclear Fuels is currently reviewing the historical data for the TenSleep Project to develop an exploration program that would include delineating the extent of the unconformity style uranium known to occur at both the top and bottom contacts of the TenSleep formation. Additional testing would include assessing the uranium mineralization for its amenability to In-Situ Recovery (\"ISR\"). The technical content of this news release has been reviewed and approved by Mark Travis , CPG., a contractor to the Company, and a Qualified Person as defined in National Instrument 43-101. ____________________________ 1 Supplement to Growth Minerals Corp.'s Red Fork Prospect Report for Cherokee Exploration, Inc., October 1978 About Nuclear Fuels Inc. Nuclear Fuels Inc. is a uranium exploration company advancing early-stage, district-scale In-Situ Recovery (\"ISR\") amenable uranium projects towards production in the United States of America.  Leveraging extensive proprietary historical databases and deep industry expertise, Nuclear Fuels is well-positioned in a sector poised for significant and sustained growth on the back of strong government support. Nuclear Fuels has consolidated the Kaycee district under single-company control for the first time since the early 1980s. Currently planning its 2025 drill program following successful 2023 and 2024 drilling, the Company aims to expand on historic resources across a 35-mile trend with over 430 miles of mapped roll-fronts defined by 3,800 drill holes.  The Company's strategic relationship with enCore Energy Corp., America's Clean Energy Company™, offers a mutually beneficial \"pathway to production,\" with enCore owning an equity interest and retaining the right to back-in to 51% ownership in the flagship Kaycee Project in Wyoming's prolific Powder River Basin. W: www.nfuranium.com Forward-Looking Information The Canadian Securities Exchange has not reviewed this press release and does not accept responsibility for the adequacy or accuracy of this news release. Certain information in this news release constitutes forward-looking statements under applicable securities laws. Any statements that are contained in this news release that are not statements of historical fact may be deemed to be forward-looking statements. Forward-looking statements are often identified by terms such as \"may\", \"should\", \"anticipate\", \"expect\", \"potential\", \"believe\", \"intend\" or the negative of these terms and similar expressions. Forward-looking statements in this news release include, but are not limited to, statements relating to planned exploration programs and the results of additional exploration work in seeking to establish mineral resources as defined in NI43-101 on any of our properties. Forward-looking statements necessarily involve known and unknown risks, including, without limitation, risks associated with the completing planned exploration programs and the results of those programs; the ability to access additional capital to fund planned and future operations; regulatory risks including exploration permitting; risks associated with title to our mineral projects; the ability of the company to implement its business strategies; and other risks including risks contained in documents available for review at www.sedar.com under the Company's profile. Readers are cautioned not to place undue reliance on forward-looking statements as there can be no assurance that the plans, intentions or expectations upon which they are placed will occur. Such information, although considered reasonable by management at the time of preparation, may prove to be incorrect and actual results may differ materially from those anticipated. Forward-looking statements contained in this news release are expressly qualified by this cautionary statement. View original content to download multimedia: https://www.prnewswire.com/news-releases/nuclear-fuels-acquires-tensleep-uranium-project-with-athabasca-basin-style-mineralization-in-wyomings-powder-river-basin-302389611.html SOURCE  Nuclear Fuels Inc.",
    "primary_commodity": "U"
  },
  "articleProject": {
    "gid": 9951,
    "project_name": "TenSleep",
    "location": "Wyoming, United States"
  },
  "articleExchange": "CSE",
  "articleCompanyId": 2582,
  "articleTicker": "NF",
  "articleCompanyName": "Nuclear Fuels Inc.",
  "allOtherCompanyProjects": [
    {
      "company_id": 2582,
      "gid": 9951,
      "project_name": "TenSleep",
      "location": "Wyoming, United States"
    },
    {
      "company_id": 2582,
      "gid": 6317,
      "project_name": "Lisbon Valley",
      "location": "Utah, United States"
    },
    {
      "company_id": 2582,
      "gid": 5509,
      "project_name": "Bootheel",
      "location": "Wyoming, United States"
    },
    {
      "company_id": 2582,
      "gid": 5686,
      "project_name": "Bobcat",
      "location": "Wyoming, United States"
    },
    {
      "company_id": 2582,
      "gid": 5506,
      "project_name": "Kaycee",
      "location": "Wyoming, United States"
    },
    {
      "company_id": 2582,
      "gid": 5507,
      "project_name": "Moonshine",
      "location": "Arizona, United States"
    },
    {
      "company_id": 2582,
      "gid": 5508,
      "project_name": "LAB",
      "location": "Newfoundland and Labrador, Canada"
    }
  ],
  "allOtherCompanyNews": [
    {
      "id": 107640,
      "company_id": 2582,
      "title": "Nuclear Fuels Commences 2025 Kaycee Uranium Project Drill Program",
      "link": "https://contentapi.cision.com/api/v1.0/releases/20250611C2680",
      "date": "2025-06-11T11:00:00.000Z",
      "hidden": false
    },
    {
      "id": 107061,
      "company_id": 2582,
      "title": "Premier American Uranium to Acquire Nuclear Fuels, Creating One of America's Largest Pure-Play Uranium Explorers",
      "link": null,
      "date": "2025-06-05T11:00:00.000Z",
      "hidden": false
    },
    {
      "id": 91926,
      "company_id": 2582,
      "title": "Nuclear Fuels Mourns the Passing of Independent Director Eugene Spiering",
      "link": "https://contentapi.cision.com/api/v1.0/releases/20250320C9059",
      "date": "2025-03-20T11:00:00.000Z",
      "hidden": false
    },
    {
      "id": 90128,
      "company_id": 2582,
      "title": "Nuclear Fuels Acquires TenSleep Uranium Project with Athabasca Basin-Style Mineralization in Wyoming's Powder River Basin",
      "link": "https://contentapi.cision.com/api/v1.0/releases/20250303C4965",
      "date": "2025-03-03T12:00:00.000Z",
      "hidden": false
    },
    {
      "id": 85637,
      "company_id": 2582,
      "title": "Nuclear Fuels Announces the Discovery of New Mineralized Zones at the Kaycee Uranium Project",
      "link": "https://contentapi.cision.com/api/v1.0/releases/20250129VA06855",
      "date": "2025-01-29T12:00:00.000Z",
      "hidden": false
    },
    {
      "id": 79461,
      "company_id": 2582,
      "title": "NUCLEAR FUELS ANNOUNCES COMPLETION OF $13.9 MILLION BOUGHT DEAL OFFERING AND NON-BROKERED PRIVATE PLACEMENT WITH ENCORE ENERGY CORP AND STRATEGIC INVESTORS",
      "link": "https://contentapi.cision.com/api/v1.0/releases/20241120C5319",
      "date": "2024-11-20T13:49:00.000Z",
      "hidden": false
    },
    {
      "id": 103054,
      "company_id": 2582,
      "title": "Nuclear Fuels Inc. to Attend the 50th Annual New Orleans Investment Conference",
      "link": "https://app.quotemedia.com/data/downloadFiling?webmasterId=104408&ref=673cde727e8ceb72807b1f21&type=PDFC&formType=002-002-001089-003001&formDescription=News+release&dateFiled=2024-11-19",
      "date": "2024-11-19T10:52:34.000Z",
      "hidden": false
    },
    {
      "id": 77757,
      "company_id": 2582,
      "title": "NUCLEAR FUELS ANNOUNCES ADDITIONAL NON-BROKERED PRIVATE PLACEMENT WITH ENCORE ENERGY CORP AND STRATEGIC INVESTORS",
      "link": "https://contentapi.cision.com/api/v1.0/releases/20241105C9500",
      "date": "2024-11-05T12:00:00.000Z",
      "hidden": false
    },
    {
      "id": -151110,
      "company_id": 2582,
      "title": "Canadian Investment Regulatory Organization Trading Halt - NF",
      "link": "https://contentapi.cision.com/api/v1.0/releases/20241030C7158",
      "date": "2024-10-30T20:20:00.000Z",
      "hidden": false
    },
    {
      "id": -151109,
      "company_id": 2582,
      "title": "Canadian Investment Regulatory Organization Trade Resumption - NF",
      "link": "https://contentapi.cision.com/api/v1.0/releases/20241030C8120",
      "date": "2024-10-30T20:20:00.000Z",
      "hidden": false
    }
  ]
}
