{
  "article": {
    "id": 89277,
    "link": "https://www.thenewswire.com/press-releases?id=1Be9F1VgW",
    "title": "URZ3 Energy Stakes Mineral Claims In Powder River Basin, Wyoming",
    "description": "<table style='width:fit-content; border: none;'><tr style='background: none;'><td colspan='10' style='padding: 0; margin: 0; border: none; background: none;' valign='bottom'><a target='_blank' href='urz3.com'><img src=\"https://www.thenewswire.com/data/tnw/clients/logos/1Bb4FdRQ0.png?t=1727130733\" alt=\"URZ3 Energy Corp.\" /></a></td></tr><tr style='background: none;'><td style='padding: 0; margin: 0; border: none; background: none;'></td></tr></table>\n\n\n\n\n\n\n\n\n<p style='text-align:left; '>\n<span style='font-weight:bold; '>Vancouver, BC – February 26, 2025</span> – URZ<span style=''>3</span> Energy Corp. (&quot;URZ3&quot; or the “Company”) (TSXV: URZ; OTCQB: URZEF) is pleased to announce that it has staked mineral claims in the uranium rich Powder River Basin in Wyoming. The claims, which cover approximately 890 acres, are situated in the well established in-situ recovery (ISR) uranium district west of the Christensen Ranch (Uranium Energy Corp.) and Nichols Ranch (Energy Fuels Inc.) ISR mines. The claims comprise the Company’s Dry Fork Project and are believed to host favorable geological structures suggesting prospectivity for uranium exploration.\n</p>\n\n\n\n<p style='text-align:left; '>\nThe Powder River Basin has long been recognized as one of North America’s key ISR uranium districts, and URZ<span style=''>3</span>'s latest staking represents a significant step in the Company’s strategy to expand its uranium portfolio. The proximity to the proven Christensen Ranch and Nichols Ranch ISR mines further reinforces the potential of the area and the exploration upside of the Dry Fork Project.\n</p>\n\n\n\n<p style='text-align:left; '>\nMark Kolebaba, President and CEO, commented, “This new project allows URZ<span style=''>3</span> Energy Corp. to leverage its experienced team and proven exploration expertise to try to replicate the success many of the Company’s founders and principals (those formerly with Uranerz Energy Corp.) achieved at the Nichols Ranch project prior to Uranerz being acquired in 2015 by Energy Fuels. The favorable geological setting of this newly staked project, combined with the district’s reputation for high-quality ISR uranium resources, provides an exciting opportunity to build another successful uranium project.”\n</p>\n\n\n\n<p style='text-align:left; '>\nThe Powder River Basin’s extensive uranium mineralization, combined with the growing demand for clean energy, presents a compelling opportunity for investors interested in North American, and specifically United States, uranium resource exploration and development. URZ<span style='font-weight:bold; '>3</span> Energy Corp. is formulating plans to advance its uranium exploration activities.\n</p>\n\n\n\n<p style='text-align:left; '>\nThe claims were staked and filed with the Bureau of Land Management (“BLM”) in October and November, 2024, respectively and are subject to final adjudication by the BLM.\n</p>\n\n\n\n<p style='text-align:left; '>\n<span style='font-weight:bold; '>About URZ</span><span style='font-weight:bold; '><span style=''>3</span></span><span style='font-weight:bold; '> Energy Corp.</span>\n</p>\n\n\n\n<p style='text-align:left; '>\nURZ<span style=''>3</span> Energy Corp. is a resource development company focused on the acquisition and exploration of uranium properties in North America. The company is dedicated to advancing its portfolio of projects to meet the growing demand for uranium as a clean energy resource, leveraging its team’s extensive experience in ISR uranium exploration, development, and production.\n</p>\n\n\n\n<p style='text-align:justify; '>\n<span style=''>For more information about URZ</span><span style=''>3</span><span style=''> Energy Corp., please visit </span><a href='http://www.urz3.com' target='_blank'><span style=''><span style=''>www.urz3.com</span></span></a><span style=''>.</span>\n</p>\n\n\n\n<p style='text-align:left; '>\n<span style='font-weight:bold; '>Contact:</span><span style=''><br />\n</span><span style='font-weight:bold; '>Mark Kolebaba, President and CEO</span>\n</p>\n\n\n\n<p style='text-align:left; '>\n<span style=''>Telephone: (604) 307-6450<br />\nEmail: </span><a href='mailto:info@URZ3.com' target='_blank'><span style=''><span style=''>info@URZ3.com</span></span></a>\n</p>\n\n \n\n<p style='text-align:left; '>\n<span style='font-style:italic; font-weight:bold; '>Forward-Looking Statements</span>\n</p>\n\n\n\n<p style='text-align:left; '>\n<span style='font-style:italic; '>This news release contains forward-looking statements that are based on management’s expectations, estimates, and projections as of the date of this release. These statements are not guarantees of future performance and involve a number of risks and uncertainties. Actual results could differ materially from those anticipated in these forward-looking statements.</span> \n</p>\n\n\n\n<p style='text-align:left; '>\n<span style=''>Neither the TSX Venture Exchange nor its Regulation Services Provider (as that term is defined in the policies of the TSX Venture Exchange) accepts responsibility for the adequacy or accuracy of this release.</span>\n</p>\n\n    \n\n<p>Copyright (c) 2025 TheNewswire - All rights reserved.</p>\n",
    "search_terms": "Dry Fork,URZ3 Energy Corp.,URZ",
    "master_gid": 9905,
    "date": "2025-02-26T12:30:00.000Z",
    "tags": "USA|Wyoming||Uranium|Project Acquisition",
    "image_id": null,
    "hidden": false,
    "company_id": 96,
    "provider": "thenewswire",
    "excerpt": "Vancouver, BC – February 26, 2025– URZ3Energy Corp. (&quot;URZ3&quot; or the “Company”) (TSXV: URZ; OTCQB: URZEF) is pleased to announce that it has staked mineral claims in the uranium rich Powder River Basin in Wyoming. The claims, which cover approximately 890 acres, are situated in the well established in-situ recovery",
    "is_regulatory": false,
    "refined_tags": null,
    "ftp_filename": null,
    "company_name": "URZ3 Energy Corp.",
    "exchange": "TSXV",
    "root_ticker": "URZ",
    "project_name": "Dry Fork",
    "gid": 9905,
    "location": "Wyoming, United States",
    "plan_id": null,
    "description_text": "Vancouver, BC – February 26, 2025 – URZ 3 Energy Corp. (\"URZ3\" or the “Company”) (TSXV: URZ; OTCQB: URZEF) is pleased to announce that it has staked mineral claims in the uranium rich Powder River Basin in Wyoming. The claims, which cover approximately 890 acres, are situated in the well established in-situ recovery (ISR) uranium district west of the Christensen Ranch (Uranium Energy Corp.) and Nichols Ranch (Energy Fuels Inc.) ISR mines. The claims comprise the Company’s Dry Fork Project and are believed to host favorable geological structures suggesting prospectivity for uranium exploration. The Powder River Basin has long been recognized as one of North America’s key ISR uranium districts, and URZ 3 's latest staking represents a significant step in the Company’s strategy to expand its uranium portfolio. The proximity to the proven Christensen Ranch and Nichols Ranch ISR mines further reinforces the potential of the area and the exploration upside of the Dry Fork Project. Mark Kolebaba, President and CEO, commented, “This new project allows URZ 3 Energy Corp. to leverage its experienced team and proven exploration expertise to try to replicate the success many of the Company’s founders and principals (those formerly with Uranerz Energy Corp.) achieved at the Nichols Ranch project prior to Uranerz being acquired in 2015 by Energy Fuels. The favorable geological setting of this newly staked project, combined with the district’s reputation for high-quality ISR uranium resources, provides an exciting opportunity to build another successful uranium project.” The Powder River Basin’s extensive uranium mineralization, combined with the growing demand for clean energy, presents a compelling opportunity for investors interested in North American, and specifically United States, uranium resource exploration and development. URZ 3 Energy Corp. is formulating plans to advance its uranium exploration activities. The claims were staked and filed with the Bureau of Land Management (“BLM”) in October and November, 2024, respectively and are subject to final adjudication by the BLM. About URZ 3 Energy Corp. URZ 3 Energy Corp. is a resource development company focused on the acquisition and exploration of uranium properties in North America. The company is dedicated to advancing its portfolio of projects to meet the growing demand for uranium as a clean energy resource, leveraging its team’s extensive experience in ISR uranium exploration, development, and production. For more information about URZ 3 Energy Corp., please visit www.urz3.com . Contact: Mark Kolebaba, President and CEO Telephone: (604) 307-6450 Email: info@URZ3.com Forward-Looking Statements This news release contains forward-looking statements that are based on management’s expectations, estimates, and projections as of the date of this release. These statements are not guarantees of future performance and involve a number of risks and uncertainties. Actual results could differ materially from those anticipated in these forward-looking statements. Neither the TSX Venture Exchange nor its Regulation Services Provider (as that term is defined in the policies of the TSX Venture Exchange) accepts responsibility for the adequacy or accuracy of this release. Copyright (c) 2025 TheNewswire - All rights reserved.",
    "primary_commodity": "U"
  },
  "articleProject": {
    "gid": 9905,
    "project_name": "Dry Fork",
    "location": "Wyoming, United States"
  },
  "articleExchange": "TSXV",
  "articleCompanyId": 96,
  "articleTicker": "URZ",
  "articleCompanyName": "URZ3 Energy Corp.",
  "allOtherCompanyProjects": [
    {
      "company_id": 96,
      "gid": 927,
      "project_name": "South Grass Valley",
      "location": "Nevada, USA"
    },
    {
      "company_id": 96,
      "gid": 9905,
      "project_name": "Dry Fork",
      "location": "Wyoming, United States"
    },
    {
      "company_id": 96,
      "gid": 924,
      "project_name": "Grass Valley",
      "location": "Nevada, USA"
    },
    {
      "company_id": 96,
      "gid": 798,
      "project_name": "Awakening",
      "location": "Nevada, USA"
    },
    {
      "company_id": 96,
      "gid": 10378,
      "project_name": "Athabasca Basin",
      "location": "Saskatchewan, Canada"
    },
    {
      "company_id": 96,
      "gid": 797,
      "project_name": "Bottle Creek",
      "location": "Nevada, USA"
    },
    {
      "company_id": 96,
      "gid": 831,
      "project_name": "Kelly Creek",
      "location": "Nevada, USA"
    }
  ],
  "allOtherCompanyNews": [
    {
      "id": 106771,
      "company_id": 96,
      "title": "URZ3 Energy Corp. Closes $1,100,000 Financing",
      "link": "https://www.thenewswire.com/press-releases?id=1AXXFYr2d",
      "date": "2025-06-03T11:30:00.000Z",
      "hidden": false
    },
    {
      "id": 103832,
      "company_id": 96,
      "title": "URZ3 Energy Welcomes Mr. Paul Goranson to the Board of Directors and Announces Private Placement",
      "link": "https://www.thenewswire.com/press-releases?id=1k98FXG3g",
      "date": "2025-05-07T11:30:00.000Z",
      "hidden": false
    },
    {
      "id": 89277,
      "company_id": 96,
      "title": "URZ3 Energy Stakes Mineral Claims In Powder River Basin, Wyoming",
      "link": "https://www.thenewswire.com/press-releases?id=1Be9F1VgW",
      "date": "2025-02-26T12:30:00.000Z",
      "hidden": false
    },
    {
      "id": -163485,
      "company_id": 96,
      "title": "URZ3 Energy Corp. Changes OTC Ticker Symbol",
      "link": "https://www.thenewswire.com/press-releases?id=1BOxFM89Q",
      "date": "2025-01-07T12:30:00.000Z",
      "hidden": false
    },
    {
      "id": 82052,
      "company_id": 96,
      "title": "URZ3 Energy Corp. Engages Alphai News Corp. for Digital Media and Capital Markets Communications",
      "link": "https://www.thenewswire.com/press-releases?id=1AlpFVdO0",
      "date": "2024-12-16T12:00:00.000Z",
      "hidden": false
    },
    {
      "id": 76785,
      "company_id": 96,
      "title": "URZ3 Energy Corp Closes Oversubscribed Private Placement Financing",
      "link": "https://www.thenewswire.com/press-releases?id=1AlpFyKDy",
      "date": "2024-10-30T11:00:00.000Z",
      "hidden": false
    },
    {
      "id": 75867,
      "company_id": 96,
      "title": "URZ3 Energy Corp Closes First Tranche of Private Placement Financing",
      "link": "https://www.thenewswire.com/press-releases?id=1AqRFngzq",
      "date": "2024-10-24T11:00:00.000Z",
      "hidden": false
    },
    {
      "id": 74487,
      "company_id": 96,
      "title": "URZ3 Energy Corp. Upsizes Financing",
      "link": "https://www.thenewswire.com/press-releases?id=1A8vFeYj8",
      "date": "2024-10-10T21:40:00.000Z",
      "hidden": false
    },
    {
      "id": 72655,
      "company_id": 96,
      "title": "URZ3 Energy Corp Initiates Private Placement Financing",
      "link": "https://www.globenewswire.com/news-release/2024/09/26/2953666/0/en/URZ3-Energy-Corp-Initiates-Private-Placement-Financing.html",
      "date": "2024-09-26T11:00:00.000Z",
      "hidden": false
    },
    {
      "id": -142445,
      "company_id": 96,
      "title": "URZ3 Energy Announces Passing of Director Benjamin D. Leboe",
      "link": "https://www.globenewswire.com/news-release/2024/09/23/2951798/0/en/URZ3-Energy-Announces-Passing-of-Director-Benjamin-D-Leboe.html",
      "date": "2024-09-23T22:42:00.000Z",
      "hidden": false
    }
  ]
}
