{
  "article": {
    "id": 52393,
    "link": "https://www.newsfilecorp.com/release/206089/Myriad-Announces-Acquisition-of-Historic-Bonanza-and-KermacDay-Uranium-Mines-at-Copper-Mountain",
    "title": "Myriad Announces Acquisition of Historic Bonanza and Kermac/Day Uranium Mines at Copper Mountain",
    "description": "<img src=\"https://api.newsfilecorp.com/newsinfo/206089/367\" id=\"367\" width=\"2\" height=\"2\" style=\"width: 1px;  height: 1px;border: 0px solid;\" /><p>Vancouver, British Columbia--(Newsfile Corp. - April 19, 2024) - <b>Myriad Uranium Corp.&#160;</b>(CSE: M) (OTCQB: MYRUF) (FSE: C3Q)&#160;(\"<b>Myriad</b>\" or the \"<b>Company</b>\") is pleased to announce that its earn-in partner Rush Rare Metals Corp. (\"Rush\"), again guided by proprietary data, has acquired the historic Bonanza and Kermac/Day uranium mines at Copper Mountain (See Figure 1 below). Various proprietary documents in Myriad's possession indicate that the Bonanza Mine produced around 780,000 lbs from 30,000 tons of ore at a grade of 1.3% eU<sub>3</sub>O<sub>8</sub>, while at the Day Mine, 1,152 tons of ore were mined at grades of between 0.12% and 0.56% eU<sub>3</sub>O<sub>8</sub> in the early 1960's (see Figure 2 below).</p><p>\"Bonanza-Kermac\" aggregates 280 acres, and its acquisition increases the area subject to Myriad's 75% earnable interest under the property option agreement between Myriad and Rush from 3,605 acres to 3,886 acres.</p><p style=\"text-align: center;\"><a rel=\"nofollow\" href=\"https://images.newsfilecorp.com/files/6301/206089_47decf06b46b3b87_002full.jpg\"><img src=\"https://images.newsfilecorp.com/files/6301/206089_47decf06b46b3b87_002.jpg\" style=\"border-width: 0px;\" alt=\"Cannot view this image? Visit: https://images.newsfilecorp.com/files/6301/206089_47decf06b46b3b87_002.jpg\" /></a><br /><br />Figure 1: Current Copper Mountain Project Area including Bonanza-Kermac<br /><br />To view an enhanced version of this graphic, please visit:<br /><a rel=\"nofollow\" href=\"https://images.newsfilecorp.com/files/6301/206089_47decf06b46b3b87_002full.jpg\">https://images.newsfilecorp.com/files/6301/206089_47decf06b46b3b87_002full.jpg</a></p><p>Myriad's CEO Thomas Lamb commented, \"We continue to add highly prospective acreage at Copper Mountain.\"</p><p>Production during the late 1950's and 1960's from the Bonanza Mine Area came from siltstones of the Wind River Formation overlying the pre-Cambrian basement granitic rocks. Mineralization in these areas formed by basinward migration of uranium in channel sediments with precipitation occurring at roll-front boundaries or fault/hydrocarbon redox areas. The deposit lies downstream of the old Little Mo (Arrowhead) Mine which was the first area of production (around 500,000 lbs U<sub>3</sub>O<sub>8</sub>) before final shutdown in 1971 (Figure 2). </p><p style=\"text-align: center;\"><a rel=\"nofollow\" href=\"https://images.newsfilecorp.com/files/6301/206089_47decf06b46b3b87_003full.jpg\"><img src=\"https://images.newsfilecorp.com/files/6301/206089_47decf06b46b3b87_003.jpg\" style=\"border-width: 0px;\" alt=\"Cannot view this image? Visit: https://images.newsfilecorp.com/files/6301/206089_47decf06b46b3b87_003.jpg\" /></a><br /><br />Figure 2: Extracts from 1975 and 1968 charts of Copper Mountain<br />indicating the Bonanza Mine's estimated uranium endowment and grade.<br /><br />To view an enhanced version of this graphic, please visit:<br /><a rel=\"nofollow\" href=\"https://images.newsfilecorp.com/files/6301/206089_47decf06b46b3b87_003full.jpg\">https://images.newsfilecorp.com/files/6301/206089_47decf06b46b3b87_003full.jpg</a></p><p>Mineralization in the Kermac/Day Mine Area follows a similar configuration and was investigated by RME as a site for potential shallow uranium mineralization in the late 1970's. Previous production was from Tertiary bentonitic clay sediments overlying the basement granite.</p><p>A qualified person (as defined under NI 43-101) has not done sufficient work to classify the historical target estimates reported in this news release as current mineral resources or mineral reserves, and Myriad is not treating the historical target estimates as current mineral resources or mineral reserves. In particular, the Company considers that insufficient work has been done to estimate a resource at the Bonanza-Kermac property and the potential cannot be relied upon until further work is done.</p><p><b>Qualified Person</b></p><p>The scientific or technical information in this news release respecting the Company's Copper Mountain Project has been approved by George van der Walt, MSc., Pr.Sci.Nat., MGSSA, a Qualified Person as defined in National Instrument 43-101&#160;&#8211;&#160;<i>Standards of Disclosure for Mineral Projects</i>. It is based on the Qualified Person's initial review of historical reports which were recently obtained by the Company. The Qualified Person considers the information to be relevant based on the amount and quality of work undertaken and reported historically. However, the information did not include original data such as drilling records, sampling, analytical or test data underlying the information or opinions contained in the written documents. Therefore, the Qualified Person has not reviewed or otherwise verified the information and has not done sufficient work to classify the historical estimates as current mineral resources or mineral reserves. A more thorough review of any available original data will be undertaken and reported on in more detail in future releases.</p><p><b>About Myriad Uranium Corp.</b></p><p>Myriad Uranium Corp. is a uranium exploration company with an earnable 75% interest in the Copper Mountain Uranium Project in Wyoming, USA. Copper Mountain hosts several known uranium deposits and historic uranium mines, including the Arrowhead Mine which produced 500,000 lbs of eU<sub>3</sub>O<sub>8</sub>. Copper Mountain saw extensive drilling and development by Union Pacific, which developed a mine plan and built a leach pad for one of the deposits at Copper Mountain. Operations ceased in 1980 before mining could commence due to falling uranium prices. Approximately 2,000 boreholes have been drilled at Copper Mountain and the project area has significant exploration upside. Union Pacific is estimated to have spent C$117 million (2023 dollars) exploring and developing Copper Mountain, generating significant historical resource estimates which are detailed&#160;<a href=\"https://api.newsfilecorp.com/redirect/V7kKPf2mrw\">here</a>.</p><p>Myriad also holds 80% ownership of over 1,800 km<sup>2 </sup>of uranium exploration licenses in the Tim Mersoi&#776; Basin, Niger, with the option to earn up to 100%. These licenses are surrounded by many of the most significant uranium deposits in Africa, including Orano's 384 Mlbs eU<sub>3</sub>O<sub>8</sub> Imouraren, Global Atomic's 236 Mlbs Dasa, and Goviex's 100 Mlbs Madaouela, and on the same fault structures. Myriad also has a 50% interest in the Millen Mountain Property in Nova Scotia, Canada, with the other 50% held by Probe Metals Inc. For further information, please refer to Myriad's disclosure record on SEDAR+ (<a href=\"https://api.newsfilecorp.com/redirect/zEkZOCxzNN\">www.sedarplus.ca</a>), contact Myriad by telephone at +1.604.418.2877, or refer to Myriad's website at<a href=\"https://api.newsfilecorp.com/redirect/4QgZpinOme\"> www.myriaduranium.com</a>.</p><p>Recent interviews with Crux Investor and VSA are <a href=\"https://api.newsfilecorp.com/redirect/NBzLQFy02j\">here</a> and <a href=\"https://api.newsfilecorp.com/redirect/X35KghgE2j\">here</a>. A video overview of the Copper Mountain Project is <a href=\"https://api.newsfilecorp.com/redirect/DZ84XFb5KL\">here</a>.</p><p><b>Myriad Contacts:<br /></b>Thomas Lamb<br />President and CEO<br /><a href=\"mailto:tlamb@myriaduranium.com\">tlamb@myriaduranium.com</a></p><p><i><b>Forward-Looking Statements</b></i></p><p><i>Mineralization hosted on adjacent or nearby properties is not necessarily indicative of mineralization hosted on the Company's properties. This news release contains \"forward-looking information\" that is based on the Company's current expectations, estimates, forecasts and projections. This forward-looking information includes, among other things, the Company's business, plans, outlook and business strategy. The words \"may\", \"would\", \"could\", \"should\", \"will\", \"likely\", \"expect,\" \"anticipate,\" \"intend\", \"estimate\", \"plan\", \"forecast\", \"project\" and \"believe\" or other similar words and phrases are intended to identify forward-looking information. The reader is cautioned that assumptions used in the preparation of any forward-looking information may prove to be incorrect, including with respect to the Company's business plans respecting the exploration and development of the Company's mineral properties, the proposed work program on the Company's mineral properties and the potential and economic viability of the Company's mineral properties. Forward-looking information is subject to known and unknown risks, uncertainties and other factors that may cause the Company's actual results, level of activity, performance or achievements to be materially different from those expressed or implied by such forward-looking information. Such factors include, but are not limited to: changes in economic conditions or financial markets; increases in costs; litigation; legislative, environmental and other judicial, regulatory, political and competitive developments; and technological or operational difficulties. This list is not exhaustive of the factors that may affect our forward-looking information. These and other factors should be considered carefully, and readers should not place undue reliance on such forward-looking information. The Company does not intend, and expressly disclaims any intention or obligation to, update or revise any forward-looking information whether as a result of new information, future events or otherwise, except as required by applicable law.</i></p><p><i>The CSE has not reviewed, approved or disapproved the contents of this news release.</i></p><p id=\"corporateNewsLogoContainer\"><img src=\"https://images.newsfilecorp.com/files/6301/206089_47decf06b46b3b87_logo.jpg\" id=\"corporateNewsLogo\" alt=\"Corporate Logo\" /></p><p id=\"corporateLinkBack\">To view the source version of this press release, please visit <a href=\"https://api.newsfilecorp.com/redirect/rvzwGsXZ1R\">https://www.newsfilecorp.com/release/206089</a></p>",
    "search_terms": "Bonanza-Kermac,Myriad Uranium Corp.,M",
    "master_gid": 6775,
    "date": "2024-04-19T11:30:00.000Z",
    "tags": "|||Copper,Uranium|Project Acquisition",
    "image_id": null,
    "hidden": false,
    "company_id": 1558,
    "provider": null,
    "excerpt": "Vancouver, British Columbia--(Newsfile Corp. - April 19, 2024) -Myriad Uranium Corp.&#160;(CSE: M) (OTCQB: MYRUF) (FSE: C3Q)&#160;(\"Myriad\" or the \"Company\") is pleased to announce that its earn-in partner Rush Rare Metals Corp. (\"Rush\"), again guided by proprietary data, has acquired the historic Bonanza and Kermac/Day uranium mines at Copper Mountain (See",
    "is_regulatory": false,
    "refined_tags": [
      "Project Acquisition"
    ],
    "ftp_filename": null,
    "company_name": "Myriad Uranium Corp.",
    "exchange": "CSE",
    "root_ticker": "M",
    "project_name": "Bonanza-Kermac",
    "gid": 6775,
    "location": "Wyoming, United States",
    "plan_id": null,
    "description_text": "Vancouver, British Columbia--(Newsfile Corp. - April 19, 2024) - Myriad Uranium Corp. (CSE: M) (OTCQB: MYRUF) (FSE: C3Q) (\" Myriad \" or the \" Company \") is pleased to announce that its earn-in partner Rush Rare Metals Corp. (\"Rush\"), again guided by proprietary data, has acquired the historic Bonanza and Kermac/Day uranium mines at Copper Mountain (See Figure 1 below). Various proprietary documents in Myriad's possession indicate that the Bonanza Mine produced around 780,000 lbs from 30,000 tons of ore at a grade of 1.3% eU 3 O 8 , while at the Day Mine, 1,152 tons of ore were mined at grades of between 0.12% and 0.56% eU 3 O 8 in the early 1960's (see Figure 2 below). \"Bonanza-Kermac\" aggregates 280 acres, and its acquisition increases the area subject to Myriad's 75% earnable interest under the property option agreement between Myriad and Rush from 3,605 acres to 3,886 acres. Figure 1: Current Copper Mountain Project Area including Bonanza-Kermac To view an enhanced version of this graphic, please visit: https://images.newsfilecorp.com/files/6301/206089_47decf06b46b3b87_002full.jpg Myriad's CEO Thomas Lamb commented, \"We continue to add highly prospective acreage at Copper Mountain.\" Production during the late 1950's and 1960's from the Bonanza Mine Area came from siltstones of the Wind River Formation overlying the pre-Cambrian basement granitic rocks. Mineralization in these areas formed by basinward migration of uranium in channel sediments with precipitation occurring at roll-front boundaries or fault/hydrocarbon redox areas. The deposit lies downstream of the old Little Mo (Arrowhead) Mine which was the first area of production (around 500,000 lbs U 3 O 8 ) before final shutdown in 1971 (Figure 2). Figure 2: Extracts from 1975 and 1968 charts of Copper Mountain indicating the Bonanza Mine's estimated uranium endowment and grade. To view an enhanced version of this graphic, please visit: https://images.newsfilecorp.com/files/6301/206089_47decf06b46b3b87_003full.jpg Mineralization in the Kermac/Day Mine Area follows a similar configuration and was investigated by RME as a site for potential shallow uranium mineralization in the late 1970's. Previous production was from Tertiary bentonitic clay sediments overlying the basement granite. A qualified person (as defined under NI 43-101) has not done sufficient work to classify the historical target estimates reported in this news release as current mineral resources or mineral reserves, and Myriad is not treating the historical target estimates as current mineral resources or mineral reserves. In particular, the Company considers that insufficient work has been done to estimate a resource at the Bonanza-Kermac property and the potential cannot be relied upon until further work is done. Qualified Person The scientific or technical information in this news release respecting the Company's Copper Mountain Project has been approved by George van der Walt, MSc., Pr.Sci.Nat., MGSSA, a Qualified Person as defined in National Instrument 43-101 – Standards of Disclosure for Mineral Projects . It is based on the Qualified Person's initial review of historical reports which were recently obtained by the Company. The Qualified Person considers the information to be relevant based on the amount and quality of work undertaken and reported historically. However, the information did not include original data such as drilling records, sampling, analytical or test data underlying the information or opinions contained in the written documents. Therefore, the Qualified Person has not reviewed or otherwise verified the information and has not done sufficient work to classify the historical estimates as current mineral resources or mineral reserves. A more thorough review of any available original data will be undertaken and reported on in more detail in future releases. About Myriad Uranium Corp. Myriad Uranium Corp. is a uranium exploration company with an earnable 75% interest in the Copper Mountain Uranium Project in Wyoming, USA. Copper Mountain hosts several known uranium deposits and historic uranium mines, including the Arrowhead Mine which produced 500,000 lbs of eU 3 O 8 . Copper Mountain saw extensive drilling and development by Union Pacific, which developed a mine plan and built a leach pad for one of the deposits at Copper Mountain. Operations ceased in 1980 before mining could commence due to falling uranium prices. Approximately 2,000 boreholes have been drilled at Copper Mountain and the project area has significant exploration upside. Union Pacific is estimated to have spent C$117 million (2023 dollars) exploring and developing Copper Mountain, generating significant historical resource estimates which are detailed here . Myriad also holds 80% ownership of over 1,800 km 2 of uranium exploration licenses in the Tim Mersoï Basin, Niger, with the option to earn up to 100%. These licenses are surrounded by many of the most significant uranium deposits in Africa, including Orano's 384 Mlbs eU 3 O 8 Imouraren, Global Atomic's 236 Mlbs Dasa, and Goviex's 100 Mlbs Madaouela, and on the same fault structures. Myriad also has a 50% interest in the Millen Mountain Property in Nova Scotia, Canada, with the other 50% held by Probe Metals Inc. For further information, please refer to Myriad's disclosure record on SEDAR+ ( www.sedarplus.ca ), contact Myriad by telephone at +1.604.418.2877, or refer to Myriad's website at www.myriaduranium.com . Recent interviews with Crux Investor and VSA are here and here . A video overview of the Copper Mountain Project is here . Myriad Contacts: Thomas Lamb President and CEO tlamb@myriaduranium.com Forward-Looking Statements Mineralization hosted on adjacent or nearby properties is not necessarily indicative of mineralization hosted on the Company's properties. This news release contains \"forward-looking information\" that is based on the Company's current expectations, estimates, forecasts and projections. This forward-looking information includes, among other things, the Company's business, plans, outlook and business strategy. The words \"may\", \"would\", \"could\", \"should\", \"will\", \"likely\", \"expect,\" \"anticipate,\" \"intend\", \"estimate\", \"plan\", \"forecast\", \"project\" and \"believe\" or other similar words and phrases are intended to identify forward-looking information. The reader is cautioned that assumptions used in the preparation of any forward-looking information may prove to be incorrect, including with respect to the Company's business plans respecting the exploration and development of the Company's mineral properties, the proposed work program on the Company's mineral properties and the potential and economic viability of the Company's mineral properties. Forward-looking information is subject to known and unknown risks, uncertainties and other factors that may cause the Company's actual results, level of activity, performance or achievements to be materially different from those expressed or implied by such forward-looking information. Such factors include, but are not limited to: changes in economic conditions or financial markets; increases in costs; litigation; legislative, environmental and other judicial, regulatory, political and competitive developments; and technological or operational difficulties. This list is not exhaustive of the factors that may affect our forward-looking information. These and other factors should be considered carefully, and readers should not place undue reliance on such forward-looking information. The Company does not intend, and expressly disclaims any intention or obligation to, update or revise any forward-looking information whether as a result of new information, future events or otherwise, except as required by applicable law. The CSE has not reviewed, approved or disapproved the contents of this news release. To view the source version of this press release, please visit https://www.newsfilecorp.com/release/206089",
    "primary_commodity": "U"
  },
  "articleProject": {
    "gid": 6775,
    "project_name": "Bonanza-Kermac",
    "location": "Wyoming, United States"
  },
  "articleExchange": "CSE",
  "articleCompanyId": 1558,
  "articleTicker": "M",
  "articleCompanyName": "Myriad Uranium Corp.",
  "allOtherCompanyProjects": [
    {
      "company_id": 1558,
      "gid": 4762,
      "project_name": "Afouday",
      "location": "Niger"
    },
    {
      "company_id": 1558,
      "gid": 4764,
      "project_name": "Tagait 3",
      "location": "Niger"
    },
    {
      "company_id": 1558,
      "gid": 6029,
      "project_name": "Millen Mountain",
      "location": "Nova Scotia, Canada"
    },
    {
      "company_id": 1558,
      "gid": 4761,
      "project_name": "Agebout",
      "location": "Niger"
    },
    {
      "company_id": 1558,
      "gid": 4763,
      "project_name": "Tagait 2",
      "location": "Niger"
    },
    {
      "company_id": 1558,
      "gid": 6775,
      "project_name": "Bonanza-Kermac",
      "location": "Wyoming, United States"
    },
    {
      "company_id": 1558,
      "gid": 6421,
      "project_name": "Knob Claims",
      "location": "Wyoming, United States"
    }
  ],
  "allOtherCompanyNews": [
    {
      "id": 107877,
      "company_id": 1558,
      "title": "Myriad Uranium Announces Private Placement",
      "link": null,
      "date": "2025-06-12T21:25:00.000Z",
      "hidden": false
    },
    {
      "id": 107652,
      "company_id": 1558,
      "title": "Myriad Uranium Reports Final Chemical Assays from Copper Mountain. Grades Up to 60% Higher Than Probe Equivalents, with Positive Implications for Scale and Scope of the Project. Plan of Operations Application Submitted to Drill High Priority Prospects",
      "link": null,
      "date": "2025-06-11T11:30:00.000Z",
      "hidden": false
    },
    {
      "id": 105552,
      "company_id": 1558,
      "title": "Myriad Uranium Corp. Announces Extension of Warrants",
      "link": null,
      "date": "2025-05-22T20:44:00.000Z",
      "hidden": false
    },
    {
      "id": 103827,
      "company_id": 1558,
      "title": "Myriad Uranium Expands its New Mexico Land Position, Now Controls Significant High Grade Historical Resources and Vast Majority of Historical Boreholes at Red Basin",
      "link": null,
      "date": "2025-05-07T11:30:00.000Z",
      "hidden": false
    },
    {
      "id": 102155,
      "company_id": 1558,
      "title": "Myriad Uranium Reports Chemical Assays from Eight More Boreholes at Copper Mountain. Assays Continue to Be up to 50% Higher than Probe Grades Previously Reported.",
      "link": null,
      "date": "2025-04-29T11:30:00.000Z",
      "hidden": false
    },
    {
      "id": 98301,
      "company_id": 1558,
      "title": "Myriad Uranium Appoints Eduards Smirnovs as Industry Advisor",
      "link": null,
      "date": "2025-04-01T11:30:00.000Z",
      "hidden": false
    },
    {
      "id": 91528,
      "company_id": 1558,
      "title": "Myriad Uranium Reports Chemical Assays on 20 Copper Mountain Boreholes. Confirmed U3O8 Grades Are 20% Higher on Average than Previously Reported Gamma Grades. Assays also Reveal the Presence of Extensive Uranium Mineralisation That Could Not Be Detected by the Probe, with Potential Positive Implications for Historical Estimates. Large Number of Additional Intervals to Be Sent for Assay",
      "link": null,
      "date": "2025-03-17T11:30:00.000Z",
      "hidden": false
    },
    {
      "id": 87551,
      "company_id": 1558,
      "title": "Myriad Uranium Issues Shares under Option to Acquire 100% of the Red Basin Uranium Project in New Mexico, USA",
      "link": "https://www.newsfilecorp.com/release/240503/Myriad-Uranium-Issues-Shares-under-Option-to-Acquire-100-of-the-Red-Basin-Uranium-Project-in-New-Mexico-USA",
      "date": "2025-02-12T00:21:00.000Z",
      "hidden": false
    },
    {
      "id": 86759,
      "company_id": 1558,
      "title": "Myriad Uranium Enters into Option to Acquire 100% of the Red Basin Uranium Project in New Mexico, USA",
      "link": "https://www.newsfilecorp.com/release/239518/Myriad-Uranium-Enters-into-Option-to-Acquire-100-of-the-Red-Basin-Uranium-Project-in-New-Mexico-USA",
      "date": "2025-02-04T12:30:00.000Z",
      "hidden": false
    },
    {
      "id": 85660,
      "company_id": 1558,
      "title": "Myriad Uranium Grants Stock Options and RSUs",
      "link": "https://www.newsfilecorp.com/release/238802/Myriad-Uranium-Grants-Stock-Options-and-RSUs",
      "date": "2025-01-29T12:30:00.000Z",
      "hidden": false
    }
  ]
}
