{
  "article": {
    "id": 63242,
    "link": "https://www.accesswire.com/viewarticle.aspx?id=880546&lang=en",
    "title": "Green Bridge Metals Acquires Option on World Class Copper-Nickel Exploration Portfolio in Duluth Complex Minnesota",
    "description": "<p><strong id=\"dateline\">VANCOUVER, BC / ACCESSWIRE / June 24, 2024 / </strong><strong>Green Bridge Metals Corporation </strong>(CNSX:<strong>GRBM</strong>)(OTCQB:<strong>GBMCF</strong>)(FRA:<strong>J48</strong>)(WKN:<strong>A3EW4S</strong>) (&quot;<strong>Green Bridge</strong>&quot; or the &quot;<strong>Company</strong>&quot;) is pleased to announce, further to its news releases dated February 6, 2024 and May 13, 2024, that it has acquired an option (the &quot;<strong>Option</strong>&quot;) to earn an 80% interest in the 8,460-hectare (84.6 square kilometre (km)) South Contact Zone Project, targeting copper (Cu), nickel (Ni)-platinum group element (PGE) mineralization pursuant to a definitive agreement with Encampment Minerals Inc.</p><p>David Suda, President and Chief Executive Officer of Green Bridge, commented &quot;Thanks to the strong support of existing and new shareholders, Green Bridge has been able to fund exploration work to commence imminently in Minnesota. The June 19th, 2024 closing of a private placement satisfies the final condition of closing on the option agreement. We are thrilled to partner with EMI and thankful to their teams for giving Green Bridge the opportunity to explore a first class package of properties in the highly prolific Duluth Mineral Complex. The Duluth Complex in Northern Minnesota is one of the largest undeveloped mineral deposits in the world richly endowed with copper, nickel and other metals.<sup>1</sup> We very much look forward to announcing our exploration plans highlighting the quality of the targets and strategic mission for the next 12 months.&quot;</p><p>The material terms of the Option, as well as a description of the South Contact Zone Project are contained in the Company's news release dated February 6, 2024.</p><p><strong>About Green Bridge Metals</strong></p><p>Green Bridge Metals Corporation (formerly Mich Resources Ltd.) is a Canadian based exploration company focused on acquiring ‘battery metal' rich mineral assets and the development of the South Contact Zone (the &quot;Property&quot;) along the basal contact of the Duluth Intrusion, north of Duluth, Minnesota. The South Contact Zone contains bulk-tonnage copper-nickel and titanium-vanadium in ilmenite hosted in ultramafic to oxide ultramafic intrusions. The Property has exploration targets for bulk-tonnage Ni mineralization, high grade Ni-Cu-PGE magmatic sulfide mineralization and titanium.</p><p><strong>ON BEHALF OF GREEN BRIDGE METALS,</strong></p><p>&quot;David Suda&quot;<br />President and Chief Executive Officer</p><p>For more information, please contact:</p><p>David Suda</p><p>President and Chief Executive Officer</p><p>Tel: 604.928-3101<br /><a rel=\"nofollow\" href=\"mailto:investors@greenbridgemetals.com\">investors@greenbridgemetals.com</a></p><p><i>Neither the Canadian Securities Exchange (the &quot;CSE&quot;) nor its Regulation Services Provider (as that term is defined in the policies of the CSE) accepts responsibility for the adequacy or accuracy of this release.</i></p><p><strong>Forward Looking Information</strong></p><p>Certain statements and information herein, including all statements that are not historical facts, contain forward-looking statements and forward-looking information within the meaning of applicable securities laws. Such forward-looking statements or information include but are not limited to statements or information with respect to: the exploration and development of the South Contact Zone Properties, exploration plans highlighting the quality of the targets and strategic mission for the next 12 months, and the Option to acquire up to 80% interest in the South Contact Zone Project.</p><p>Although management of the Company believe that the assumptions made and the expectations represented by such statements or information are reasonable, there can be no assurance that forward-looking statements or information herein will prove to be accurate. Forward-looking statements and information by their nature are based on assumptions and involve known and unknown risks, uncertainties and other factors which may cause actual results, performance or achievements, or industry results, to be materially different from any future results, performance or achievements expressed or implied by such forward-looking statements or information. These risk factors include, but are not limited to: the exploration and development of the South Contact Zone Properties may not result in any commercially successful outcome for the Company; the conditions to acquire up to 80% interest in the South Contact Zone Project may not be met as currently contemplated, or at all; risks associated with the business of the Company; business and economic conditions in the mining industry generally; changes in general economic conditions or conditions in the financial markets; changes in laws (including regulations respecting mining concessions); and other risk factors as detailed from time to time.</p><p>The Company does not undertake to update any forward-looking information, except in accordance with applicable securities laws.<br />_________________________<br /><sup>1</sup><a rel=\"nofollow\" href=\"https://pr.report/azz\">https://me.smenet.org/webContent.cfm?webarticleid=3518</a></p><p><strong>SOURCE:</strong> Green Bridge Metals Corporation</p><br><br>View the original <a href='https://www.accesswire.com/880546/green-bridge-metals-acquires-option-on-world-class-copper-nickel-exploration-portfolio-in-duluth-complex-minnesota'>press release</a> on accesswire.com<br><br><br><br>View the original <a href='https://www.accesswire.com/880546/green-bridge-metals-acquires-option-on-world-class-copper-nickel-exploration-portfolio-in-duluth-complex-minnesota'>press release</a> on accesswire.com<br><br>",
    "search_terms": "South Contact Zone,Green Bridge Metals Corporation,GRBM",
    "master_gid": 6333,
    "date": "2024-06-24T11:30:00.000Z",
    "tags": "|||Copper,Nickel|Project Acquisition",
    "image_id": null,
    "hidden": false,
    "company_id": 3540,
    "provider": "accesswire",
    "excerpt": "VANCOUVER, BC / ACCESSWIRE / June 24, 2024 /Green Bridge Metals Corporation(CNSX:GRBM)(OTCQB:GBMCF)(FRA:J48)(WKN:A3EW4S) (&quot;Green Bridge&quot; or the &quot;Company&quot;) is pleased to announce, further to its news releases dated February 6, 2024 and May 13, 2024, that it has acquired an option (the &quot;Option&quot;) to earn an 80% interest in the 8,460-hectare",
    "is_regulatory": false,
    "refined_tags": [
      "Project Acquisition"
    ],
    "ftp_filename": null,
    "company_name": "Green Bridge Metals Corporation",
    "exchange": "CSE",
    "root_ticker": "GRBM",
    "project_name": "South Contact Zone",
    "gid": 6333,
    "location": "Minnesota, United States",
    "plan_id": null,
    "description_text": "VANCOUVER, BC / ACCESSWIRE / June 24, 2024 / Green Bridge Metals Corporation (CNSX: GRBM )(OTCQB: GBMCF )(FRA: J48 )(WKN: A3EW4S ) (\" Green Bridge \" or the \" Company \") is pleased to announce, further to its news releases dated February 6, 2024 and May 13, 2024, that it has acquired an option (the \" Option \") to earn an 80% interest in the 8,460-hectare (84.6 square kilometre (km)) South Contact Zone Project, targeting copper (Cu), nickel (Ni)-platinum group element (PGE) mineralization pursuant to a definitive agreement with Encampment Minerals Inc. David Suda, President and Chief Executive Officer of Green Bridge, commented \"Thanks to the strong support of existing and new shareholders, Green Bridge has been able to fund exploration work to commence imminently in Minnesota. The June 19th, 2024 closing of a private placement satisfies the final condition of closing on the option agreement. We are thrilled to partner with EMI and thankful to their teams for giving Green Bridge the opportunity to explore a first class package of properties in the highly prolific Duluth Mineral Complex. The Duluth Complex in Northern Minnesota is one of the largest undeveloped mineral deposits in the world richly endowed with copper, nickel and other metals. 1 We very much look forward to announcing our exploration plans highlighting the quality of the targets and strategic mission for the next 12 months.\" The material terms of the Option, as well as a description of the South Contact Zone Project are contained in the Company's news release dated February 6, 2024. About Green Bridge Metals Green Bridge Metals Corporation (formerly Mich Resources Ltd.) is a Canadian based exploration company focused on acquiring ‘battery metal' rich mineral assets and the development of the South Contact Zone (the \"Property\") along the basal contact of the Duluth Intrusion, north of Duluth, Minnesota. The South Contact Zone contains bulk-tonnage copper-nickel and titanium-vanadium in ilmenite hosted in ultramafic to oxide ultramafic intrusions. The Property has exploration targets for bulk-tonnage Ni mineralization, high grade Ni-Cu-PGE magmatic sulfide mineralization and titanium. ON BEHALF OF GREEN BRIDGE METALS, \"David Suda\" President and Chief Executive Officer For more information, please contact: David Suda President and Chief Executive Officer Tel: 604.928-3101 investors@greenbridgemetals.com Neither the Canadian Securities Exchange (the \"CSE\") nor its Regulation Services Provider (as that term is defined in the policies of the CSE) accepts responsibility for the adequacy or accuracy of this release. Forward Looking Information Certain statements and information herein, including all statements that are not historical facts, contain forward-looking statements and forward-looking information within the meaning of applicable securities laws. Such forward-looking statements or information include but are not limited to statements or information with respect to: the exploration and development of the South Contact Zone Properties, exploration plans highlighting the quality of the targets and strategic mission for the next 12 months, and the Option to acquire up to 80% interest in the South Contact Zone Project. Although management of the Company believe that the assumptions made and the expectations represented by such statements or information are reasonable, there can be no assurance that forward-looking statements or information herein will prove to be accurate. Forward-looking statements and information by their nature are based on assumptions and involve known and unknown risks, uncertainties and other factors which may cause actual results, performance or achievements, or industry results, to be materially different from any future results, performance or achievements expressed or implied by such forward-looking statements or information. These risk factors include, but are not limited to: the exploration and development of the South Contact Zone Properties may not result in any commercially successful outcome for the Company; the conditions to acquire up to 80% interest in the South Contact Zone Project may not be met as currently contemplated, or at all; risks associated with the business of the Company; business and economic conditions in the mining industry generally; changes in general economic conditions or conditions in the financial markets; changes in laws (including regulations respecting mining concessions); and other risk factors as detailed from time to time. The Company does not undertake to update any forward-looking information, except in accordance with applicable securities laws. _________________________ 1 https://me.smenet.org/webContent.cfm?webarticleid=3518 SOURCE: Green Bridge Metals Corporation View the original press release on accesswire.com View the original press release on accesswire.com",
    "primary_commodity": "Cu"
  },
  "articleProject": {
    "gid": 6333,
    "project_name": "South Contact Zone",
    "location": "Minnesota, United States"
  },
  "articleExchange": "CSE",
  "articleCompanyId": 3540,
  "articleTicker": "GRBM",
  "articleCompanyName": "Green Bridge Metals Corporation",
  "allOtherCompanyProjects": [
    {
      "company_id": 3540,
      "gid": 6938,
      "project_name": "Chrome-Puddy",
      "location": "Ontario, Canada"
    },
    {
      "company_id": 3540,
      "gid": 5295,
      "project_name": "Chrome-Puddy",
      "location": "Ontario, Canada"
    },
    {
      "company_id": 3540,
      "gid": 6333,
      "project_name": "South Contact Zone",
      "location": "Minnesota, United States"
    }
  ],
  "allOtherCompanyNews": [
    {
      "id": 104092,
      "company_id": 3540,
      "title": "Green Bridge Metals Enters LOI to Option Large Bulk Tonnage Copper-Nickel-PGE Serpentine Project, Duluth Complex, Minnesota, USA",
      "link": null,
      "date": "2025-05-08T21:45:00.000Z",
      "hidden": false
    },
    {
      "id": 103721,
      "company_id": 3540,
      "title": "Green Bridge Metals Highlights VTEM Survey Results Identifying New Drill Targets at South Contact Zone, Minnesota",
      "link": null,
      "date": "2025-05-06T21:30:00.000Z",
      "hidden": false
    },
    {
      "id": 90369,
      "company_id": 3540,
      "title": "Green Bridge Metals Announces Closing of Second and Final Tranche of Non-Brokered Private Placement",
      "link": "https://www.thenewswire.com/press-releases?id=1LmPFd9Jy",
      "date": "2025-03-07T22:00:00.000Z",
      "hidden": false
    },
    {
      "id": 88735,
      "company_id": 3540,
      "title": "Green Bridge Metals Highlights Milestones of 2024 and Provides 2025 Outlook for South Contact Zone and Chrome-Puddy Projects ",
      "link": "https://www.accessnewswire.com/newsroom/en/metals-and-mining/green-bridge-metals-highlights-milestones-of-2024-and-provides-2025-outlook-for-so-988903",
      "date": "2025-02-21T08:01:00.000Z",
      "hidden": false
    },
    {
      "id": 86866,
      "company_id": 3540,
      "title": "Green Bridge Metals Announces Closing of First Tranche of Non-Brokered Private Placement",
      "link": "https://www.accessnewswire.com/newsroom/en/metals-and-mining/green-bridge-metals-announces-closing-of-first-tranche-of-non-brokered-private-pla-979687",
      "date": "2025-02-04T22:00:00.000Z",
      "hidden": false
    },
    {
      "id": 85034,
      "company_id": 3540,
      "title": "Green Bridge Metals Announces Non-Brokered Private Placement",
      "link": "https://www.thenewswire.com/press-releases?id=1LymFe1jx",
      "date": "2025-01-22T23:00:00.000Z",
      "hidden": false
    },
    {
      "id": 79398,
      "company_id": 3540,
      "title": "Green Bridge Metals Announces Appointment of Dr. George Hudak as Technical Advisor",
      "link": "https://www.thenewswire.com/press-releases?id=1LaPFv7y5",
      "date": "2024-11-20T08:05:00.000Z",
      "hidden": false
    },
    {
      "id": 79120,
      "company_id": 3540,
      "title": "Green Bridge Metals Corporation Appoints Robert G. Krause to Board of Directors",
      "link": "https://www.thenewswire.com/press-releases?id=1kogFvEVG",
      "date": "2024-11-18T13:30:00.000Z",
      "hidden": false
    },
    {
      "id": -153585,
      "company_id": 3540,
      "title": "Green Bridge Metals Corporation Announces Establishment of Minnesota Headquarters",
      "link": "https://www.thenewswire.com/press-releases?id=1BR1FNWaJ",
      "date": "2024-11-12T08:05:00.000Z",
      "hidden": false
    },
    {
      "id": -152566,
      "company_id": 3540,
      "title": "Green Bridge Metals Announces Change of CFO and Corporate Secretary ",
      "link": "https://www.thenewswire.com/press-releases?id=1BQPFdVdM",
      "date": "2024-11-05T22:00:00.000Z",
      "hidden": false
    }
  ]
}
