{
  "article": {
    "id": 41762,
    "link": "https://www.newsfilecorp.com/release/182583/M3-Metals-Provides-an-Update-and-Property-Disclosure-for-the-Daggett-Lithium-Project-near-Barstow-California",
    "title": "M3 Metals Provides an Update and Property Disclosure for the Daggett Lithium Project, near Barstow, California",
    "description": "<img src=\"https://api.newsfilecorp.com/newsinfo/182583/367\" id=\"367\" width=\"2\" height=\"2\" style=\"width: 1px;  height: 1px;border: 0px solid;\" /><p>Vancouver, British Columbia--(Newsfile Corp. - October 2, 2023) - <b>M3 Metals Corp. (TSXV: MT) (FSE: XOV) (\"M3 Metals\" or the \"Company\").  </b>On May 9, 2023, the Company announced that it had entered into a mineral property option agreement (the \"Agreement\") to acquire up to an eighty (80%) percent interest in the Daggett Lithium Project (the \"Property\"), a mineral property prospective for lithium and located in San Bernardino County, California.</p><p>The Agreement, dated effective May 8, 2023, is between the Company and IMEx Consultants Inc. (the \"Vendor\").  The Agreement provides that the Company can earn a sixty (60%) percent interest in the Property by: (i) issuing 2,000,000 shares to the Vendor and paying to the Vendor the sum of USD$150,000 upon regulatory approval of the Agreement; and (ii) making USD$400,000 in exploration expenditures on the Property within twelve (12) months of regulatory approval of the Agreement.  The Company can acquire an additional twenty (20%) percent interest, for a total eighty (80%) interest in the Property by issuing an additional 2,000,000 shares to the Vendor and making an additional USD$2,000,000 in exploration expenditures on the Daggett Lithium Property within thirty-six (36) months of regulatory approval of the Agreement.</p><p>The Agreement is subject to the regulatory approval of the TSX Venture Exchange (the \"Exchange\").  Because the transaction can result in the creation of a new control person, IMEx Consultants Inc., approval of the Agreement is further subject to the written consent of shareholders holding over 50% of the current issued and outstanding shares of the Company. The transactions contemplated in the Agreement constitute a Fundamental Acquisition (as that term is defined in the policies of the Exchange) and, as such, require completion of a technical report on the Property prior to receipt of regulatory approval.  The technical report has been submitted for review by the Exchange and the Company hopes to move forward with the Fundamental Acquisition shortly.   Trading in the shares of the Company is expected to resume between October 4-6, 2023.  </p><p>No finder's fees are payable in connection with the Agreement and the Agreement is an arm's length transaction.   There are no royalties or underlying option or other agreements related to the Property. </p><p style=\"text-align: center;\"><b>ABOUT THE DAGGETT LITHIUM PROJECT</b></p><p>The Property is comprised of 96 staked BLM and San Bernardino County registered lode mining claims (the \"Lakshmi Claims\") covering 2,641 acres (761 hectares). The Lakshmi Claims encompass a 9km strike length of exposed Barstow Formation clay-rich sediments containing anomalous levels of lithium.</p><p>The Barstow area, located in the central Mojave Desert hosts numerous historic and current mines and exploration projects. To the east of the Daggett Lithium Project, the now-inactive Hector Borate Mine was most recently operated by N.L. Industries Corp. ) (\"N.L.\"). N.L. and its predecessors produced hectorite, a lithium-magnesium smectite clay for use in specialty applications. Currently, adjacent to that site, 5E Advanced Materials, Inc. is finalizing permitting while commissioning a new borate solution mining and refining operation.</p><p>Borates play a big part in the history of mining in the Barstow region, with commercial borate mining and refining operations dating from the 1880's in the nearby Calico Mountains, and even a small borate mining operation within the Lakshmi claims group. The Calico borate mines were active until the 1920's, at which time the Pacific Coast Borax Company commenced operations at their giant sodium borate deposit at Boron, California. Another active project in the area includes the Waterloo Mine Silver Project, currently operated by Apollo Silver Corp.</p><p>With its close association with borate mineralization and proximity to the Hector Mine, the Daggett Project is similar in occurrence to projects in advanced development in a similar geologic and tectonic setting in Nevada. The Project is well located in regard to infrastructure being within a very short distance from major highway, rail and energy corridors. It is also lies in close proximity to the town of Barstow, CA with available accommodations and labor.</p><p>IMEx Consultants Inc. (\"IMEx\"), the vendor of the Daggett Lithium Project, first sampled the project area in March of 2022. Based on past experience in the area exploring for borate minerals, IMEx was aware that the fine-grained sediments of the area contain anomalous levels of both boron and lithium.  IMEx prospected the favorable sediments using a SciApps hand-help spectrometer (LIBS) to detect lithium contents of as much as 1,995ppmLi. Duplicate samples were submitted to the SGS laboratory in Lima, Peru and confirmed anomalous Li levels.</p><p style=\"text-align: center;\"><a rel=\"nofollow\" href=\"https://images.newsfilecorp.com/files/5509/182583_5e571b32241b9a7e_001full.jpg\"><img src=\"https://images.newsfilecorp.com/files/5509/182583_5e571b32241b9a7e_001.jpg\" style=\"border-width: 0px;\" alt=\"Cannot view this image? Visit: https://images.newsfilecorp.com/files/5509/182583_5e571b32241b9a7e_001.jpg\" /></a></p><p style=\"text-align: center;\"><u><i>Figure 1: Map showing the location of the Daggett Lithium project \"Lakshmi\" claims in relation to the city of Barstow, with nearby intersecting rail, highway, power and gas corridors.</i></u><br /><br />To view an enhanced version of this graphic, please visit:<br /><a rel=\"nofollow\" href=\"https://images.newsfilecorp.com/files/5509/182583_5e571b32241b9a7e_001full.jpg\">https://images.newsfilecorp.com/files/5509/182583_5e571b32241b9a7e_001full.jpg</a></p><p>M3M contemplates two phases (Phase I and Phase II) of exploration work, environmental baseline studies and a permitting program at a cost of US$350,000 for Phase I and US$600,000 for Phase II to bring the Daggett Project to the drilling stage, as outlined in the table, below and with Phase II being contingent on results obtained in Phase I:  </p><p style=\"text-align: center;\"><i>Table 1: Daggett Lithium project Phase I budget and schedule.</i></p><table cellspacing=\"0\" cellpadding=\"0\" style=\"text-align: start; width: 100%; border-collapse: collapse;\" border=\"0\"><tbody><tr><td style=\"width: 40%; border-top: 1px solid #000000; border-bottom: 1px solid #000000; border-left: 1px solid #000000;\"><u>Activity</u></td><td style=\"width: 20%; vertical-align: middle; border-top: 1px solid #000000; border-bottom: 1px solid #000000;\"><u>Budget (US$)</u></td><td style=\"width: 20%; vertical-align: middle; border-top: 1px solid #000000; border-bottom: 1px solid #000000; border-right: 1px solid #000000;\"><u>Schedule</u></td></tr><tr><td style=\"width: 40%;\"><u>Phase I: </u><br /><u>Mapping</u><br /><u>Sampling</u></td><td style=\"width: 20%;\"><u>350,000 (total)</u><br /><u>40,000</u><br /><u>60,000</u></td><td style=\"width: 20%; vertical-align: middle;\"><u>Oct. 23 - May 24</u><br /><u>Oct. 23 - May 24</u><br /><u>Jan. 24 - May 24</u></td></tr><tr><td style=\"width: 40%;\"><u>Geophysics (ERT/TEM)</u><br /><u>G&#38;A / Other Costs</u><br /><u>Phase II</u><br /><u>Baseline Studies</u><br /><u>Bureau of Land Management (EA)</u><br /><u>NEPA Review Work</u><br /><u>US Legal (Environmental / BLM / NEPA)</u><br /><u>G&#38;A / Other Costs</u></td><td style=\"width: 20%;\"><u>150,000</u><br /><u>100,000</u><br /><u>600,000 (total)</u><br /><u>150,000</u><br /><u>150,000</u><br /><u>100,000</u><br /><u>50,000</u><br /><u>150,000</u></td><td style=\"width: 20%; vertical-align: middle;\"><u>Apr. 24 - May 24</u><br /><u>Oct. 23 - May 24</u><br /><u>May 24 - May 25</u><br /><u>May 24 - Apr. 25</u><br /><u>Sept. 24 - Apr. 25</u><br /><u>July 24 - May 25</u><br /><u>May 24 - May 25</u><br /><u>May 24 - May 25</u></td></tr></tbody></table><p>&#160;</p><p>M3M anticipates filing on SEDAR a technical report (the \"Report\") titled \"Daggett Lithium Project\", authored by Mr. Jerry L. Aiken, BSc., Professional Geologist (WA) and SME Registered Member which has been prepared for M3 Metals Corp. dated effective September, 2023.  The Report will contain additional details and disclosure concerning the Daggett Lithium Project. </p><p>UPDATE ON DISPOSITION OF GREAT TEXAS SPRING PROPERTY CLAIMS</p><p>In its news releases of July 26, 2023 and September 21, 2023 (the \"News Releases\"), the Company announced that it had entered into a mineral property option and joint venture agreement (the \"Agreement\") with Surge Battery Metals Inc. (\"Surge\"), a TSX Venture Exchange listed company and described an amendment to the Agreement.  The Agreement, as amended, grants Surge the option (the \"Option\") to earn up to an eighty (80%) percent interest in and to certain recently staked claims in Nevada (the \"Great Texas Spring Property Claims\") on the terms and conditions described in the News Releases. </p><p>The Company has applied for TSX Venture Exchange approval of the disposition (the \"Disposition\") of the Great Texas Spring Property Claims.  Approval of the Disposition is subject both to that TSX Venture Exchange approval and is further subject to the written consent of shareholders holding over 50% of the current issued and outstanding shares of the Company.</p><p>The technical disclosure in this news release regarding the Daggett Lithium Project has been reviewed by Mr. Jerry L. Aiken, BSc, Professional Geologist (WA) and SME Registered Member.   Mr. Aiken is a Qualified Person as that term is defined in NI 43-101.  </p><p><b>ABOUT M3 METALS CORP.</b></p><p>M3 Metals Corp. is a Canadian listed Company, focused on creating shareholder value through discoveries and strategic development of mineral properties in North America. For additional information please visit M3 Metals website at <a href=\"https://api.newsfilecorp.com/redirect/V7oJGtb758\">www.m3metalscorp.com</a>. You may also email <a href=\"mailto:info@m3metalscorp.com\">info@m3metalscorp.com</a> or call investor relations at (604) 669-2279.</p><p><b>M3 METALS CORP.<br /></b><i>\"Kosta Tsoutsis\"<br /></i>Kosta Tsoutsis, CEO</p><p><i>NEITHER THE TSX VENTURE EXCHANGE NOR ITS REGULATION SERVICES PROVIDER (AS THAT TERM IS DEFINED IN THE POLICIES OF THE TSX VENTURE EXCHANGE) ACCEPTS RESPONSIBILITY FOR THE ADEQUACY OR ACCURACY OF THIS RELEASE.</i></p><p><i>This news release may contain certain \"Forward-Looking Statements\" within the meaning of the United States Private Securities Litigation Reform Act of 1995 and applicable Canadian securities laws.  When or if used in this news release, the words \"anticipate\", \"believe\", \"estimate\", \"expect\", \"target, \"plan\", \"forecast\", \"may\", \"schedule\" and similar words or expressions identify forward-looking statements or information.  These forward-looking statements or information may relate to future prices of commodities, accuracy of mineral or resource exploration activity, reserves or resources, regulatory or government requirements or approvals (including environmental, habitat and other similar requirements or approvals), the reliability of third party information, continued access to mineral properties or infrastructure, currency risks including the exchange rate of US$ for CDN$,  changes in exploration costs and government royalties or taxes in Canada, the United States, California or other jurisdictions and other factors or information. Such statements represent the Company's current views with respect to future events and are necessarily based upon a number of assumptions and estimates that, while considered reasonable by the Company, are inherently subject to significant business, economic, competitive, political and social risks, contingencies and uncertainties. Many factors, both known and unknown, could cause results, performance or achievements to be materially different from the results, performance or achievements that are or may be expressed or implied by such forward-looking statements. The Company does not intend, and does not assume any obligation, to update these forward-looking statements or information to reflect changes in assumptions or changes in circumstances or any other events affections such statements and information other than as required by applicable laws, rules and regulations.</i></p><p id=\"corporateNewsLogoContainer\"><img src=\"https://images.newsfilecorp.com/files/5509/182583_5e571b32241b9a7e_logo.jpg\" id=\"corporateNewsLogo\" alt=\"Corporate Logo\" /></p><p id=\"corporateLinkBack\">To view the source version of this press release, please visit <a href=\"https://api.newsfilecorp.com/redirect/zEM2PFRn4Z\">https://www.newsfilecorp.com/release/182583</a></p>",
    "search_terms": "Daggett,M3 Metals Corp.,MT",
    "master_gid": 5489,
    "date": "2023-10-02T12:00:00.000Z",
    "tags": "USA|California||Lithium|Project Acquisition",
    "image_id": null,
    "hidden": false,
    "company_id": 300,
    "provider": null,
    "excerpt": "Vancouver, British Columbia--(Newsfile Corp. - October 2, 2023) -M3 Metals Corp. (TSXV: MT) (FSE: XOV) (\"M3 Metals\" or the \"Company\").On May 9, 2023, the Company announced that it had entered into a mineral property option agreement (the \"Agreement\") to acquire up to an eighty (80%) percent interest in the Daggett",
    "is_regulatory": false,
    "refined_tags": [
      "Project Acquisition"
    ],
    "ftp_filename": null,
    "company_name": "M3 Metals Corp.",
    "exchange": "TSXV",
    "root_ticker": "MT",
    "project_name": "Daggett",
    "gid": 5489,
    "location": "California, United States",
    "plan_id": null,
    "description_text": "Vancouver, British Columbia--(Newsfile Corp. - October 2, 2023) - M3 Metals Corp. (TSXV: MT) (FSE: XOV) (\"M3 Metals\" or the \"Company\"). On May 9, 2023, the Company announced that it had entered into a mineral property option agreement (the \"Agreement\") to acquire up to an eighty (80%) percent interest in the Daggett Lithium Project (the \"Property\"), a mineral property prospective for lithium and located in San Bernardino County, California. The Agreement, dated effective May 8, 2023, is between the Company and IMEx Consultants Inc. (the \"Vendor\").  The Agreement provides that the Company can earn a sixty (60%) percent interest in the Property by: (i) issuing 2,000,000 shares to the Vendor and paying to the Vendor the sum of USD$150,000 upon regulatory approval of the Agreement; and (ii) making USD$400,000 in exploration expenditures on the Property within twelve (12) months of regulatory approval of the Agreement.  The Company can acquire an additional twenty (20%) percent interest, for a total eighty (80%) interest in the Property by issuing an additional 2,000,000 shares to the Vendor and making an additional USD$2,000,000 in exploration expenditures on the Daggett Lithium Property within thirty-six (36) months of regulatory approval of the Agreement. The Agreement is subject to the regulatory approval of the TSX Venture Exchange (the \"Exchange\").  Because the transaction can result in the creation of a new control person, IMEx Consultants Inc., approval of the Agreement is further subject to the written consent of shareholders holding over 50% of the current issued and outstanding shares of the Company. The transactions contemplated in the Agreement constitute a Fundamental Acquisition (as that term is defined in the policies of the Exchange) and, as such, require completion of a technical report on the Property prior to receipt of regulatory approval.  The technical report has been submitted for review by the Exchange and the Company hopes to move forward with the Fundamental Acquisition shortly.   Trading in the shares of the Company is expected to resume between October 4-6, 2023. No finder's fees are payable in connection with the Agreement and the Agreement is an arm's length transaction.   There are no royalties or underlying option or other agreements related to the Property. ABOUT THE DAGGETT LITHIUM PROJECT The Property is comprised of 96 staked BLM and San Bernardino County registered lode mining claims (the \"Lakshmi Claims\") covering 2,641 acres (761 hectares). The Lakshmi Claims encompass a 9km strike length of exposed Barstow Formation clay-rich sediments containing anomalous levels of lithium. The Barstow area, located in the central Mojave Desert hosts numerous historic and current mines and exploration projects. To the east of the Daggett Lithium Project, the now-inactive Hector Borate Mine was most recently operated by N.L. Industries Corp. ) (\"N.L.\"). N.L. and its predecessors produced hectorite, a lithium-magnesium smectite clay for use in specialty applications. Currently, adjacent to that site, 5E Advanced Materials, Inc. is finalizing permitting while commissioning a new borate solution mining and refining operation. Borates play a big part in the history of mining in the Barstow region, with commercial borate mining and refining operations dating from the 1880's in the nearby Calico Mountains, and even a small borate mining operation within the Lakshmi claims group. The Calico borate mines were active until the 1920's, at which time the Pacific Coast Borax Company commenced operations at their giant sodium borate deposit at Boron, California. Another active project in the area includes the Waterloo Mine Silver Project, currently operated by Apollo Silver Corp. With its close association with borate mineralization and proximity to the Hector Mine, the Daggett Project is similar in occurrence to projects in advanced development in a similar geologic and tectonic setting in Nevada. The Project is well located in regard to infrastructure being within a very short distance from major highway, rail and energy corridors. It is also lies in close proximity to the town of Barstow, CA with available accommodations and labor. IMEx Consultants Inc. (\"IMEx\"), the vendor of the Daggett Lithium Project, first sampled the project area in March of 2022. Based on past experience in the area exploring for borate minerals, IMEx was aware that the fine-grained sediments of the area contain anomalous levels of both boron and lithium.  IMEx prospected the favorable sediments using a SciApps hand-help spectrometer (LIBS) to detect lithium contents of as much as 1,995ppmLi. Duplicate samples were submitted to the SGS laboratory in Lima, Peru and confirmed anomalous Li levels. Figure 1: Map showing the location of the Daggett Lithium project \"Lakshmi\" claims in relation to the city of Barstow, with nearby intersecting rail, highway, power and gas corridors. To view an enhanced version of this graphic, please visit: https://images.newsfilecorp.com/files/5509/182583_5e571b32241b9a7e_001full.jpg M3M contemplates two phases (Phase I and Phase II) of exploration work, environmental baseline studies and a permitting program at a cost of US$350,000 for Phase I and US$600,000 for Phase II to bring the Daggett Project to the drilling stage, as outlined in the table, below and with Phase II being contingent on results obtained in Phase I: Table 1: Daggett Lithium project Phase I budget and schedule. Activity Budget (US$) Schedule Phase I: Mapping Sampling 350,000 (total) 40,000 60,000 Oct. 23 - May 24 Oct. 23 - May 24 Jan. 24 - May 24 Geophysics (ERT/TEM) G&A / Other Costs Phase II Baseline Studies Bureau of Land Management (EA) NEPA Review Work US Legal (Environmental / BLM / NEPA) G&A / Other Costs 150,000 100,000 600,000 (total) 150,000 150,000 100,000 50,000 150,000 Apr. 24 - May 24 Oct. 23 - May 24 May 24 - May 25 May 24 - Apr. 25 Sept. 24 - Apr. 25 July 24 - May 25 May 24 - May 25 May 24 - May 25 M3M anticipates filing on SEDAR a technical report (the \"Report\") titled \"Daggett Lithium Project\", authored by Mr. Jerry L. Aiken, BSc., Professional Geologist (WA) and SME Registered Member which has been prepared for M3 Metals Corp. dated effective September, 2023.  The Report will contain additional details and disclosure concerning the Daggett Lithium Project. UPDATE ON DISPOSITION OF GREAT TEXAS SPRING PROPERTY CLAIMS In its news releases of July 26, 2023 and September 21, 2023 (the \"News Releases\"), the Company announced that it had entered into a mineral property option and joint venture agreement (the \"Agreement\") with Surge Battery Metals Inc. (\"Surge\"), a TSX Venture Exchange listed company and described an amendment to the Agreement.  The Agreement, as amended, grants Surge the option (the \"Option\") to earn up to an eighty (80%) percent interest in and to certain recently staked claims in Nevada (the \"Great Texas Spring Property Claims\") on the terms and conditions described in the News Releases. The Company has applied for TSX Venture Exchange approval of the disposition (the \"Disposition\") of the Great Texas Spring Property Claims.  Approval of the Disposition is subject both to that TSX Venture Exchange approval and is further subject to the written consent of shareholders holding over 50% of the current issued and outstanding shares of the Company. The technical disclosure in this news release regarding the Daggett Lithium Project has been reviewed by Mr. Jerry L. Aiken, BSc, Professional Geologist (WA) and SME Registered Member.   Mr. Aiken is a Qualified Person as that term is defined in NI 43-101. ABOUT M3 METALS CORP. M3 Metals Corp. is a Canadian listed Company, focused on creating shareholder value through discoveries and strategic development of mineral properties in North America. For additional information please visit M3 Metals website at www.m3metalscorp.com . You may also email info@m3metalscorp.com or call investor relations at (604) 669-2279. M3 METALS CORP. \"Kosta Tsoutsis\" Kosta Tsoutsis, CEO NEITHER THE TSX VENTURE EXCHANGE NOR ITS REGULATION SERVICES PROVIDER (AS THAT TERM IS DEFINED IN THE POLICIES OF THE TSX VENTURE EXCHANGE) ACCEPTS RESPONSIBILITY FOR THE ADEQUACY OR ACCURACY OF THIS RELEASE. This news release may contain certain \"Forward-Looking Statements\" within the meaning of the United States Private Securities Litigation Reform Act of 1995 and applicable Canadian securities laws.  When or if used in this news release, the words \"anticipate\", \"believe\", \"estimate\", \"expect\", \"target, \"plan\", \"forecast\", \"may\", \"schedule\" and similar words or expressions identify forward-looking statements or information.  These forward-looking statements or information may relate to future prices of commodities, accuracy of mineral or resource exploration activity, reserves or resources, regulatory or government requirements or approvals (including environmental, habitat and other similar requirements or approvals), the reliability of third party information, continued access to mineral properties or infrastructure, currency risks including the exchange rate of US$ for CDN$,  changes in exploration costs and government royalties or taxes in Canada, the United States, California or other jurisdictions and other factors or information. Such statements represent the Company's current views with respect to future events and are necessarily based upon a number of assumptions and estimates that, while considered reasonable by the Company, are inherently subject to significant business, economic, competitive, political and social risks, contingencies and uncertainties. Many factors, both known and unknown, could cause results, performance or achievements to be materially different from the results, performance or achievements that are or may be expressed or implied by such forward-looking statements. The Company does not intend, and does not assume any obligation, to update these forward-looking statements or information to reflect changes in assumptions or changes in circumstances or any other events affections such statements and information other than as required by applicable laws, rules and regulations. To view the source version of this press release, please visit https://www.newsfilecorp.com/release/182583",
    "primary_commodity": "Li"
  },
  "articleProject": {
    "gid": 5489,
    "project_name": "Daggett",
    "location": "California, United States"
  },
  "articleExchange": "TSXV",
  "articleCompanyId": 300,
  "articleTicker": "MT",
  "articleCompanyName": "M3 Metals Corp.",
  "allOtherCompanyProjects": [
    {
      "company_id": 300,
      "gid": 5489,
      "project_name": "Daggett",
      "location": "California, United States"
    }
  ],
  "allOtherCompanyNews": [
    {
      "id": -158117,
      "company_id": 300,
      "title": "M3 Announces Management Changes",
      "link": "https://www.newsfilecorp.com/release/232205/M3-Announces-Management-Changes",
      "date": "2024-12-02T22:01:00.000Z",
      "hidden": false
    },
    {
      "id": 77474,
      "company_id": 300,
      "title": "M3 Announces Extension to Property Purchase Agreement Announced on August 22, 2024",
      "link": "https://www.newsfilecorp.com/release/228497/M3-Announces-Extension-to-Property-Purchase-Agreement-Announced-on-August-22-2024",
      "date": "2024-10-31T21:00:00.000Z",
      "hidden": false
    },
    {
      "id": -149291,
      "company_id": 300,
      "title": "M3 Extends Warrant Term",
      "link": "https://www.newsfilecorp.com/release/227694/M3-Extends-Warrant-Term",
      "date": "2024-10-24T21:30:00.000Z",
      "hidden": false
    },
    {
      "id": 69086,
      "company_id": 300,
      "title": "M3 Sells Texas Spring Property",
      "link": "https://www.newsfilecorp.com/release/220713/M3-Sells-Texas-Spring-Property",
      "date": "2024-08-22T12:00:00.000Z",
      "hidden": false
    },
    {
      "id": 51569,
      "company_id": 300,
      "title": "M3 Metals JV Partner Surge Announces Drilling on M3 Land",
      "link": "https://www.newsfilecorp.com/release/204271/M3-Metals-JV-Partner-Surge-Announces-Drilling-on-M3-Land",
      "date": "2024-04-04T12:00:00.000Z",
      "hidden": false
    },
    {
      "id": 49954,
      "company_id": 300,
      "title": "M3 Metals Hires Capital Analytica for IR Services",
      "link": "https://www.newsfilecorp.com/release/199919/M3-Metals-Hires-Capital-Analytica-for-IR-Services",
      "date": "2024-03-01T22:00:00.000Z",
      "hidden": false
    },
    {
      "id": 45339,
      "company_id": 300,
      "title": "M3 Metals Capitalizing on 2 Large-Scale Lithium Projects in Multi-Billion Dollar Lithium Hotbeds",
      "link": "https://www.globenewswire.com/news-release/2023/12/05/2790945/0/en/M3-Metals-Capitalizing-on-2-Large-Scale-Lithium-Projects-in-Multi-Billion-Dollar-Lithium-Hotbeds.html",
      "date": "2023-12-05T13:45:00.000Z",
      "hidden": false
    },
    {
      "id": 43403,
      "company_id": 300,
      "title": "M3 Metals JV Partner Surge Announces Soil Sampling on Recently Acquired Property",
      "link": "https://www.newsfilecorp.com/release/185833/M3-Metals-JV-Partner-Surge-Announces-Soil-Sampling-on-Recently-Acquired-Property",
      "date": "2023-11-01T12:00:00.000Z",
      "hidden": false
    },
    {
      "id": 42959,
      "company_id": 300,
      "title": "M3M Closes Initial Disposition of 50% of Lands in the Area of Surge Battery Metals' North Nevada Lithium Project",
      "link": "https://www.newsfilecorp.com/release/185003/M3M-Closes-Initial-Disposition-of-50-of-Lands-in-the-Area-of-Surge-Battery-Metals-North-Nevada-Lithium-Project",
      "date": "2023-10-24T12:00:00.000Z",
      "hidden": false
    },
    {
      "id": 42759,
      "company_id": 300,
      "title": "M3 Metals Receives Regulatory Approval and Makes Initial Payments Under Daggett Lithium Project Option Agreement",
      "link": "https://www.newsfilecorp.com/release/184565/M3-Metals-Receives-Regulatory-Approval-and-Makes-Initial-Payments-Under-Daggett-Lithium-Project-Option-Agreement",
      "date": "2023-10-19T20:45:00.000Z",
      "hidden": false
    }
  ]
}
