{
  "article": {
    "id": 46092,
    "link": "https://www.newsfilecorp.com/release/191563/Silver-One-Expands-Its-Land-Position-to-Cover-Potential-Porphyry-Copper-Systems-and-Areas-of-Silver-Mineralization-at-Its-Phoenix-Silver-Project-Arizona",
    "title": "Silver One Expands Its Land Position to Cover Potential Porphyry Copper Systems and Areas of Silver Mineralization at Its Phoenix Silver Project, Arizona",
    "description": "<img src=\"https://api.newsfilecorp.com/newsinfo/191563/367\" id=\"367\" width=\"2\" height=\"2\" style=\"width: 1px;  height: 1px;border: 0px solid;\" /><p>Vancouver, British Columbia--(Newsfile Corp. - December 19, 2023) - Silver One Resources Inc. (TSXV: SVE) (OTCQX: SLVRF) (FSE: BRK1) (\"Silver One\" or the \"Company\") is pleased to announce the staking of additional claims to the east of those announced in the Company's news release of October 23, 2023.  These new claims further expand the ground holdings at its Phoenix Silver Project near Globe, Arizona.  The newly acquired area more fully covers regional magnetic anomalies located in the southern part of the property.  These anomalies are  part of a prolific, 30+ km long, northeast-trending porphyry copper belt; host to several large porphyry copper deposits such as Resolution (Rio Tinto-BHP), Carlota (KGHM), Pinto Valley (Capstone Copper) and Globe/Miami  (Freeport McMoran) -See Figure 1.</p><p><i>Greg Crowe, President and CEO of Silver One commented:  \"The staking of these new claims is an affirmation of the company's commitment to seek and take advantage of opportunities to grow.  We are not only continuing to explore the silver anomalies in the central and northern parts of the property, which includes the drill-permitted area covering the potentially very high-grade silver targets, but we are also expanding our land position around magnetic anomalies identified to date. The magnetic anomalies constitute promising copper targets in a region holding immense potential for porphyry copper systems.  These anomalies, along with the select vein samples that returned high-grade copper values in the southern part of the Phoenix Silver project (see Figure 2) are strongly suggestive of a copper system at depth.  Silver One is looking forward to fully exploring the property and to unlocking value for our investors.\"      </i></p><p>Highlights:</p><ul style=\"list-style-type: disc;\"><li>The Phoenix Silver property has expanded in size and scope to cover the original very high-grade silver vein targets and the more recently outlined areas of potential porphyry copper targets.<br /><br /></li><li>The Project now covers 6,141 hectares (15,175 acres) along the northeastern extension of a 30+ km long system hosting past and current producing silver and copper mines.  This belt is the focus of new exploration efforts by several companies to potentially outline new porphyry copper and silver related targets.</li></ul><ul style=\"list-style-type: disc;\"><li>Silver One is planning on drilling the potentially very high-grade silver targets, which are already permitted, in 2024.  The Company also plans to conduct sampling and geophysical surveys to better outline potential porphyry copper targets in the southern part of the property.</li></ul><p style=\"text-align: center;\"><a rel=\"nofollow\" href=\"https://images.newsfilecorp.com/files/4730/191563_f50cc7bf943e5a65_001full.jpg\"><img src=\"https://images.newsfilecorp.com/files/4730/191563_f50cc7bf943e5a65_001.jpg\" style=\"border-width: 0px;\" alt=\"Cannot view this image? Visit: https://images.newsfilecorp.com/files/4730/191563_f50cc7bf943e5a65_001.jpg\" /></a><br /><br /><b>Figure 1 - Phoenix Silver location map showing the location of the new claims staked, regional magnetic anomalies (magnetic vector inversion (MVI) component W) as well as selected silver and copper mines and exploration projects. Magnetic contours are .0002, .0004, .0008, .0016 .0032 .0064 .0128</b>&#160;<b>in SI units.</b></p><p style=\"text-align: center;\">To view an enhanced version of this graphic, please visit:<br /><a rel=\"nofollow\" href=\"https://images.newsfilecorp.com/files/4730/191563_f50cc7bf943e5a65_001full.jpg\">https://images.newsfilecorp.com/files/4730/191563_f50cc7bf943e5a65_001full.jpg</a></p><p style=\"text-align: center;\"><a rel=\"nofollow\" href=\"https://images.newsfilecorp.com/files/4730/191563_f50cc7bf943e5a65_002full.jpg\"><img src=\"https://images.newsfilecorp.com/files/4730/191563_f50cc7bf943e5a65_002.jpg\" style=\"border-width: 0px;\" alt=\"Cannot view this image? Visit: https://images.newsfilecorp.com/files/4730/191563_f50cc7bf943e5a65_002.jpg\" /></a><br /><br /><b>Figure 2 - Phoenix Silver Property Map showing new area staked, silver and porphyry targets (interpreted from a detailed drone-borne survey commissioned by the Company. Purple shaded zones are magnetic anomalies at 600 m depth, see October 23, 2023 news release), as well as regional magnetic anomalies (magnetic vector inversion (\"MVI\") component W, contours start at .0002, then .0004, .0008, .0016 .0032 .0064 .0128</b>&#160;<b>in SI units) derived from public data.</b></p><p style=\"text-align: center;\">To view an enhanced version of this graphic, please visit:<br /><a rel=\"nofollow\" href=\"https://images.newsfilecorp.com/files/4730/191563_f50cc7bf943e5a65_002full.jpg\">https://images.newsfilecorp.com/files/4730/191563_f50cc7bf943e5a65_002full.jpg</a></p><p>Silver One's new staking has strategically secured 260 unpatented lode claims covering 2,090 hectares (5,165 acres) in an area renowned for its geological copper and silver potential, as illustrated by the Resolution deposit, one of the world's largest undeveloped copper deposits, BHP's new Ocelot  copper discovery,  Freeport McMoRan's Miami complex immediately southwest of Phoenix Silver, other producing copper mines, as well as associated regional magnetic anomalies possibly indicative of porphyry copper deposits.  In total, the property now extends over 6,141 hectares (61.4 square kilometers or 15,175 acres) (Figures 1 and 2) which cover both the potential very high-grade silver and the porphyry copper targets. </p><p>The new claims occur along a prolific present and past-producing northeast-trending, 30+ km long porphyry copper belt.  Freeport McMoran is currently operating the Miami copper mine immediately southwest of Phoenix Silver, Capstone operates Pinto Valley Mine, and KGHM owns the Carlotta Mine (Figure 1).  Several other companies, including BHP, Rio Tinto and South 32, are actively exploring the area.   Select rock samples collected from the southern portion of the Phoenix Silver property have returned several values over 1% copper (see Figure 2 and October 23, 2023 and July 28, 2020 news releases).</p><p>Silver One is leveraging the use of advanced exploration technology to identify promising new targets. The reprocessing of drone-borne and publicly available regional magnetic data using magnetic vector inversion (MVI) modelling has revealed strong northeast-trending magnetic anomalies at Phoenix Silver, which are similar to those found at Globe-Miami and elsewhere along the 30+ km long mineralized belt (Figure 1 shows regional magnetic anomalies. Figure 2 shows both local and regional magnetic anomalies - See October 23, 2023 and Jan 11, 2021 News Releases). The MVI processing and Interpretation was done by Carl Windels Consulting, Denver, Colorado.</p><p>The expansion of the property aligns with the Company's plans to grow through the development of existing properties and acquisitions. Thus, the new claims acquired through staking offer an excellent opportunity to explore highly sought-after targets in the mining industry such as porphyry copper systems along with pursuing its primary goal of finding and developing quality silver assets.</p><p><i><b>Qualified Person</b></i><br /><br />The technical content of this news release has been reviewed and approved by Robert M. Cann, P. Geo, a Qualified Person as defined by National Instrument 43-101 and an independent consultant to the Company.</p><p><i><b>About Silver One</b></i></p><p>Silver One is focused on the exploration and development of quality silver projects.  The Company holds a 100% interest in its flagship project, the past-producing Candelaria Mine located in Nevada.  Potential reprocessing of silver from the historic leach pads at Candelaria provides an opportunity for possible near-term production.  Additional opportunities lie in previously identified high-grade silver intercepts down-dip, potentially increasing the substantive silver mineralization along-strike from the two past-producing open pits.</p><p>The Company has staked 636 lode claims and entered into a Lease/Purchase Agreement to acquire five patented claims on its Cherokee project located in Lincoln County, Nevada. The Property hosts multiple silver-copper-gold vein systems, traced to date for over 11 km along-strike.</p><p>Silver One holds an option to acquire a 100% interest in the Phoenix Silver Project. The Phoenix Silver Project is a very high-grade native silver prospect that lies within the \"Arizona Silver Belt,\" immediately adjacent to the prolific copper producing area of Globe, Arizona. </p><p><b>For more information, please contact:</b></p><p>Silver One Resources Inc.<br />Gary Lindsey - VP, Investor Relations<br />Phone: 604-974&#8208;5274<br />Mobile:  (720) 273-6224<br />Email:  <a href=\"mailto:gary@strata-star.com\">gary@strata-star.com</a></p><p><i><b>Forward-Looking Statements</b></i></p><p>Information set forth in this news release contains forward-looking statements that are based on assumptions as of the date of this news release. These statements reflect management's current estimates, beliefs, intentions and expectations. They are not guarantees of future performance. Silver One cautions that all forward-looking statements are inherently uncertain, and that actual performance may be affected by a number of material factors, many of which are beyond Silver One's control. Such factors include, among other things: risks and uncertainties relating to Silver One's limited operating history, ability to obtain sufficient financing to carry out its exploration and development objectives on the Candelaria and Phoenix Silver Projects, obtaining the necessary permits to carry out its activities and the need to comply with environmental and governmental regulations. Mineralization at nearby deposits is not necessarily indicative of mineralization at Silver One's properties.  Accordingly, actual and future events, conditions and results may differ materially from the estimates, beliefs, intentions and expectations expressed or implied in the forward-looking information. Except as required under applicable securities legislation, Silver One undertakes no obligation to publicly update or revise forward-looking information.</p><p><b>NEITHER TSX VENTURE EXCHANGE NOR ITS REGULATION SERVICES PROVIDER (AS THAT TERM IS DEFINED IN THE POLICIES OF THE TSX VENTURE EXCHANGE) ACCEPTS RESPONSIBILITY FOR THE ADEQUACY OR ACCURACY OF THIS RELEASE. </b></p><p id=\"corporateNewsLogoContainer\"><img src=\"https://images.newsfilecorp.com/files/4730/191563_f50cc7bf943e5a65_logo.jpg\" id=\"corporateNewsLogo\" alt=\"Corporate Logo\" /></p><p id=\"corporateLinkBack\">To view the source version of this press release, please visit <a href=\"https://api.newsfilecorp.com/redirect/0V2r0CJOWA\">https://www.newsfilecorp.com/release/191563</a></p>",
    "search_terms": "Phoenix ,Silver One Resources Inc.,SVE",
    "master_gid": 5400,
    "date": "2023-12-19T07:39:00.000Z",
    "tags": "USA|Arizona||Silver|Project Acquisition",
    "image_id": null,
    "hidden": false,
    "company_id": 417,
    "provider": null,
    "excerpt": "Vancouver, British Columbia--(Newsfile Corp. - December 19, 2023) - Silver One Resources Inc. (TSXV: SVE) (OTCQX: SLVRF) (FSE: BRK1) (\"Silver One\" or the \"Company\") is pleased to announce the staking of additional claims to the east of those announced in the Company's news release of October 23, 2023.  These",
    "is_regulatory": false,
    "refined_tags": [
      "Project Acquisition"
    ],
    "ftp_filename": null,
    "company_name": "Silver One Resources Inc.",
    "exchange": "TSXV",
    "root_ticker": "SVE",
    "project_name": "Phoenix Silver",
    "gid": 5400,
    "location": "Arizona, United States",
    "plan_id": null,
    "description_text": "Vancouver, British Columbia--(Newsfile Corp. - December 19, 2023) - Silver One Resources Inc. (TSXV: SVE) (OTCQX: SLVRF) (FSE: BRK1) (\"Silver One\" or the \"Company\") is pleased to announce the staking of additional claims to the east of those announced in the Company's news release of October 23, 2023.  These new claims further expand the ground holdings at its Phoenix Silver Project near Globe, Arizona.  The newly acquired area more fully covers regional magnetic anomalies located in the southern part of the property.  These anomalies are  part of a prolific, 30+ km long, northeast-trending porphyry copper belt; host to several large porphyry copper deposits such as Resolution (Rio Tinto-BHP), Carlota (KGHM), Pinto Valley (Capstone Copper) and Globe/Miami  (Freeport McMoran) -See Figure 1. Greg Crowe, President and CEO of Silver One commented:  \"The staking of these new claims is an affirmation of the company's commitment to seek and take advantage of opportunities to grow.  We are not only continuing to explore the silver anomalies in the central and northern parts of the property, which includes the drill-permitted area covering the potentially very high-grade silver targets, but we are also expanding our land position around magnetic anomalies identified to date. The magnetic anomalies constitute promising copper targets in a region holding immense potential for porphyry copper systems.  These anomalies, along with the select vein samples that returned high-grade copper values in the southern part of the Phoenix Silver project (see Figure 2) are strongly suggestive of a copper system at depth.  Silver One is looking forward to fully exploring the property and to unlocking value for our investors.\" Highlights: The Phoenix Silver property has expanded in size and scope to cover the original very high-grade silver vein targets and the more recently outlined areas of potential porphyry copper targets. The Project now covers 6,141 hectares (15,175 acres) along the northeastern extension of a 30+ km long system hosting past and current producing silver and copper mines.  This belt is the focus of new exploration efforts by several companies to potentially outline new porphyry copper and silver related targets. Silver One is planning on drilling the potentially very high-grade silver targets, which are already permitted, in 2024.  The Company also plans to conduct sampling and geophysical surveys to better outline potential porphyry copper targets in the southern part of the property. Figure 1 - Phoenix Silver location map showing the location of the new claims staked, regional magnetic anomalies (magnetic vector inversion (MVI) component W) as well as selected silver and copper mines and exploration projects. Magnetic contours are .0002, .0004, .0008, .0016 .0032 .0064 .0128 in SI units. To view an enhanced version of this graphic, please visit: https://images.newsfilecorp.com/files/4730/191563_f50cc7bf943e5a65_001full.jpg Figure 2 - Phoenix Silver Property Map showing new area staked, silver and porphyry targets (interpreted from a detailed drone-borne survey commissioned by the Company. Purple shaded zones are magnetic anomalies at 600 m depth, see October 23, 2023 news release), as well as regional magnetic anomalies (magnetic vector inversion (\"MVI\") component W, contours start at .0002, then .0004, .0008, .0016 .0032 .0064 .0128 in SI units) derived from public data. To view an enhanced version of this graphic, please visit: https://images.newsfilecorp.com/files/4730/191563_f50cc7bf943e5a65_002full.jpg Silver One's new staking has strategically secured 260 unpatented lode claims covering 2,090 hectares (5,165 acres) in an area renowned for its geological copper and silver potential, as illustrated by the Resolution deposit, one of the world's largest undeveloped copper deposits, BHP's new Ocelot  copper discovery,  Freeport McMoRan's Miami complex immediately southwest of Phoenix Silver, other producing copper mines, as well as associated regional magnetic anomalies possibly indicative of porphyry copper deposits.  In total, the property now extends over 6,141 hectares (61.4 square kilometers or 15,175 acres) (Figures 1 and 2) which cover both the potential very high-grade silver and the porphyry copper targets. The new claims occur along a prolific present and past-producing northeast-trending, 30+ km long porphyry copper belt.  Freeport McMoran is currently operating the Miami copper mine immediately southwest of Phoenix Silver, Capstone operates Pinto Valley Mine, and KGHM owns the Carlotta Mine (Figure 1).  Several other companies, including BHP, Rio Tinto and South 32, are actively exploring the area.   Select rock samples collected from the southern portion of the Phoenix Silver property have returned several values over 1% copper (see Figure 2 and October 23, 2023 and July 28, 2020 news releases). Silver One is leveraging the use of advanced exploration technology to identify promising new targets. The reprocessing of drone-borne and publicly available regional magnetic data using magnetic vector inversion (MVI) modelling has revealed strong northeast-trending magnetic anomalies at Phoenix Silver, which are similar to those found at Globe-Miami and elsewhere along the 30+ km long mineralized belt (Figure 1 shows regional magnetic anomalies. Figure 2 shows both local and regional magnetic anomalies - See October 23, 2023 and Jan 11, 2021 News Releases). The MVI processing and Interpretation was done by Carl Windels Consulting, Denver, Colorado. The expansion of the property aligns with the Company's plans to grow through the development of existing properties and acquisitions. Thus, the new claims acquired through staking offer an excellent opportunity to explore highly sought-after targets in the mining industry such as porphyry copper systems along with pursuing its primary goal of finding and developing quality silver assets. Qualified Person The technical content of this news release has been reviewed and approved by Robert M. Cann, P. Geo, a Qualified Person as defined by National Instrument 43-101 and an independent consultant to the Company. About Silver One Silver One is focused on the exploration and development of quality silver projects.  The Company holds a 100% interest in its flagship project, the past-producing Candelaria Mine located in Nevada.  Potential reprocessing of silver from the historic leach pads at Candelaria provides an opportunity for possible near-term production.  Additional opportunities lie in previously identified high-grade silver intercepts down-dip, potentially increasing the substantive silver mineralization along-strike from the two past-producing open pits. The Company has staked 636 lode claims and entered into a Lease/Purchase Agreement to acquire five patented claims on its Cherokee project located in Lincoln County, Nevada. The Property hosts multiple silver-copper-gold vein systems, traced to date for over 11 km along-strike. Silver One holds an option to acquire a 100% interest in the Phoenix Silver Project. The Phoenix Silver Project is a very high-grade native silver prospect that lies within the \"Arizona Silver Belt,\" immediately adjacent to the prolific copper producing area of Globe, Arizona. For more information, please contact: Silver One Resources Inc. Gary Lindsey - VP, Investor Relations Phone: 604-974‐5274 Mobile:  (720) 273-6224 Email: gary@strata-star.com Forward-Looking Statements Information set forth in this news release contains forward-looking statements that are based on assumptions as of the date of this news release. These statements reflect management's current estimates, beliefs, intentions and expectations. They are not guarantees of future performance. Silver One cautions that all forward-looking statements are inherently uncertain, and that actual performance may be affected by a number of material factors, many of which are beyond Silver One's control. Such factors include, among other things: risks and uncertainties relating to Silver One's limited operating history, ability to obtain sufficient financing to carry out its exploration and development objectives on the Candelaria and Phoenix Silver Projects, obtaining the necessary permits to carry out its activities and the need to comply with environmental and governmental regulations. Mineralization at nearby deposits is not necessarily indicative of mineralization at Silver One's properties.  Accordingly, actual and future events, conditions and results may differ materially from the estimates, beliefs, intentions and expectations expressed or implied in the forward-looking information. Except as required under applicable securities legislation, Silver One undertakes no obligation to publicly update or revise forward-looking information. NEITHER TSX VENTURE EXCHANGE NOR ITS REGULATION SERVICES PROVIDER (AS THAT TERM IS DEFINED IN THE POLICIES OF THE TSX VENTURE EXCHANGE) ACCEPTS RESPONSIBILITY FOR THE ADEQUACY OR ACCURACY OF THIS RELEASE. To view the source version of this press release, please visit https://www.newsfilecorp.com/release/191563",
    "primary_commodity": "Ag"
  },
  "articleProject": {
    "gid": 5400,
    "project_name": "Phoenix Silver",
    "location": "Arizona, United States"
  },
  "articleExchange": "TSXV",
  "articleCompanyId": 417,
  "articleTicker": "SVE",
  "articleCompanyName": "Silver One Resources Inc.",
  "allOtherCompanyProjects": [
    {
      "company_id": 417,
      "gid": 5400,
      "project_name": "Phoenix Silver",
      "location": "Arizona, United States"
    },
    {
      "company_id": 417,
      "gid": 767,
      "project_name": "Cherokee",
      "location": "Nevada, USA"
    },
    {
      "company_id": 417,
      "gid": 999,
      "project_name": "Candelaria",
      "location": "Nevada, USA"
    }
  ],
  "allOtherCompanyNews": [
    {
      "id": 103599,
      "company_id": 417,
      "title": "SILVER ONE ANNOUNCES IN-GROUND MINERAL RESOURCE ESTIMATE PREPARED IN ACCORDANCE WITH NI 43-101 ON ITS CANDELARIA PROJECT, NEVADA",
      "link": "https://contentapi.cision.com/api/v1.0/releases/20250506LN79557",
      "date": "2025-05-06T04:15:00.000Z",
      "hidden": false
    },
    {
      "id": 100542,
      "company_id": 417,
      "title": "Silver One Provides Corporate Update on Its Nevada and Arizona Projects, Southwest USA",
      "link": null,
      "date": "2025-04-23T04:15:00.000Z",
      "hidden": false
    },
    {
      "id": 89232,
      "company_id": 417,
      "title": "SILVER ONE PROVIDES UPDATE ON METALLURGICAL TEST RESULTS USING INNOVATIVE SEPARATION AND LEACHING TECHNOLOGIES AT ITS CANDELARIA SILVER MINE, NEVADA",
      "link": "https://contentapi.cision.com/api/v1.0/releases/20250226C7373",
      "date": "2025-02-26T05:15:00.000Z",
      "hidden": false
    },
    {
      "id": 88903,
      "company_id": 417,
      "title": "SILVER ONE RECEIVES FINAL DRILL RESULTS FROM ITS PHOENIX SILVER PROJECT, ARIZONA TRACES SILVER-COPPER BEARING STRUCTURE ALONG STRIKE",
      "link": "https://contentapi.cision.com/api/v1.0/releases/20250224LN25241",
      "date": "2025-02-24T05:15:00.000Z",
      "hidden": false
    },
    {
      "id": 88565,
      "company_id": 417,
      "title": "SILVER ONE'S ZTEM AIRBORNE GEOPHYSICAL SURVEY OUTLINES POTENTIAL PORPHYRY COPPER AND ADDITIONAL SILVER EXPLORATION TARGETS AT PHOENIX SILVER, ARIZONA. NEW CLAIMS STAKED",
      "link": "https://contentapi.cision.com/api/v1.0/releases/20250220LN23399",
      "date": "2025-02-20T05:27:00.000Z",
      "hidden": false
    },
    {
      "id": 74026,
      "company_id": 417,
      "title": "SILVER ONE COMMENCES A ZTEM GEOPHYSICAL SURVEY AT ITS HIGH-GRADE PHOENIX SILVER PROJECT, ARIZONA",
      "link": "https://contentapi.cision.com/api/v1.0/releases/20241008C5867",
      "date": "2024-10-08T04:15:00.000Z",
      "hidden": false
    },
    {
      "id": 73528,
      "company_id": 417,
      "title": "SILVER ONE COMMENCES DRILLING AT ITS HIGH-GRADE PHOENIX SILVER PROJECT, ARIZONA",
      "link": "https://contentapi.cision.com/api/v1.0/releases/20241002LN21199",
      "date": "2024-10-02T04:15:00.000Z",
      "hidden": false
    },
    {
      "id": 71592,
      "company_id": 417,
      "title": "SILVER ONE COMMENCES ROAD AND PAD CONSTRUCTION IN PREPARATION FOR DRILLING AT ITS HIGH-GRADE PHOENIX SILVER PROJECT, ARIZONA",
      "link": "https://contentapi.cision.com/api/v1.0/releases/20240917C6260",
      "date": "2024-09-17T06:56:00.000Z",
      "hidden": false
    },
    {
      "id": 68050,
      "company_id": 417,
      "title": "Silver One to Conduct Airborne Geophysics and Prepares for Drilling on Its Phoenix Silver Project, Arizona",
      "link": "https://www.newsfilecorp.com/release/219546/Silver-One-to-Conduct-Airborne-Geophysics-and-Prepares-for-Drilling-on-Its-Phoenix-Silver-Project-Arizona",
      "date": "2024-08-12T04:15:00.000Z",
      "hidden": false
    },
    {
      "id": 63142,
      "company_id": 417,
      "title": "SILVER ONE CLOSES OVERSUBSCRIBED FINANCING OF $5.9 MILLION",
      "link": "https://contentapi.cision.com/api/v1.0/releases/20240621LN45426",
      "date": "2024-06-21T11:20:00.000Z",
      "hidden": false
    }
  ]
}
