{
  "article": {
    "id": 48576,
    "link": "https://contentapi.cision.com/api/v1.0/releases/20240208C0168",
    "title": "SILVER ONE COMPLETES THE 100% ACQUISITION OF ITS PHOENIX SILVER PROJECT IN ARIZONA",
    "description": "\n\n<p><span class=\"legendSpanClass\"><span class=\"xn-location\">VANCOUVER, BC</span></span>, <span class=\"legendSpanClass\"><span class=\"xn-chron\">Feb. 8, 2024</span></span> /CNW/ -- <b>Silver One Resources Inc. (TSXV: SVE) (OTCQX: SLVRF) (FSE: BRK1) </b>(\"Silver One\" or the \"Company\") is pleased to announce that it has exercised its option to acquire a 100% interest in the high-grade Phoenix Silver Project, located within the \"Arizona Silver Belt\". </p>\n\n    <div class=\"PRN_ImbeddedAssetReference\" id=\"DivAssetPlaceHolder1\">\n                <p>\n                        <a href=\"https://mma.prnewswire.com/media/2337001/Phoenix_Silver_Project_Location.html\" rel=\"nofollow\" target=\"_blank\">\n                    <img alt=\"Figure 1 – Phoenix Silver Project Location\" src=\"https://mma.prnewswire.com/media/2337001/Phoenix_Silver_Project_Location.jpg?p=original\" title=\"Figure 1 – Phoenix Silver Project Location\"></img>\n                        </a>\n                </p>\n\n    </div>\n<p><b><i>Highlights of Phoenix Silver Project:</i></b></p>\n<ul type=\"disc\"><li><b>Phoenix Silver Project covers 6,141 hectares along the northern extension of a prolific 30+km long mineralized trend hosting past and current producing silver and copper mines.</b></li><li><b>Permitted for drilling on high-grade silver targets.</b></li><li><b>Very high-grade native silver vein fragments, including a 189 kg (417 lb.) specimen estimated to contain over 70% silver and an 8.5 kg (18.7 lb. ) specimen assaying 459,000 g/t (14,688 oz/t) silver (see news release dated <span class=\"xn-chron\">February 20, 2020</span>).</b></li></ul><p><i><span class=\"xn-person\">Greg Crowe</span>, President and CEO of Silver One commented: \"Acquiring a 100% interest in Phoenix Silver represents a rare opportunity in potentially identifying extremely rich silver vein mineralization.  Large angular and unabraded vein fragments were detected by metal detectors and uncovered in overburden within a metre of surface.  These have been interpreted as being near their original source, as silver is very soft and large fragments break apart easily upon transport over even small distances.  One vein fragment weighed 189 kg (417 lb.) and was estimated by specific gravity methods to contain 70% silver.  Assays of smaller fragments returned up to 459,000 g/t (14,688 oz/T) silver (see Company News Release of <span class=\"xn-chron\">February 20, 2020</span>). </i></p>\n<p><i>A drill permit has been secured to test structures believed to be the host to these very high-grade vein fragments (see Company News Release of <span class=\"xn-chron\">March 2</span>, 2023).  </i></p>\n<p><i>The southern portion of the project also hosts regional trending veins and breccia zones, with several selected samples returning over 1% copper.  The property lies to the northeast of Freeport McMoran's copper producing Miami Complex and BHP's Ocelot porphyry copper exploration project.  Phoenix Silver lies at the northeast margin of a 30+ km long porphyry copper and silver belt and has excellent potential to host very high-grade silver mineralization as well as porphyry related copper mineralization.\"</i></p>\n<p>In order to acquire a 100% interest in the Phoenix Silver Project, Silver One paid <span class=\"xn-money\">US$350,000</span> and issued ten million common shares of Silver One over 3 years to the property vendors.  The central portion of the claim block is subject to a 2% NSR, which can be purchased for <span class=\"xn-money\">US$ 1.0 million</span>.</p>\n<p><b><i>Qualified Person</i></b></p>\n<p>The technical content of this news release has been reviewed and approved by <span class=\"xn-person\">Robert M. Cann</span>, P. Geo, a Qualified Person as defined by National Instrument 43-101 and an independent consultant to the Company.</p>\n<p><b><i>About Silver One</i></b></p>\n<p>Silver One is focused on the exploration and development of quality silver projects.  The Company owns a 100%-interest in its flagship project, the past-producing Candelaria Mine located in Nevada.  Potential reprocessing of silver from the historic leach pads at Candelaria provides an opportunity for possible near-term production.  Additional opportunities lie in previously identified high-grade silver intercepts down-dip and potentially increasing the substantive silver mineralization along-strike from the two past-producing open pits.</p>\n<p>The Company has staked 636 lode claims and entered into a Lease/Purchase Agreement to acquire five patented claims on its Cherokee project located in <span class=\"xn-location\">Lincoln County, Nevada</span>, host to multiple silver-copper-gold vein systems, traced to date for over 11 km along-strike.</p>\n<p>Silver One owns 100% interest in the Silver Phoenix Project. The Silver Phoenix Project is a very high-grade native silver prospect that lies within the \"Arizona Silver Belt,\" immediately adjacent to the prolific copper producing area of <span class=\"xn-location\">Globe</span>, Arizona. </p>\n<p>For more information, please contact:</p>\n<p>Silver One Resources Inc.<br></br><span class=\"xn-person\">Gary Lindsey</span> - VP, Investor Relations<br></br>Phone: 604-974–5274<br></br>Mobile : (720) 273-6224<br></br>Email :  <a href=\"mailto:gary@strata-star.com\" rel=\"nofollow\" target=\"_blank\">gary@strata-star.</a><a href=\"mailto:gary@strata-star.com\" rel=\"nofollow\" target=\"_blank\">com</a> </p>\n<p><b><i>Forward-Looking Statements</i></b></p>\n<p>Information set forth in this news release contains forward-looking statements that are based on assumptions as of the date of this news release. These statements reflect management's current estimates, beliefs, intentions and expectations. They are not guarantees of future performance. Silver One cautions that all forward-looking statements are inherently uncertain, and that actual performance may be affected by a number of material factors, many of which are beyond Silver One's control. Such factors include, among other things: risks and uncertainties relating to Silver One's limited operating history, ability to obtain sufficient financing to carry out its exploration and development objectives on the Candelaria Project, obtaining the necessary permits to carry out its activities and the need to comply with environmental and governmental regulations. Accordingly, actual and future events, conditions and results may differ materially from the estimates, beliefs, intentions and expectations expressed or implied in the forward-looking information. Except as required under applicable securities legislation, Silver One undertakes no obligation to publicly update or revise forward-looking information.</p>\n<p><b>NEITHER TSX VENTURE EXCHANGE NOR ITS REGULATION SERVICES PROVIDER (AS THAT TERM IS DEFINED IN THE POLICIES OF THE TSX VENTURE EXCHANGE) ACCEPTS RESPONSIBILITY FOR THE ADEQUACY OR ACCURACY OF THIS RELEASE.</b></p>\n<p>Photo - <a href=\"https://mma.prnewswire.com/media/2337001/Phoenix_Silver_Project_Location.jpg\" rel=\"nofollow\" target=\"_blank\">https://mma.prnewswire.com/media/2337001/Phoenix_Silver_Project_Location.jpg</a><br></br>Logo - <a href=\"https://mma.prnewswire.com/media/1574720/Silver_One_Logo.jpg?p=original\" rel=\"nofollow\" target=\"_blank\">https://mma.prnewswire.com/media/1574720/Silver_One_Logo.jpg</a></p>\n\n<div class=\"PRN_ImbeddedAssetReference\" id=\"DivAssetPlaceHolder2\">\n                <p>\n                        <a href=\"https://mma.prnewswire.com/media/1574720/Silver_One_Logo.html\" rel=\"nofollow\" target=\"_blank\">\n                    <img alt=\"(PRNewsfoto/Silver One Resources Inc.)\" src=\"https://mma.prnewswire.com/media/1574720/Silver_One_Logo.jpg\" title=\"(PRNewsfoto/Silver One Resources Inc.)\"></img>\n                        </a>\n                </p>\n\n</div>\n\n\n\n\n\n<p id=\"PURL\"><img alt=\"Cision\" height=\"12\" src=\"https://c212.net/c/img/favicon.png?sn=LN32213&amp;sd=2024-02-08\" title=\"Cision\" width=\"12\"></img> View original content to download multimedia:<a href=\"https://www.prnewswire.com/news-releases/silver-one-completes-the-100-acquisition-of-its-phoenix-silver-project-in-arizona-302056849.html\" id=\"PRNURL\" rel=\"nofollow\" target=\"_blank\">https://www.prnewswire.com/news-releases/silver-one-completes-the-100-acquisition-of-its-phoenix-silver-project-in-arizona-302056849.html</a></p>\n<p>SOURCE  Silver One Resources Inc.</p>\n<img alt=\"\" src=\"https://rt.newswire.ca/rt.gif?NewsItemId=C0168&amp;Transmission_Id=202402080015CANADANWCANADAPR_C0168&amp;DateId=20240208\" style=\"border:0px; width:1px; height:1px;\"></img>\n\n",
    "search_terms": "Phoenix ,Silver One Resources Inc.,SVE",
    "master_gid": 5400,
    "date": "2024-02-08T05:15:00.000Z",
    "tags": "|||Copper,Silver|Project Acquisition",
    "image_id": null,
    "hidden": false,
    "company_id": 417,
    "provider": null,
    "excerpt": "VANCOUVER, BC,Feb. 8, 2024/CNW/ --Silver One Resources Inc. (TSXV: SVE) (OTCQX: SLVRF) (FSE: BRK1)(\"Silver One\" or the \"Company\") is pleased to announce that it has exercised its option to acquire a 100% interest in the high-grade Phoenix Silver Project, located within the \"Arizona Silver Belt\". Highlights of Phoenix Silver Project:Phoenix Silver Project",
    "is_regulatory": false,
    "refined_tags": [
      "Project Acquisition"
    ],
    "ftp_filename": null,
    "company_name": "Silver One Resources Inc.",
    "exchange": "TSXV",
    "root_ticker": "SVE",
    "project_name": "Phoenix Silver",
    "gid": 5400,
    "location": "Arizona, United States",
    "plan_id": null,
    "description_text": "VANCOUVER, BC , Feb. 8, 2024 /CNW/ -- Silver One Resources Inc. (TSXV: SVE) (OTCQX: SLVRF) (FSE: BRK1) (\"Silver One\" or the \"Company\") is pleased to announce that it has exercised its option to acquire a 100% interest in the high-grade Phoenix Silver Project, located within the \"Arizona Silver Belt\". Highlights of Phoenix Silver Project: Phoenix Silver Project covers 6,141 hectares along the northern extension of a prolific 30+km long mineralized trend hosting past and current producing silver and copper mines. Permitted for drilling on high-grade silver targets. Very high-grade native silver vein fragments, including a 189 kg (417 lb.) specimen estimated to contain over 70% silver and an 8.5 kg (18.7 lb. ) specimen assaying 459,000 g/t (14,688 oz/t) silver (see news release dated February 20, 2020 ). Greg Crowe , President and CEO of Silver One commented: \"Acquiring a 100% interest in Phoenix Silver represents a rare opportunity in potentially identifying extremely rich silver vein mineralization.  Large angular and unabraded vein fragments were detected by metal detectors and uncovered in overburden within a metre of surface.  These have been interpreted as being near their original source, as silver is very soft and large fragments break apart easily upon transport over even small distances.  One vein fragment weighed 189 kg (417 lb.) and was estimated by specific gravity methods to contain 70% silver.  Assays of smaller fragments returned up to 459,000 g/t (14,688 oz/T) silver (see Company News Release of February 20, 2020 ). A drill permit has been secured to test structures believed to be the host to these very high-grade vein fragments (see Company News Release of March 2 , 2023). The southern portion of the project also hosts regional trending veins and breccia zones, with several selected samples returning over 1% copper.  The property lies to the northeast of Freeport McMoran's copper producing Miami Complex and BHP's Ocelot porphyry copper exploration project.  Phoenix Silver lies at the northeast margin of a 30+ km long porphyry copper and silver belt and has excellent potential to host very high-grade silver mineralization as well as porphyry related copper mineralization.\" In order to acquire a 100% interest in the Phoenix Silver Project, Silver One paid US$350,000 and issued ten million common shares of Silver One over 3 years to the property vendors.  The central portion of the claim block is subject to a 2% NSR, which can be purchased for US$ 1.0 million . Qualified Person The technical content of this news release has been reviewed and approved by Robert M. Cann , P. Geo, a Qualified Person as defined by National Instrument 43-101 and an independent consultant to the Company. About Silver One Silver One is focused on the exploration and development of quality silver projects.  The Company owns a 100%-interest in its flagship project, the past-producing Candelaria Mine located in Nevada.  Potential reprocessing of silver from the historic leach pads at Candelaria provides an opportunity for possible near-term production.  Additional opportunities lie in previously identified high-grade silver intercepts down-dip and potentially increasing the substantive silver mineralization along-strike from the two past-producing open pits. The Company has staked 636 lode claims and entered into a Lease/Purchase Agreement to acquire five patented claims on its Cherokee project located in Lincoln County, Nevada , host to multiple silver-copper-gold vein systems, traced to date for over 11 km along-strike. Silver One owns 100% interest in the Silver Phoenix Project. The Silver Phoenix Project is a very high-grade native silver prospect that lies within the \"Arizona Silver Belt,\" immediately adjacent to the prolific copper producing area of Globe , Arizona. For more information, please contact: Silver One Resources Inc. Gary Lindsey - VP, Investor Relations Phone: 604-974–5274 Mobile : (720) 273-6224 Email : gary@strata-star. com Forward-Looking Statements Information set forth in this news release contains forward-looking statements that are based on assumptions as of the date of this news release. These statements reflect management's current estimates, beliefs, intentions and expectations. They are not guarantees of future performance. Silver One cautions that all forward-looking statements are inherently uncertain, and that actual performance may be affected by a number of material factors, many of which are beyond Silver One's control. Such factors include, among other things: risks and uncertainties relating to Silver One's limited operating history, ability to obtain sufficient financing to carry out its exploration and development objectives on the Candelaria Project, obtaining the necessary permits to carry out its activities and the need to comply with environmental and governmental regulations. Accordingly, actual and future events, conditions and results may differ materially from the estimates, beliefs, intentions and expectations expressed or implied in the forward-looking information. Except as required under applicable securities legislation, Silver One undertakes no obligation to publicly update or revise forward-looking information. NEITHER TSX VENTURE EXCHANGE NOR ITS REGULATION SERVICES PROVIDER (AS THAT TERM IS DEFINED IN THE POLICIES OF THE TSX VENTURE EXCHANGE) ACCEPTS RESPONSIBILITY FOR THE ADEQUACY OR ACCURACY OF THIS RELEASE. Photo - https://mma.prnewswire.com/media/2337001/Phoenix_Silver_Project_Location.jpg Logo - https://mma.prnewswire.com/media/1574720/Silver_One_Logo.jpg View original content to download multimedia: https://www.prnewswire.com/news-releases/silver-one-completes-the-100-acquisition-of-its-phoenix-silver-project-in-arizona-302056849.html SOURCE  Silver One Resources Inc.",
    "primary_commodity": "Ag"
  },
  "articleProject": {
    "gid": 5400,
    "project_name": "Phoenix Silver",
    "location": "Arizona, United States"
  },
  "articleExchange": "TSXV",
  "articleCompanyId": 417,
  "articleTicker": "SVE",
  "articleCompanyName": "Silver One Resources Inc.",
  "allOtherCompanyProjects": [
    {
      "company_id": 417,
      "gid": 5400,
      "project_name": "Phoenix Silver",
      "location": "Arizona, United States"
    },
    {
      "company_id": 417,
      "gid": 767,
      "project_name": "Cherokee",
      "location": "Nevada, USA"
    },
    {
      "company_id": 417,
      "gid": 999,
      "project_name": "Candelaria",
      "location": "Nevada, USA"
    }
  ],
  "allOtherCompanyNews": [
    {
      "id": 103599,
      "company_id": 417,
      "title": "SILVER ONE ANNOUNCES IN-GROUND MINERAL RESOURCE ESTIMATE PREPARED IN ACCORDANCE WITH NI 43-101 ON ITS CANDELARIA PROJECT, NEVADA",
      "link": "https://contentapi.cision.com/api/v1.0/releases/20250506LN79557",
      "date": "2025-05-06T04:15:00.000Z",
      "hidden": false
    },
    {
      "id": 100542,
      "company_id": 417,
      "title": "Silver One Provides Corporate Update on Its Nevada and Arizona Projects, Southwest USA",
      "link": null,
      "date": "2025-04-23T04:15:00.000Z",
      "hidden": false
    },
    {
      "id": 89232,
      "company_id": 417,
      "title": "SILVER ONE PROVIDES UPDATE ON METALLURGICAL TEST RESULTS USING INNOVATIVE SEPARATION AND LEACHING TECHNOLOGIES AT ITS CANDELARIA SILVER MINE, NEVADA",
      "link": "https://contentapi.cision.com/api/v1.0/releases/20250226C7373",
      "date": "2025-02-26T05:15:00.000Z",
      "hidden": false
    },
    {
      "id": 88903,
      "company_id": 417,
      "title": "SILVER ONE RECEIVES FINAL DRILL RESULTS FROM ITS PHOENIX SILVER PROJECT, ARIZONA TRACES SILVER-COPPER BEARING STRUCTURE ALONG STRIKE",
      "link": "https://contentapi.cision.com/api/v1.0/releases/20250224LN25241",
      "date": "2025-02-24T05:15:00.000Z",
      "hidden": false
    },
    {
      "id": 88565,
      "company_id": 417,
      "title": "SILVER ONE'S ZTEM AIRBORNE GEOPHYSICAL SURVEY OUTLINES POTENTIAL PORPHYRY COPPER AND ADDITIONAL SILVER EXPLORATION TARGETS AT PHOENIX SILVER, ARIZONA. NEW CLAIMS STAKED",
      "link": "https://contentapi.cision.com/api/v1.0/releases/20250220LN23399",
      "date": "2025-02-20T05:27:00.000Z",
      "hidden": false
    },
    {
      "id": 74026,
      "company_id": 417,
      "title": "SILVER ONE COMMENCES A ZTEM GEOPHYSICAL SURVEY AT ITS HIGH-GRADE PHOENIX SILVER PROJECT, ARIZONA",
      "link": "https://contentapi.cision.com/api/v1.0/releases/20241008C5867",
      "date": "2024-10-08T04:15:00.000Z",
      "hidden": false
    },
    {
      "id": 73528,
      "company_id": 417,
      "title": "SILVER ONE COMMENCES DRILLING AT ITS HIGH-GRADE PHOENIX SILVER PROJECT, ARIZONA",
      "link": "https://contentapi.cision.com/api/v1.0/releases/20241002LN21199",
      "date": "2024-10-02T04:15:00.000Z",
      "hidden": false
    },
    {
      "id": 71592,
      "company_id": 417,
      "title": "SILVER ONE COMMENCES ROAD AND PAD CONSTRUCTION IN PREPARATION FOR DRILLING AT ITS HIGH-GRADE PHOENIX SILVER PROJECT, ARIZONA",
      "link": "https://contentapi.cision.com/api/v1.0/releases/20240917C6260",
      "date": "2024-09-17T06:56:00.000Z",
      "hidden": false
    },
    {
      "id": 68050,
      "company_id": 417,
      "title": "Silver One to Conduct Airborne Geophysics and Prepares for Drilling on Its Phoenix Silver Project, Arizona",
      "link": "https://www.newsfilecorp.com/release/219546/Silver-One-to-Conduct-Airborne-Geophysics-and-Prepares-for-Drilling-on-Its-Phoenix-Silver-Project-Arizona",
      "date": "2024-08-12T04:15:00.000Z",
      "hidden": false
    },
    {
      "id": 63142,
      "company_id": 417,
      "title": "SILVER ONE CLOSES OVERSUBSCRIBED FINANCING OF $5.9 MILLION",
      "link": "https://contentapi.cision.com/api/v1.0/releases/20240621LN45426",
      "date": "2024-06-21T11:20:00.000Z",
      "hidden": false
    }
  ]
}
