{
  "article": {
    "id": 88565,
    "link": "https://contentapi.cision.com/api/v1.0/releases/20250220LN23399",
    "title": "SILVER ONE'S ZTEM AIRBORNE GEOPHYSICAL SURVEY OUTLINES POTENTIAL PORPHYRY COPPER AND ADDITIONAL SILVER EXPLORATION TARGETS AT PHOENIX SILVER, ARIZONA. NEW CLAIMS STAKED",
    "description": "\n\n<p><span class=\"legendSpanClass\"><span class=\"xn-location\">VANCOUVER, BC</span></span>, <span class=\"legendSpanClass\"><span class=\"xn-chron\">Feb. 20, 2025</span></span> /PRNewswire/ -- <b>Silver One Resources Inc.</b> (TSXV: SVE) (OTCQX: SLVRF) (FSE: BRK1) (\"Silver One\" or the \"Company\") is pleased to announce the completion of the geophysical processing and 3D modelling of helicopter-borne electromagnetic data from the ZTEM survey (Z-Axis Tipper Electromagnetic) conducted in <span class=\"xn-chron\">October 2024</span> at its Phoenix Silver Project located near <span class=\"xn-location\">Globe, Arizona</span> (See company's news release of <span class=\"xn-chron\">October 7, 2024</span> and Figure 1).  The survey and processing were done by Geotech LTD (\"Geotech\").  Geotech's processing, 3D-modelling, and targeting analysis have identified several significant anomalies potentially related to copper and silver mineralization.  Anomalies identified include two priority copper targets and five priority silver targets, all recommended for further exploration (Figure  2).  </p>\n<p>The copper targets in the project (Figures 3 and 4) have geophysical, geochemical and geological features characteristic of porphyry copper deposits.  The project area has a regional setting similar to BHP's Ocelot copper deposit located 5 kilometers to the southwest of Silver One's property.  All occur within a prolific belt of copper producers including Freeport McMoRan's Copper Cities and Miami-Inspiration mining complex, Capstone Copper's Pinto Valley Mine, KGHM's Carlota Mine and Rio Tinto – BHP's Resolution deposit.</p>\n<p>Four of the five silver targets identified by the ZTEM are outside the area hosting the large silver vein fragments that was drilled in the 2024 exploration program (417 area).  Additionally, company geologists have identified a sixth silver target, outside the ZTEM targets, to the north of the 417 area (See Figure 2).  It is defined by a train of numerous (40+) silver nuggets, weighing between a few grams to 9.5 kilograms (20.9 lb), each estimated to contain over 20% silver based on specific gravity calculations. This area strongly warrants follow up exploration.</p>\n<p>Additional claims were staked on the southwest part of the property to completely cover the Defiance geophysical and geochemical Target (see Figures 2 and 5), these claims abut BHP's claims to the south.</p>\n<p><span class=\"xn-person\">Greg Crowe</span>, Silver One's President, CEO and Director, commented, <i>\"The ZTEM has been successful in identifying several anomalies at its Phoenix Silver project.  This includes several silver targets, and two priority conductive areas interpreted as disseminated sulfide mineralization potentially related to an underlying porphyry system.  We are enthusiastic about all these targets.  However, the two potential porphyry related conductive zones are particularly attractive as they are interpreted to be relatively shallow (500 meters to centre of anomaly (Figure 4) and are geophysically similar to the conductive anomaly of BHP/Rio Tinto's Resolution copper deposit.  </i><i>Multiple select samples collected in the vicinity of these two ZTEM anomalies contain highly anomalous copper and silver values (see company's news releases of <span class=\"xn-chron\">December 18, 2023</span>, <span class=\"xn-chron\">May 15, 2024</span> and <span class=\"xn-chron\">June 6, 2024</span>, and Figure 5) and are hosted in polymetallic veins and alteration zones in the southern part of the property.  Silver Phoenix lies at the northeastern margin of a 50+ km long porphyry belt that projects northeastwards beneath Silver One's property.  Several mines and/or prospects occur along this belt, such as Freeport McMoRan's Miami-Inspiration mining complex, BHP's Ocelot porphyry discovery, Rio Tinto and BHP's Resolution deposit and others (see Figure 1).  The proximity to major copper producers and exploration porphyry targets along with excellent prospectivity defined by both geophysics and surface copper and silver samples, makes this project a high priority porphyry exploration target.  Additional silver anomalies add to the already overall exploration potential of Phoenix Silver.\"</i></p>\n<p><i>Figure 1: Phoenix Silver location map showing copper belts of the <span class=\"xn-location\">Miami</span>-<span class=\"xn-location\">Globe</span> porphyry copper district. Major mines and deposits include the Miami-Inspiration mining complex,  BHP's Ocelot discovery area and Rio Tinto/BHP's Resolution copper deposit.  Blue contours are regional magnetic (MVI – contour interval 0.0002 SI) anomalies which are spatially coincident with the mineral belts of the <span class=\"xn-location\">Miami</span>-<span class=\"xn-location\">Globe</span> copper district.</i></p>\n<div class=\"PRN_ImbeddedAssetReference\" id=\"DivAssetPlaceHolder2302\"><p><a href=\"https://mma.prnewswire.com/media/2624122/Silver_One_Resources.html\" rel=\"nofollow\" target=\"_blank\"><img alt=\"Figure 1 - Phoenix Silver location map showing copper belts of the Miami-Globe porphyry copper district. Major mines and deposits include the Miami-Inspiration mining complex,  BHP's Ocelot discovery area and Rio Tinto/BHP's Resolution copper deposit.  Blue contours are regional magnetic (MVI - contour interval 0.0002 SI) anomalies which are spatially coincident with the mineral belts of the Miami-Globe copper district.\" src=\"https://mma.prnewswire.com/media/2624122/Silver_One_Resources.jpg?p=original\" title=\"Figure 1 - Phoenix Silver location map showing copper belts of the Miami-Globe porphyry copper district. Major mines and deposits include the Miami-Inspiration mining complex,  BHP's Ocelot discovery area and Rio Tinto/BHP's Resolution copper deposit.  Blue contours are regional magnetic (MVI - contour interval 0.0002 SI) anomalies which are spatially coincident with the mineral belts of the Miami-Globe copper district.\"></img></a></p>\n</div><p>Photo: <a href=\"https://mma.prnewswire.com/media/2624122/Silver_One_Resources.jpg\" rel=\"nofollow\" target=\"_blank\">https://mma.prnewswire.com/media/2624122/Silver_One_Resources.jpg</a></p>\n<p> </p>\n<p><i>Figure 2.  Silver targets (PS1 to PS5 and Nuggets North) over the ZTEM3D <span class=\"xn-money\">-300 m</span> resistivity depth slice. Dashed black circles show the priority porphyry targets (Defiance and Quartz Ridge \"QR\") for reference. Copper values shown are from select rock samples.</i></p>\n<div class=\"PRN_ImbeddedAssetReference\" id=\"DivAssetPlaceHolder3172\"><p><a href=\"https://mma.prnewswire.com/media/2624123/Silver_One_Resources.html\" rel=\"nofollow\" target=\"_blank\"><img alt=\"Figure 2 - Silver targets (PS1 to PS5 and Nuggets North) over the ZTEM3D -300 m resistivity depth slice. Dashed black circles show the priority porphyry targets (Defiance and Quartz Ridge &quot;QR&quot;) for reference. Copper values shown are from select rock samples.\" src=\"https://mma.prnewswire.com/media/2624123/Silver_One_Resources.jpg?p=original\" title=\"Figure 2 - Silver targets (PS1 to PS5 and Nuggets North) over the ZTEM3D -300 m resistivity depth slice. Dashed black circles show the priority porphyry targets (Defiance and Quartz Ridge &quot;QR&quot;) for reference. Copper values shown are from select rock samples.\"></img></a></p>\n</div><p>Photo: <a href=\"https://mma.prnewswire.com/media/2624123/Silver_One_Resources.jpg\" rel=\"nofollow\" target=\"_blank\">https://mma.prnewswire.com/media/2624123/Silver_One_Resources.jpg</a></p>\n<p><b>Porphyry Copper Targets</b></p>\n<p>The priority copper exploration targets consist of:  1) near circular magnetic anomalies defined by relative magnetic lows surrounded by relatively high magnetization halos and: 2) resistivity lows near the center of sub-circular shaped magnetic anomalies.  Priority copper targets, named Defiance and Quartz Ridge (\"QR\") in Figure 3 and respective sections are in Figure 4.</p>\n<p>Resistivity lows can occur where increased concentrations of conductive metals in the geological formations provide less resistance to electromagnetic fields.  Other significant attributes include magnetic lows due to magnetite destruction, often caused by hydrothermal alteration or due to the low magnetite content of syn-genetic Laramide intrusions that are often associated with many of the porphyry deposits in <span class=\"xn-location\">Arizona</span> (Brant, 1966, Geophysics in the exploration for <span class=\"xn-location\">Arizona</span> porphyry coppers, in Titley, S.R., and Hicks C.L. eds., Geology of the porphyry copper deposits, southwestern <span class=\"xn-location\">North America</span>: <span class=\"xn-location\">Tucson</span>, <span class=\"xn-org\">University of Arizona</span> Press, p87-110 ), as is the case in the <span class=\"xn-location\">Morenci</span> copper mine 130 km southeast of <span class=\"xn-location\">Globe, Arizona</span>.</p>\n<p><i>Figure 3: <b>Left.</b> 3D Magnetic Vector Inversion (MVI Amplitude) 300 meter depth. Note copper targets in black  dashed line defined by a magnetic low surrounded by a relatively high magnetic halo. <b>Right.</b> 3D-ZTEM resistivity inversion 500 meters depth: the red and light-red ovals within the magnetic lows represent conductive zones potentially associated to copper sulfides.  Defiance and QR targets are </i><i>4 and 8 square kilometers in size, respectively</i><i>.  North-South sections on these porphyry targets are shown in Figure 4.</i></p>\n<div class=\"PRN_ImbeddedAssetReference\" id=\"DivAssetPlaceHolder9685\"><p><a href=\"https://mma.prnewswire.com/media/2624124/Silver_One_Resources.html\" rel=\"nofollow\" target=\"_blank\"><img alt=\"Figure 3 - Left. 3D Magnetic Vector Inversion (MVI Amplitude) 300 meter depth. Note copper targets in black  dashed line defined by a magnetic low surrounded by a relatively high magnetic halo. Right. 3D-ZTEM resistivity inversion 500 meters depth: the red and light-red ovals within the magnetic lows represent conductive zones potentially associated to copper sulfides.  Defiance and QR targets are 4 and 8 square kilometers in size, respectively.  North-South sections on these porphyry targets are shown in Figure 4.\" src=\"https://mma.prnewswire.com/media/2624124/Silver_One_Resources.jpg?p=original\" title=\"Figure 3 - Left. 3D Magnetic Vector Inversion (MVI Amplitude) 300 meter depth. Note copper targets in black  dashed line defined by a magnetic low surrounded by a relatively high magnetic halo. Right. 3D-ZTEM resistivity inversion 500 meters depth: the red and light-red ovals within the magnetic lows represent conductive zones potentially associated to copper sulfides.  Defiance and QR targets are 4 and 8 square kilometers in size, respectively.  North-South sections on these porphyry targets are shown in Figure 4.\"></img></a></p>\n</div><p>Photo: <a href=\"https://mma.prnewswire.com/media/2624124/Silver_One_Resources.jpg\" rel=\"nofollow\" target=\"_blank\">https://mma.prnewswire.com/media/2624124/Silver_One_Resources.jpg</a></p>\n<p> </p>\n<p><i>Figure 4: <b>Left</b>. ZTEM3D resistivity section of L1050 over the Defiance porphyry target. <b>Right</b>. ZTEM3D resistivity section of L1240 over the QR porphyry target. Both sections are looking west, showing the approximate depth to the center and lateral size of the conductor.  See figure above for sections location.</i></p>\n<div class=\"PRN_ImbeddedAssetReference\" id=\"DivAssetPlaceHolder1529\"><p><a href=\"https://mma.prnewswire.com/media/2624125/Silver_One_Resources.html\" rel=\"nofollow\" target=\"_blank\"><img alt=\"Figure 4 - Left. ZTEM3D resistivity section of L1050 over the Defiance porphyry target. Right. ZTEM3D resistivity section of L1240 over the QR porphyry target. Both sections are looking west, showing the approximate depth to the center and lateral size of the conductor.  See figure above for sections location.\" src=\"https://mma.prnewswire.com/media/2624125/Silver_One_Resources.jpg?p=original\" title=\"Figure 4 - Left. ZTEM3D resistivity section of L1050 over the Defiance porphyry target. Right. ZTEM3D resistivity section of L1240 over the QR porphyry target. Both sections are looking west, showing the approximate depth to the center and lateral size of the conductor.  See figure above for sections location.\"></img></a></p>\n</div><p>Photo: <a href=\"https://mma.prnewswire.com/media/2624125/Silver_One_Resources.jpg\" rel=\"nofollow\" target=\"_blank\">https://mma.prnewswire.com/media/2624125/Silver_One_Resources.jpg</a></p>\n<p> </p>\n<p><i>Figure 5.  Rock geochemistry map showing silver and copper values.  Assays of select copper samples are highlighted by the corresponding labels. The blue polygon shows the new claims staked in the southwest part of the property.</i></p>\n<div class=\"PRN_ImbeddedAssetReference\" id=\"DivAssetPlaceHolder7248\"><p><a href=\"https://mma.prnewswire.com/media/2624126/Silver_One_Resources.html\" rel=\"nofollow\" target=\"_blank\"><img alt=\"Figure 5 - Rock geochemistry map showing silver and copper values.  Assays of select copper samples are highlighted by the corresponding labels. The blue polygon shows the new claims staked in the southwest part of the property.\" src=\"https://mma.prnewswire.com/media/2624126/Silver_One_Resources.jpg?p=original\" title=\"Figure 5 - Rock geochemistry map showing silver and copper values.  Assays of select copper samples are highlighted by the corresponding labels. The blue polygon shows the new claims staked in the southwest part of the property.\"></img></a></p>\n</div><p>Photo: <a href=\"https://mma.prnewswire.com/media/2624126/Silver_One_Resources.jpg\" rel=\"nofollow\" target=\"_blank\">https://mma.prnewswire.com/media/2624126/Silver_One_Resources.jpg</a></p>\n<p>Previous exploration work at Phoenix Silver, including geologic mapping, sampling, and drone-borne magnetometry, has identified features possibly associated with the tops of porphyry copper systems.  These include felsic dikes, mineralized polymetallic (silver-copper-lead-zinc) veins, alteration zones, and structures that occur proximal to the ZTEM anomalies (see Figure 6).</p>\n<p>Felsic dikes are interpreted to be possibly connected to intrusions at depth, which may be related to potential mineralization sources.  Vein mineralization discovered in various parts of the property is interpreted as leakage into outcropping rocks and can be a surface manifestation of deeper porphyry systems.  Multiple select samples collected in the property returned highly anomalous values, some  exceeding 7% copper and over 1 kg/ton silver, with locally abundant lead and zinc (See Figure 5 and Company's news release of <span class=\"xn-chron\">May 15</span> and <span class=\"xn-chron\">June 16</span>, 2024). </p>\n<p>Prospective northeast lineaments are identified by the ZTEM data across the property, notably those traversing the Defiance and QR priority targets (see Figure 6).  These lineaments are important as they are aligned with the regional, northeast-oriented, deep-seated structures that control the mineralization of porphyry deposits along the <span class=\"xn-location\">Globe</span> area, Resolution - Miami-Inspiration copper belt.</p>\n<p><i>Figure 6: <b>Left.</b> Total magnetic intensity map showing additional copper targets.  Red shaded areas are magnetic highs interpreted as potential intrusive rocks at depth.  <b>Right.</b> 2D ZTEM resistivity inversion <span class=\"xn-money\">600 m</span> depth showing northeast oriented lineaments which are part of the northeast extension of the <span class=\"xn-location\">Globe</span>-Miami-Inspiration porphyry belt</i><i>.</i></p>\n<div class=\"PRN_ImbeddedAssetReference\" id=\"DivAssetPlaceHolder9076\"><p><a href=\"https://mma.prnewswire.com/media/2624127/Silver_One_Resources.html\" rel=\"nofollow\" target=\"_blank\"><img alt=\"Figure 6 - Left. Total magnetic intensity map showing additional copper targets.  Red shaded areas are magnetic highs interpreted as potential intrusive rocks at depth.  Right. 2D ZTEM resistivity inversion 600 m depth showing northeast oriented lineaments which are part of the northeast extension of the Globe-Miami-Inspiration porphyry belt.\" src=\"https://mma.prnewswire.com/media/2624127/Silver_One_Resources.jpg?p=original\" title=\"Figure 6 - Left. Total magnetic intensity map showing additional copper targets.  Red shaded areas are magnetic highs interpreted as potential intrusive rocks at depth.  Right. 2D ZTEM resistivity inversion 600 m depth showing northeast oriented lineaments which are part of the northeast extension of the Globe-Miami-Inspiration porphyry belt.\"></img></a></p>\n</div><p>Photo: <a href=\"https://mma.prnewswire.com/media/2624127/Silver_One_Resources.jpg\" rel=\"nofollow\" target=\"_blank\">https://mma.prnewswire.com/media/2624127/Silver_One_Resources.jpg</a></p>\n<p>Additional porphyry targets were identified with the 2D inversion of the drone-borne magnetic data (see Figure 6 (left), and company's news releases of <span class=\"xn-chron\">May 15</span> and <span class=\"xn-chron\">June 6</span>, 2024).  Targets DB1, DB3 and DB6 are located peripheral to the ZTEM priority targets.  Target DB4 underlies the 417 area where numerous silver fragments, including a 417 pound fragment, were found.  Target DB5 is in the northern part of the property under thick alluvial cover.  These targets are interpreted to be at a depth of six hundred meters.</p>\n<p><b>Silver Targets</b></p>\n<p>Five priority silver targets were identified using Geotech's S<sup>3 </sup>targeting algorithm (see PS1 to PS5 target locations in Figure 2).  The algorithm combines the analysis of:  1) structural data (known and inferred faults/contacts and magnetic ridges); 2) self organizing map (SOM), which includes ZTEM3D inversion resistivity data, and products derived from the structural analysis and;  3) Supervised Deep Neural Network (SDNN), which focuses on  mine sites and major showings that altogether produce predictive probabilities in the selection of targets.</p>\n<p>All the targets identified are located in resistive zones either surrounded or flanked by conductive zones or trends that are interpreted to occur within three hundred meters from the surface.  None of these areas have been mapped or sampled in detail and will require further exploration.</p>\n<p>Except for the target labeled PS1 on Figure 2, all the silver targets identified by the ZTEM are outside the 417 area hosting the large silver vein fragments that was drilled in the 2024 drill program.  Company geologists have also identified a more northerly area of silver nuggets called \"Nuggets North\" (see Figure 2).    This zone is defined  by a kilometer-long  train of numerous (40+) silver nuggets ranging in size from one centimeter to 20 centimeters and weighing from a few grams up to 9.5 kilograms.  This represents a high-priority  exploration target.</p>\n<p>Phoenix Silver is an exceptional exploration property.  Not only does it host multiple silver exploration targets, but it is also marginal to and along the trend of a major porphyry copper-silver belt.  It also has numerous promising geophysical and geochemical targets identified within its property boundaries.</p>\n<p><b><i>Qualified Person</i></b></p>\n<p>The technical content of this news release has been reviewed and approved by Robert M. Cann, P. Geo, a Qualified Person as defined by National Instrument 43-101 and an independent consultant to the Company.</p>\n<p><b><i>About Silver One</i></b></p>\n<p>Silver One is focused on the exploration and development of quality silver projects.  The Company holds 100% interest in its flagship project, the past-producing Candelaria Mine located in Nevada.  Potential reprocessing of silver from the historic leach pads at Candelaria provides an opportunity for possible near-term production.  Additional opportunities lie in previously identified high-grade silver intercepts down-dip and potentially increasing the substantive silver mineralization along-strike from the two past-producing open pits.</p>\n<p>The Company owns 636 lode claims and five patented claims on its Cherokee project located in <span class=\"xn-location\">Lincoln County, Nevada</span>, host to multiple silver-copper-gold vein systems, traced to date for over 11 km along-strike.</p>\n<p>Silver One also owns a 100% interest in the Silver Phoenix Project. The Silver Phoenix Project is a very high-grade native silver prospect that lies within the \"Arizona Silver Belt,\" immediately adjacent to the prolific copper producing area of <span class=\"xn-location\">Globe</span>, Arizona. </p>\n<p>For more information, please contact:</p>\n<p>Silver One Resources Inc.<br></br><span class=\"xn-person\">Gary Lindsey</span> - VP, Investor Relations<br></br>Phone: 604-974‐5274<br></br>Mobile : (720) 273-6224<br></br>Email :  <a href=\"mailto:gary@strata-star.com\" rel=\"nofollow\" target=\"_blank\">gary@strata-star.com</a> </p>\n<p><b><i>Forward-Looking Statements</i></b></p>\n<p>Information set forth in this news release contains forward-looking statements that are based on assumptions as of the date of this news release. These statements reflect management's current estimates, beliefs, intentions and expectations. They are not guarantees of future performance. Silver One cautions that all forward-looking statements are inherently uncertain, and that actual performance may be affected by a number of material factors, many of which are beyond Silver One's control. Such factors include, among other things: risks and uncertainties relating to Silver One's limited operating history, ability to obtain sufficient financing to carry out its exploration and development objectives on the Candelaria Project, obtaining the necessary permits to carry out its activities and the need to comply with environmental and governmental regulations. Accordingly, actual and future events, conditions and results may differ materially from the estimates, beliefs, intentions and expectations expressed or implied in the forward-looking information. Except as required under applicable securities legislation, Silver One undertakes no obligation to publicly update or revise forward-looking information.</p>\n<p><b>NEITHER TSX VENTURE EXCHANGE NOR ITS REGULATION SERVICES PROVIDER (AS THAT TERM IS DEFINED IN THE POLICIES OF THE TSX VENTURE EXCHANGE) ACCEPTS RESPONSIBILITY FOR THE ADEQUACY OR ACCURACY OF THIS RELEASE. </b></p>\n\n<div class=\"PRN_ImbeddedAssetReference\" id=\"DivAssetPlaceHolder0\">\n</div>\n\n\n\n\n\n<p id=\"PURL\"><img alt=\"Cision\" height=\"12\" src=\"https://c212.net/c/img/favicon.png?sn=LN23399&amp;sd=2025-02-20\" title=\"Cision\" width=\"12\"></img> View original content to download multimedia:<a href=\"https://www.prnewswire.com/news-releases/silver-ones-ztem-airborne-geophysical-survey-outlines-potential-porphyry-copper-and-additional-silver-exploration-targets-at-phoenix-silver-arizona-new-claims-staked-302381107.html\" id=\"PRNURL\" rel=\"nofollow\" target=\"_blank\">https://www.prnewswire.com/news-releases/silver-ones-ztem-airborne-geophysical-survey-outlines-potential-porphyry-copper-and-additional-silver-exploration-targets-at-phoenix-silver-arizona-new-claims-staked-302381107.html</a></p>\n<p>SOURCE  Silver One Resources Inc.</p>\n\n<img alt=\"\" src=\"https://rt.prnewswire.com/rt.gif?NewsItemId=LN23399&amp;Transmission_Id=202502200015PR_NEWS_USPR_____LN23399&amp;DateId=20250220\" style=\"border:0px; width:1px; height:1px;\"></img>\n",
    "search_terms": "Phoenix Silver,Silver One Resources Inc.,SVE",
    "master_gid": 5400,
    "date": "2025-02-20T05:27:00.000Z",
    "tags": "USA|Arizona||Copper,Silver|Exploration update,Geophysical Survey,Project Acquisition",
    "image_id": null,
    "hidden": false,
    "company_id": 417,
    "provider": "cision",
    "excerpt": "VANCOUVER, BC,Feb. 20, 2025/PRNewswire/ --Silver One Resources Inc.(TSXV: SVE) (OTCQX: SLVRF) (FSE: BRK1) (\"Silver One\" or the \"Company\") is pleased to announce the completion of the geophysical processing and 3D modelling of helicopter-borne electromagnetic data from the ZTEM survey (Z-Axis Tipper Electromagnetic) conducted inOctober 2024at its Phoenix Silver Project located nearGlobe, Arizona(See company's",
    "is_regulatory": false,
    "refined_tags": [],
    "ftp_filename": null,
    "company_name": "Silver One Resources Inc.",
    "exchange": "TSXV",
    "root_ticker": "SVE",
    "project_name": "Phoenix Silver",
    "gid": 5400,
    "location": "Arizona, United States",
    "plan_id": null,
    "description_text": "VANCOUVER, BC , Feb. 20, 2025 /PRNewswire/ -- Silver One Resources Inc. (TSXV: SVE) (OTCQX: SLVRF) (FSE: BRK1) (\"Silver One\" or the \"Company\") is pleased to announce the completion of the geophysical processing and 3D modelling of helicopter-borne electromagnetic data from the ZTEM survey (Z-Axis Tipper Electromagnetic) conducted in October 2024 at its Phoenix Silver Project located near Globe, Arizona (See company's news release of October 7, 2024 and Figure 1).  The survey and processing were done by Geotech LTD (\"Geotech\").  Geotech's processing, 3D-modelling, and targeting analysis have identified several significant anomalies potentially related to copper and silver mineralization.  Anomalies identified include two priority copper targets and five priority silver targets, all recommended for further exploration (Figure  2). The copper targets in the project (Figures 3 and 4) have geophysical, geochemical and geological features characteristic of porphyry copper deposits.  The project area has a regional setting similar to BHP's Ocelot copper deposit located 5 kilometers to the southwest of Silver One's property.  All occur within a prolific belt of copper producers including Freeport McMoRan's Copper Cities and Miami-Inspiration mining complex, Capstone Copper's Pinto Valley Mine, KGHM's Carlota Mine and Rio Tinto – BHP's Resolution deposit. Four of the five silver targets identified by the ZTEM are outside the area hosting the large silver vein fragments that was drilled in the 2024 exploration program (417 area).  Additionally, company geologists have identified a sixth silver target, outside the ZTEM targets, to the north of the 417 area (See Figure 2).  It is defined by a train of numerous (40+) silver nuggets, weighing between a few grams to 9.5 kilograms (20.9 lb), each estimated to contain over 20% silver based on specific gravity calculations. This area strongly warrants follow up exploration. Additional claims were staked on the southwest part of the property to completely cover the Defiance geophysical and geochemical Target (see Figures 2 and 5), these claims abut BHP's claims to the south. Greg Crowe , Silver One's President, CEO and Director, commented, \"The ZTEM has been successful in identifying several anomalies at its Phoenix Silver project.  This includes several silver targets, and two priority conductive areas interpreted as disseminated sulfide mineralization potentially related to an underlying porphyry system.  We are enthusiastic about all these targets.  However, the two potential porphyry related conductive zones are particularly attractive as they are interpreted to be relatively shallow (500 meters to centre of anomaly (Figure 4) and are geophysically similar to the conductive anomaly of BHP/Rio Tinto's Resolution copper deposit. Multiple select samples collected in the vicinity of these two ZTEM anomalies contain highly anomalous copper and silver values (see company's news releases of December 18, 2023 , May 15, 2024 and June 6, 2024 , and Figure 5) and are hosted in polymetallic veins and alteration zones in the southern part of the property.  Silver Phoenix lies at the northeastern margin of a 50+ km long porphyry belt that projects northeastwards beneath Silver One's property.  Several mines and/or prospects occur along this belt, such as Freeport McMoRan's Miami-Inspiration mining complex, BHP's Ocelot porphyry discovery, Rio Tinto and BHP's Resolution deposit and others (see Figure 1).  The proximity to major copper producers and exploration porphyry targets along with excellent prospectivity defined by both geophysics and surface copper and silver samples, makes this project a high priority porphyry exploration target.  Additional silver anomalies add to the already overall exploration potential of Phoenix Silver.\" Figure 1: Phoenix Silver location map showing copper belts of the Miami - Globe porphyry copper district. Major mines and deposits include the Miami-Inspiration mining complex,  BHP's Ocelot discovery area and Rio Tinto/BHP's Resolution copper deposit.  Blue contours are regional magnetic (MVI – contour interval 0.0002 SI) anomalies which are spatially coincident with the mineral belts of the Miami - Globe copper district. Photo: https://mma.prnewswire.com/media/2624122/Silver_One_Resources.jpg Figure 2.  Silver targets (PS1 to PS5 and Nuggets North) over the ZTEM3D -300 m resistivity depth slice. Dashed black circles show the priority porphyry targets (Defiance and Quartz Ridge \"QR\") for reference. Copper values shown are from select rock samples. Photo: https://mma.prnewswire.com/media/2624123/Silver_One_Resources.jpg Porphyry Copper Targets The priority copper exploration targets consist of:  1) near circular magnetic anomalies defined by relative magnetic lows surrounded by relatively high magnetization halos and: 2) resistivity lows near the center of sub-circular shaped magnetic anomalies.  Priority copper targets, named Defiance and Quartz Ridge (\"QR\") in Figure 3 and respective sections are in Figure 4. Resistivity lows can occur where increased concentrations of conductive metals in the geological formations provide less resistance to electromagnetic fields.  Other significant attributes include magnetic lows due to magnetite destruction, often caused by hydrothermal alteration or due to the low magnetite content of syn-genetic Laramide intrusions that are often associated with many of the porphyry deposits in Arizona (Brant, 1966, Geophysics in the exploration for Arizona porphyry coppers, in Titley, S.R., and Hicks C.L. eds., Geology of the porphyry copper deposits, southwestern North America : Tucson , University of Arizona Press, p87-110 ), as is the case in the Morenci copper mine 130 km southeast of Globe, Arizona . Figure 3: Left. 3D Magnetic Vector Inversion (MVI Amplitude) 300 meter depth. Note copper targets in black  dashed line defined by a magnetic low surrounded by a relatively high magnetic halo. Right. 3D-ZTEM resistivity inversion 500 meters depth: the red and light-red ovals within the magnetic lows represent conductive zones potentially associated to copper sulfides.  Defiance and QR targets are 4 and 8 square kilometers in size, respectively .  North-South sections on these porphyry targets are shown in Figure 4. Photo: https://mma.prnewswire.com/media/2624124/Silver_One_Resources.jpg Figure 4: Left . ZTEM3D resistivity section of L1050 over the Defiance porphyry target. Right . ZTEM3D resistivity section of L1240 over the QR porphyry target. Both sections are looking west, showing the approximate depth to the center and lateral size of the conductor.  See figure above for sections location. Photo: https://mma.prnewswire.com/media/2624125/Silver_One_Resources.jpg Figure 5.  Rock geochemistry map showing silver and copper values.  Assays of select copper samples are highlighted by the corresponding labels. The blue polygon shows the new claims staked in the southwest part of the property. Photo: https://mma.prnewswire.com/media/2624126/Silver_One_Resources.jpg Previous exploration work at Phoenix Silver, including geologic mapping, sampling, and drone-borne magnetometry, has identified features possibly associated with the tops of porphyry copper systems.  These include felsic dikes, mineralized polymetallic (silver-copper-lead-zinc) veins, alteration zones, and structures that occur proximal to the ZTEM anomalies (see Figure 6). Felsic dikes are interpreted to be possibly connected to intrusions at depth, which may be related to potential mineralization sources.  Vein mineralization discovered in various parts of the property is interpreted as leakage into outcropping rocks and can be a surface manifestation of deeper porphyry systems.  Multiple select samples collected in the property returned highly anomalous values, some  exceeding 7% copper and over 1 kg/ton silver, with locally abundant lead and zinc (See Figure 5 and Company's news release of May 15 and June 16 , 2024). Prospective northeast lineaments are identified by the ZTEM data across the property, notably those traversing the Defiance and QR priority targets (see Figure 6).  These lineaments are important as they are aligned with the regional, northeast-oriented, deep-seated structures that control the mineralization of porphyry deposits along the Globe area, Resolution - Miami-Inspiration copper belt. Figure 6: Left. Total magnetic intensity map showing additional copper targets.  Red shaded areas are magnetic highs interpreted as potential intrusive rocks at depth. Right. 2D ZTEM resistivity inversion 600 m depth showing northeast oriented lineaments which are part of the northeast extension of the Globe -Miami-Inspiration porphyry belt . Photo: https://mma.prnewswire.com/media/2624127/Silver_One_Resources.jpg Additional porphyry targets were identified with the 2D inversion of the drone-borne magnetic data (see Figure 6 (left), and company's news releases of May 15 and June 6 , 2024).  Targets DB1, DB3 and DB6 are located peripheral to the ZTEM priority targets.  Target DB4 underlies the 417 area where numerous silver fragments, including a 417 pound fragment, were found.  Target DB5 is in the northern part of the property under thick alluvial cover.  These targets are interpreted to be at a depth of six hundred meters. Silver Targets Five priority silver targets were identified using Geotech's S 3 targeting algorithm (see PS1 to PS5 target locations in Figure 2).  The algorithm combines the analysis of:  1) structural data (known and inferred faults/contacts and magnetic ridges); 2) self organizing map (SOM), which includes ZTEM3D inversion resistivity data, and products derived from the structural analysis and;  3) Supervised Deep Neural Network (SDNN), which focuses on  mine sites and major showings that altogether produce predictive probabilities in the selection of targets. All the targets identified are located in resistive zones either surrounded or flanked by conductive zones or trends that are interpreted to occur within three hundred meters from the surface.  None of these areas have been mapped or sampled in detail and will require further exploration. Except for the target labeled PS1 on Figure 2, all the silver targets identified by the ZTEM are outside the 417 area hosting the large silver vein fragments that was drilled in the 2024 drill program.  Company geologists have also identified a more northerly area of silver nuggets called \"Nuggets North\" (see Figure 2).    This zone is defined  by a kilometer-long  train of numerous (40+) silver nuggets ranging in size from one centimeter to 20 centimeters and weighing from a few grams up to 9.5 kilograms.  This represents a high-priority  exploration target. Phoenix Silver is an exceptional exploration property.  Not only does it host multiple silver exploration targets, but it is also marginal to and along the trend of a major porphyry copper-silver belt.  It also has numerous promising geophysical and geochemical targets identified within its property boundaries. Qualified Person The technical content of this news release has been reviewed and approved by Robert M. Cann, P. Geo, a Qualified Person as defined by National Instrument 43-101 and an independent consultant to the Company. About Silver One Silver One is focused on the exploration and development of quality silver projects.  The Company holds 100% interest in its flagship project, the past-producing Candelaria Mine located in Nevada.  Potential reprocessing of silver from the historic leach pads at Candelaria provides an opportunity for possible near-term production.  Additional opportunities lie in previously identified high-grade silver intercepts down-dip and potentially increasing the substantive silver mineralization along-strike from the two past-producing open pits. The Company owns 636 lode claims and five patented claims on its Cherokee project located in Lincoln County, Nevada , host to multiple silver-copper-gold vein systems, traced to date for over 11 km along-strike. Silver One also owns a 100% interest in the Silver Phoenix Project. The Silver Phoenix Project is a very high-grade native silver prospect that lies within the \"Arizona Silver Belt,\" immediately adjacent to the prolific copper producing area of Globe , Arizona. For more information, please contact: Silver One Resources Inc. Gary Lindsey - VP, Investor Relations Phone: 604-974‐5274 Mobile : (720) 273-6224 Email : gary@strata-star.com Forward-Looking Statements Information set forth in this news release contains forward-looking statements that are based on assumptions as of the date of this news release. These statements reflect management's current estimates, beliefs, intentions and expectations. They are not guarantees of future performance. Silver One cautions that all forward-looking statements are inherently uncertain, and that actual performance may be affected by a number of material factors, many of which are beyond Silver One's control. Such factors include, among other things: risks and uncertainties relating to Silver One's limited operating history, ability to obtain sufficient financing to carry out its exploration and development objectives on the Candelaria Project, obtaining the necessary permits to carry out its activities and the need to comply with environmental and governmental regulations. Accordingly, actual and future events, conditions and results may differ materially from the estimates, beliefs, intentions and expectations expressed or implied in the forward-looking information. Except as required under applicable securities legislation, Silver One undertakes no obligation to publicly update or revise forward-looking information. NEITHER TSX VENTURE EXCHANGE NOR ITS REGULATION SERVICES PROVIDER (AS THAT TERM IS DEFINED IN THE POLICIES OF THE TSX VENTURE EXCHANGE) ACCEPTS RESPONSIBILITY FOR THE ADEQUACY OR ACCURACY OF THIS RELEASE. View original content to download multimedia: https://www.prnewswire.com/news-releases/silver-ones-ztem-airborne-geophysical-survey-outlines-potential-porphyry-copper-and-additional-silver-exploration-targets-at-phoenix-silver-arizona-new-claims-staked-302381107.html SOURCE  Silver One Resources Inc.",
    "primary_commodity": "Ag"
  },
  "articleProject": {
    "gid": 5400,
    "project_name": "Phoenix Silver",
    "location": "Arizona, United States"
  },
  "articleExchange": "TSXV",
  "articleCompanyId": 417,
  "articleTicker": "SVE",
  "articleCompanyName": "Silver One Resources Inc.",
  "allOtherCompanyProjects": [
    {
      "company_id": 417,
      "gid": 5400,
      "project_name": "Phoenix Silver",
      "location": "Arizona, United States"
    },
    {
      "company_id": 417,
      "gid": 767,
      "project_name": "Cherokee",
      "location": "Nevada, USA"
    },
    {
      "company_id": 417,
      "gid": 999,
      "project_name": "Candelaria",
      "location": "Nevada, USA"
    }
  ],
  "allOtherCompanyNews": [
    {
      "id": 103599,
      "company_id": 417,
      "title": "SILVER ONE ANNOUNCES IN-GROUND MINERAL RESOURCE ESTIMATE PREPARED IN ACCORDANCE WITH NI 43-101 ON ITS CANDELARIA PROJECT, NEVADA",
      "link": "https://contentapi.cision.com/api/v1.0/releases/20250506LN79557",
      "date": "2025-05-06T04:15:00.000Z",
      "hidden": false
    },
    {
      "id": 100542,
      "company_id": 417,
      "title": "Silver One Provides Corporate Update on Its Nevada and Arizona Projects, Southwest USA",
      "link": null,
      "date": "2025-04-23T04:15:00.000Z",
      "hidden": false
    },
    {
      "id": 89232,
      "company_id": 417,
      "title": "SILVER ONE PROVIDES UPDATE ON METALLURGICAL TEST RESULTS USING INNOVATIVE SEPARATION AND LEACHING TECHNOLOGIES AT ITS CANDELARIA SILVER MINE, NEVADA",
      "link": "https://contentapi.cision.com/api/v1.0/releases/20250226C7373",
      "date": "2025-02-26T05:15:00.000Z",
      "hidden": false
    },
    {
      "id": 88903,
      "company_id": 417,
      "title": "SILVER ONE RECEIVES FINAL DRILL RESULTS FROM ITS PHOENIX SILVER PROJECT, ARIZONA TRACES SILVER-COPPER BEARING STRUCTURE ALONG STRIKE",
      "link": "https://contentapi.cision.com/api/v1.0/releases/20250224LN25241",
      "date": "2025-02-24T05:15:00.000Z",
      "hidden": false
    },
    {
      "id": 88565,
      "company_id": 417,
      "title": "SILVER ONE'S ZTEM AIRBORNE GEOPHYSICAL SURVEY OUTLINES POTENTIAL PORPHYRY COPPER AND ADDITIONAL SILVER EXPLORATION TARGETS AT PHOENIX SILVER, ARIZONA. NEW CLAIMS STAKED",
      "link": "https://contentapi.cision.com/api/v1.0/releases/20250220LN23399",
      "date": "2025-02-20T05:27:00.000Z",
      "hidden": false
    },
    {
      "id": 74026,
      "company_id": 417,
      "title": "SILVER ONE COMMENCES A ZTEM GEOPHYSICAL SURVEY AT ITS HIGH-GRADE PHOENIX SILVER PROJECT, ARIZONA",
      "link": "https://contentapi.cision.com/api/v1.0/releases/20241008C5867",
      "date": "2024-10-08T04:15:00.000Z",
      "hidden": false
    },
    {
      "id": 73528,
      "company_id": 417,
      "title": "SILVER ONE COMMENCES DRILLING AT ITS HIGH-GRADE PHOENIX SILVER PROJECT, ARIZONA",
      "link": "https://contentapi.cision.com/api/v1.0/releases/20241002LN21199",
      "date": "2024-10-02T04:15:00.000Z",
      "hidden": false
    },
    {
      "id": 71592,
      "company_id": 417,
      "title": "SILVER ONE COMMENCES ROAD AND PAD CONSTRUCTION IN PREPARATION FOR DRILLING AT ITS HIGH-GRADE PHOENIX SILVER PROJECT, ARIZONA",
      "link": "https://contentapi.cision.com/api/v1.0/releases/20240917C6260",
      "date": "2024-09-17T06:56:00.000Z",
      "hidden": false
    },
    {
      "id": 68050,
      "company_id": 417,
      "title": "Silver One to Conduct Airborne Geophysics and Prepares for Drilling on Its Phoenix Silver Project, Arizona",
      "link": "https://www.newsfilecorp.com/release/219546/Silver-One-to-Conduct-Airborne-Geophysics-and-Prepares-for-Drilling-on-Its-Phoenix-Silver-Project-Arizona",
      "date": "2024-08-12T04:15:00.000Z",
      "hidden": false
    },
    {
      "id": 63142,
      "company_id": 417,
      "title": "SILVER ONE CLOSES OVERSUBSCRIBED FINANCING OF $5.9 MILLION",
      "link": "https://contentapi.cision.com/api/v1.0/releases/20240621LN45426",
      "date": "2024-06-21T11:20:00.000Z",
      "hidden": false
    }
  ]
}
