{
  "article": {
    "id": 39573,
    "link": "https://www.newsfilecorp.com/release/177538/Sienna-Enters-Into-an-Agreement-for-an-Option-to-Acquire-100-of-the-Elko-Lithium-Project-in-Elko-County-Nevada-Bordering-Surge-Battery-Metals",
    "title": "Sienna Enters Into an Agreement for an Option to Acquire 100% of the \"Elko Lithium Project\" in Elko County, Nevada Bordering Surge Battery Metals",
    "description": "<img src=\"https://api.newsfilecorp.com/newsinfo/177538/367\" id=\"367\" width=\"2\" height=\"2\" style=\"width: 1px;  height: 1px;border: 0px solid;\" /><p>Vancouver, British Columbia--(Newsfile Corp. - August 17, 2023) - Sienna Resources Inc. (TSXV:&#160;SIE) (OTC Pink: SNNAF) (FSE: A1XCQ0) (\"Sienna\" or the \"Company\")&#160;is pleased to announce that it has entered into an arm's length property option agreement whereby it has been granted an option to acquire a 100% interest in the \"Elko Lithium Project\" in Elko County, Nevada.  This project consists of approximately 1200 contiguous acres directly bordering Surge Battery Metals' \"Nevada North Lithium Project\" in Elko County, Nevada.  This agreement is subject to TSX Venture Exchange (the \"Exchange\") approval. The Nevada North Lithium Project has retuned some of the highest grades for lithium in Nevada.  According to Surge's website, \"Drill hole NN2207 intersected the thickest intervals of lithium-rich claystone encountered to date; a total of 120.4 metres (395 feet) averaging 3,943 parts per million lithium in four zones.\"  Plans are being formulated immediately for the first phase of work on this project.  Sienna management cautions that past results or discoveries on properties in proximity to Sienna may not necessarily be indicative of the presence of mineralization on the company's properties.</p><p>Jason Gigliotti, President of Sienna states, \"This is one of the most exciting lithium regions in North America.  The grades that were encountered by Surge are some of the highest grades attained in Nevada and having a project that is directly bordering this new lithium discovery holds tremendous promise for Sienna's shareholders. We plan to immediately commence plans for the first phase of work on this project.  Not only do we have this new lithium project, but Sienna is one of the largest landholders in Clayton Valley, Nevada through its other property interests.  Sienna has adequate cash resources for anticipated exploration plans and we expect to very active on multiple fronts in the remainder of 2023.  Management is very optimistic about the future and looks forward to what will happen in the ground on these projects.\"</p><p style=\"text-align: center;\"><a rel=\"nofollow\" href=\"https://images.newsfilecorp.com/files/854/177538_6efb8483e48dea97_002full.jpg\"><img src=\"https://images.newsfilecorp.com/files/854/177538_6efb8483e48dea97_002.jpg\" style=\"border-width: 0px;\" alt=\"Cannot view this image? Visit: https://images.newsfilecorp.com/files/854/177538_6efb8483e48dea97_002.jpg\" /></a><br /><br />Clayton Valley Map</p><p style=\"text-align: center;\">To view an enhanced version of this graphic, please visit:<br /><a rel=\"nofollow\" href=\"https://images.newsfilecorp.com/files/854/177538_6efb8483e48dea97_002full.jpg\">https://images.newsfilecorp.com/files/854/177538_6efb8483e48dea97_002full.jpg</a></p><p>Recently, the Bureau of Land Management (BLM) has given Sienna approval for up to 4 additional holes to be completed on the 100% owned Blue Clay Lithium Project in Clayton Valley, Nevada (See map). On March 25, 2022, Sienna revealed a new lithium discovery on the Blue Clay Lithium Project. Lithium values as high as 1230 ppm Li were encountered. The Blue Clay Lithium Project consists of 150 contiguous claims totaling approximately 2,950 acres prospective for lithium right in the heart of the Clayton Valley in Nevada, which is currently home to the only producing lithium region in North America.  </p><p>Terms of the agreement:</p><ol><li><p>Upon receipt of conditional approval from the Exchange, the Optionee has the exclusive right and option to earn a 100% legal and beneficial interest in the Elko Lithium Project from the owner by making cash payments totalling $92,000 CDN and issuing stock totalling 16 million shares (the \"<b>Transaction</b>\") as set out below:</p><ol style=\"list-style-type: lower-alpha;\"><li><p>Paying the optionor $92,000 within five (5) days of all applicable approvals (including receipt of conditional approval of the Exchange);</p></li><li><p>Issuing the optionor 10,0000,000 common shares within five (5) days of all applicable approvals (including receipt of conditional approval of the Exchange);</p></li><li><p>Issuing the optionor 3,000,000 common shares within 10 days of drilling a hole that returns drilling results evidencing at least 1,000 ppm lithium anywhere in the hole; and</p></li><li><p>Issuing the optionor 3,000,000 common shares within 10 days of receiving a technical report (in compliance with NI 43-101) by an acceptable and accredited 3<sup>rd</sup> party evidencing a minimum of 1,000,000 LCE with a 300 ppm cut-off.</p></li></ol></li></ol><p>The option agreement constitutes an Expedited Acquisition under the policies of the Exchange. All common shares issuable under the option agreement will be issued with a restrictive period of four months and one day.  There were no finder's fees payable in connection with the option agreement.</p><p>About Sienna Resources Inc.</p><p>Sienna is one of the larger landholders in Clayton Valley Nevada. Sienna's Clayton Valley projects include the Blue Clay Lithium Project, the Silver Peak South Project, and the Clayton Valley Deep Basin Lithium Project. The Clayton Valley is home to the only lithium production in North America, being Albemarle Corp's Silver Peak deposit.  This project is also near Tesla Motors Inc.'s Gigafactory in Nevada. On March 18, 2021, Schlumberger New Energy Venture announced the development of a lithium extraction pilot plant through its new venture, NeoLith Energy in a strategic partnership with Pure Energy. The deployment of the pilot plant will be in Clayton Valley, Nevada, USA. The NeoLith Energy sustainable approach uses a differentiated direct lithium extraction (DLE) process to enable the production of high-purity, battery-grade lithium material while reducing the production time from over a year to weeks. Results from this pilot plant are expected in 2023 and could have a significant impact on the brine prospects within Clayton Valley Nevada. Sienna also has the 'Marathon North Platinum-Palladium Property' in Northern Ontario directly bordering Generation Mining Marathon Deposit.</p><p>Qualified Person:</p><p>Mr. Frank Bain, PGeo, a qualified person as defined by National Instrument 43-101 has reviewed and approved the scientific and technical disclosure contained within this news release.</p><p>If you would like to be added to Sienna's email list, please email <a href=\"mailto:info@siennaresources.com\">info@siennaresources.com</a> for information or join our twitter account at <a href=\"https://api.newsfilecorp.com/redirect/0VpwRUy1k4\">@SiennaResources</a>.</p><p>Contact Information<br />Tel:  1.604.646.6900<br />Fax: 1.604.689.1733<br /><a href=\"https://api.newsfilecorp.com/redirect/R7Y0oiaVOq\">www.siennaresources.com</a><br /><a href=\"mailto:info@siennaresources.com\">info@siennaresources.com</a></p><p>\"Jason Gigliotti\"<br />President, Director<br />Sienna Resources Inc.</p><p><i>Statements in this news release that are not historical facts are forward-looking statements.  Forward-looking statements are statements that are not historical, and consist primarily of projections - statements regarding future plans, expectations and developments.  Words such as \"expects\", \"intends\", \"plans\", \"may\", \"could\", \"potential\", \"should\", \"anticipates\", \"likely\", \"believes\" and words of similar import tend to identify forward-looking statements.  Forward-looking statements in this news release include the exercise of the option, TSX Venture Exchange approval of the agreement and mineralization potential regarding the Project.  All of these forward-looking statements are subject to a variety of known and unknown risks, uncertainties and other factors that could cause actual events or results to differ from those expressed or implied, including, without limitation, that the Company may not be able to obtain TSX Venture Exchange approval; may not elect to exercise the option; may not be able to conclude the property expenditure requirements as required; uncertainty of exploration and development plans regarding the property; commodity price fluctuations; political or economic instability and regulatory changes; currency fluctuations, the state of the capital markets; uncertainty in the measurement of mineral reserves and resource estimates; the Company's ability to attract and retain qualified personnel and management; potential labour unrest; reclamation and closure requirements for mineral properties and the availability of capital to fund the Company's projects, as well as other risks and uncertainties identified under the heading \"Risk Factors\" in the Company's continuous disclosure documents filed on SEDAR.  You are cautioned that the foregoing list is not exhaustive of all factors and assumptions which may have been used.  The Company cannot assure you that actual events, performance or results will be consistent with these forward-looking statements, and management's assumptions may prove to be incorrect. These forward-looking statements reflect current expectations regarding future events and operating performance and speak only as of the date hereof and the Company does not assume any obligation to update forward-looking statements if circumstances or management's beliefs, expectations or opinions should change other than as required by applicable law. For the reasons set forth above, you should not place undue reliance on forward-looking statements.</i></p><p><i>Neither the TSX Venture Exchange nor its Regulation Services Provider (as that term is defined in the policies of the TSX Venture Exchange) accepts responsibility for the adequacy or accuracy of this press release.</i></p><p id=\"corporateNewsLogoContainer\"><img src=\"https://images.newsfilecorp.com/files/854/177538_6efb8483e48dea97_logo.jpg\" id=\"corporateNewsLogo\" alt=\"Corporate Logo\" /></p><p id=\"corporateLinkBack\">To view the source version of this press release, please visit <a href=\"https://api.newsfilecorp.com/redirect/W0AKpUv8Ma\">https://www.newsfilecorp.com/release/177538</a></p>",
    "search_terms": "Blue Clay,Sienna Resources Inc.,SIE",
    "master_gid": 2284,
    "date": "2023-08-17T07:01:00.000Z",
    "tags": "USA|Nevada||Lithium|Project Acquisition",
    "image_id": null,
    "hidden": false,
    "company_id": 1007,
    "provider": null,
    "excerpt": "Vancouver, British Columbia--(Newsfile Corp. - August 17, 2023) - Sienna Resources Inc. (TSXV:&#160;SIE) (OTC Pink: SNNAF) (FSE: A1XCQ0) (\"Sienna\" or the \"Company\")&#160;is pleased to announce that it has entered into an arm's length property option agreement whereby it has been granted an option to acquire a 100% interest in the",
    "is_regulatory": false,
    "refined_tags": [
      "Project Acquisition"
    ],
    "ftp_filename": null,
    "company_name": "Sienna Resources Inc.",
    "exchange": "TSXV",
    "root_ticker": "SIEN",
    "project_name": "Blue Clay",
    "gid": 2284,
    "location": "Nevada, USA",
    "plan_id": null,
    "description_text": "Vancouver, British Columbia--(Newsfile Corp. - August 17, 2023) - Sienna Resources Inc. (TSXV: SIE) (OTC Pink: SNNAF) (FSE: A1XCQ0) (\"Sienna\" or the \"Company\") is pleased to announce that it has entered into an arm's length property option agreement whereby it has been granted an option to acquire a 100% interest in the \"Elko Lithium Project\" in Elko County, Nevada.  This project consists of approximately 1200 contiguous acres directly bordering Surge Battery Metals' \"Nevada North Lithium Project\" in Elko County, Nevada.  This agreement is subject to TSX Venture Exchange (the \"Exchange\") approval. The Nevada North Lithium Project has retuned some of the highest grades for lithium in Nevada.  According to Surge's website, \"Drill hole NN2207 intersected the thickest intervals of lithium-rich claystone encountered to date; a total of 120.4 metres (395 feet) averaging 3,943 parts per million lithium in four zones.\"  Plans are being formulated immediately for the first phase of work on this project.  Sienna management cautions that past results or discoveries on properties in proximity to Sienna may not necessarily be indicative of the presence of mineralization on the company's properties. Jason Gigliotti, President of Sienna states, \"This is one of the most exciting lithium regions in North America.  The grades that were encountered by Surge are some of the highest grades attained in Nevada and having a project that is directly bordering this new lithium discovery holds tremendous promise for Sienna's shareholders. We plan to immediately commence plans for the first phase of work on this project.  Not only do we have this new lithium project, but Sienna is one of the largest landholders in Clayton Valley, Nevada through its other property interests.  Sienna has adequate cash resources for anticipated exploration plans and we expect to very active on multiple fronts in the remainder of 2023.  Management is very optimistic about the future and looks forward to what will happen in the ground on these projects.\" Clayton Valley Map To view an enhanced version of this graphic, please visit: https://images.newsfilecorp.com/files/854/177538_6efb8483e48dea97_002full.jpg Recently, the Bureau of Land Management (BLM) has given Sienna approval for up to 4 additional holes to be completed on the 100% owned Blue Clay Lithium Project in Clayton Valley, Nevada (See map). On March 25, 2022, Sienna revealed a new lithium discovery on the Blue Clay Lithium Project. Lithium values as high as 1230 ppm Li were encountered. The Blue Clay Lithium Project consists of 150 contiguous claims totaling approximately 2,950 acres prospective for lithium right in the heart of the Clayton Valley in Nevada, which is currently home to the only producing lithium region in North America. Terms of the agreement: Upon receipt of conditional approval from the Exchange, the Optionee has the exclusive right and option to earn a 100% legal and beneficial interest in the Elko Lithium Project from the owner by making cash payments totalling $92,000 CDN and issuing stock totalling 16 million shares (the \" Transaction \") as set out below: Paying the optionor $92,000 within five (5) days of all applicable approvals (including receipt of conditional approval of the Exchange); Issuing the optionor 10,0000,000 common shares within five (5) days of all applicable approvals (including receipt of conditional approval of the Exchange); Issuing the optionor 3,000,000 common shares within 10 days of drilling a hole that returns drilling results evidencing at least 1,000 ppm lithium anywhere in the hole; and Issuing the optionor 3,000,000 common shares within 10 days of receiving a technical report (in compliance with NI 43-101) by an acceptable and accredited 3 rd party evidencing a minimum of 1,000,000 LCE with a 300 ppm cut-off. The option agreement constitutes an Expedited Acquisition under the policies of the Exchange. All common shares issuable under the option agreement will be issued with a restrictive period of four months and one day.  There were no finder's fees payable in connection with the option agreement. About Sienna Resources Inc. Sienna is one of the larger landholders in Clayton Valley Nevada. Sienna's Clayton Valley projects include the Blue Clay Lithium Project, the Silver Peak South Project, and the Clayton Valley Deep Basin Lithium Project. The Clayton Valley is home to the only lithium production in North America, being Albemarle Corp's Silver Peak deposit.  This project is also near Tesla Motors Inc.'s Gigafactory in Nevada. On March 18, 2021, Schlumberger New Energy Venture announced the development of a lithium extraction pilot plant through its new venture, NeoLith Energy in a strategic partnership with Pure Energy. The deployment of the pilot plant will be in Clayton Valley, Nevada, USA. The NeoLith Energy sustainable approach uses a differentiated direct lithium extraction (DLE) process to enable the production of high-purity, battery-grade lithium material while reducing the production time from over a year to weeks. Results from this pilot plant are expected in 2023 and could have a significant impact on the brine prospects within Clayton Valley Nevada. Sienna also has the 'Marathon North Platinum-Palladium Property' in Northern Ontario directly bordering Generation Mining Marathon Deposit. Qualified Person: Mr. Frank Bain, PGeo, a qualified person as defined by National Instrument 43-101 has reviewed and approved the scientific and technical disclosure contained within this news release. If you would like to be added to Sienna's email list, please email info@siennaresources.com for information or join our twitter account at @SiennaResources . Contact Information Tel:  1.604.646.6900 Fax: 1.604.689.1733 www.siennaresources.com info@siennaresources.com \"Jason Gigliotti\" President, Director Sienna Resources Inc. Statements in this news release that are not historical facts are forward-looking statements.  Forward-looking statements are statements that are not historical, and consist primarily of projections - statements regarding future plans, expectations and developments.  Words such as \"expects\", \"intends\", \"plans\", \"may\", \"could\", \"potential\", \"should\", \"anticipates\", \"likely\", \"believes\" and words of similar import tend to identify forward-looking statements.  Forward-looking statements in this news release include the exercise of the option, TSX Venture Exchange approval of the agreement and mineralization potential regarding the Project.  All of these forward-looking statements are subject to a variety of known and unknown risks, uncertainties and other factors that could cause actual events or results to differ from those expressed or implied, including, without limitation, that the Company may not be able to obtain TSX Venture Exchange approval; may not elect to exercise the option; may not be able to conclude the property expenditure requirements as required; uncertainty of exploration and development plans regarding the property; commodity price fluctuations; political or economic instability and regulatory changes; currency fluctuations, the state of the capital markets; uncertainty in the measurement of mineral reserves and resource estimates; the Company's ability to attract and retain qualified personnel and management; potential labour unrest; reclamation and closure requirements for mineral properties and the availability of capital to fund the Company's projects, as well as other risks and uncertainties identified under the heading \"Risk Factors\" in the Company's continuous disclosure documents filed on SEDAR.  You are cautioned that the foregoing list is not exhaustive of all factors and assumptions which may have been used.  The Company cannot assure you that actual events, performance or results will be consistent with these forward-looking statements, and management's assumptions may prove to be incorrect. These forward-looking statements reflect current expectations regarding future events and operating performance and speak only as of the date hereof and the Company does not assume any obligation to update forward-looking statements if circumstances or management's beliefs, expectations or opinions should change other than as required by applicable law. For the reasons set forth above, you should not place undue reliance on forward-looking statements. Neither the TSX Venture Exchange nor its Regulation Services Provider (as that term is defined in the policies of the TSX Venture Exchange) accepts responsibility for the adequacy or accuracy of this press release. To view the source version of this press release, please visit https://www.newsfilecorp.com/release/177538",
    "primary_commodity": "Li"
  },
  "articleProject": {
    "gid": 2284,
    "project_name": "Blue Clay",
    "location": "Nevada, USA"
  },
  "articleExchange": "TSXV",
  "articleCompanyId": 1007,
  "articleTicker": "SIEN",
  "articleCompanyName": "Sienna Resources Inc.",
  "allOtherCompanyProjects": [
    {
      "company_id": 1007,
      "gid": 2284,
      "project_name": "Blue Clay",
      "location": "Nevada, USA"
    },
    {
      "company_id": 1007,
      "gid": 2283,
      "project_name": "Clayton Valley Deep Basin",
      "location": "Nevada, USA"
    },
    {
      "company_id": 1007,
      "gid": 6499,
      "project_name": "Atomic Uranium",
      "location": null
    },
    {
      "company_id": 1007,
      "gid": 4914,
      "project_name": "Silver Peak South",
      "location": "Nevada, United States"
    },
    {
      "company_id": 1007,
      "gid": 6223,
      "project_name": "Dragon (Uranium Town)",
      "location": "Saskatchewan, Canada"
    },
    {
      "company_id": 1007,
      "gid": 5336,
      "project_name": "Elko",
      "location": "Nevada, United States"
    },
    {
      "company_id": 1007,
      "gid": 8037,
      "project_name": "Stonesthrow",
      "location": null
    },
    {
      "company_id": 1007,
      "gid": 6987,
      "project_name": "Case Lake West",
      "location": null
    }
  ],
  "allOtherCompanyNews": [
    {
      "id": 106414,
      "company_id": 1007,
      "title": "Sienna Resources Inc. Announces Private Placement",
      "link": "https://app.quotemedia.com/data/downloadFiling?webmasterId=104408&ref=6839bb309ef6d722ed095836&type=PDFC&formType=002-002-001089-003001&formDescription=News+release&dateFiled=2025-05-30",
      "date": "2025-05-30T14:05:36.000Z",
      "hidden": false
    },
    {
      "id": -200272,
      "company_id": 1007,
      "title": "Sienna Resources Inc.: Corporate Update",
      "link": null,
      "date": "2025-05-09T17:10:00.000Z",
      "hidden": false
    },
    {
      "id": -197324,
      "company_id": 1007,
      "title": "Sienna Resources Inc. Corporate Update",
      "link": null,
      "date": "2025-04-30T00:27:00.000Z",
      "hidden": false
    },
    {
      "id": 100209,
      "company_id": 1007,
      "title": "Sienna Resources Inc.: Company Update",
      "link": null,
      "date": "2025-04-17T13:25:00.000Z",
      "hidden": false
    },
    {
      "id": 91908,
      "company_id": 1007,
      "title": "Sienna Resources Drills Significant Sulphide Intersections at the Case Lake Project",
      "link": null,
      "date": "2025-03-20T07:01:00.000Z",
      "hidden": false
    },
    {
      "id": 90186,
      "company_id": 1007,
      "title": "Multi-Hole Drill Program Now Underway on \"Case Lake West Cesium and Spodumene Pegmatite Project\" in Ontario Bordering Power Metals Corp.'s Cesium Deposit",
      "link": "https://www.newsfilecorp.com/release/243516/MultiHole-Drill-Program-Now-Underway-on-Case-Lake-West-Cesium-and-Spodumene-Pegmatite-Project-in-Ontario-Bordering-Power-Metals-Corp.s-Cesium-Deposit",
      "date": "2025-03-06T08:01:00.000Z",
      "hidden": false
    },
    {
      "id": 89386,
      "company_id": 1007,
      "title": "Drill Contractor Engaged for \"Case Lake West Cesium and Spodumene Pegmatite Project\" in Ontario Bordering Power Metals Corp.'s Cesium Deposit",
      "link": "https://www.newsfilecorp.com/release/242600/Drill-Contractor-Engaged-for-Case-Lake-West-Cesium-and-Spodumene-Pegmatite-Project-in-Ontario-Bordering-Power-Metals-Corp.s-Cesium-Deposit",
      "date": "2025-02-27T08:01:00.000Z",
      "hidden": false
    },
    {
      "id": 87849,
      "company_id": 1007,
      "title": "Sienna Resources Receives Drill Permit on the \"Case Lake West Cesium and Spodumene Pegmatite Project\" in Ontario Bordering Power Metals Corp.'s Cesium deposit",
      "link": "https://www.newsfilecorp.com/release/240910/Sienna-Resources-Receives-Drill-Permit-on-the-Case-Lake-West-Cesium-and-Spodumene-Pegmatite-Project-in-Ontario-Bordering-Power-Metals-Corp.s-Cesium-deposit",
      "date": "2025-02-14T08:01:00.000Z",
      "hidden": false
    },
    {
      "id": -160257,
      "company_id": 1007,
      "title": "Sienna Announces Arrangements to Address Mailing Delays Resulting from Canada Post Strike",
      "link": "https://www.newsfilecorp.com/release/233581/Sienna-Announces-Arrangements-to-Address-Mailing-Delays-Resulting-from-Canada-Post-Strike",
      "date": "2024-12-12T20:07:00.000Z",
      "hidden": false
    },
    {
      "id": 78016,
      "company_id": 1007,
      "title": "Applies for Drill Permit on the \"Case Lake West Cesium and Spodumene Pegmatite Project\" in Larder Lake Mining division of Ontario",
      "link": "https://www.newsfilecorp.com/release/229119/Applies-for-Drill-Permit-on-the-Case-Lake-West-Cesium-and-Spodumene-Pegmatite-Project-in-Larder-Lake-Mining-division-of-Ontario",
      "date": "2024-11-07T08:01:00.000Z",
      "hidden": false
    }
  ]
}
