{
  "article": {
    "id": 68203,
    "link": "https://www.newsfilecorp.com/release/219743/CopAur-Minerals-Consolidates-100-Interest-in-Kinsley-Mountain-Gold-Project",
    "title": "CopAur Minerals Consolidates 100% Interest in Kinsley Mountain Gold Project",
    "description": "<img src=\"https://api.newsfilecorp.com/newsinfo/219743/367\" id=\"367\" width=\"2\" height=\"2\" style=\"width: 1px;  height: 1px;border: 0px solid;\" /><p>Vancouver, British Columbia--(Newsfile Corp. - August 12, 2024) - CopAur Minerals Inc. (TSXV: CPAU) (OTCQX: COPAF) (\"<b>CopAur</b>\" or the \"<b>Company</b>\") is pleased to announce that it has completed its previously announced (see news release disseminated July 8, 2024) acquisition from Nevada Sunrise Metals Corporation (\"<b>Nevada Sunrise</b>\") of Nevada Sunrise's 18.74% ownership interest in Kinsley Gold LLC (\"<b>LLC</b>\"), the joint venture vehicle that holds rights to the Kinsley Mountain Gold Project in Nevada (\"<b>Kinsley Project</b>\"). The Company now owns 100% of the Kinsley Project, a gold exploration project in Elko County, Nevada. The Kinsley Project comprises 513 unpatented lode claims on U.S. Bureau of Land Management land plus 6 leased patents totaling 4,213 hectares (10,410 acres), and hosts a past-producing mine with an extensive exploration database and numerous, untested gold targets. The leased claims are subject to a 3% net smelter returns royalty on production. </p><p>Under the terms of a membership purchase agreement CopAur acquired Nevada Sunrise's 18.74% ownership interest in the LLC in consideration of the payment of CDN$475,000 and the issuance of 1,000,000 common shares of CopAur (\"<b>Consideration Shares</b>\") to Nevada Sunrise. The Consideration Shares are subject to a four-month statutory hold period (the \"<b>Statutory Hold Period</b>\") and voluntary hold periods for an additional nine month period. The first 250,000 Consideration Shares will be released on expiry of the Statutory Hold Period and the remaining shares will be released in equal tranches every three months following the first release. </p><p>Chief executive officer Jeremy Yaseniuk stated: <i>\"We are pleased to have completed this transaction to acquire 100% ownership of the LLC, which provides us with full control over the Kinsley Project and the ability to concentrate our efforts on further advancing this exciting project. The Kinsley Project has both oxide and sulphide gold resources. Recent drilling by the Company has yielded multiple near-surface oxide intercepts at the Main Pit North target and high-grade sulphide gold mineralization at the Western Flank (news releases Oct. 4, 2023 and Nov. 10, 2023).\"</i></p><p>The Kinsley Project hosts a National Instrument 43-101 mineral resource that CopAur is working to upgrade and expand. The Kinsley Project is a historical past producer that yielded 138,000 ounces of near-surface open-pit gold between 1995 and 1999, when mining was suspended.</p><p>A technical report on the Kinsley Project titled \"Technical Report of the Kinsley Project, Elko and White Pine Counties, Nevada, U.S.A.\", dated June 21, 2021, with an effective date of May 5, 2021, prepared by Michael M. Gustin and Gary L. Simmons, is available for review under New Placer Dome Gold Corp.'s issuer profile on SEDAR+.</p><p><b>About CopAur</b></p><p>CopAur is an exploration company focused on developing projects within the emerging, mineral-rich mining regions of Nevada. The Company is backed by a dynamic and experienced team of resource professionals advancing its projects in Nevada with the flagship project being Kinsley Mountain gold property, a Carlin-style project located 90 kilometres south of the Long Canyon mine (currently in production under the Newmont/Barrick joint venture, Nevada Gold Mines).</p><p><b>Qualified Person</b></p><p>The scientific and technical information contained in this news release has been reviewed and approved by Kristopher J. Raffle, P.Geo. (British Columbia), principal and consultant, of Apex Geoscience Ltd. of Edmonton, Alta., and a qualified person as defined in National Instrument 43-101 (Standards of Disclosure for Mineral Projects).</p><p>For more information, please contact:</p><p><b>CopAur Minerals Inc.</b></p><div id=\"contactInfo\"><p>Jeremy Yaseniuk, Chief Executive Officer &#38; Director<br />Tel: +1 (604) 773-1467<br />Email: <a href=\"mailto:jeremyy@copaur.com\">jeremyy@CopAur.com</a></p></div><p><i>Neither the TSX Venture Exchange nor its Regulation Services Provider (as that term is defined in the policies of the TSX Venture Exchange) accepts responsibility for the adequacy or accuracy of this news release</i>.</p><p><i><b>Forward Looking Information</b></i></p><p><i>This news release contains forward-looking statements. These statements relate to future events or the Company's future performance. All such statements involve substantial known and unknown risks, uncertainties and other factors which may cause the actual results to vary from those expressed or implied by such forward-looking. Forward-looking statements involve significant risks and uncertainties, they should not be read as guarantees of future performance or results and they will not necessarily be accurate indications of whether or not such results will be achieved. Actual results could differ materially from those anticipated due to a number of factors and risks. Although the forward-looking statements contained in this news release are based upon what management of the Company believes are reasonable assumptions on the date of this news release, the Company cannot assure investors that actual results will be consistent with these forward-looking statements. The forward-looking statements contained in this press release are made as of the date hereof and the Company disclaims any intention or obligation to update or revised any forward-looking statements whether as a result of new information, future events or otherwise, except as required under applicable securities regulations.</i></p><p id=\"corporateNewsLogoContainer\"><img src=\"https://images.newsfilecorp.com/files/7895/219743_30f64a3f14a46a06_logo.jpg\" id=\"corporateNewsLogo\" alt=\"Corporate Logo\" /></p><p id=\"corporateLinkBack\">To view the source version of this press release, please visit <a href=\"https://api.newsfilecorp.com/redirect/ar8jRFeepM\">https://www.newsfilecorp.com/release/219743</a></p>",
    "search_terms": "Kinsley Mountain,CopAur Minerals Inc.,CPAU",
    "master_gid": 911,
    "date": "2024-08-12T22:04:00.000Z",
    "tags": "USA|Nevada||Gold|Project Acquisition",
    "image_id": null,
    "hidden": false,
    "company_id": 369,
    "provider": "newsfilecorp",
    "excerpt": "Vancouver, British Columbia--(Newsfile Corp. - August 12, 2024) - CopAur Minerals Inc. (TSXV: CPAU) (OTCQX: COPAF) (\"CopAur\" or the \"Company\") is pleased to announce that it has completed its previously announced (see news release disseminated July 8, 2024) acquisition from Nevada Sunrise Metals Corporation (\"Nevada Sunrise\") of Nevada Sunrise's 18.74%",
    "is_regulatory": false,
    "refined_tags": null,
    "ftp_filename": null,
    "company_name": "CopAur Minerals Inc.",
    "exchange": "TSXV",
    "root_ticker": "CPAU",
    "project_name": "Kinsley Mountain",
    "gid": 911,
    "location": "Nevada, USA",
    "plan_id": null,
    "description_text": "Vancouver, British Columbia--(Newsfile Corp. - August 12, 2024) - CopAur Minerals Inc. (TSXV: CPAU) (OTCQX: COPAF) (\" CopAur \" or the \" Company \") is pleased to announce that it has completed its previously announced (see news release disseminated July 8, 2024) acquisition from Nevada Sunrise Metals Corporation (\" Nevada Sunrise \") of Nevada Sunrise's 18.74% ownership interest in Kinsley Gold LLC (\" LLC \"), the joint venture vehicle that holds rights to the Kinsley Mountain Gold Project in Nevada (\" Kinsley Project \"). The Company now owns 100% of the Kinsley Project, a gold exploration project in Elko County, Nevada. The Kinsley Project comprises 513 unpatented lode claims on U.S. Bureau of Land Management land plus 6 leased patents totaling 4,213 hectares (10,410 acres), and hosts a past-producing mine with an extensive exploration database and numerous, untested gold targets. The leased claims are subject to a 3% net smelter returns royalty on production. Under the terms of a membership purchase agreement CopAur acquired Nevada Sunrise's 18.74% ownership interest in the LLC in consideration of the payment of CDN$475,000 and the issuance of 1,000,000 common shares of CopAur (\" Consideration Shares \") to Nevada Sunrise. The Consideration Shares are subject to a four-month statutory hold period (the \" Statutory Hold Period \") and voluntary hold periods for an additional nine month period. The first 250,000 Consideration Shares will be released on expiry of the Statutory Hold Period and the remaining shares will be released in equal tranches every three months following the first release. Chief executive officer Jeremy Yaseniuk stated: \"We are pleased to have completed this transaction to acquire 100% ownership of the LLC, which provides us with full control over the Kinsley Project and the ability to concentrate our efforts on further advancing this exciting project. The Kinsley Project has both oxide and sulphide gold resources. Recent drilling by the Company has yielded multiple near-surface oxide intercepts at the Main Pit North target and high-grade sulphide gold mineralization at the Western Flank (news releases Oct. 4, 2023 and Nov. 10, 2023).\" The Kinsley Project hosts a National Instrument 43-101 mineral resource that CopAur is working to upgrade and expand. The Kinsley Project is a historical past producer that yielded 138,000 ounces of near-surface open-pit gold between 1995 and 1999, when mining was suspended. A technical report on the Kinsley Project titled \"Technical Report of the Kinsley Project, Elko and White Pine Counties, Nevada, U.S.A.\", dated June 21, 2021, with an effective date of May 5, 2021, prepared by Michael M. Gustin and Gary L. Simmons, is available for review under New Placer Dome Gold Corp.'s issuer profile on SEDAR+. About CopAur CopAur is an exploration company focused on developing projects within the emerging, mineral-rich mining regions of Nevada. The Company is backed by a dynamic and experienced team of resource professionals advancing its projects in Nevada with the flagship project being Kinsley Mountain gold property, a Carlin-style project located 90 kilometres south of the Long Canyon mine (currently in production under the Newmont/Barrick joint venture, Nevada Gold Mines). Qualified Person The scientific and technical information contained in this news release has been reviewed and approved by Kristopher J. Raffle, P.Geo. (British Columbia), principal and consultant, of Apex Geoscience Ltd. of Edmonton, Alta., and a qualified person as defined in National Instrument 43-101 (Standards of Disclosure for Mineral Projects). For more information, please contact: CopAur Minerals Inc. Jeremy Yaseniuk, Chief Executive Officer & Director Tel: +1 (604) 773-1467 Email: jeremyy@CopAur.com Neither the TSX Venture Exchange nor its Regulation Services Provider (as that term is defined in the policies of the TSX Venture Exchange) accepts responsibility for the adequacy or accuracy of this news release . Forward Looking Information This news release contains forward-looking statements. These statements relate to future events or the Company's future performance. All such statements involve substantial known and unknown risks, uncertainties and other factors which may cause the actual results to vary from those expressed or implied by such forward-looking. Forward-looking statements involve significant risks and uncertainties, they should not be read as guarantees of future performance or results and they will not necessarily be accurate indications of whether or not such results will be achieved. Actual results could differ materially from those anticipated due to a number of factors and risks. Although the forward-looking statements contained in this news release are based upon what management of the Company believes are reasonable assumptions on the date of this news release, the Company cannot assure investors that actual results will be consistent with these forward-looking statements. The forward-looking statements contained in this press release are made as of the date hereof and the Company disclaims any intention or obligation to update or revised any forward-looking statements whether as a result of new information, future events or otherwise, except as required under applicable securities regulations. To view the source version of this press release, please visit https://www.newsfilecorp.com/release/219743",
    "primary_commodity": "Au"
  },
  "articleProject": {
    "gid": 911,
    "project_name": "Kinsley Mountain",
    "location": "Nevada, USA"
  },
  "articleExchange": "TSXV",
  "articleCompanyId": 369,
  "articleTicker": "CPAU",
  "articleCompanyName": "CopAur Minerals Inc.",
  "allOtherCompanyProjects": [
    {
      "company_id": 369,
      "gid": 3670,
      "project_name": "Bolo",
      "location": "Nevada, United States"
    },
    {
      "company_id": 369,
      "gid": 1045,
      "project_name": "Troy Canyon/Locke",
      "location": "Nevada, USA"
    },
    {
      "company_id": 369,
      "gid": 2540,
      "project_name": "Williams",
      "location": null
    }
  ],
  "allOtherCompanyNews": [
    {
      "id": 107390,
      "company_id": 369,
      "title": "CopAur Minerals Announces $85,000 Non-Brokered Private Placement Increasing Previously Closed Financing $505,500 Private Placement",
      "link": null,
      "date": "2025-06-09T23:18:00.000Z",
      "hidden": false
    },
    {
      "id": 106439,
      "company_id": 369,
      "title": "CopAur Minerals, a Metals Group Company, Closes Oversubscribed Non-Brokered Private Placement with Strong Industry Participation",
      "link": null,
      "date": "2025-05-31T00:32:00.000Z",
      "hidden": false
    },
    {
      "id": 105943,
      "company_id": 369,
      "title": "CopAur Minerals Upsizes Private Placement Amid Strategic Interest",
      "link": null,
      "date": "2025-05-27T18:33:00.000Z",
      "hidden": false
    },
    {
      "id": 105550,
      "company_id": 369,
      "title": "CopAur Minerals $400,000 Non-Brokered Private Placement",
      "link": null,
      "date": "2025-05-22T20:15:00.000Z",
      "hidden": false
    },
    {
      "id": 104066,
      "company_id": 369,
      "title": "CopAur Minerals Engages Thorne Solutions for Nevada Permitting and Advances Work at Past-Producing Gold Projects",
      "link": null,
      "date": "2025-05-08T13:30:00.000Z",
      "hidden": false
    },
    {
      "id": 102843,
      "company_id": 369,
      "title": "COPAUR & ALLEGIANT ANNOUNCE PLAN TO SPIN-OUT BOLO PROJECT",
      "link": "https://app.quotemedia.com/data/downloadFiling?webmasterId=104408&ref=6807b873e56840588652dd22&type=PDFC&formType=002-002-001089-003001&formDescription=News+release&dateFiled=2025-04-22",
      "date": "2025-04-22T08:40:35.000Z",
      "hidden": false
    },
    {
      "id": 94056,
      "company_id": 369,
      "title": "CopAur Minerals Explores Non-Dilutive Financing",
      "link": "https://app.quotemedia.com/data/downloadFiling?webmasterId=104408&ref=67d9bd3062771a6ef35454e2&type=PDFC&formType=002-002-001089-003001&formDescription=News+release&dateFiled=2025-03-18",
      "date": "2025-03-18T18:36:32.000Z",
      "hidden": false
    },
    {
      "id": -178750,
      "company_id": 369,
      "title": "CopAur Minerals Is Pleased To Announce Completion Of Debt Settlement",
      "link": "https://app.quotemedia.com/data/downloadFiling?webmasterId=104408&ref=67980dfbadf30c1a1d3cd540&type=PDFC&formType=002-002-001089-003001&formDescription=News+release&dateFiled=2025-01-27",
      "date": "2025-01-27T22:51:39.000Z",
      "hidden": false
    },
    {
      "id": -178751,
      "company_id": 369,
      "title": "CopAur Minerals Announces Debt Settlement",
      "link": "https://app.quotemedia.com/data/downloadFiling?webmasterId=104408&ref=6792d8457966ca64f64d2db1&type=PDFC&formType=002-002-001089-003001&formDescription=News+release&dateFiled=2025-01-23",
      "date": "2025-01-24T00:01:09.000Z",
      "hidden": false
    },
    {
      "id": -178752,
      "company_id": 369,
      "title": "COPAUR MINERALS CLOSES NON-BROKERED PRIVATE PLACEMENT",
      "link": "https://app.quotemedia.com/data/downloadFiling?webmasterId=104408&ref=6792c3e68f639e57be6fb002&type=PDFC&formType=002-002-001089-003001&formDescription=News+release&dateFiled=2025-01-23",
      "date": "2025-01-23T22:34:14.000Z",
      "hidden": false
    }
  ]
}
