{
  "article": {
    "id": 79605,
    "link": "https://silverrangeresources.com/news/2024/silver-range-resources-provides-corporate-update-3/",
    "title": "Silver Range Resources Provides Corporate Update",
    "description": "<div>\n            <p><strong>Vancouver, B.C. – Silver Range Resources Ltd. [TSX-V:SNG] (“Silver Range”) </strong>provides the following corporate update:</p>\n\n<p><em>Cold Springs Project</em></p>\n\n<p>Silver Range has reacquired the Cold Springs Property.&nbsp;&nbsp; Cold Springs is a low sulphidation epithermal prospect approximately 80 kilometres east of Fallon on Highway 50 in Churchill County, Nevada.&nbsp; High grade gold and silver mineralization occurs in four major gently west-dipping quartz chalcedony veins exposed in the footwall of a west-dipping range front (normal) fault.&nbsp; The veins are in a package of generally west-dipping rhyodacitic crystal through lithic-crystal tuff, capped by a maroon lithic tuff breccia.&nbsp; Individual veins are exposed for up to 70 metres in the scarp face and are up to 2.0 metres wide.&nbsp; Ginguro bands and clots of pyrite occur in colloform banded quartz-chalcedony veins with local bladed quartz-after-calcite texture.&nbsp; Selected specimens of this material sampled by Silver Range have assayed up to 20.1&nbsp;g/t Au and 1,770&nbsp;g/t Ag.&nbsp;&nbsp; The best historic drill results from these veins were reported in an ASARCO drill hole (CS83-03) which returned 3.05&nbsp;m @ 4.25&nbsp;g/t Au.&nbsp;&nbsp;&nbsp; The vein mineralization cross-cuts a large envelope of pervasive quartz flooding in the maroon lithic tuff.&nbsp;&nbsp; This earlier style of mineralization was thoroughly drill tested by previous operators east of the vein exposures and averaged 0.113&nbsp;g/t Au and 2.81&nbsp;g/t Ag in 38 shallow air-track drill holes.&nbsp; (See Silver Range News Release dated October 31, 2018).&nbsp; &nbsp;</p>\n\n<p>Silver Range staked the property in 2016 and subsequently optioned it to Supernova Metals Corp. [TSX.V:SUPR] (“Supernova”) in 2020.&nbsp;&nbsp; Supernova drilled four holes (1,378 metres) and then exercised an amended option to acquire the property, granting Silver Range a net smelter return.&nbsp;&nbsp; Supernova allowed the property to lapse and Silver Range reacquired the project by staking.&nbsp;&nbsp; The property has a rich drill database and Silver Range is compiling targets for future testing.</p>\n\n<p><em>East Goldfield Project</em></p>\n\n<p>Silver Range has acquired data from a multi-year drill program on the East Goldfield Property centered in the area of the Tom Keane Mine.&nbsp;&nbsp; Silver Range intends to digitize this data and build a property-scale drill database to identify new targets on the property.&nbsp;&nbsp; The East Goldfield Property is contiguous with Centerra Gold’s Goldfield Project covering the historic Goldfield Mining District, the Gemfield Deposit and the McMahon Ridge Deposit. &nbsp;</p>\n\n<p>Work during 2020 and 2021 on the property by ATAC Resources Ltd., now a wholly owned subsidiary of Hecla Mining Company, yielded surface sample results of up to 4.16&nbsp;g/t Au over 8 metres and&nbsp; a drill program returned a best intersection of 82.30&nbsp;m @ 0.31g/t Au including 9.15&nbsp;m @ 1.03g/t Au.&nbsp; The option was terminated in February 2022.</p>\n\n<p>More information on the Cold Springs and East Goldfield Properties may be found on Silver Range’s website at <a href=\"www.silverrangeresources.com.\">www.silverrangeresources.com.</a></p>\n\n<p><br>\n<em>Options update</em></p>\n\n<p>Silver Range has amended an option agreement covering the Bellehelen Property with Excalibur Metals Corp., extending the deadline for listing until January 31, 2025.&nbsp;&nbsp; The Bellehelen Property covers principal showings in the Bellehelen Mining District in Nye County.&nbsp;&nbsp; Work on the project has identified numerous showings with best surface samples returning assays up to 11.25&nbsp;g/t Au and 1,490&nbsp;g/t Ag.&nbsp; Excalibur Metals Corp. is managed by the King and Bay merchant bank and is pursuing a listing on the TSX-V. &nbsp;</p>\n\n<p>Under an amended and restated asset purchase agreement dated November 2, 2021, Silver Range sold the Michelle property to Silver47 Exploration Corp. (“Silver47”) (TSX-V:AGA).&nbsp; As consideration for the property, Silver Range acquired 5,650,000 Silver47 shares. &nbsp;</p>\n\n<p>Silver47 shares commenced trading on the TSX Venture Exchange on November 14, 2024.&nbsp; Silver Range intends to sell a portion of the Silver47 shareholding in an orderly manner to provide working capital.</p>\n\n<p>&nbsp;</p>\n\n<p><em>Royalty generation</em></p>\n\n<p>In September, Silver Range concluded agreements with three private Nevada corporations conveying four Nevada properties (Bankroll, Bottom Dollar, Robot and Opulent) to them in return for 1% net smelter returns on each.&nbsp; &nbsp;</p>\n\n<p>&nbsp;</p>\n\n<p><em>Conference participation</em></p>\n\n<p>Silver Range will be exhibiting at Booth 7 in the Core Shack at the American Exploration and Mining Association Convention in Reno from December 4 to 6, 2024.&nbsp;&nbsp; Results from the Shamrock, Silver Mountain, Cambridge, Tonto del Pueblo and East Goldfield projects will be on display.</p>\n\n<p>&nbsp;</p>\n\n<p><strong>About Silver Range Resources Ltd.</strong></p>\n\n<p>Silver Range is a precious metals prospect generator working in the Southwest United States. and Northern Canada.&nbsp; It has assembled a portfolio of 31 properties, 7 of which are currently optioned to others.&nbsp; Eight other projects have been converted to royalty interests.&nbsp; Silver Range is actively seeking other joint venture partners to explore the high-grade precious metals opportunities in its portfolio.</p>\n\n<p><br>\n<strong>ON BEHALF OF SILVER RANGE RESOURCES LTD.</strong></p>\n\n<p>“Mike Power”<br>\nPresident and CEO</p>\n\n<p><strong>For further information concerning Silver Range or its exploration projects please contact:</strong><br>\nInvestor &amp; project opportunity inquiries<br>\nJohn Gilbert<br>\nVice-President<br>\nTel: (604) 687-2522<br>\nNA Toll-Free: (888) 688-2522<br>\n<a href=\"mailto:jgilbert@silverrangeresources.com\">jgilbert@silverrangeresources.com</a><br>\n<a href=\"http://www.silverrangeresources.com\" target=\"_blank\">http://www.silverrangeresources.com</a></p>\n\n<p>&nbsp;</p>\n        </div>",
    "search_terms": "Cold Springs,Silver Range Resources Ltd.,SNG",
    "master_gid": 979,
    "date": "2024-11-21T14:07:00.000Z",
    "tags": "||||Company Update,Options Grant,Project Acquisition",
    "image_id": null,
    "hidden": false,
    "company_id": 404,
    "provider": "custom addition",
    "excerpt": "Vancouver, B.C. – Silver Range Resources Ltd. [TSX-V:SNG] (“Silver Range”) provides the following corporate update:Cold Springs Projectilver Range has reacquired the Cold Springs Property.&nbsp;&nbsp; Cold Springs is a low sulphidation epithermal prospect approximately 80 kilometres east of Fallon",
    "is_regulatory": false,
    "refined_tags": null,
    "ftp_filename": null,
    "company_name": "Silver Range Resources Ltd.",
    "exchange": "TSXV",
    "root_ticker": "SNG",
    "project_name": "Cold Springs",
    "gid": 979,
    "location": "Nevada, United States",
    "plan_id": "companytier2",
    "description_text": "Vancouver, B.C. – Silver Range Resources Ltd. [TSX-V:SNG] (“Silver Range”) provides the following corporate update: Cold Springs Project Silver Range has reacquired the Cold Springs Property.   Cold Springs is a low sulphidation epithermal prospect approximately 80 kilometres east of Fallon on Highway 50 in Churchill County, Nevada.  High grade gold and silver mineralization occurs in four major gently west-dipping quartz chalcedony veins exposed in the footwall of a west-dipping range front (normal) fault.  The veins are in a package of generally west-dipping rhyodacitic crystal through lithic-crystal tuff, capped by a maroon lithic tuff breccia.  Individual veins are exposed for up to 70 metres in the scarp face and are up to 2.0 metres wide.  Ginguro bands and clots of pyrite occur in colloform banded quartz-chalcedony veins with local bladed quartz-after-calcite texture.  Selected specimens of this material sampled by Silver Range have assayed up to 20.1 g/t Au and 1,770 g/t Ag.   The best historic drill results from these veins were reported in an ASARCO drill hole (CS83-03) which returned 3.05 m @ 4.25 g/t Au.    The vein mineralization cross-cuts a large envelope of pervasive quartz flooding in the maroon lithic tuff.   This earlier style of mineralization was thoroughly drill tested by previous operators east of the vein exposures and averaged 0.113 g/t Au and 2.81 g/t Ag in 38 shallow air-track drill holes.  (See Silver Range News Release dated October 31, 2018). Silver Range staked the property in 2016 and subsequently optioned it to Supernova Metals Corp. [TSX.V:SUPR] (“Supernova”) in 2020.   Supernova drilled four holes (1,378 metres) and then exercised an amended option to acquire the property, granting Silver Range a net smelter return.   Supernova allowed the property to lapse and Silver Range reacquired the project by staking.   The property has a rich drill database and Silver Range is compiling targets for future testing. East Goldfield Project Silver Range has acquired data from a multi-year drill program on the East Goldfield Property centered in the area of the Tom Keane Mine.   Silver Range intends to digitize this data and build a property-scale drill database to identify new targets on the property.   The East Goldfield Property is contiguous with Centerra Gold’s Goldfield Project covering the historic Goldfield Mining District, the Gemfield Deposit and the McMahon Ridge Deposit. Work during 2020 and 2021 on the property by ATAC Resources Ltd., now a wholly owned subsidiary of Hecla Mining Company, yielded surface sample results of up to 4.16 g/t Au over 8 metres and  a drill program returned a best intersection of 82.30 m @ 0.31g/t Au including 9.15 m @ 1.03g/t Au.  The option was terminated in February 2022. More information on the Cold Springs and East Goldfield Properties may be found on Silver Range’s website at www.silverrangeresources.com. Options update Silver Range has amended an option agreement covering the Bellehelen Property with Excalibur Metals Corp., extending the deadline for listing until January 31, 2025.   The Bellehelen Property covers principal showings in the Bellehelen Mining District in Nye County.   Work on the project has identified numerous showings with best surface samples returning assays up to 11.25 g/t Au and 1,490 g/t Ag.  Excalibur Metals Corp. is managed by the King and Bay merchant bank and is pursuing a listing on the TSX-V. Under an amended and restated asset purchase agreement dated November 2, 2021, Silver Range sold the Michelle property to Silver47 Exploration Corp. (“Silver47”) (TSX-V:AGA).  As consideration for the property, Silver Range acquired 5,650,000 Silver47 shares. Silver47 shares commenced trading on the TSX Venture Exchange on November 14, 2024.  Silver Range intends to sell a portion of the Silver47 shareholding in an orderly manner to provide working capital. Royalty generation In September, Silver Range concluded agreements with three private Nevada corporations conveying four Nevada properties (Bankroll, Bottom Dollar, Robot and Opulent) to them in return for 1% net smelter returns on each. Conference participation Silver Range will be exhibiting at Booth 7 in the Core Shack at the American Exploration and Mining Association Convention in Reno from December 4 to 6, 2024.   Results from the Shamrock, Silver Mountain, Cambridge, Tonto del Pueblo and East Goldfield projects will be on display. About Silver Range Resources Ltd. Silver Range is a precious metals prospect generator working in the Southwest United States. and Northern Canada.  It has assembled a portfolio of 31 properties, 7 of which are currently optioned to others.  Eight other projects have been converted to royalty interests.  Silver Range is actively seeking other joint venture partners to explore the high-grade precious metals opportunities in its portfolio. ON BEHALF OF SILVER RANGE RESOURCES LTD. “Mike Power” President and CEO For further information concerning Silver Range or its exploration projects please contact: Investor & project opportunity inquiries John Gilbert Vice-President Tel: (604) 687-2522 NA Toll-Free: (888) 688-2522 jgilbert@silverrangeresources.com http://www.silverrangeresources.com",
    "primary_commodity": "Au"
  },
  "articleProject": {
    "gid": 979,
    "project_name": "Cold Springs",
    "location": "Nevada, United States"
  },
  "articleExchange": "TSXV",
  "articleCompanyId": 404,
  "articleTicker": "SNG",
  "articleCompanyName": "Silver Range Resources Ltd.",
  "allOtherCompanyProjects": [
    {
      "company_id": 404,
      "gid": 1058,
      "project_name": "Silver Mountain",
      "location": "Nevada, United States"
    },
    {
      "company_id": 404,
      "gid": 1059,
      "project_name": "Sniper",
      "location": "Nevada, United States"
    },
    {
      "company_id": 404,
      "gid": 953,
      "project_name": "Cambridge",
      "location": "Nevada, United States"
    },
    {
      "company_id": 404,
      "gid": 2336,
      "project_name": "Quartzite",
      "location": "Nunavut, Canada"
    },
    {
      "company_id": 404,
      "gid": 2332,
      "project_name": "Esker",
      "location": "Nunavut, Canada"
    },
    {
      "company_id": 404,
      "gid": 10296,
      "project_name": "Alamo",
      "location": "Arizona, United States"
    },
    {
      "company_id": 404,
      "gid": 10297,
      "project_name": "Luxor",
      "location": "Nevada, United States"
    },
    {
      "company_id": 404,
      "gid": 956,
      "project_name": "Rand",
      "location": "Nevada, United States"
    },
    {
      "company_id": 404,
      "gid": 2333,
      "project_name": "Uist",
      "location": "Nunavut, Canada"
    },
    {
      "company_id": 404,
      "gid": 4068,
      "project_name": "Tule Canyon",
      "location": "Nevada, United States"
    },
    {
      "company_id": 404,
      "gid": 4974,
      "project_name": "Crosby",
      "location": "Arizona, United States"
    },
    {
      "company_id": 404,
      "gid": 4975,
      "project_name": "Chloride",
      "location": "Arizona, United States"
    },
    {
      "company_id": 404,
      "gid": 818,
      "project_name": "Loner",
      "location": "Nevada, United States"
    },
    {
      "company_id": 404,
      "gid": 2335,
      "project_name": "Yandle",
      "location": "Nunavut, Canada"
    },
    {
      "company_id": 404,
      "gid": 3124,
      "project_name": "Steptoe",
      "location": "Nevada, United States"
    },
    {
      "company_id": 404,
      "gid": 3125,
      "project_name": "Tonto del Pueblo",
      "location": "Nevada, United States"
    },
    {
      "company_id": 404,
      "gid": 873,
      "project_name": "Silver Range",
      "location": "Yukon, Canada"
    },
    {
      "company_id": 404,
      "gid": 2331,
      "project_name": "Gold Bugs",
      "location": "Nunavut, Canada"
    },
    {
      "company_id": 404,
      "gid": 2551,
      "project_name": "Mel",
      "location": "Yukon, Canada"
    },
    {
      "company_id": 404,
      "gid": 1044,
      "project_name": "Bellehelen",
      "location": "Nevada, United States"
    },
    {
      "company_id": 404,
      "gid": 4524,
      "project_name": "Ujaraq",
      "location": "Nunavut, Canada"
    },
    {
      "company_id": 404,
      "gid": 3135,
      "project_name": "Hard Cash",
      "location": "Nunavut, Canada"
    },
    {
      "company_id": 404,
      "gid": 3712,
      "project_name": "Sand Springs",
      "location": "Nevada, United States"
    },
    {
      "company_id": 404,
      "gid": 2334,
      "project_name": "Qannituq",
      "location": "Nunavut, Canada"
    },
    {
      "company_id": 404,
      "gid": 2337,
      "project_name": "Barb",
      "location": "Yukon, Canada"
    },
    {
      "company_id": 404,
      "gid": 1053,
      "project_name": "East Goldfield",
      "location": "Nevada, United States"
    },
    {
      "company_id": 404,
      "gid": 5853,
      "project_name": "South Weepah",
      "location": "Nevada, United States"
    },
    {
      "company_id": 404,
      "gid": 5256,
      "project_name": "Shamrock",
      "location": "Nevada, United States"
    },
    {
      "company_id": 404,
      "gid": 4504,
      "project_name": "Bling",
      "location": "Nunavut, Canada"
    },
    {
      "company_id": 404,
      "gid": 3122,
      "project_name": "Gold Chief",
      "location": "Nevada, United States"
    },
    {
      "company_id": 404,
      "gid": 4526,
      "project_name": "Hiqiniq",
      "location": "Nunavut, Canada"
    }
  ],
  "allOtherCompanyNews": [
    {
      "id": 100640,
      "company_id": 404,
      "title": "Silver ranges stakes projects in Arizona and Nevada",
      "link": "https://silverrangeresources.com/news/2025/2025-04-23-silver-ranges-stakes-projects-in-arizona-and-nevada/",
      "date": "2025-04-23T13:30:00.000Z",
      "hidden": false
    },
    {
      "id": 99169,
      "company_id": 404,
      "title": "Silver Range defines an exploration drill target at East Goldfield",
      "link": "https://silverrangeresources.com/news/2025/2025-04-09-silver-range-defines-an-exploration-drill-target-at-east-goldfield/",
      "date": "2025-04-09T12:30:00.000Z",
      "hidden": false
    },
    {
      "id": 92552,
      "company_id": 404,
      "title": "Walker Lane Resources Ltd. Options Three Properties in the Walker Lane Gold Trend in Nevada from Silver Range Resources Ltd.",
      "link": "https://golddiscovery.com/legacy/user/news_details/746659-sngca-walker-lane-resources-ltd-options-three-properties-in-the-walker-lane-gold-trend-in-nevada-from-silver-range-resources-ltd",
      "date": "2025-03-26T11:23:00.000Z",
      "hidden": false
    },
    {
      "id": 103114,
      "company_id": 404,
      "title": "Silver Range Provides Operational Update and Announces Management Change",
      "link": "https://app.quotemedia.com/data/downloadFiling?webmasterId=104408&ref=67d313e33cc8c231c00a6fb1&type=PDFC&formType=002-002-001089-003001&formDescription=News+release&dateFiled=2025-03-13",
      "date": "2025-03-13T10:20:35.000Z",
      "hidden": false
    },
    {
      "id": 94159,
      "company_id": 404,
      "title": "SILVER RANGE OPTIONS THE SKYLIGHT PROPERTY TO RUSH GOLD CORP.",
      "link": "https://app.quotemedia.com/data/downloadFiling?webmasterId=104408&ref=6787f490bbb8e31c86778981&type=PDFC&formType=002-002-001089-003001&formDescription=News+release&dateFiled=2025-01-15",
      "date": "2025-01-15T17:46:56.000Z",
      "hidden": false
    },
    {
      "id": 94158,
      "company_id": 404,
      "title": "SILVER RANGE RESOURCES GRANTS STOCK OPTIONS",
      "link": "https://app.quotemedia.com/data/downloadFiling?webmasterId=104408&ref=674a08f31dec50617c01e5f5&type=PDFC&formType=002-002-001089-003001&formDescription=News+release&dateFiled=2024-11-29",
      "date": "2024-11-29T18:33:23.000Z",
      "hidden": false
    },
    {
      "id": 79605,
      "company_id": 404,
      "title": "Silver Range Resources Provides Corporate Update",
      "link": "https://silverrangeresources.com/news/2024/silver-range-resources-provides-corporate-update-3/",
      "date": "2024-11-21T14:07:00.000Z",
      "hidden": false
    },
    {
      "id": -138574,
      "company_id": 404,
      "title": "Silver Range Resources Ltd. Announces Issuance of Shares for Services",
      "link": "https://silverrangeresources.com/news/2024/silver-range-resources-ltd-announces-issuance-of-shares-for-services/",
      "date": "2024-08-30T13:00:00.000Z",
      "hidden": false
    },
    {
      "id": -137670,
      "company_id": 404,
      "title": "Silver Range Resources Announces Proposed Issuance of Shares for Services",
      "link": "https://silverrangeresources.com/news/2024/silver-range-resources-announces-proposed-issuance-of-shares-for-services/",
      "date": "2024-08-26T11:33:00.000Z",
      "hidden": false
    },
    {
      "id": 65030,
      "company_id": 404,
      "title": "Silver Resources Ltd. Announces Closing of Private Placement",
      "link": "https://silverrangeresources.com/news/2024/silver-range-resources-ltd-announces-closing-of-private-placement/",
      "date": "2024-07-15T13:18:00.000Z",
      "hidden": false
    }
  ]
}
