{
  "article": {
    "id": 75744,
    "link": "https://www.newsfilecorp.com/release/227545/Fairchild-Gold-Corp.-Announces-Significant-Expansion-of-Its-Land-Position-at-Its-Historic-Copper-Chief-HighGrade-Copper-and-Gold-Mining-Camp-in-Nevada",
    "title": "Fairchild Gold Corp. Announces Significant Expansion of Its Land Position at Its Historic Copper Chief High-Grade Copper and Gold Mining Camp in Nevada",
    "description": "<img src=\"https://api.newsfilecorp.com/newsinfo/227545/367\" id=\"367\" width=\"2\" height=\"2\" style=\"width: 1px;  height: 1px;border: 0px solid;\" /><p>Vancouver, British Columbia--(Newsfile Corp. - October 23, 2024) - Fairchild Gold Corp. (TSXV: FAIR)&#160;(\"Fairchild\" or the \"Company\") is pleased to announce that it has increased the size of its  Copper Chief Property by <i><b>74%</b></i>. The project area which encompasses a historic high-grade copper and gold mining camp, is easily accessible by paved road and is located 35 km Southwest of Las Vegas, Nevada. Through direct staking, the Company has acquired an additional 88 mineral claims, bringing the total project land package to 6.5 square miles <i>(approximately 16.6 square kilometers</i>).</p><p style=\"text-align: center;\"><a rel=\"nofollow\" href=\"https://images.newsfilecorp.com/files/10593/227545_21cd1317946a0ad5_001full.jpg\"><img src=\"https://images.newsfilecorp.com/files/10593/227545_21cd1317946a0ad5_001.jpg\" style=\"border-width: 0px;\" alt=\"Cannot view this image? Visit: https://images.newsfilecorp.com/files/10593/227545_21cd1317946a0ad5_001.jpg\" /></a><br /><br />Figure 1: New claims obtained by Fairchild Gold Corp&#160;</p><p style=\"text-align: center;\">To view an enhanced version of this graphic, please visit:<br /><a rel=\"nofollow\" href=\"https://images.newsfilecorp.com/files/10593/227545_21cd1317946a0ad5_001full.jpg\">https://images.newsfilecorp.com/files/10593/227545_21cd1317946a0ad5_001full.jpg</a></p><p>This latest project expansion follows a recent property visit guided by ASTER satellite data analysis, which identified promising extensions of mineralization across the region with anomalies potentially related to granitic intrusions. These new claims significantly increase Fairchild's footprint in the historic Goodsprings mining district, known for its rich yet virtually un-explored copper, gold, silver, platinum, palladium, and cobalt deposits.</p><p style=\"text-align: center;\"><a rel=\"nofollow\" href=\"https://images.newsfilecorp.com/files/10593/227545_21cd1317946a0ad5_004full.jpg\"><img src=\"https://images.newsfilecorp.com/files/10593/227545_21cd1317946a0ad5_004.jpg\" style=\"border-width: 0px;\" alt=\"Cannot view this image? Visit: https://images.newsfilecorp.com/files/10593/227545_21cd1317946a0ad5_004.jpg\" /></a></p><p style=\"text-align: center;\">Figure 2: Anomalies (Yellow) potentially related to granitic intrusions (ASTER data) map.</p><p style=\"text-align: center;\">To view an enhanced version of this graphic, please visit:<br /><a rel=\"nofollow\" href=\"https://images.newsfilecorp.com/files/10593/227545_21cd1317946a0ad5_004full.jpg\">https://images.newsfilecorp.com/files/10593/227545_21cd1317946a0ad5_004full.jpg</a></p><p><i style=\"text-align: -webkit-center;\"><br />\"With this expansion, we are positioning ourselves for substantial exploration and development opportunities on our Copper Chief Property,\"</i><span style=\"text-align: -webkit-center;\">&#160;said&#160;</span><i style=\"text-align: -webkit-center;\"><b>Luis Martins</b></i><span style=\"text-align: -webkit-center;\">, CEO of Fairchild.&#160;</span><i style=\"text-align: -webkit-center;\">\"The additional claims cover key geological targets, and we are excited about the prospect of unlocking significant value from this historic yet overlooked mining camp.\"</i></p><p>Fieldwork has already begun, with outcrop and float samples collected from some of the newly acquired claims. These samples will be submitted to <i>Act Labs</i> in Ontario, Canada, for comprehensive geochemical analysis. Meanwhile, reference materials from different lithologies are being assessed to understand their structural attributes, aiding Geologists in future exploration activities.</p><p>Fairchild continues to advance its exploration efforts, confident that this expanded claim package will enhance the potential for new copper and gold discoveries.</p><p>For further information, check out our website.<br /><a href=\"https://api.newsfilecorp.com/redirect/4QNb8TzVvM\">https://www.fairchildgold.com/single-project</a></p><p><i><b>Mr. Richard R. Redfern</b>, M.S., C.P.G. </i><u><i>No. 10717</i></u>, is the qualified person as defined by National Instrument 43-101 <i>Standards of Disclosure for Mineral Projects</i>, has examined the property on the ground, reviewed the geological information available from public sources related to the property, and is responsible for having approved the technical contents of this press release.</p><div id=\"contactInfo\"><p>On behalf of the Board of Directors</p><p><i><b>Luis Martins </b></i><br /><i>Director and Chief Executive Officer </i><br /><b>Fairchild Gold Corp. </b><br /><i><i><a href=\"mailto:info@fairchildgold.com\"><i>info@fairchildgold.com</i></a></i></i><br />(866) 497-0284</p></div><p><b>Fairchild Gold Corporation</b> is in the business of acquiring and developing mineral exploration properties in North America.</p><p>Neither the TSX Venture Exchange nor its Regulation Services Provider (as the term is defined in the policies of the TSX Venture Exchange) accepts responsibility for the adequacy of this news release. </p><p>Cautionary Statement Regarding Forward-Looking Information Certain information contained in this news release constitutes \"forward-looking information\" or \"forward-looking statements\" (collectively, \"forward- looking information\"). Without limiting the foregoing, such forward-looking information includes statements regarding the process and completion of the Offering, the use of proceeds of the Offering and any statements regarding the Company's business plans, expectations and objectives. In this news release, words such as \"may\", \"would\", \"could\", \"will\", \"likely\", \"believe\", \"expect\", \"anticipate\", \"intend\", \"plan\", \"estimate\" and similar words and the negative form thereof are used to identify forward-looking information. </p><p>Forward-looking information should not be read as guarantees of future performance or results, and will not necessarily be accurate indications of whether, or the times at or by which, such future performance will be achieved. Forward-looking information is based on information available at the time and/or the Company management's good faith belief with respect to future events and is subject to known or unknown risks, uncertainties, assumptions and other unpredictable factors, many of which are beyond the Company's control. For additional information with respect to these and other factors and assumptions underlying the forward-looking information made in this news release, see the Company's most recent Management's Discussion and Analysis and financial statements and other documents filed by the Company with the Canadian securities commissions and the discussion of risk factors set out therein. Such documents are available at www.sedar.com under the Company's profile and on the Company's website, https://fairchildgold.com/. The forward-looking information set forth herein reflects the Company's expectations as at the date of this news release and is subject to change after such date. The Company disclaims any News Release Announcing Offering intention or obligation to update or revise any forward-looking information, whether as a result of new information, future events or otherwise, other than as required by law.  </p><p id=\"corporateNewsLogoContainer\"><img src=\"https://images.newsfilecorp.com/files/10593/227545_21cd1317946a0ad5_logo.jpg\" id=\"corporateNewsLogo\" alt=\"Corporate Logo\" /></p><p id=\"corporateLinkBack\">To view the source version of this press release, please visit <a href=\"https://api.newsfilecorp.com/redirect/jpan4HJ5RZ\">https://www.newsfilecorp.com/release/227545</a></p>",
    "search_terms": "Copper Chief,Fairchild Gold Corp.,FAIR",
    "master_gid": 7642,
    "date": "2024-10-23T16:12:00.000Z",
    "tags": "USA|Nevada||Copper,Gold|Project Acquisition",
    "image_id": null,
    "hidden": false,
    "company_id": 1303,
    "provider": "newsfilecorp",
    "excerpt": "Vancouver, British Columbia--(Newsfile Corp. - October 23, 2024) - Fairchild Gold Corp. (TSXV: FAIR)&#160;(\"Fairchild\" or the \"Company\") is pleased to announce that it has increased the size of its Copper Chief Property by74%. The project area which encompasses a historic high-grade copper and gold mining camp, is easily accessible by",
    "is_regulatory": false,
    "refined_tags": [],
    "ftp_filename": null,
    "company_name": "Fairchild Gold Corp.",
    "exchange": "TSXV",
    "root_ticker": "FAIR",
    "project_name": "Copper Chief",
    "gid": 7642,
    "location": null,
    "plan_id": null,
    "description_text": "Vancouver, British Columbia--(Newsfile Corp. - October 23, 2024) - Fairchild Gold Corp. (TSXV: FAIR) (\"Fairchild\" or the \"Company\") is pleased to announce that it has increased the size of its  Copper Chief Property by 74% . The project area which encompasses a historic high-grade copper and gold mining camp, is easily accessible by paved road and is located 35 km Southwest of Las Vegas, Nevada. Through direct staking, the Company has acquired an additional 88 mineral claims, bringing the total project land package to 6.5 square miles (approximately 16.6 square kilometers ). Figure 1: New claims obtained by Fairchild Gold Corp To view an enhanced version of this graphic, please visit: https://images.newsfilecorp.com/files/10593/227545_21cd1317946a0ad5_001full.jpg This latest project expansion follows a recent property visit guided by ASTER satellite data analysis, which identified promising extensions of mineralization across the region with anomalies potentially related to granitic intrusions. These new claims significantly increase Fairchild's footprint in the historic Goodsprings mining district, known for its rich yet virtually un-explored copper, gold, silver, platinum, palladium, and cobalt deposits. Figure 2: Anomalies (Yellow) potentially related to granitic intrusions (ASTER data) map. To view an enhanced version of this graphic, please visit: https://images.newsfilecorp.com/files/10593/227545_21cd1317946a0ad5_004full.jpg \"With this expansion, we are positioning ourselves for substantial exploration and development opportunities on our Copper Chief Property,\" said Luis Martins , CEO of Fairchild. \"The additional claims cover key geological targets, and we are excited about the prospect of unlocking significant value from this historic yet overlooked mining camp.\" Fieldwork has already begun, with outcrop and float samples collected from some of the newly acquired claims. These samples will be submitted to Act Labs in Ontario, Canada, for comprehensive geochemical analysis. Meanwhile, reference materials from different lithologies are being assessed to understand their structural attributes, aiding Geologists in future exploration activities. Fairchild continues to advance its exploration efforts, confident that this expanded claim package will enhance the potential for new copper and gold discoveries. For further information, check out our website. https://www.fairchildgold.com/single-project Mr. Richard R. Redfern , M.S., C.P.G. No. 10717 , is the qualified person as defined by National Instrument 43-101 Standards of Disclosure for Mineral Projects , has examined the property on the ground, reviewed the geological information available from public sources related to the property, and is responsible for having approved the technical contents of this press release. On behalf of the Board of Directors Luis Martins Director and Chief Executive Officer Fairchild Gold Corp. info@fairchildgold.com (866) 497-0284 Fairchild Gold Corporation is in the business of acquiring and developing mineral exploration properties in North America. Neither the TSX Venture Exchange nor its Regulation Services Provider (as the term is defined in the policies of the TSX Venture Exchange) accepts responsibility for the adequacy of this news release. Cautionary Statement Regarding Forward-Looking Information Certain information contained in this news release constitutes \"forward-looking information\" or \"forward-looking statements\" (collectively, \"forward- looking information\"). Without limiting the foregoing, such forward-looking information includes statements regarding the process and completion of the Offering, the use of proceeds of the Offering and any statements regarding the Company's business plans, expectations and objectives. In this news release, words such as \"may\", \"would\", \"could\", \"will\", \"likely\", \"believe\", \"expect\", \"anticipate\", \"intend\", \"plan\", \"estimate\" and similar words and the negative form thereof are used to identify forward-looking information. Forward-looking information should not be read as guarantees of future performance or results, and will not necessarily be accurate indications of whether, or the times at or by which, such future performance will be achieved. Forward-looking information is based on information available at the time and/or the Company management's good faith belief with respect to future events and is subject to known or unknown risks, uncertainties, assumptions and other unpredictable factors, many of which are beyond the Company's control. For additional information with respect to these and other factors and assumptions underlying the forward-looking information made in this news release, see the Company's most recent Management's Discussion and Analysis and financial statements and other documents filed by the Company with the Canadian securities commissions and the discussion of risk factors set out therein. Such documents are available at www.sedar.com under the Company's profile and on the Company's website, https://fairchildgold.com/. The forward-looking information set forth herein reflects the Company's expectations as at the date of this news release and is subject to change after such date. The Company disclaims any News Release Announcing Offering intention or obligation to update or revise any forward-looking information, whether as a result of new information, future events or otherwise, other than as required by law. To view the source version of this press release, please visit https://www.newsfilecorp.com/release/227545",
    "primary_commodity": "Cu"
  },
  "articleProject": {
    "gid": 7642,
    "project_name": "Copper Chief",
    "location": null
  },
  "articleExchange": "TSXV",
  "articleCompanyId": 1303,
  "articleTicker": "FAIR",
  "articleCompanyName": "Fairchild Gold Corp.",
  "allOtherCompanyProjects": [
    {
      "company_id": 1303,
      "gid": 3964,
      "project_name": "Fairchild Lake",
      "location": "Ontario, Canada"
    },
    {
      "company_id": 1303,
      "gid": 7642,
      "project_name": "Copper Chief",
      "location": null
    },
    {
      "company_id": 1303,
      "gid": 9807,
      "project_name": "Goodsprings",
      "location": "Nevada, United States"
    }
  ],
  "allOtherCompanyNews": [
    {
      "id": 107263,
      "company_id": 1303,
      "title": "Fairchild Gold Announces Closing of the Second Tranche of Its Previously Announced Private Placement",
      "link": null,
      "date": "2025-06-06T21:25:00.000Z",
      "hidden": false
    },
    {
      "id": 106119,
      "company_id": 1303,
      "title": "Fairchild Announces Upsizing of Its Private Placement",
      "link": null,
      "date": "2025-05-28T21:40:00.000Z",
      "hidden": false
    },
    {
      "id": 105387,
      "company_id": 1303,
      "title": "Fairchild Gold Corp. Discovers New Highly Mineralised Zones at It's Copper Chief Property in Goodsprings, Nevada",
      "link": null,
      "date": "2025-05-21T16:30:00.000Z",
      "hidden": false
    },
    {
      "id": 100692,
      "company_id": 1303,
      "title": "Fairchild Gold Announces Closing of a Private Placement and Provides Corporate Update",
      "link": null,
      "date": "2025-04-23T21:00:00.000Z",
      "hidden": false
    },
    {
      "id": 93119,
      "company_id": 1303,
      "title": "Fairchild Gold Corp. Announces the Appointment of Jill Kelley as Chair of Its Newly Constituted Strategic Advisory Board",
      "link": null,
      "date": "2025-03-31T12:53:00.000Z",
      "hidden": false
    },
    {
      "id": 92730,
      "company_id": 1303,
      "title": "Fairchild Gold Corp Announces Board Changes",
      "link": null,
      "date": "2025-03-27T13:33:00.000Z",
      "hidden": false
    },
    {
      "id": 91413,
      "company_id": 1303,
      "title": "Fairchild Gold Corp Announces Successful Completion of Transaction with Koba Resources Ltd.",
      "link": null,
      "date": "2025-03-14T16:43:00.000Z",
      "hidden": false
    },
    {
      "id": 87458,
      "company_id": 1303,
      "title": "Fairchild Gold Acquires 72 Claims From Koba Resources Adjacent to Its Copper Chief Property at Goodsprings, Nevada",
      "link": "https://www.accessnewswire.com/newsroom/en/metals-and-mining/fairchild-gold-acquires-72-claims-from-koba-resources-adjacent-to-its-copper-chief-983268",
      "date": "2025-02-11T14:10:00.000Z",
      "hidden": false
    },
    {
      "id": 84757,
      "company_id": 1303,
      "title": "Fairchild Gold Reports Anomalous Geochemical Results of up to 8.90% Cu Sampled from Outcrop at Its Copper Chief Property Near Las Vegas, Nevada",
      "link": "https://www.accessnewswire.com/newsroom/en/metals-and-mining/fairchild-gold-reports-anomalous-geochemical-results-of-up-to-890-cu-sampled-from-outcrop-at-its-copper-chief-property-near-las-vegas-nevada-971280",
      "date": "2025-01-21T13:50:00.000Z",
      "hidden": false
    },
    {
      "id": 83319,
      "company_id": 1303,
      "title": "Fairchild Gold Corp. Advances Exploration at its Copper Chief Property and confirms Porphyry Rock outcropping on site",
      "link": "https://www.thenewswire.com/press-releases?id=1LYzF25jX",
      "date": "2025-01-06T17:30:00.000Z",
      "hidden": false
    }
  ]
}
