{
  "article": {
    "id": 87458,
    "link": "https://www.accessnewswire.com/newsroom/en/metals-and-mining/fairchild-gold-acquires-72-claims-from-koba-resources-adjacent-to-its-copper-chief-983268",
    "title": "Fairchild Gold Acquires 72 Claims From Koba Resources Adjacent to Its Copper Chief Property at Goodsprings, Nevada",
    "description": "<p><strong id=\"dateline\">VANCOUVER, BRITISH COLUMBIA / <a href='https://www.accessnewswire.com/'>ACCESS Newswire</a> / February 11, 2025 / </strong>Fairchild Gold Corp. (TSXV:FAIR) (&quot;<strong>Fairchild</strong>&quot; or the &quot;<strong>Company</strong>&quot;) is pleased to announce that it has entered into an agreement to purchase, subject to approval of the TSX Venture Exchange, 72 unpatented lode mining claims within and adjacent to <strong>Fairchild's Copper Chief Property (</strong>Cu-Au-Ag-PGEs-Co) located 35 km southwest of Las Vegas, Nevada (Figure 1). These new claims add significant deposit potential for Porphyry copper-gold, Antimony, and Gold-silver-PGEs targets and deposits on the property.</p><p>Figure 1: Fairchild/KOBA Acquisition (Outline of 72 lode mining claims purchased from Koba Resources)</p><p><a rel=\"nofollow\" href=\"https://pr.report/71z9\">(Click for Link)</a></p><p>Fairchild has made an agreement to purchase 72 mining claims from Koba Resources Ltd. (Australia) and Covada LLC (US:Nevada), a wholly-owned subsidiary of Koba. To consummate the purchase transaction, Fairchild will issue and deliver to Koba 3,000,000 FAIR shares of common stock at a deemed price of CDN$0.05 per share and grant to Koba a One Percent (1 %) Net Smelter Returns Royalty, of which 50% of this royalty may be repurchased by Fairchild at any time for a cash consideration of CDN$1,000,000. This agreement is subject to acceptance by the TSX Venture Exchange.</p><p><strong><u>Assets Acquired</u></strong>: The Koba claims contain several excellent mineral exploration targets that are additive to Fairchild's existing claims, including <strong>the December Mine antimony-gold prospect, the Poppy Shaft gold system, and the Fitzhugh Lee, Rose, Mobile and Columbia Mine porphyry copper-gold targets</strong>. Koba did a substantial amount of geochemical sampling and IP Geophysics, and Fairchild will be receiving this Koba database.</p><p>Figure 2: IP Geophysics performed by Koba</p><p><a rel=\"nofollow\" href=\"https://pr.report/71za\">(Click for Link)</a></p><p>The Copper Chief Property is a good combination of a perfect geographic location, a 1-hour drive from Las Vegas, all the infrastructure in situ, with a geologically favorable environment; characterized by the existence of a set of multi-target, mainly Skarn-related mineralization, Carbonate Replacement Deposits with Porphyry-style potential, and multi-commodities like Cu-Au-Ag-PGEs.</p><p>Other critical metals, like antimony can be found on the property with <strong>a 4500 g/ton sample found at the December Mine </strong>in 2021. With this acquisition Fairchild Gold can now follow up on these and other findings without concern.</p><p><strong><u>Copper Chief Targets</u></strong>: Fairchild is focused on the discovery of Porphyry Copper-gold systems (PCDs) and gold-silver-PGEs-antimony vein systems at Copper Chief. More than 15 old prospects and mines are located within the outline of the property. Several types and ages of mineral deposits are present. Fairchild's presently known targets are shown in <i>Figure 3.</i></p><p><strong>The #1priority target is the Copper Chief Porphyry</strong> which has very high-grade copper mineralization present at the surface in multiple places, and in skarn that may indicate a shallower PCD system. Other ranked targets are:</p><p><strong>2025 Targets</strong>:</p><figure class=\"table\" width=\"100%\"><table width=\"100%\"><tbody><tr><td style=\"border-style:solid;border-width:1pt;height:19.5pt;vertical-align:top;width:220.95pt;\"><p><strong>Sandy Veins Au-Ag-PGEs-Co</strong></p></td></tr><tr><td style=\"border-bottom-style:solid;border-left-style:solid;border-right-style:solid;border-top-style:none;border-width:1pt;height:33pt;vertical-align:top;width:220.95pt;\"><p><strong>Ironside Fault hosted Au-Ag-PGEs-Sb (December/Knickenbocker Mines)</strong></p></td></tr><tr><td style=\"border-bottom-style:solid;border-left-style:solid;border-right-style:solid;border-top-style:none;border-width:1pt;height:21pt;vertical-align:top;width:220.95pt;\"><p><strong>Copperside and Skarn/PCD</strong></p></td></tr><tr><td style=\"border-bottom-style:solid;border-left-style:solid;border-right-style:solid;border-top-style:none;border-width:1pt;height:17pt;vertical-align:top;width:220.95pt;\"><p><strong>Rose Mine PCD</strong></p></td></tr><tr><td style=\"border-bottom-style:solid;border-left-style:solid;border-right-style:solid;border-top-style:none;border-width:1pt;height:17pt;vertical-align:top;width:220.95pt;\"><p><strong>Columbia Mine PCD-Co</strong></p></td></tr><tr><td style=\"border-bottom-style:solid;border-left-style:solid;border-right-style:solid;border-top-style:none;border-width:1pt;height:17pt;vertical-align:top;width:220.95pt;\"><p><strong>Whale Cobalt Target</strong></p></td></tr><tr><td style=\"border-bottom-style:solid;border-left-style:solid;border-right-style:solid;border-top-style:none;border-width:1pt;height:17pt;vertical-align:top;width:220.95pt;\"><p><strong>Cu /Au Tailings</strong></p></td></tr></tbody></table></figure><p><strong>*None of these targets have been previously drilled</strong></p><p>Figure 3: Fairchild Gold 2025 targets</p><p>(<a rel=\"nofollow\" href=\"https://pr.report/71zb\">Click for Link</a>)</p><p><strong>About the Copper Chief Property</strong></p><p>Situated in Nevada's renowned mineral belts, the Copper Chief Property stands out as a high-potential Cu-Au exploration project. With robust geochemical results and favorable geology, it presents a compelling case for continued exploration and investment.</p><p><strong>CEO's Statement:</strong></p><p><i>&quot;This agreement with Koba Resources Ltd allows Fairchild to expand the Copper Chief asset with a high mineral potential area, where appropriate exploration surveys were conducted and generated an important database, including geological, geochemical and geophysical information. Fairchild's team will assess and reprocess this data, with the objective of confirming the potential for copper and gold, but not neglecting other critical metals like PGEs, antimony and cobalt.</i></p><p><i>The company will prioritize all the property targets, including the ones coming from this last acquisition, and refining the knowledge already acquired&quot;</i></p><p>-<i>Luis Martins</i>, <strong>CEO </strong>of <i>Fairchild Gold Corp</i>.</p><p><strong>QP Statement:</strong></p><p>Mr. Richard R. Redfern, M.S., C.P.G. No. 10717, is the qualified person as defined by National Instrument 43-101 who has examined the Copper Chief property on the ground numerous times since 2003, and reviewed the geological information available from private and public sources related to the property and is responsible for approving the technical contents of this press release.</p><p><strong>About KOBA Resources</strong></p><p>Koba Resources Limited (ASX:KOB) is an Australian exploration company that is focused on a portfolio of uranium projects in Australia and Canada.</p><p><strong>About Fairchild Gold Corp.</strong></p><p><strong>Fairchild</strong> is engaged in the business of mineral exploration and the acquisition of mineral property assets in North America. Its objective is to locate and develop economic precious and base metal properties of merit and to conduct its exploration program on the <i><strong>Copper Chief Property</strong></i><strong>, Nevada</strong>, and the <i><strong>Fairchild Lake Property</strong></i><strong> in Ontario</strong>.</p><p><strong>On behalf of the </strong><i><strong>Board of Directors</strong></i></p><p>Luis Martins<br /><i>Director and Chief Executive Officer</i><br /><i>Fairchild Gold Corp.</i><br /><a rel=\"nofollow\" href=\"mailto:info@fairchildgold.com\">info@fairchildgold.com</a><br />(866) 497-0284</p><p>Neither the TSX Venture Exchange nor its Regulation Services Provider (as the term is defined in the policies of the TSX Venture Exchange) accepts responsibility for the adequacy of this news release.</p><p>Cautionary Statement Regarding Forward-Looking Information Certain information contained in this news release constitutes &quot;forward-looking information&quot; or &quot;forward-looking statements&quot; (collectively, &quot;forward- looking information&quot;). Without limiting the foregoing, such forward-looking information includes statements regarding the process and completion of the Offering, the use of proceeds of the Offering and any statements regarding the Company's business plans, expectations and objectives. In this news release, words such as &quot;may&quot;, &quot;would&quot;, &quot;could&quot;, &quot;will&quot;, &quot;likely&quot;, &quot;believe&quot;, &quot;expect&quot;, &quot;anticipate&quot;, &quot;intend&quot;, &quot;plan&quot;, &quot;estimate&quot; and similar words and the negative form thereof are used to identify forward-looking information.</p><p>Forward-looking information should not be read as guarantees of future performance or results, and will not necessarily be accurate indications of whether, or the times at or by which, such future performance will be achieved. Forward-looking information is based on information available at the time and/or the Company management's good faith belief with respect to future events and is subject to known or unknown risks, uncertainties, assumptions and other unpredictable factors, many of which are beyond the Company's control. For additional information with respect to these and other factors and assumptions underlying the forward-looking information made in this news release, see the Company's most recent Management's Discussion and Analysis and financial statements and other documents filed by the Company with the Canadian securities commissions and the discussion of risk factors set out therein. Such documents are available at www.sedar.com under the Company's profile and on the Company's website, https://fairchildgold.com/. The forward-looking information set forth herein reflects the Company's expectations as at the date of this news release and is subject to change after such date. The Company disclaims any News Release Announcing Offering intention or obligation to update or revise any forward-looking information, whether as a result of new information, future events or otherwise, other than as required by law.</p><p><strong>Contact Information</strong></p><p>Steve Cozine <br /><a rel=\"nofollow\" href=\"mailto:info@fairchildgold.com\">info@fairchildgold.com</a><br />778-928-7677</p><p><strong>SOURCE: </strong>Fairchild Gold Corp</p><img src='https://app.accessnewswire.com/img.ashx?id=983268' width=\"100%\" /><br /><br />View the original <a href='https://www.accessnewswire.com/newsroom/en/metals-and-mining/fairchild-gold-acquires-72-claims-from-koba-resources-adjacent-to-its-copper-chief-983268'>press release</a> on ACCESS Newswire<br /><br />",
    "search_terms": "Copper Chief,Fairchild Gold Corp.,FAIR",
    "master_gid": 7642,
    "date": "2025-02-11T14:10:00.000Z",
    "tags": "USA|Nevada||Copper,Gold|Project Acquisition",
    "image_id": null,
    "hidden": false,
    "company_id": 1303,
    "provider": "accesswire",
    "excerpt": "VANCOUVER, BRITISH COLUMBIA /ACCESS Newswire/ February 11, 2025 /Fairchild Gold Corp. (TSXV:FAIR) (&quot;Fairchild&quot; or the &quot;Company&quot;) is pleased to announce that it has entered into an agreement to purchase, subject to approval of the TSX Venture Exchange, 72 unpatented lode mining claims within and adjacent toFairchild's Copper Chief Property (Cu-Au-Ag-PGEs-Co)",
    "is_regulatory": false,
    "refined_tags": [],
    "ftp_filename": null,
    "company_name": "Fairchild Gold Corp.",
    "exchange": "TSXV",
    "root_ticker": "FAIR",
    "project_name": "Copper Chief",
    "gid": 7642,
    "location": null,
    "plan_id": null,
    "description_text": "VANCOUVER, BRITISH COLUMBIA / ACCESS Newswire / February 11, 2025 / Fairchild Gold Corp. (TSXV:FAIR) (\" Fairchild \" or the \" Company \") is pleased to announce that it has entered into an agreement to purchase, subject to approval of the TSX Venture Exchange, 72 unpatented lode mining claims within and adjacent to Fairchild's Copper Chief Property ( Cu-Au-Ag-PGEs-Co) located 35 km southwest of Las Vegas, Nevada (Figure 1). These new claims add significant deposit potential for Porphyry copper-gold, Antimony, and Gold-silver-PGEs targets and deposits on the property. Figure 1: Fairchild/KOBA Acquisition (Outline of 72 lode mining claims purchased from Koba Resources) (Click for Link) Fairchild has made an agreement to purchase 72 mining claims from Koba Resources Ltd. (Australia) and Covada LLC (US:Nevada), a wholly-owned subsidiary of Koba. To consummate the purchase transaction, Fairchild will issue and deliver to Koba 3,000,000 FAIR shares of common stock at a deemed price of CDN$0.05 per share and grant to Koba a One Percent (1 %) Net Smelter Returns Royalty, of which 50% of this royalty may be repurchased by Fairchild at any time for a cash consideration of CDN$1,000,000. This agreement is subject to acceptance by the TSX Venture Exchange. Assets Acquired : The Koba claims contain several excellent mineral exploration targets that are additive to Fairchild's existing claims, including the December Mine antimony-gold prospect, the Poppy Shaft gold system, and the Fitzhugh Lee, Rose, Mobile and Columbia Mine porphyry copper-gold targets . Koba did a substantial amount of geochemical sampling and IP Geophysics, and Fairchild will be receiving this Koba database. Figure 2: IP Geophysics performed by Koba (Click for Link) The Copper Chief Property is a good combination of a perfect geographic location, a 1-hour drive from Las Vegas, all the infrastructure in situ, with a geologically favorable environment; characterized by the existence of a set of multi-target, mainly Skarn-related mineralization, Carbonate Replacement Deposits with Porphyry-style potential, and multi-commodities like Cu-Au-Ag-PGEs. Other critical metals, like antimony can be found on the property with a 4500 g/ton sample found at the December Mine in 2021. With this acquisition Fairchild Gold can now follow up on these and other findings without concern. Copper Chief Targets : Fairchild is focused on the discovery of Porphyry Copper-gold systems (PCDs) and gold-silver-PGEs-antimony vein systems at Copper Chief. More than 15 old prospects and mines are located within the outline of the property. Several types and ages of mineral deposits are present. Fairchild's presently known targets are shown in Figure 3. The #1priority target is the Copper Chief Porphyry which has very high-grade copper mineralization present at the surface in multiple places, and in skarn that may indicate a shallower PCD system. Other ranked targets are: 2025 Targets : Sandy Veins Au-Ag-PGEs-Co Ironside Fault hosted Au-Ag-PGEs-Sb (December/Knickenbocker Mines) Copperside and Skarn/PCD Rose Mine PCD Columbia Mine PCD-Co Whale Cobalt Target Cu /Au Tailings *None of these targets have been previously drilled Figure 3: Fairchild Gold 2025 targets ( Click for Link ) About the Copper Chief Property Situated in Nevada's renowned mineral belts, the Copper Chief Property stands out as a high-potential Cu-Au exploration project. With robust geochemical results and favorable geology, it presents a compelling case for continued exploration and investment. CEO's Statement: \"This agreement with Koba Resources Ltd allows Fairchild to expand the Copper Chief asset with a high mineral potential area, where appropriate exploration surveys were conducted and generated an important database, including geological, geochemical and geophysical information. Fairchild's team will assess and reprocess this data, with the objective of confirming the potential for copper and gold, but not neglecting other critical metals like PGEs, antimony and cobalt. The company will prioritize all the property targets, including the ones coming from this last acquisition, and refining the knowledge already acquired\" - Luis Martins , CEO of Fairchild Gold Corp . QP Statement: Mr. Richard R. Redfern, M.S., C.P.G. No. 10717, is the qualified person as defined by National Instrument 43-101 who has examined the Copper Chief property on the ground numerous times since 2003, and reviewed the geological information available from private and public sources related to the property and is responsible for approving the technical contents of this press release. About KOBA Resources Koba Resources Limited (ASX:KOB) is an Australian exploration company that is focused on a portfolio of uranium projects in Australia and Canada. About Fairchild Gold Corp. Fairchild is engaged in the business of mineral exploration and the acquisition of mineral property assets in North America. Its objective is to locate and develop economic precious and base metal properties of merit and to conduct its exploration program on the Copper Chief Property , Nevada , and the Fairchild Lake Property in Ontario . On behalf of the Board of Directors Luis Martins Director and Chief Executive Officer Fairchild Gold Corp. info@fairchildgold.com (866) 497-0284 Neither the TSX Venture Exchange nor its Regulation Services Provider (as the term is defined in the policies of the TSX Venture Exchange) accepts responsibility for the adequacy of this news release. Cautionary Statement Regarding Forward-Looking Information Certain information contained in this news release constitutes \"forward-looking information\" or \"forward-looking statements\" (collectively, \"forward- looking information\"). Without limiting the foregoing, such forward-looking information includes statements regarding the process and completion of the Offering, the use of proceeds of the Offering and any statements regarding the Company's business plans, expectations and objectives. In this news release, words such as \"may\", \"would\", \"could\", \"will\", \"likely\", \"believe\", \"expect\", \"anticipate\", \"intend\", \"plan\", \"estimate\" and similar words and the negative form thereof are used to identify forward-looking information. Forward-looking information should not be read as guarantees of future performance or results, and will not necessarily be accurate indications of whether, or the times at or by which, such future performance will be achieved. Forward-looking information is based on information available at the time and/or the Company management's good faith belief with respect to future events and is subject to known or unknown risks, uncertainties, assumptions and other unpredictable factors, many of which are beyond the Company's control. For additional information with respect to these and other factors and assumptions underlying the forward-looking information made in this news release, see the Company's most recent Management's Discussion and Analysis and financial statements and other documents filed by the Company with the Canadian securities commissions and the discussion of risk factors set out therein. Such documents are available at www.sedar.com under the Company's profile and on the Company's website, https://fairchildgold.com/. The forward-looking information set forth herein reflects the Company's expectations as at the date of this news release and is subject to change after such date. The Company disclaims any News Release Announcing Offering intention or obligation to update or revise any forward-looking information, whether as a result of new information, future events or otherwise, other than as required by law. Contact Information Steve Cozine info@fairchildgold.com 778-928-7677 SOURCE: Fairchild Gold Corp View the original press release on ACCESS Newswire",
    "primary_commodity": "Cu"
  },
  "articleProject": {
    "gid": 7642,
    "project_name": "Copper Chief",
    "location": null
  },
  "articleExchange": "TSXV",
  "articleCompanyId": 1303,
  "articleTicker": "FAIR",
  "articleCompanyName": "Fairchild Gold Corp.",
  "allOtherCompanyProjects": [
    {
      "company_id": 1303,
      "gid": 3964,
      "project_name": "Fairchild Lake",
      "location": "Ontario, Canada"
    },
    {
      "company_id": 1303,
      "gid": 7642,
      "project_name": "Copper Chief",
      "location": null
    },
    {
      "company_id": 1303,
      "gid": 9807,
      "project_name": "Goodsprings",
      "location": "Nevada, United States"
    }
  ],
  "allOtherCompanyNews": [
    {
      "id": 107263,
      "company_id": 1303,
      "title": "Fairchild Gold Announces Closing of the Second Tranche of Its Previously Announced Private Placement",
      "link": null,
      "date": "2025-06-06T21:25:00.000Z",
      "hidden": false
    },
    {
      "id": 106119,
      "company_id": 1303,
      "title": "Fairchild Announces Upsizing of Its Private Placement",
      "link": null,
      "date": "2025-05-28T21:40:00.000Z",
      "hidden": false
    },
    {
      "id": 105387,
      "company_id": 1303,
      "title": "Fairchild Gold Corp. Discovers New Highly Mineralised Zones at It's Copper Chief Property in Goodsprings, Nevada",
      "link": null,
      "date": "2025-05-21T16:30:00.000Z",
      "hidden": false
    },
    {
      "id": 100692,
      "company_id": 1303,
      "title": "Fairchild Gold Announces Closing of a Private Placement and Provides Corporate Update",
      "link": null,
      "date": "2025-04-23T21:00:00.000Z",
      "hidden": false
    },
    {
      "id": 93119,
      "company_id": 1303,
      "title": "Fairchild Gold Corp. Announces the Appointment of Jill Kelley as Chair of Its Newly Constituted Strategic Advisory Board",
      "link": null,
      "date": "2025-03-31T12:53:00.000Z",
      "hidden": false
    },
    {
      "id": 92730,
      "company_id": 1303,
      "title": "Fairchild Gold Corp Announces Board Changes",
      "link": null,
      "date": "2025-03-27T13:33:00.000Z",
      "hidden": false
    },
    {
      "id": 91413,
      "company_id": 1303,
      "title": "Fairchild Gold Corp Announces Successful Completion of Transaction with Koba Resources Ltd.",
      "link": null,
      "date": "2025-03-14T16:43:00.000Z",
      "hidden": false
    },
    {
      "id": 87458,
      "company_id": 1303,
      "title": "Fairchild Gold Acquires 72 Claims From Koba Resources Adjacent to Its Copper Chief Property at Goodsprings, Nevada",
      "link": "https://www.accessnewswire.com/newsroom/en/metals-and-mining/fairchild-gold-acquires-72-claims-from-koba-resources-adjacent-to-its-copper-chief-983268",
      "date": "2025-02-11T14:10:00.000Z",
      "hidden": false
    },
    {
      "id": 84757,
      "company_id": 1303,
      "title": "Fairchild Gold Reports Anomalous Geochemical Results of up to 8.90% Cu Sampled from Outcrop at Its Copper Chief Property Near Las Vegas, Nevada",
      "link": "https://www.accessnewswire.com/newsroom/en/metals-and-mining/fairchild-gold-reports-anomalous-geochemical-results-of-up-to-890-cu-sampled-from-outcrop-at-its-copper-chief-property-near-las-vegas-nevada-971280",
      "date": "2025-01-21T13:50:00.000Z",
      "hidden": false
    },
    {
      "id": 83319,
      "company_id": 1303,
      "title": "Fairchild Gold Corp. Advances Exploration at its Copper Chief Property and confirms Porphyry Rock outcropping on site",
      "link": "https://www.thenewswire.com/press-releases?id=1LYzF25jX",
      "date": "2025-01-06T17:30:00.000Z",
      "hidden": false
    }
  ]
}
