{
  "article": {
    "id": 33578,
    "link": "https://www.newsfilecorp.com/release/147947/Foremost-Lithium-Completes-Acquisition-of-The-Little-Granite-Mine-in-the-Winston-Group-of-Properties-New-Mexico-USA-Announces-Chairman-Executive-and-Adviser-Appointments",
    "title": "Foremost Lithium Completes Acquisition of The Little Granite Mine in the Winston Group of Properties, New Mexico, USA, Announces Chairman, Executive and Adviser Appointments",
    "description": "<img id=\"367\" width=\"2\" height=\"2\" style=\"width: 1px;  height: 1px;border: 0px solid;\" src=\"https://api.newsfilecorp.com/newsinfo/147947/367\" /><p>Vancouver, British Columbia--(Newsfile Corp. - December 14, 2022) - <b>Foremost Lithium Resource &#38; Technology Ltd.</b> <b>(CSE: FAT) (OTCQB: FRRSF) (FSE: F0R0) (WKN: A3DCC8) (</b><a href=\"https://www.newsfilecorp.com/redirect/8AYxZhJ1kJ\"><b>www.foremostlithium.com</b></a><b>) (</b>\"<b>Foremost Lithium</b>\"<b>, </b>\"<b>Foremost</b>\"<b> </b>or the \"<b>Company</b>\"<b>) </b>is pleased to announce further to its news release of March 31, 2015, that it has entered into an amended property acquisition agreement pursuant to which it has acquired 100% interest of the Little Granite Claims in the Winston Group of Properties Gold/Silver Project (the \"<b>Property</b>\").  </p><p>Under the amended terms, Foremost successfully negotiated the final cash payment required to exercise its option on the Property from $380,000USD to $75,000USD which has been satisfied through the issuance a non-interest-bearing promissory note to the arm's length Vendor (the \"<b>Note</b>\"). The Note is due and payable by October 15, 2023, of which an initial $25,000 payment has been made. Following these amendments, the Company has acquired the Property for aggregate consideration of $186,000USD, versus aggregate consideration of $434,000USD under the original terms.</p><p>The Winston Gold and Silver Project is home to three historic producing mines: Ivanhoe, Emporia, and Little Granite located in Sierra County, New Mexico, USA.  The project covers a 2780-acre property consisting of 139 unpatented BLM (Bureau of Land Management) mining claims and 2 patented Ivanhoe and Emporia lode mining claims. The Little Granite Mine has been worked during several periods since discovery in the 1870s; workings consist of 3 shafts, a 470ft decline, and several underground levels. The historic mines are hosted by north-south orientated vein systems which display characteristics typical of low sulphidation epithermal style mineralization, carrying grades in gold and silver. A sampling program at the Little Granite Mine last year, returned results ranging from 0.10 to 66.50 g/t gold and 7.6 to 2,940 g/t silver as disclosed in the Company's press release on June 29, 2022.</p><p>Jason Barnard, Foremost's President and CEO states,&#160;<i>\"The Winston Gold/Silver Project is an exceptional property with strong potential, returning assays as high 66 g/t gold and 4,610 g/t silver. Significantly reducing our capex, allows us to redirect the budget to a 2023 drill program in New Mexico, which our Company and shareholders have anticipated for many years. I look forward to strategizing these objectives with our new board and management team.\"</i></p><p>Foremost would like to announce they have made the following key appointments:</p><p><b>Chairman of the Board</b></p><p>Mike McLeod has over 40 years of experience in the corporate financial services industry. He has been a long-term member of the Canadian Investor Relations Institute and Governance Professionals of Canada. Mr. McLeod has served as advisor to and counseled many boards of directors and management teams on a wide range of topics including corporate governance, capital markets intelligence, M&#38;A transactions, and shareholder engagement and communications.<b> </b></p><p><b>Chief Financial Officer and Corporate Secretary</b></p><p>Cyrus Driver is a Chartered Accountant and was founding partner in the firm of Driver Anderson since its inception in 1981. He is a retired partner in the firm of Davidson and Company LLP after merging with them in 2002. Whilst providing general public accounting services to a wide range of clients, he specializes in servicing TSX Venture Exchange-listed companies and members of the brokerage community. He also serves on the boards of several listed companies. Mr. Driver's roles as CFO and Corporate Secretary will commence on January 01, 2023.</p><p><b>Advisory Board</b></p><p>Raymond Strafehl is a current director at Tearlach Resources, recently stepping down as President and CEO.  He was a former stock exchange trader, investment advisor and registered Commodity Trading Advisor for more than 20 years. Mr. Strafehl negotiated the $170 million takeover transaction of Valley High Ventures Ltd. He served several public mining companies in roles as president, director, and corporate relations over the past 15 years.</p><p><b>Option Grant</b></p><p>Foremost announces it has granted incentive stock options to purchase an aggregate of 1,550,000 common shares of the Company at an exercise price of $0.19 per common share expiring three years from the date of grant. The stock options are granted to certain officers, directors, consultants, employees, and advisors to the Company in accordance with the terms and conditions of the Company's Rolling Stock Option Plan, which was approved by the shareholders at the Company's annual general meeting, and the policies of the Canadian Securities Exchange.</p><p>In Connection with Mr. Driver's appointment as CFO effective January 1, 2023, Foremost's current CFO, Andrew Lyons, has announced his intention to resign in that role effective January 1, 2023.The Company would like to thank Mr. Lyons for his contributions over the last year, and he will continue to serve in his capacity on the board of directors. The Company would like to confirm John Gravelle and Pierre Yves Tenn did not stand for re-election at the most recent AGM and are no longer associated with the Company.  Foremost wishes them well in their future endeavors.  </p><p><b>QP Statement</b></p><p>Geologic sampling was completed by Michael Feinstein, PhD, CPG.  Mr. Feinstein is the Qualified Person (Q.P.) and has approved the technical material contained in this document. All samples are collected and maintained in accordance with established QA/QC protocols. </p><p><b>On Behalf of the Board of Directors</b><br />Jason Barnard, President and CEO<br />Email: <a href=\"mailto:info@foremostlithium.com\">info@foremostlithium.com</a> <br />Phone: +1 (604) 330-8067</p><p>The Canadian Securities Exchange has neither approved nor disapproved the contents of this news release and accepts no responsibility for the adequacy or accuracy hereof.</p><p><b>About Foremost Lithium Resource &#38; Technology Ltd.</b></p><p>Foremost Lithium is a hard-rock exploration company strategically located to capitalize on the world's growing EV appetite and is committed to being a premier supplier of North America's lithium feedstock. As the world transitions towards decarbonization, the Company is focused on exploration and growth on its 5 Lithium Lane Projects in Snow Lake Manitoba. Foremost Lithium also has the Winston Gold/Silver Property in New Mexico USA. </p><p>Follow us or contact us on social media: <br />Twitter: <a href=\"https://www.newsfilecorp.com/redirect/KJbDkhxp8M\">@foremostlithium</a> <br />Linkedin: <a href=\"https://www.newsfilecorp.com/redirect/ErbxjsZJOA\">https://www.linkedin.com/company/foremost-lithium-resourcetechnology/mycompany</a> <br />Facebook: <a href=\"https://www.newsfilecorp.com/redirect/xOYQZHwNXJ\">https://www.facebook.com/ForemostLithium</a></p><p><b>Forward-Looking Statements</b></p><p>This news release contains \"forward-looking statements\" and \"forward looking information\" (as defined under applicable securities laws), based on management's best estimates, assumptions, and current expectations. Such statements include but are not limited to, statements with respect to the plans for future exploration and development of the Company's properties and the acquisition of additional exploration projects. Generally, these forward-looking statements can be identified by the use of forward-looking terminology such as \"expects\", \"expected\", \"budgeted\", \"forecasts\", \"anticipates\" \"plans\", \"anticipates\", \"believes\", \"intends\", \"estimates\", \"projects\", \"aims\", \"potential\", \"goal\", \"objective\", \"prospective\", and similar expressions, or that events or conditions \"will\", \"would\", \"may\", \"can\", \"could\" or \"should\" occur. These statements should not be read as guarantees of future performance or results. Such statements involve known and unknown risks, uncertainties and other factors that may cause actual results, performance or achievements to be materially different from those expressed or implied by such statements, including but not limited to:  risks related to the receipt of all necessary regulatory and third party approvals for the proposed operations of the Company's business and exploration activities, completion of the Company's recently announced financing, risks related to the Company's exploration properties; risks related to international operations; risks related to general economic conditions, actual results of current exploration activities, unanticipated reclamation expenses; changes in project parameters as plans continue to be refined; fluctuations in prices of commodities including lithium and gold; fluctuations in foreign currency exchange rates, increases in market prices of mining consumables, possible variations in reserves; failure of plant, equipment or processes to operate as anticipated; accidents, labour disputes, title disputes, claims and limitations on insurance coverage and other risks of the mining industry; delays in the completion of exploration, development or construction activities, changes in national and local government regulation of mining operations, tax rules and regulations, and political and economic developments in jurisdictions in which the Company operates. Although the Company has attempted to identify important factors that could cause actual results to differ materially from those contained in forward-looking statements, there may be other factors that cause results not to be as anticipated, estimated or intended. There can be no assurance that such statements will prove to be accurate, as actual results and future events could differ materially from those anticipated in such statements. The forward-looking statements and forward-looking information are made as of the date hereof and are qualified in their entirety by this cautionary statement. The Company disclaims any obligation to revise or update any such factors or to publicly announce the result of any revisions to any forward-looking statements or forward-looking information contained herein to reflect future results, events or developments, except as require by law. Accordingly, readers should not place undue reliance on forward-looking statements and information. Please refer to the Company's most recent filings under its profile at <a href=\"https://www.newsfilecorp.com/redirect/7epxZCw1mq\">www.sedar.com</a> for further information respecting the risks affecting the Company and its business.</p><p id=\"corporateNewsLogoContainer\"><img src=\"https://images.newsfilecorp.com/files/4689/147947_fb04024e04806b17_logo.jpg\" id=\"corporateNewsLogo\" alt=\"Corporate Logo\" /></p><p id=\"corporateLinkBack\">To view the source version of this press release, please visit <a href=\"https://www.newsfilecorp.com/redirect/e4VGKhxXye\">https://www.newsfilecorp.com/release/147947</a></p>",
    "search_terms": "Winston,Foremost Clean Energy Ltd,FAT",
    "master_gid": 4422,
    "date": "2022-12-14T13:30:00.000Z",
    "tags": "Mexico,USA|New Mexico||Gold,Lithium,Silver|Project Acquisition",
    "image_id": null,
    "hidden": false,
    "company_id": 839,
    "provider": null,
    "excerpt": "Vancouver, British Columbia--(Newsfile Corp. - December 14, 2022) -Foremost Lithium Resource &#38; Technology Ltd.(CSE: FAT) (OTCQB: FRRSF) (FSE: F0R0) (WKN: A3DCC8) (www.foremostlithium.com) (\"Foremost Lithium\",\"Foremost\"or the \"Company\")is pleased to announce further to its news release of March 31, 2015, that it has entered into an amended property acquisition agreement pursuant to",
    "is_regulatory": false,
    "refined_tags": [
      "Project Acquisition"
    ],
    "ftp_filename": null,
    "company_name": "Rio Grande Resources Ltd.",
    "exchange": "CSE",
    "root_ticker": "FAT",
    "project_name": "Winston",
    "gid": 4422,
    "location": "New Mexico, United States",
    "plan_id": null,
    "description_text": "Vancouver, British Columbia--(Newsfile Corp. - December 14, 2022) - Foremost Lithium Resource & Technology Ltd. (CSE: FAT) (OTCQB: FRRSF) (FSE: F0R0) (WKN: A3DCC8) ( www.foremostlithium.com ) ( \" Foremost Lithium \" , \" Foremost \" or the \" Company \" ) is pleased to announce further to its news release of March 31, 2015, that it has entered into an amended property acquisition agreement pursuant to which it has acquired 100% interest of the Little Granite Claims in the Winston Group of Properties Gold/Silver Project (the \" Property \"). Under the amended terms, Foremost successfully negotiated the final cash payment required to exercise its option on the Property from $380,000USD to $75,000USD which has been satisfied through the issuance a non-interest-bearing promissory note to the arm's length Vendor (the \" Note \"). The Note is due and payable by October 15, 2023, of which an initial $25,000 payment has been made. Following these amendments, the Company has acquired the Property for aggregate consideration of $186,000USD, versus aggregate consideration of $434,000USD under the original terms. The Winston Gold and Silver Project is home to three historic producing mines: Ivanhoe, Emporia, and Little Granite located in Sierra County, New Mexico, USA.  The project covers a 2780-acre property consisting of 139 unpatented BLM (Bureau of Land Management) mining claims and 2 patented Ivanhoe and Emporia lode mining claims. The Little Granite Mine has been worked during several periods since discovery in the 1870s; workings consist of 3 shafts, a 470ft decline, and several underground levels. The historic mines are hosted by north-south orientated vein systems which display characteristics typical of low sulphidation epithermal style mineralization, carrying grades in gold and silver. A sampling program at the Little Granite Mine last year, returned results ranging from 0.10 to 66.50 g/t gold and 7.6 to 2,940 g/t silver as disclosed in the Company's press release on June 29, 2022. Jason Barnard, Foremost's President and CEO states, \"The Winston Gold/Silver Project is an exceptional property with strong potential, returning assays as high 66 g/t gold and 4,610 g/t silver. Significantly reducing our capex, allows us to redirect the budget to a 2023 drill program in New Mexico, which our Company and shareholders have anticipated for many years. I look forward to strategizing these objectives with our new board and management team.\" Foremost would like to announce they have made the following key appointments: Chairman of the Board Mike McLeod has over 40 years of experience in the corporate financial services industry. He has been a long-term member of the Canadian Investor Relations Institute and Governance Professionals of Canada. Mr. McLeod has served as advisor to and counseled many boards of directors and management teams on a wide range of topics including corporate governance, capital markets intelligence, M&A transactions, and shareholder engagement and communications. Chief Financial Officer and Corporate Secretary Cyrus Driver is a Chartered Accountant and was founding partner in the firm of Driver Anderson since its inception in 1981. He is a retired partner in the firm of Davidson and Company LLP after merging with them in 2002. Whilst providing general public accounting services to a wide range of clients, he specializes in servicing TSX Venture Exchange-listed companies and members of the brokerage community. He also serves on the boards of several listed companies. Mr. Driver's roles as CFO and Corporate Secretary will commence on January 01, 2023. Advisory Board Raymond Strafehl is a current director at Tearlach Resources, recently stepping down as President and CEO.  He was a former stock exchange trader, investment advisor and registered Commodity Trading Advisor for more than 20 years. Mr. Strafehl negotiated the $170 million takeover transaction of Valley High Ventures Ltd. He served several public mining companies in roles as president, director, and corporate relations over the past 15 years. Option Grant Foremost announces it has granted incentive stock options to purchase an aggregate of 1,550,000 common shares of the Company at an exercise price of $0.19 per common share expiring three years from the date of grant. The stock options are granted to certain officers, directors, consultants, employees, and advisors to the Company in accordance with the terms and conditions of the Company's Rolling Stock Option Plan, which was approved by the shareholders at the Company's annual general meeting, and the policies of the Canadian Securities Exchange. In Connection with Mr. Driver's appointment as CFO effective January 1, 2023, Foremost's current CFO, Andrew Lyons, has announced his intention to resign in that role effective January 1, 2023.The Company would like to thank Mr. Lyons for his contributions over the last year, and he will continue to serve in his capacity on the board of directors. The Company would like to confirm John Gravelle and Pierre Yves Tenn did not stand for re-election at the most recent AGM and are no longer associated with the Company.  Foremost wishes them well in their future endeavors. QP Statement Geologic sampling was completed by Michael Feinstein, PhD, CPG.  Mr. Feinstein is the Qualified Person (Q.P.) and has approved the technical material contained in this document. All samples are collected and maintained in accordance with established QA/QC protocols. On Behalf of the Board of Directors Jason Barnard, President and CEO Email: info@foremostlithium.com Phone: +1 (604) 330-8067 The Canadian Securities Exchange has neither approved nor disapproved the contents of this news release and accepts no responsibility for the adequacy or accuracy hereof. About Foremost Lithium Resource & Technology Ltd. Foremost Lithium is a hard-rock exploration company strategically located to capitalize on the world's growing EV appetite and is committed to being a premier supplier of North America's lithium feedstock. As the world transitions towards decarbonization, the Company is focused on exploration and growth on its 5 Lithium Lane Projects in Snow Lake Manitoba. Foremost Lithium also has the Winston Gold/Silver Property in New Mexico USA. Follow us or contact us on social media: Twitter: @foremostlithium Linkedin: https://www.linkedin.com/company/foremost-lithium-resourcetechnology/mycompany Facebook: https://www.facebook.com/ForemostLithium Forward-Looking Statements This news release contains \"forward-looking statements\" and \"forward looking information\" (as defined under applicable securities laws), based on management's best estimates, assumptions, and current expectations. Such statements include but are not limited to, statements with respect to the plans for future exploration and development of the Company's properties and the acquisition of additional exploration projects. Generally, these forward-looking statements can be identified by the use of forward-looking terminology such as \"expects\", \"expected\", \"budgeted\", \"forecasts\", \"anticipates\" \"plans\", \"anticipates\", \"believes\", \"intends\", \"estimates\", \"projects\", \"aims\", \"potential\", \"goal\", \"objective\", \"prospective\", and similar expressions, or that events or conditions \"will\", \"would\", \"may\", \"can\", \"could\" or \"should\" occur. These statements should not be read as guarantees of future performance or results. Such statements involve known and unknown risks, uncertainties and other factors that may cause actual results, performance or achievements to be materially different from those expressed or implied by such statements, including but not limited to:  risks related to the receipt of all necessary regulatory and third party approvals for the proposed operations of the Company's business and exploration activities, completion of the Company's recently announced financing, risks related to the Company's exploration properties; risks related to international operations; risks related to general economic conditions, actual results of current exploration activities, unanticipated reclamation expenses; changes in project parameters as plans continue to be refined; fluctuations in prices of commodities including lithium and gold; fluctuations in foreign currency exchange rates, increases in market prices of mining consumables, possible variations in reserves; failure of plant, equipment or processes to operate as anticipated; accidents, labour disputes, title disputes, claims and limitations on insurance coverage and other risks of the mining industry; delays in the completion of exploration, development or construction activities, changes in national and local government regulation of mining operations, tax rules and regulations, and political and economic developments in jurisdictions in which the Company operates. Although the Company has attempted to identify important factors that could cause actual results to differ materially from those contained in forward-looking statements, there may be other factors that cause results not to be as anticipated, estimated or intended. There can be no assurance that such statements will prove to be accurate, as actual results and future events could differ materially from those anticipated in such statements. The forward-looking statements and forward-looking information are made as of the date hereof and are qualified in their entirety by this cautionary statement. The Company disclaims any obligation to revise or update any such factors or to publicly announce the result of any revisions to any forward-looking statements or forward-looking information contained herein to reflect future results, events or developments, except as require by law. Accordingly, readers should not place undue reliance on forward-looking statements and information. Please refer to the Company's most recent filings under its profile at www.sedar.com for further information respecting the risks affecting the Company and its business. To view the source version of this press release, please visit https://www.newsfilecorp.com/release/147947",
    "primary_commodity": "Au"
  },
  "articleProject": {
    "gid": 4422,
    "project_name": "Winston",
    "location": "New Mexico, United States"
  },
  "articleExchange": "CSE",
  "articleCompanyId": 839,
  "articleTicker": "FAT",
  "articleCompanyName": "Foremost Clean Energy Ltd",
  "allOtherCompanyProjects": [
    {
      "company_id": 839,
      "gid": 3614,
      "project_name": "Peg North",
      "location": "Manitoba, Canada"
    },
    {
      "company_id": 839,
      "gid": 2237,
      "project_name": "Jean Lake",
      "location": "Manitoba, Canada"
    },
    {
      "company_id": 839,
      "gid": 3615,
      "project_name": "Grass River",
      "location": "Manitoba, Canada"
    },
    {
      "company_id": 839,
      "gid": 4422,
      "project_name": "Winston",
      "location": "New Mexico, United States"
    },
    {
      "company_id": 839,
      "gid": 8809,
      "project_name": "Hatchet Lake",
      "location": null
    },
    {
      "company_id": 839,
      "gid": 3616,
      "project_name": "JOL",
      "location": "Manitoba, Canada"
    },
    {
      "company_id": 839,
      "gid": 4270,
      "project_name": "Lac Simard South",
      "location": "Quebec, Canada"
    },
    {
      "company_id": 839,
      "gid": 2205,
      "project_name": "Zoro",
      "location": "Manitoba, Canada"
    }
  ],
  "allOtherCompanyNews": [
    {
      "id": 108161,
      "company_id": 839,
      "title": "Foremost Clean Energy Fortifies Its Treasury with over $4.5 Million in Warrant and Option Exercises and Extends Successful National Marketing Campaign",
      "link": null,
      "date": "2025-06-16T13:00:00.000Z",
      "hidden": false
    },
    {
      "id": 107529,
      "company_id": 839,
      "title": "Foremost Clean Energy Announces 3-Year Exploration Drill Permit for CLK Uranium Property Showcasing Exploration Pipeline",
      "link": null,
      "date": "2025-06-10T12:30:00.000Z",
      "hidden": false
    },
    {
      "id": 107119,
      "company_id": 839,
      "title": "Foremost Clean Energy Announces 3-Year Exploration Drill Permit for Murphy Lake South Uranium Property; Targeting Summer Drill Program",
      "link": null,
      "date": "2025-06-05T13:00:00.000Z",
      "hidden": false
    },
    {
      "id": 106591,
      "company_id": 839,
      "title": "Foremost Clean Energy Strengthens Leadership Team with Appointment of Cameron MacKay as Vice President of Exploration",
      "link": null,
      "date": "2025-06-02T13:00:00.000Z",
      "hidden": false
    },
    {
      "id": 105922,
      "company_id": 839,
      "title": "Foremost Clean Energy Successfully Regains Compliance with Nasdaq Minimum Bid Price Requirement Supported by Significant Trading Volume and +260% Increase in Share Price",
      "link": null,
      "date": "2025-05-27T13:00:00.000Z",
      "hidden": false
    },
    {
      "id": 104811,
      "company_id": 839,
      "title": "Foremost Clean Energy Completes Highly Successful Exploration Drill Program at Hatchet Uranium Property and Provides Corporate Update",
      "link": null,
      "date": "2025-05-15T13:00:00.000Z",
      "hidden": false
    },
    {
      "id": 103864,
      "company_id": 839,
      "title": "Foremost Clean Energy Announces the Successful Completion of Airborne Geophysical Survey Over its CLK Uranium Property",
      "link": null,
      "date": "2025-05-07T13:00:00.000Z",
      "hidden": false
    },
    {
      "id": 103476,
      "company_id": 839,
      "title": "Foremost Clean Energy Announces Warrant Incentive Program",
      "link": null,
      "date": "2025-05-05T13:00:00.000Z",
      "hidden": false
    },
    {
      "id": 103049,
      "company_id": 839,
      "title": "Foremost Clean Energy Reports New Discovery of Uranium Mineralization at Hatchet Lake Property",
      "link": null,
      "date": "2025-05-01T12:30:00.000Z",
      "hidden": false
    },
    {
      "id": 101877,
      "company_id": 839,
      "title": "Foremost Clean Energy Announces National Marketing Campaign",
      "link": null,
      "date": "2025-04-28T12:00:00.000Z",
      "hidden": false
    }
  ]
}