{
  "article": {
    "id": 42566,
    "link": "https://www.globenewswire.com/news-release/2023/10/17/2761519/0/en/Foremost-Lithium-Finalizes-Acquisition-Of-The-Little-Granite-Gold-Silver-Mine-in-New-Mexico-and-Provides-Business-Update-for-Winston-Group-Of-Properties.html",
    "title": "Foremost Lithium Finalizes Acquisition Of The Little Granite Gold/Silver Mine in New Mexico and Provides Business Update for Winston Group Of Properties",
    "description": "<p align=\"justify\">VANCOUVER, British Columbia, Oct.  17, 2023  (GLOBE NEWSWIRE) -- <strong>Foremost Lithium Resource &amp; Technology Ltd. (NASDAQ: FMST) (CSE: FAT) </strong>(“<strong>Foremost Lithium</strong>”, “<strong>Foremost</strong>” or the “<strong>Company</strong>”), a North American hard-rock lithium exploration company, today announced that it has made the third and final cash payment in the amount of $25,000USD to acquire a 100% interest in and to the Little Granite Gold/Silver Mine claims (collectively, the <strong>\"Property\"</strong>) within the Winston Group of Properties as previously announced on December 14, 2022.</p>  <p align=\"justify\">Under the amended terms of this acquisition, Foremost successfully negotiated a reduction in the final cash payment required to exercise its option to acquire the Property from $380,000USD to $75,000USD (which was paid) which had been satisfied through the issuance a non-interest-bearing promissory note to the arm's length Property Vendor (the <strong>\"Note\"</strong>). The Note was due and payable by October 15, 2023 and, following the amendments, the Company has now acquired the Property for aggregate consideration of $186,000USD versus aggregate consideration of $434,000USD under the original terms of the acquisition.</p>  <p align=\"justify\"><em>“This is a great property, drilled in 1980’s with a historical geologic report by geologist Christopher B. Dewitt, detailing the tracing of a gold bearing vein for over 1,000 feet with assay results returning gold grades of over one ounce per ton</em><sup>1</sup><em>” </em>comments Jason Barnard, Chief Executive Officer and President of Foremost. <em>“As the precious metals market resumes its uptrend, I expect investors will begin to recognize the value of this property. It’s great to be part of an organization with a portfolio that is rich not just in battery minerals but also precious metals, which adds another layer of opportunity for our company and its stakeholders to increase value. The Board and I would also like to Thank Ray Strafehl who was integral in assisting us with the acquisition of Little Granite Gold/Silver Mine claims.”</em></p>  <p><img alt=\"Location of the Winston Property Winston, New Mexico\" data-mce-src=\"/api/ImageRender/DownloadFile?resourceId=bb9218db-7e24-46cf-bc6b-4b727733ff3f&amp;size=3\" height=\"505\" name=\"GNW_RichHtml_External_IMG\" src=\"https://ml.globenewswire.com/Resource/Download/bb9218db-7e24-46cf-bc6b-4b727733ff3f\" width=\"600\" /><br /></p>  <p><strong>Figure. 1 - Location of the Winston Property Winston, New Mexico</strong></p>  <p align=\"justify\">Foremost has extended its land holdings most recently by staking seven additional claims at the north end of the Property. The purpose was to secure a more solid holding of the northern extension of the PayMaster Fault, a structural trend known for historic gold discoveries. The Winston Property now consists of 147 unpatented mining claims and 2 patented Ivanhoe and Emporia lode mining claims, comprising a total of 3,000 acres.</p>  <p align=\"justify\">The Winston Group of Properties contains three historic mines: Ivanhoe; Emporia; and Little Granite; located in Sierra County, New Mexico, USA. The Little Granite Mine has been worked during several periods since discovery in the 1870s; workings consist of 3 shafts, a 470ft decline and several underground levels. The historic mines are hosted by north-south orientated vein systems which display characteristics typical of low sulphidation epithermal style mineralization, carrying grades in gold and silver. A sampling program at the Little Granite Mine last year returned results ranging from 0.10 to 66.50 g/t gold and 7.6 to 2,940 g/t silver as disclosed in the Company's press release on June 29, 2022.</p>  <p align=\"justify\">Foremost contracted KLM Geophysical Exploration, from Caliente, Nevada, to complete a ground magnetic survey in Spring 2023. This data was processed to generate Total Magnetic Intensity and other map products which provide important structural context for the Property. A 3D GIS (<strong>“Geographic Information System”</strong>) is used for all drill targeting and project planning. Special attention was given to maintaining a high level of vertical accuracy due to the local topography. Data compilation both of historic and recent work, along with acquisition of Magnetic and LiDAR data, has enabled the construction of a high-precision geologic model.</p>  <p align=\"justify\">Current exploration plans for the Winston Group of Properties include review and focus along the northern portion of the 7km long Paymaster Fault.</p>  <p><strong>QP Statement</strong></p>  <p align=\"justify\">The technical content of this news release has been reviewed by Dr. Michael Feinstein, CPG, who is a Qualified Person as defined in NI 43-101 and as defined by SEC’s S-K 1300.</p>  <p align=\"justify\"><strong>About Foremost Lithium</strong></p>  <p align=\"justify\">Foremost Lithium (NASDAQ: FMST) (CSE: FAT) (FSE: F0R0) (WKN: A3DCC8) is a hard-rock lithium exploration company focused on empowering the North American clean energy economy. Foremost’s strategically located lithium properties extend over 43,000 acres in Snow Lake, Manitoba, and includes a property in a known active lithium camp situated on over 11,400 acres in Quebec called Lac Simard South.</p>  <p align=\"justify\">Foremost’s four flagship Lithium Lane Projects (Zoro, Jean Lake, GRC, and Peg North), as well as its Lac Simard South project, are located at the tip of the NAFTA superhighway to capitalize on the world's growing EV appetite, strongly positioning the Company to become a premier supplier of North America's lithium feedstock. As the world transitions towards decarbonization, the Company's objective is the extraction of lithium oxide (Li₂O), and to subsequently play a role in the production of high-quality lithium hydroxide (LiOH), to help power lithium-based batteries, critical in developing a clean-energy economy. Foremost Lithium also has the Winston Gold/Silver Property in New Mexico, USA. Learn More at www.foremostlithium.com.</p>  <p><strong>Follow us or contact us on social media:</strong><br />Twitter: @foremostlithium<br />Linkedin: <a href=\"https://www.globenewswire.com/Tracker?data=861F0n9-aw_sLmYUgSN6mMReh3uKenhFgDZZ1R3t9znRiMGX4xCNXyoGhGf0aPMS5T430s4oWAzH8xOMqoKF9FFDrXYxw9e17ZyLyeUvcOgk9CTj9oZHP39EzM4vrjxvmbqzQhR7T6ess11lKoXA9UpjAnX4vC6sg-OKS-TijLxUvAsPS-0pqtKG7F1Un45T21jvRIKl6NLKu8o7HzRm4QAd8Wht9tb6olCAMZGeO0g=\" rel=\"nofollow\" target=\"_blank\" title=\"\"><u>https://www.linkedin.com/company/foremost-lithium-resource-technology</u></a><u>/</u> <br />Facebook: <a href=\"https://www.globenewswire.com/Tracker?data=861F0n9-aw_sLmYUgSN6mGHDIBPX3RY42EHiz5oYdV2piLUmODeoP3gvBMxqH7Bx-_MhIEPXfAjHbfA4ckJfsWT6nf9416atCyRQiWVi-1uplo05mS_L03e9Z3ivXsoo0VpwxennrPEXn4aRs2_t9Q==\" rel=\"nofollow\" target=\"_blank\" title=\"\"><u>https://www.facebook.com/ForemostLithium</u></a></p>  <p><strong>Company</strong><br />Jason Barnard, President and CEO<br />+1 (604) 330-8067<br /><a href=\"https://www.globenewswire.com/Tracker?data=6rtdOOhsx1Lntm0AWr6xbWvO7VeTmxV4abFMS6OrdADLuVtVOj2_kyB7rchNIVZ7qqapXp3PcwX8s952NHQuLrGl300nz2IBLS_mw73mr8g=\" rel=\"nofollow\" target=\"_blank\" title=\"\"><u>info@foremostlithium.com</u></a><br /><br /><strong>Investor Relations</strong><br />Michael Kim or Brooks Hamilton<br />MZ North America <br />+1 (737) 289-0835<br /><a href=\"https://www.globenewswire.com/Tracker?data=WCUuSvefQOKJW3BeaHkOQy2fGsrWPiS5UeIcxwPA7YTyA7NkNBPIPriEG_5mQpkxnUgM_ddULymKFMnNrgyjiw==\" rel=\"nofollow\" target=\"_blank\" title=\"\"><u>FMST@mzgroup.us</u></a></p>  <p align=\"justify\"><em>The CSE has neither approved nor disapproved the contents of this news release. The CSE does not accept responsibility for the adequacy or accuracy of this release.</em></p>  <p align=\"justify\"><strong>Forward-Looking Statements</strong></p>  <p align=\"justify\">This news release contains \"forward-looking statements\" and \"forward-looking information\" (as defined under applicable securities laws), based on management's best estimates, assumptions, and current expectations. Such statements include but are not limited to, statements with respect to the plans for future exploration and development of the Company's properties and the acquisition of additional exploration projects. Generally, these forward-looking statements can be identified by the use of forward-looking terminology such as \"expects\", \"expected\", \"budgeted\", \"forecasts\", \"anticipates\" \"plans\", \"anticipates\", \"believes\", \"intends\", \"estimates\", \"projects\", \"aims\", \"potential\", \"goal\", \"objective\", \"prospective\", and similar expressions, or that events or conditions \"will\", \"would\", \"may\", \"can\", \"could\" or \"should\" occur. These statements should not be read as guarantees of future performance or results. Such statements involve known and unknown risks, uncertainties and other factors that may cause actual results, performance or achievements to be materially different from those expressed or implied by such statements, including but not limited to: risks related to the receipt of all necessary regulatory and third party approvals for the proposed operations of the Company's business and exploration activities, risks related to the Company's exploration properties; risks related to international operations; risks related to general economic conditions, actual results of current exploration activities, unanticipated reclamation expenses; changes in project parameters as plans continue to be refined; fluctuations in prices of commodities including lithium and gold; fluctuations in foreign currency exchange rates, increases in market prices of mining consumables, possible variations in reserves; failure of plant, equipment or processes to operate as anticipated; accidents, labour disputes, title disputes, claims and limitations on insurance coverage and other risks of the mining industry; delays in the completion of exploration, development or construction activities, changes in national and local government regulation of mining operations, tax rules and regulations, and political and economic developments in jurisdictions in which the Company operates. . Although the Company has attempted to identify important factors that could cause actual results to differ materially from those contained in forward-looking statements, there may be other factors that cause results not to be as anticipated, estimated or intended. There can be no assurance that such statements will prove to be accurate, as actual results and future events could differ materially from those anticipated in such statements. The forward-looking statements and forward-looking information are made as of the date hereof and are qualified in their entirety by this cautionary statement. The Company disclaims any obligation to revise or update any such factors or to publicly announce the result of any revisions to any forward-looking statements or forward-looking information contained herein to reflect future results, events, or developments, except as require by law. Accordingly, readers should not place undue reliance on forward-looking statements and information. Please refer to the Company's most recent filings under its profile at www.sedar.com for further information respecting the risks affecting the Company and its business.</p>  <hr />  <p><sup>1</sup> “Economic Evaluation of the Little Granite Mine” (1984) by Christopher B. DeWitt, Numex Geologic and Engineering Services; Source: New Mexico Geological Society, c/o: New Mexico Bureau of Geology &amp; Mineral Resources, 801 Leroy Place Socorro, NM 87801-4796</p>  <p>A photo accompanying this announcement is available at <img src=\"https://ml.globenewswire.com/Resource/Download/bb9218db-7e24-46cf-bc6b-4b727733ff3f?size=original\" alt=\"\"/></p>  <br /><img src='https://ml.globenewswire.com/media/ZTY0NjY0MWYtMDA2Yi00MjVjLTgxYjctYWE4ZWM1NWYzNGQ4LTExOTY5NzQ=/tiny/Foremost-Lithium-Resource-Tech.png' referrerpolicy='no-referrer-when-downgrade' />",
    "search_terms": "Winston,Foremost Clean Energy Ltd,FAT",
    "master_gid": 4422,
    "date": "2023-10-17T12:31:00.000Z",
    "tags": "|||Lithium|Project Acquisition,Project Update",
    "image_id": null,
    "hidden": false,
    "company_id": 839,
    "provider": null,
    "excerpt": "VANCOUVER, British Columbia, Oct.  17, 2023  (GLOBE NEWSWIRE) --Foremost Lithium Resource &amp; Technology Ltd. (NASDAQ: FMST) (CSE: FAT)(“Foremost Lithium”, “Foremost” or the “Company”), a North American hard-rock lithium exploration company, today announced that it has made the third and final cash payment in the amount of $25,000USD to",
    "is_regulatory": false,
    "refined_tags": [
      "Project Acquisition",
      "Project Update"
    ],
    "ftp_filename": null,
    "company_name": "Rio Grande Resources Ltd.",
    "exchange": "CSE",
    "root_ticker": "FAT",
    "project_name": "Winston",
    "gid": 4422,
    "location": "New Mexico, United States",
    "plan_id": null,
    "description_text": "VANCOUVER, British Columbia, Oct.  17, 2023  (GLOBE NEWSWIRE) -- Foremost Lithium Resource & Technology Ltd. (NASDAQ: FMST) (CSE: FAT) (“ Foremost Lithium ”, “ Foremost ” or the “ Company ”), a North American hard-rock lithium exploration company, today announced that it has made the third and final cash payment in the amount of $25,000USD to acquire a 100% interest in and to the Little Granite Gold/Silver Mine claims (collectively, the \"Property\" ) within the Winston Group of Properties as previously announced on December 14, 2022. Under the amended terms of this acquisition, Foremost successfully negotiated a reduction in the final cash payment required to exercise its option to acquire the Property from $380,000USD to $75,000USD (which was paid) which had been satisfied through the issuance a non-interest-bearing promissory note to the arm's length Property Vendor (the \"Note\" ). The Note was due and payable by October 15, 2023 and, following the amendments, the Company has now acquired the Property for aggregate consideration of $186,000USD versus aggregate consideration of $434,000USD under the original terms of the acquisition. “This is a great property, drilled in 1980’s with a historical geologic report by geologist Christopher B. Dewitt, detailing the tracing of a gold bearing vein for over 1,000 feet with assay results returning gold grades of over one ounce per ton 1 ” comments Jason Barnard, Chief Executive Officer and President of Foremost. “As the precious metals market resumes its uptrend, I expect investors will begin to recognize the value of this property. It’s great to be part of an organization with a portfolio that is rich not just in battery minerals but also precious metals, which adds another layer of opportunity for our company and its stakeholders to increase value. The Board and I would also like to Thank Ray Strafehl who was integral in assisting us with the acquisition of Little Granite Gold/Silver Mine claims.” Figure. 1 - Location of the Winston Property Winston, New Mexico Foremost has extended its land holdings most recently by staking seven additional claims at the north end of the Property. The purpose was to secure a more solid holding of the northern extension of the PayMaster Fault, a structural trend known for historic gold discoveries. The Winston Property now consists of 147 unpatented mining claims and 2 patented Ivanhoe and Emporia lode mining claims, comprising a total of 3,000 acres. The Winston Group of Properties contains three historic mines: Ivanhoe; Emporia; and Little Granite; located in Sierra County, New Mexico, USA. The Little Granite Mine has been worked during several periods since discovery in the 1870s; workings consist of 3 shafts, a 470ft decline and several underground levels. The historic mines are hosted by north-south orientated vein systems which display characteristics typical of low sulphidation epithermal style mineralization, carrying grades in gold and silver. A sampling program at the Little Granite Mine last year returned results ranging from 0.10 to 66.50 g/t gold and 7.6 to 2,940 g/t silver as disclosed in the Company's press release on June 29, 2022. Foremost contracted KLM Geophysical Exploration, from Caliente, Nevada, to complete a ground magnetic survey in Spring 2023. This data was processed to generate Total Magnetic Intensity and other map products which provide important structural context for the Property. A 3D GIS ( “Geographic Information System” ) is used for all drill targeting and project planning. Special attention was given to maintaining a high level of vertical accuracy due to the local topography. Data compilation both of historic and recent work, along with acquisition of Magnetic and LiDAR data, has enabled the construction of a high-precision geologic model. Current exploration plans for the Winston Group of Properties include review and focus along the northern portion of the 7km long Paymaster Fault. QP Statement The technical content of this news release has been reviewed by Dr. Michael Feinstein, CPG, who is a Qualified Person as defined in NI 43-101 and as defined by SEC’s S-K 1300. About Foremost Lithium Foremost Lithium (NASDAQ: FMST) (CSE: FAT) (FSE: F0R0) (WKN: A3DCC8) is a hard-rock lithium exploration company focused on empowering the North American clean energy economy. Foremost’s strategically located lithium properties extend over 43,000 acres in Snow Lake, Manitoba, and includes a property in a known active lithium camp situated on over 11,400 acres in Quebec called Lac Simard South. Foremost’s four flagship Lithium Lane Projects (Zoro, Jean Lake, GRC, and Peg North), as well as its Lac Simard South project, are located at the tip of the NAFTA superhighway to capitalize on the world's growing EV appetite, strongly positioning the Company to become a premier supplier of North America's lithium feedstock. As the world transitions towards decarbonization, the Company's objective is the extraction of lithium oxide (Li₂O), and to subsequently play a role in the production of high-quality lithium hydroxide (LiOH), to help power lithium-based batteries, critical in developing a clean-energy economy. Foremost Lithium also has the Winston Gold/Silver Property in New Mexico, USA. Learn More at www.foremostlithium.com. Follow us or contact us on social media: Twitter: @foremostlithium Linkedin: https://www.linkedin.com/company/foremost-lithium-resource-technology / Facebook: https://www.facebook.com/ForemostLithium Company Jason Barnard, President and CEO +1 (604) 330-8067 info@foremostlithium.com Investor Relations Michael Kim or Brooks Hamilton MZ North America +1 (737) 289-0835 FMST@mzgroup.us The CSE has neither approved nor disapproved the contents of this news release. The CSE does not accept responsibility for the adequacy or accuracy of this release. Forward-Looking Statements This news release contains \"forward-looking statements\" and \"forward-looking information\" (as defined under applicable securities laws), based on management's best estimates, assumptions, and current expectations. Such statements include but are not limited to, statements with respect to the plans for future exploration and development of the Company's properties and the acquisition of additional exploration projects. Generally, these forward-looking statements can be identified by the use of forward-looking terminology such as \"expects\", \"expected\", \"budgeted\", \"forecasts\", \"anticipates\" \"plans\", \"anticipates\", \"believes\", \"intends\", \"estimates\", \"projects\", \"aims\", \"potential\", \"goal\", \"objective\", \"prospective\", and similar expressions, or that events or conditions \"will\", \"would\", \"may\", \"can\", \"could\" or \"should\" occur. These statements should not be read as guarantees of future performance or results. Such statements involve known and unknown risks, uncertainties and other factors that may cause actual results, performance or achievements to be materially different from those expressed or implied by such statements, including but not limited to: risks related to the receipt of all necessary regulatory and third party approvals for the proposed operations of the Company's business and exploration activities, risks related to the Company's exploration properties; risks related to international operations; risks related to general economic conditions, actual results of current exploration activities, unanticipated reclamation expenses; changes in project parameters as plans continue to be refined; fluctuations in prices of commodities including lithium and gold; fluctuations in foreign currency exchange rates, increases in market prices of mining consumables, possible variations in reserves; failure of plant, equipment or processes to operate as anticipated; accidents, labour disputes, title disputes, claims and limitations on insurance coverage and other risks of the mining industry; delays in the completion of exploration, development or construction activities, changes in national and local government regulation of mining operations, tax rules and regulations, and political and economic developments in jurisdictions in which the Company operates. . Although the Company has attempted to identify important factors that could cause actual results to differ materially from those contained in forward-looking statements, there may be other factors that cause results not to be as anticipated, estimated or intended. There can be no assurance that such statements will prove to be accurate, as actual results and future events could differ materially from those anticipated in such statements. The forward-looking statements and forward-looking information are made as of the date hereof and are qualified in their entirety by this cautionary statement. The Company disclaims any obligation to revise or update any such factors or to publicly announce the result of any revisions to any forward-looking statements or forward-looking information contained herein to reflect future results, events, or developments, except as require by law. Accordingly, readers should not place undue reliance on forward-looking statements and information. Please refer to the Company's most recent filings under its profile at www.sedar.com for further information respecting the risks affecting the Company and its business. 1 “Economic Evaluation of the Little Granite Mine” (1984) by Christopher B. DeWitt, Numex Geologic and Engineering Services; Source: New Mexico Geological Society, c/o: New Mexico Bureau of Geology & Mineral Resources, 801 Leroy Place Socorro, NM 87801-4796 A photo accompanying this announcement is available at",
    "primary_commodity": "Au"
  },
  "articleProject": {
    "gid": 4422,
    "project_name": "Winston",
    "location": "New Mexico, United States"
  },
  "articleExchange": "CSE",
  "articleCompanyId": 839,
  "articleTicker": "FAT",
  "articleCompanyName": "Foremost Clean Energy Ltd",
  "allOtherCompanyProjects": [
    {
      "company_id": 839,
      "gid": 3614,
      "project_name": "Peg North",
      "location": "Manitoba, Canada"
    },
    {
      "company_id": 839,
      "gid": 2237,
      "project_name": "Jean Lake",
      "location": "Manitoba, Canada"
    },
    {
      "company_id": 839,
      "gid": 3615,
      "project_name": "Grass River",
      "location": "Manitoba, Canada"
    },
    {
      "company_id": 839,
      "gid": 4422,
      "project_name": "Winston",
      "location": "New Mexico, United States"
    },
    {
      "company_id": 839,
      "gid": 8809,
      "project_name": "Hatchet Lake",
      "location": null
    },
    {
      "company_id": 839,
      "gid": 3616,
      "project_name": "JOL",
      "location": "Manitoba, Canada"
    },
    {
      "company_id": 839,
      "gid": 4270,
      "project_name": "Lac Simard South",
      "location": "Quebec, Canada"
    },
    {
      "company_id": 839,
      "gid": 2205,
      "project_name": "Zoro",
      "location": "Manitoba, Canada"
    }
  ],
  "allOtherCompanyNews": [
    {
      "id": 108161,
      "company_id": 839,
      "title": "Foremost Clean Energy Fortifies Its Treasury with over $4.5 Million in Warrant and Option Exercises and Extends Successful National Marketing Campaign",
      "link": null,
      "date": "2025-06-16T13:00:00.000Z",
      "hidden": false
    },
    {
      "id": 107529,
      "company_id": 839,
      "title": "Foremost Clean Energy Announces 3-Year Exploration Drill Permit for CLK Uranium Property Showcasing Exploration Pipeline",
      "link": null,
      "date": "2025-06-10T12:30:00.000Z",
      "hidden": false
    },
    {
      "id": 107119,
      "company_id": 839,
      "title": "Foremost Clean Energy Announces 3-Year Exploration Drill Permit for Murphy Lake South Uranium Property; Targeting Summer Drill Program",
      "link": null,
      "date": "2025-06-05T13:00:00.000Z",
      "hidden": false
    },
    {
      "id": 106591,
      "company_id": 839,
      "title": "Foremost Clean Energy Strengthens Leadership Team with Appointment of Cameron MacKay as Vice President of Exploration",
      "link": null,
      "date": "2025-06-02T13:00:00.000Z",
      "hidden": false
    },
    {
      "id": 105922,
      "company_id": 839,
      "title": "Foremost Clean Energy Successfully Regains Compliance with Nasdaq Minimum Bid Price Requirement Supported by Significant Trading Volume and +260% Increase in Share Price",
      "link": null,
      "date": "2025-05-27T13:00:00.000Z",
      "hidden": false
    },
    {
      "id": 104811,
      "company_id": 839,
      "title": "Foremost Clean Energy Completes Highly Successful Exploration Drill Program at Hatchet Uranium Property and Provides Corporate Update",
      "link": null,
      "date": "2025-05-15T13:00:00.000Z",
      "hidden": false
    },
    {
      "id": 103864,
      "company_id": 839,
      "title": "Foremost Clean Energy Announces the Successful Completion of Airborne Geophysical Survey Over its CLK Uranium Property",
      "link": null,
      "date": "2025-05-07T13:00:00.000Z",
      "hidden": false
    },
    {
      "id": 103476,
      "company_id": 839,
      "title": "Foremost Clean Energy Announces Warrant Incentive Program",
      "link": null,
      "date": "2025-05-05T13:00:00.000Z",
      "hidden": false
    },
    {
      "id": 103049,
      "company_id": 839,
      "title": "Foremost Clean Energy Reports New Discovery of Uranium Mineralization at Hatchet Lake Property",
      "link": null,
      "date": "2025-05-01T12:30:00.000Z",
      "hidden": false
    },
    {
      "id": 101877,
      "company_id": 839,
      "title": "Foremost Clean Energy Announces National Marketing Campaign",
      "link": null,
      "date": "2025-04-28T12:00:00.000Z",
      "hidden": false
    }
  ]
}