{
  "article": {
    "id": 90584,
    "link": "https://www.newsfilecorp.com/release/244051/Lion-Rock-Closes-Option-Agreement-with-Tinton-Partners",
    "title": "Lion Rock Closes Option Agreement with Tinton Partners",
    "description": "<img src=\"https://api.newsfilecorp.com/newsinfo/244051/367\" id=\"367\" width=\"2\" height=\"2\" style=\"width: 1px;  height: 1px;border: 0px solid;\" /><p>Vancouver, British Columbia--(Newsfile Corp. - March 11, 2025) - Lion Rock Resources Inc. <b>(TSXV: ROAR) (FSE: KGB1) </b>(the \"<b>Company</b>\" or \"<b>Lion Rock</b>\") is pleased to announce, that further to its news release of October 9, 2024, the TSX Venture Exchange has approved and the Company has closed the option agreement dated October 7, 2024 (the \"<b>Option Agreement</b>\") between the Company, as optionee, and Tinton Partners and The Tinton Land, LLC, as optionors (together, the \"<b>Optionor</b>\"), pursuant to which the Optionor has granted to the Company the exclusive right and option to acquire an undivided 100% interest in the Volney property (the \"<b>Volney Project</b>\").</p><p>The terms of the Option Agreement are set out in the Company's news release dated October 9, 2024. Pursuant to its obligations under the Option Agreement, the Company has issued 7,001,000 common shares of the Company (the \"<b>Initial Consideration Shares</b>\") to Tinton Partners. The Initial Consideration Shares are subject to a four month hold period expiring on July 11, 2025.</p><p>On March 11, 2025, the Company filed a technical report regarding the Volney Project which can be found under the Company's SEDAR+ profile at <a href=\"https://api.newsfilecorp.com/redirect/DZRZPsZrwe\">www.sedarplus.ca</a>.</p><p>The Volney Project is comprised of 38 private land claims totaling 142 ha in the Black Hills. The property is located 20 km south of Spearfish, South Dakota and approximately 15 km west of Leads. Pegmatites are within a Neoarchean greenstone belt, featuring the Giant Volney pegmatite, historically mined for tin.  The property is accessible by road and strategically located with proximity to infrastructure and major mining jurisdiction. </p><p>The Company also announces that a total of 5,700,000 incentive stock options have been granted to directors, officers, consultants and employees of the Company pursuant to the Company's stock option plan.  The options are exercisable for a period of three years at a price of $0.20 per share and shall vest immediately.</p><p><b>About Lion Rock Resources Inc. </b></p><p>Lion Rock has an option to acquire the Volney Gold/Lithium Project, comprised of private land claims located 20 km south of Spearfish, South Dakota. The property features the Giant Volney pegmatite, historically mined for high grade lithium and tin, as well as gold from the adjacent shear zone. The property is accessible by road and strategically located with proximity to infrastructure and major mining jurisdiction. The Company also holds properties prospective for gold, copper and lithium in Ontario and Quebec.</p><p><b>On Behalf of the Board </b></p><div id=\"contactInfo\"><p>R. Dale Ginn, President &#38; Chief Executive Officer<br />O: 604-678-5308<br />E: <a href=\"mailto:dale@rsdcapital.com\">dale@rsdcapital.com </a></p></div><p><i><b>Caution Regarding Forward-Looking Information</b></i></p><p><i>Certain statements contained in this news release may constitute \"forward-looking information\" within the meaning of Canadian securities legislation. Forward-looking information is often, but not always, identified by the use of words such as \"anticipate\", \"plan\", \"estimate\", \"expect\", \"may\", \"will\", \"intend\", \"should\", \"potential\", \"indicative\" and similar expressions. Forward-looking information involves known and unknown risks, uncertainties and other factors that may cause actual results or events to differ materially from those anticipated in such forward-looking information. The Company's actual results could differ materially from those anticipated in this forward-looking information as a result of risks and uncertainties inherent in the exploration and development of mineral properties, fluctuations in commodity prices, counterparty risk, market conditions, regulatory decisions, competitive factors in the industries in which the Company operates, prevailing economic conditions, changes to the Company's strategic growth plans, and other factors, many of which are beyond the control of the Company. The Company believes that the expectations reflected in the forward-looking information are reasonable, but no assurance can be given that these expectations will prove to be correct and such forward-looking information should not be unduly relied upon. Any forward-looking information contained in this news release represents the Company's expectations as of the date hereof and is subject to change after such date. The Company disclaims any intention or obligation to update or revise any forward-looking information whether as a result of new information, future events or otherwise, except as required by applicable securities legislation.</i></p><p><i>Neither the TSX Venture Exchange nor its Regulation Services Provider (as that term is defined in the policies of the TSXV Venture Exchange) accepts responsibility for the adequacy or accuracy of this release.</i></p><p id=\"corporateNewsLogoContainer\"><img src=\"https://images.newsfilecorp.com/files/8985/244051_1cec1c27947108db_logo.jpg\" id=\"corporateNewsLogo\" alt=\"Corporate Logo\" /></p><p id=\"corporateLinkBack\">To view the source version of this press release, please visit <a href=\"https://api.newsfilecorp.com/redirect/rvevQCPAOp\">https://www.newsfilecorp.com/release/244051</a></p>",
    "search_terms": "Volney,Lion Rock Resources Inc.,ROAR",
    "master_gid": 8737,
    "date": "2025-03-11T11:20:00.000Z",
    "tags": "||||Project Acquisition",
    "image_id": null,
    "hidden": false,
    "company_id": 3615,
    "provider": "newsfilecorp",
    "excerpt": "Vancouver, British Columbia--(Newsfile Corp. - March 11, 2025) - Lion Rock Resources Inc.(TSXV: ROAR) (FSE: KGB1)(the \"Company\" or \"Lion Rock\") is pleased to announce, that further to its news release of October 9, 2024, the TSX Venture Exchange has approved and the Company has closed the option agreement dated October",
    "is_regulatory": false,
    "refined_tags": null,
    "ftp_filename": null,
    "company_name": "Lion Rock Resources Inc.",
    "exchange": "TSXV",
    "root_ticker": "ROAR",
    "project_name": "Volney",
    "gid": 8737,
    "location": null,
    "plan_id": null,
    "description_text": "Vancouver, British Columbia--(Newsfile Corp. - March 11, 2025) - Lion Rock Resources Inc. (TSXV: ROAR) (FSE: KGB1) (the \" Company \" or \" Lion Rock \") is pleased to announce, that further to its news release of October 9, 2024, the TSX Venture Exchange has approved and the Company has closed the option agreement dated October 7, 2024 (the \" Option Agreement \") between the Company, as optionee, and Tinton Partners and The Tinton Land, LLC, as optionors (together, the \" Optionor \"), pursuant to which the Optionor has granted to the Company the exclusive right and option to acquire an undivided 100% interest in the Volney property (the \" Volney Project \"). The terms of the Option Agreement are set out in the Company's news release dated October 9, 2024. Pursuant to its obligations under the Option Agreement, the Company has issued 7,001,000 common shares of the Company (the \" Initial Consideration Shares \") to Tinton Partners. The Initial Consideration Shares are subject to a four month hold period expiring on July 11, 2025. On March 11, 2025, the Company filed a technical report regarding the Volney Project which can be found under the Company's SEDAR+ profile at www.sedarplus.ca . The Volney Project is comprised of 38 private land claims totaling 142 ha in the Black Hills. The property is located 20 km south of Spearfish, South Dakota and approximately 15 km west of Leads. Pegmatites are within a Neoarchean greenstone belt, featuring the Giant Volney pegmatite, historically mined for tin.  The property is accessible by road and strategically located with proximity to infrastructure and major mining jurisdiction. The Company also announces that a total of 5,700,000 incentive stock options have been granted to directors, officers, consultants and employees of the Company pursuant to the Company's stock option plan.  The options are exercisable for a period of three years at a price of $0.20 per share and shall vest immediately. About Lion Rock Resources Inc. Lion Rock has an option to acquire the Volney Gold/Lithium Project, comprised of private land claims located 20 km south of Spearfish, South Dakota. The property features the Giant Volney pegmatite, historically mined for high grade lithium and tin, as well as gold from the adjacent shear zone. The property is accessible by road and strategically located with proximity to infrastructure and major mining jurisdiction. The Company also holds properties prospective for gold, copper and lithium in Ontario and Quebec. On Behalf of the Board R. Dale Ginn, President & Chief Executive Officer O: 604-678-5308 E: dale@rsdcapital.com Caution Regarding Forward-Looking Information Certain statements contained in this news release may constitute \"forward-looking information\" within the meaning of Canadian securities legislation. Forward-looking information is often, but not always, identified by the use of words such as \"anticipate\", \"plan\", \"estimate\", \"expect\", \"may\", \"will\", \"intend\", \"should\", \"potential\", \"indicative\" and similar expressions. Forward-looking information involves known and unknown risks, uncertainties and other factors that may cause actual results or events to differ materially from those anticipated in such forward-looking information. The Company's actual results could differ materially from those anticipated in this forward-looking information as a result of risks and uncertainties inherent in the exploration and development of mineral properties, fluctuations in commodity prices, counterparty risk, market conditions, regulatory decisions, competitive factors in the industries in which the Company operates, prevailing economic conditions, changes to the Company's strategic growth plans, and other factors, many of which are beyond the control of the Company. The Company believes that the expectations reflected in the forward-looking information are reasonable, but no assurance can be given that these expectations will prove to be correct and such forward-looking information should not be unduly relied upon. Any forward-looking information contained in this news release represents the Company's expectations as of the date hereof and is subject to change after such date. The Company disclaims any intention or obligation to update or revise any forward-looking information whether as a result of new information, future events or otherwise, except as required by applicable securities legislation. Neither the TSX Venture Exchange nor its Regulation Services Provider (as that term is defined in the policies of the TSXV Venture Exchange) accepts responsibility for the adequacy or accuracy of this release. To view the source version of this press release, please visit https://www.newsfilecorp.com/release/244051",
    "primary_commodity": "Au"
  },
  "articleProject": {
    "gid": 8737,
    "project_name": "Volney",
    "location": null
  },
  "articleExchange": "TSXV",
  "articleCompanyId": 3615,
  "articleTicker": "ROAR",
  "articleCompanyName": "Lion Rock Resources Inc.",
  "allOtherCompanyProjects": [
    {
      "company_id": 3615,
      "gid": 8737,
      "project_name": "Volney",
      "location": null
    },
    {
      "company_id": 3615,
      "gid": 6536,
      "project_name": "Maybrun",
      "location": null
    }
  ],
  "allOtherCompanyNews": [
    {
      "id": 107074,
      "company_id": 3615,
      "title": "Lion Rock Resources Begins Trading on the OTCQB",
      "link": null,
      "date": "2025-06-05T11:20:00.000Z",
      "hidden": false
    },
    {
      "id": 106045,
      "company_id": 3615,
      "title": "Lion Rock Resources Reports New Gold Results Including 189.5 g/t at Volney Project, South Dakota",
      "link": null,
      "date": "2025-05-28T11:20:00.000Z",
      "hidden": false
    },
    {
      "id": 105482,
      "company_id": 3615,
      "title": "Lion Rock Resources Completes High-Resolution Magnetic Survey at Volney Project, South Dakota",
      "link": null,
      "date": "2025-05-22T11:20:00.000Z",
      "hidden": false
    },
    {
      "id": 105236,
      "company_id": 3615,
      "title": "Lion Rock Resources Grants Stock Options and Enters into Marketing Agreement",
      "link": "https://app.quotemedia.com/data/downloadFiling?webmasterId=104408&ref=682cb4527717fc518f7f6696&type=PDFC&formType=002-002-001089-003001&formDescription=News+release&dateFiled=2025-05-20",
      "date": "2025-05-20T16:56:50.000Z",
      "hidden": false
    },
    {
      "id": 104459,
      "company_id": 3615,
      "title": "Lion Rock Resources Reports High-Grade Lithium Results at Volney Project, South Dakota",
      "link": null,
      "date": "2025-05-13T11:20:00.000Z",
      "hidden": false
    },
    {
      "id": 104003,
      "company_id": 3615,
      "title": "Lion Rock Appoints Executive Chairman and Independent Director",
      "link": null,
      "date": "2025-05-08T11:20:00.000Z",
      "hidden": false
    },
    {
      "id": 103336,
      "company_id": 3615,
      "title": "Lion Rock Announces Engagement of Resource Stock Digest",
      "link": "https://app.quotemedia.com/data/downloadFiling?webmasterId=104408&ref=6814f8c4d9254e4121133cc6&type=PDFC&formType=002-002-001089-003001&formDescription=News+release&dateFiled=2025-05-02",
      "date": "2025-05-02T16:54:28.000Z",
      "hidden": false
    },
    {
      "id": 103007,
      "company_id": 3615,
      "title": "Lion Rock Resources Begins 2025 Exploration Program at Volney Project, Targeting Critical Minerals in South Dakota",
      "link": null,
      "date": "2025-05-01T11:20:00.000Z",
      "hidden": false
    },
    {
      "id": 98025,
      "company_id": 3615,
      "title": "LION ROCK ANNOUNCES DIRECTOR RESIGNATION",
      "link": "https://app.quotemedia.com/data/downloadFiling?webmasterId=104408&ref=67d84d76c153b44bd02fcfa1&type=PDFC&formType=002-002-001089-003001&formDescription=News+release&dateFiled=2025-03-17",
      "date": "2025-03-17T16:27:34.000Z",
      "hidden": false
    },
    {
      "id": 90584,
      "company_id": 3615,
      "title": "Lion Rock Closes Option Agreement with Tinton Partners",
      "link": "https://www.newsfilecorp.com/release/244051/Lion-Rock-Closes-Option-Agreement-with-Tinton-Partners",
      "date": "2025-03-11T11:20:00.000Z",
      "hidden": false
    }
  ]
}
