{
  "article": {
    "id": 39577,
    "link": "https://www.thenewswire.com/press-releases?id=1AqRFXWEn",
    "title": "Allegiant Announces Completion of Phase 1 Option by Summa Silver, Acquires 75% of the Mogollon Project",
    "description": "<table style='width:fit-content; border: none;'><tr style='background: none;'><td colspan='10' style='padding: 0; margin: 0; border: none; background: none;' valign='bottom'><a target='_blank' href='https://allegiantgold.com/'><img src=\"https://www.thenewswire.com/data/tnw/clients/logos/1ArbFNgKx.png?t=1655814533\" alt=\"Allegiant Gold Ltd.\" /></a></td></tr><tr style='background: none;'><td style='padding: 0; margin: 0; border: none; background: none;'></td></tr></table>\n<p style='text-align:justify; '>\n<span style='font-weight:bold; '>Tonopah, Nevada - </span><span style='font-weight:bold; '>TheNewswire -</span><span style='font-weight:bold; '> August 17, 2023 - </span><span style='font-weight:normal; '>Allegiant Gold Ltd. </span><span style='font-weight:bold; '>(“Allegiant” or the “Company”) (TSX-V:AUAU) (OTC:AUXXF) </span><span style=''>is very pleased to announce the completion of the Phase I Option of the Option Agreement with Summa Silver for the Mogollon Project (“Mogollon”) in New Mexico, USA.  </span>\n</p>\n \n<p style='text-align:justify; '>\n<span style=''>In connection with Summa's option and joint venture agreement dated August 21, 2020, Summa intends to pay US$100,000 in cash and issue, subject to approval from the TSX Venture Exchange, 4,398,831 common shares at a deemed price of $0.5047 per common share in order to satisfy the US$1,750,000 third anniversary payment. The common shares issued will have a statutory hold period of four months and one day from the date of issuance. Upon completion of the share issuance, Summa will have satisfied phase one of the option and joint venture agreement and have earned a 75% interest in the Mogollon project.</span>\n</p>\n \n<p style='text-align:justify; '>\n<span style='font-weight:bold; '>Peter Gianulis, CEO of Allegiant Gold</span><span style=''>, commented: </span><span style=''>“It has been a pleasure to have worked with Summa Silver the past three years.  They have proven to be an excellent partner in helping develop a high-quality asset such as our Mogollon Project.  We believe that Mogollon has the potential to be one of the premier underground gold/silver projects in the United States.  Over the past four years, Allegiant has received approximately  $7 million in cash and share payments from our farm-out partners, which has led to our ability to finance our company and projects with minimal dilution.  We look forward to continue advancing our Eastside District project and working closely with our farm-out partners.”</span>\n</p>\n \n<p style='text-align:justify; '>\n<span style='font-weight:bold; '>ABOUT ALLEGIANT</span>\n</p>\n\n<p style='text-align:justify; '>\n<span style=''>Allegiant owns six highly prospective gold projects in the United States, five of which are in the mining-friendly jurisdiction of Nevada. Two of Allegiant’s projects are currently farmed-out, providing for cost reductions and cash-flow. Allegiant’s flagship, district-scale Eastside project hosts a large and expanding gold resource and is in an area of excellent infrastructure. Preliminary metallurgical testing indicates that both oxide and sulphide gold mineralization at Eastside is amenable to heap leaching.</span>\n</p>\n \n<p style='text-align:justify; '>\n<span style='font-weight:bold; '>ON BEHALF OF THE BOARD</span>\n</p>\n\n<p style='text-align:justify; '>\n<span style=''>Peter Gianulis </span>\n</p>\n\n<p style='text-align:justify; '>\n<span style=''>CEO </span>\n</p>\n\n<p style='text-align:justify; '>\n<span style=''>For more information contact: </span>\n</p>\n\n<p style='text-align:justify; '>\n<span style=''>Investor Relations </span>\n</p>\n\n<p style='text-align:left; '>\n<span style=''>(604) 634-0970 or </span>\n</p>\n\n<p style='text-align:left; '>\n<span style=''>1-888-818-1364 </span>\n</p>\n\n<p style='text-align:left; '>\n<span style=''>ir@allegiantgold.com </span>\n</p>\n\n<p style='text-align:justify; '>\n<span style='font-style:italic; '>Neither TSX Venture Exchange nor its Regulation Services Provider (as that term is defined in policies of the TSX Venture Exchange) accepts responsibility for the adequacy or accuracy of this release.</span>\n</p>\n\n<p style='text-align:justify; '>\n<span style='font-style:italic; '>Certain statements and information contained in this press release constitute &quot;forward-looking statements&quot; within the meaning of applicable U.S. securities laws and “forward-looking information” within the meaning of applicable Canadian securities laws, which are referred to collectively as &quot;forward-looking statements&quot;. The United States Private Securities Litigation Reform Act of 1995 provides a “safe harbor” for certain forward-looking statements.</span> <span style='font-style:italic; '>Allegiant Gold Ltd.’s (“Allegiant”) exploration plans for its gold exploration properties, the drill program at Allegiant’s Eastside project, the preparation and publication of an updated resource estimate in respect of the Original Zone at the Eastside project, Allegiant’s future exploration and development plans, including anticipated costs and timing thereof; Allegiant’s plans for growth through exploration activities, acquisitions or otherwise; and expectations regarding future maintenance and capital expenditures, and working capital requirements.  Forward-looking statements are statements and information regarding possible events, conditions or results of operations that are based upon assumptions about future economic conditions and courses of action. All statements and information other than statements of historical fact may be forward-looking statements. In some cases, forward-looking statements can be identified by the </span><span style='font-style:italic; '>use of words such as “seek”, “expect”, “anticipate”, “budget”, “plan”, “estimate”, “continue”, “forecast”, “intend”, “believe”, “predict”, “potential”, “target”, “may”, “could”, “would”, “might”, “will” and similar words or phrases (including negative variations) suggesting future outcomes or statements regarding an outlook.  Such forward-looking statements are based on a number of material factors and assumptions and involve known and unknown risks, uncertainties and other factors which may cause actual results, performance or achievements, or industry results, to differ materially from those anticipated in such forward-looking information. You are cautioned not to place undue reliance on forward-looking statements contained in this press release. Some of the known risks and other factors which could cause actual results to differ materially from those expressed in the forward-looking statements are described in the sections entitled “Risk Factors” in Allegiant’s Listing Application, dated January 24, 2018, as filed with the TSX Venture Exchange and available on SEDAR under Allegiant’s profile at www.sedar.com.  Actual results and future events could differ materially from those anticipated in such statements. Allegiant undertakes no obligation to update or revise any forward-looking statements included in this press release if these beliefs, estimates and opinions or other circumstances should change, except as otherwise required by applicable law. </span>\n</p>\n \n\n<p>Copyright (c) 2023 TheNewswire - All rights reserved.</p>\n",
    "search_terms": "Mogollon,Allegiant Gold Ltd.,AUAU",
    "master_gid": 2302,
    "date": "2023-08-17T12:30:00.000Z",
    "tags": "Mexico,USA|New Mexico||Gold,Silver|Project Acquisition",
    "image_id": null,
    "hidden": false,
    "company_id": 489,
    "provider": null,
    "excerpt": "Tonopah, Nevada -TheNewswire -August 17, 2023 -Allegiant Gold Ltd.(“Allegiant” or the “Company”) (TSX-V:AUAU) (OTC:AUXXF)is very pleased to announce the completion of the Phase I Option of the Option Agreement with Summa Silver for the Mogollon Project (“Mogollon”) in New Mexico, USA.   In connection with Summa's option and joint venture agreement",
    "is_regulatory": false,
    "refined_tags": [
      "Project Acquisition"
    ],
    "ftp_filename": null,
    "company_name": "Summa Silver Corp.",
    "exchange": "TSXV",
    "root_ticker": "AUAU",
    "project_name": "Mogollon",
    "gid": 2302,
    "location": "New Mexico, United States",
    "plan_id": null,
    "description_text": "Tonopah, Nevada - TheNewswire - August 17, 2023 - Allegiant Gold Ltd. (“Allegiant” or the “Company”) (TSX-V:AUAU) (OTC:AUXXF) is very pleased to announce the completion of the Phase I Option of the Option Agreement with Summa Silver for the Mogollon Project (“Mogollon”) in New Mexico, USA. In connection with Summa's option and joint venture agreement dated August 21, 2020, Summa intends to pay US$100,000 in cash and issue, subject to approval from the TSX Venture Exchange, 4,398,831 common shares at a deemed price of $0.5047 per common share in order to satisfy the US$1,750,000 third anniversary payment. The common shares issued will have a statutory hold period of four months and one day from the date of issuance. Upon completion of the share issuance, Summa will have satisfied phase one of the option and joint venture agreement and have earned a 75% interest in the Mogollon project. Peter Gianulis, CEO of Allegiant Gold , commented: “It has been a pleasure to have worked with Summa Silver the past three years.  They have proven to be an excellent partner in helping develop a high-quality asset such as our Mogollon Project.  We believe that Mogollon has the potential to be one of the premier underground gold/silver projects in the United States.  Over the past four years, Allegiant has received approximately  $7 million in cash and share payments from our farm-out partners, which has led to our ability to finance our company and projects with minimal dilution.  We look forward to continue advancing our Eastside District project and working closely with our farm-out partners.” ABOUT ALLEGIANT Allegiant owns six highly prospective gold projects in the United States, five of which are in the mining-friendly jurisdiction of Nevada. Two of Allegiant’s projects are currently farmed-out, providing for cost reductions and cash-flow. Allegiant’s flagship, district-scale Eastside project hosts a large and expanding gold resource and is in an area of excellent infrastructure. Preliminary metallurgical testing indicates that both oxide and sulphide gold mineralization at Eastside is amenable to heap leaching. ON BEHALF OF THE BOARD Peter Gianulis CEO For more information contact: Investor Relations (604) 634-0970 or 1-888-818-1364 ir@allegiantgold.com Neither TSX Venture Exchange nor its Regulation Services Provider (as that term is defined in policies of the TSX Venture Exchange) accepts responsibility for the adequacy or accuracy of this release. Certain statements and information contained in this press release constitute \"forward-looking statements\" within the meaning of applicable U.S. securities laws and “forward-looking information” within the meaning of applicable Canadian securities laws, which are referred to collectively as \"forward-looking statements\". The United States Private Securities Litigation Reform Act of 1995 provides a “safe harbor” for certain forward-looking statements. Allegiant Gold Ltd.’s (“Allegiant”) exploration plans for its gold exploration properties, the drill program at Allegiant’s Eastside project, the preparation and publication of an updated resource estimate in respect of the Original Zone at the Eastside project, Allegiant’s future exploration and development plans, including anticipated costs and timing thereof; Allegiant’s plans for growth through exploration activities, acquisitions or otherwise; and expectations regarding future maintenance and capital expenditures, and working capital requirements.  Forward-looking statements are statements and information regarding possible events, conditions or results of operations that are based upon assumptions about future economic conditions and courses of action. All statements and information other than statements of historical fact may be forward-looking statements. In some cases, forward-looking statements can be identified by the use of words such as “seek”, “expect”, “anticipate”, “budget”, “plan”, “estimate”, “continue”, “forecast”, “intend”, “believe”, “predict”, “potential”, “target”, “may”, “could”, “would”, “might”, “will” and similar words or phrases (including negative variations) suggesting future outcomes or statements regarding an outlook.  Such forward-looking statements are based on a number of material factors and assumptions and involve known and unknown risks, uncertainties and other factors which may cause actual results, performance or achievements, or industry results, to differ materially from those anticipated in such forward-looking information. You are cautioned not to place undue reliance on forward-looking statements contained in this press release. Some of the known risks and other factors which could cause actual results to differ materially from those expressed in the forward-looking statements are described in the sections entitled “Risk Factors” in Allegiant’s Listing Application, dated January 24, 2018, as filed with the TSX Venture Exchange and available on SEDAR under Allegiant’s profile at www.sedar.com.  Actual results and future events could differ materially from those anticipated in such statements. Allegiant undertakes no obligation to update or revise any forward-looking statements included in this press release if these beliefs, estimates and opinions or other circumstances should change, except as otherwise required by applicable law. Copyright (c) 2023 TheNewswire - All rights reserved.",
    "primary_commodity": "Ag"
  },
  "articleProject": {
    "gid": 2302,
    "project_name": "Mogollon",
    "location": "New Mexico, United States"
  },
  "articleExchange": "TSXV",
  "articleCompanyId": 489,
  "articleTicker": "AUAU",
  "articleCompanyName": "Allegiant Gold Ltd.",
  "allOtherCompanyProjects": [
    {
      "company_id": 489,
      "gid": 5463,
      "project_name": "Browns Canyon",
      "location": "Nevada, United States"
    },
    {
      "company_id": 489,
      "gid": 989,
      "project_name": "Castle/Black Rock",
      "location": "Nevada, USA"
    },
    {
      "company_id": 489,
      "gid": 991,
      "project_name": "Eastside",
      "location": "Nevada, USA"
    },
    {
      "company_id": 489,
      "gid": 4501,
      "project_name": "Goldfield West",
      "location": "Nevada, United States"
    },
    {
      "company_id": 489,
      "gid": 5110,
      "project_name": "TS",
      "location": "Nevada, United States"
    }
  ],
  "allOtherCompanyNews": [
    {
      "id": 106638,
      "company_id": 489,
      "title": "Allegiant Provides Corporate Update",
      "link": "https://www.thenewswire.com/press-releases?id=1k3wFOaO6",
      "date": "2025-06-02T21:00:00.000Z",
      "hidden": false
    },
    {
      "id": 106586,
      "company_id": 489,
      "title": "Allegiant Gold Announces Non-Brokered Private Placement",
      "link": "https://www.thenewswire.com/press-releases?id=1ArbFmPrp",
      "date": "2025-06-02T12:45:00.000Z",
      "hidden": false
    },
    {
      "id": 106266,
      "company_id": 489,
      "title": "Allegiant Gold Announces Effective Date for Share Consolidation",
      "link": "https://www.thenewswire.com/press-releases?id=1AlpFvZ7W",
      "date": "2025-05-29T13:00:00.000Z",
      "hidden": false
    },
    {
      "id": 105535,
      "company_id": 489,
      "title": "Allegiant Gold Announces Proposed Share Consolidation and Explore Financing Options",
      "link": "https://www.thenewswire.com/press-releases?id=1k6WF4agd",
      "date": "2025-05-22T13:30:00.000Z",
      "hidden": false
    },
    {
      "id": 100431,
      "company_id": 489,
      "title": "Allegiant & CopAur Announce Plan To Spin-Out Bolo Project",
      "link": "https://www.thenewswire.com/press-releases?id=1BR1F9jb7",
      "date": "2025-04-22T13:00:00.000Z",
      "hidden": false
    },
    {
      "id": 99025,
      "company_id": 489,
      "title": "Allegiant Provides Drill Targets for Upcoming Test of High Grade Zone at McIntosh Zone",
      "link": "https://www.thenewswire.com/press-releases?id=1ArbFmEj0",
      "date": "2025-04-08T12:45:00.000Z",
      "hidden": false
    },
    {
      "id": 88644,
      "company_id": 489,
      "title": "Allegiant Announces Appointment of Javier Reyes to the Board of Directors",
      "link": "https://www.thenewswire.com/press-releases?id=1A8vFv5ag",
      "date": "2025-02-20T13:45:00.000Z",
      "hidden": false
    },
    {
      "id": 84018,
      "company_id": 489,
      "title": "Allegiant Announces Plans to Drill Deep Targets at High-Grade Zone",
      "link": "https://www.thenewswire.com/press-releases?id=1k49FJnzJ",
      "date": "2025-01-14T14:00:00.000Z",
      "hidden": false
    },
    {
      "id": 82091,
      "company_id": 489,
      "title": "Allegiant Advances Permitting on Eastside District",
      "link": "https://www.thenewswire.com/press-releases?id=1k98F1gjP",
      "date": "2024-12-16T14:30:00.000Z",
      "hidden": false
    },
    {
      "id": 72190,
      "company_id": 489,
      "title": "Allegiant Provides Update On Eastside",
      "link": "https://www.thenewswire.com/press-releases?id=1L7OFrQgw",
      "date": "2024-09-23T12:30:00.000Z",
      "hidden": false
    }
  ]
}