{
  "article": {
    "id": 42761,
    "link": "https://www.newsfilecorp.com/release/184610/Summa-Silver-Earns-100-Interest-in-the-HighGrade-Silver-and-Gold-Mogollon-Project-in-New-Mexico",
    "title": "Summa Silver Earns 100% Interest in the High-Grade Silver and Gold Mogollon Project in New Mexico",
    "description": "<img src=\"https://api.newsfilecorp.com/newsinfo/184610/367\" id=\"367\" width=\"2\" height=\"2\" style=\"width: 1px;  height: 1px;border: 0px solid;\" /><p>Vancouver, British Columbia--(Newsfile Corp. - October 19, 2023) - <b>Summa Silver Corp.</b> <b>(TSXV: SSVR) (OTCQX: SSVRF) (FSE: 48X)</b> (\"Summa\" or the \"Company\") is pleased to announce that it is completing all option payments to Allegiant Gold Ltd. (\"Allegiant\") (TSXV: AUAU) for the Mogollon Project near Silver City, New Mexico (the \"Project\" or \"Mogollon\") to earn 100% ownership of the Project. </p><p><b>Galen McNamara, CEO, stated: </b>\"Over the past three years, exploration results from Mogollon have shown that it has the potential to be one of the best silver and gold vein fields remaining in the United States. This is a project that we're very happy to own 100%. The world is now changing rapidly. We strongly believe that in the coming years responsibly tapping domestic sources of metals will be vital to both financial security and the green energy transition. I would like to thank Allegiant for their collaborative approach since we optioned the Project in 2020. I'm looking forward to continuing to collaborate closely and welcome them as significant shareholders of the Company.\"</p><p><b>Mogollon Project Payment</b></p><p>In connection with the option and joint venture agreement dated August 21, 2020, between the Company and Allegiant regarding the Project (the \"Option Agreement\"), the Company intends to issue 8,912,884 common shares (the \"Consideration Shares\") at a deemed price of $0.4579 per Consideration Share to Allegiant pursuant to the Option Agreement. Upon issuance of the Consideration Shares, the Company will have satisfied the requirements to exercise the phase two option pursuant to the Option Agreement and acquire 100% ownership of the Project. The Company expects to issue the Consideration Shares in the coming days. The Consideration Shares will have a statutory hold period of four months and one day from the date of issuance. </p><p><b>About Summa Silver Corp</b></p><p>Summa Silver Corp. is a junior mineral exploration company. The Company owns a 100% interest in the Hughes project located in central Nevada and, upon issuance of the Consideration Shares, will own a 100% interest in the Mogollon project located in southwestern New Mexico. The high-grade past-producing Belmont Mine, one of the most prolific silver producers in the United States between 1903 and 1929, is located on the Hughes project. The Mogollon project is the largest historic silver producer in New Mexico. Both projects have remained inactive since commercial production ceased and neither have seen modern exploration prior to the Company's involvement.</p><p><b>Follow Summa Silver on Twitter: @summasilver<br />LinkedIn: </b><a href=\"https://api.newsfilecorp.com/redirect/wWR4XCQ0Zx\"><b>https://www.linkedin.com/company/summa-silver-corp/</b></a></p><p><b>ON BEHALF OF THE BOARD OF DIRECTORS</b></p><p><b>\"Galen McNamara\"</b><br />Galen McNamara, Chief Executive Officer<br /><a href=\"mailto:info@summasilver.com\" target=\"_blank\"><b>info@summasilver.com</b></a><br /><a href=\"https://api.newsfilecorp.com/redirect/gOQY5tm8JP\"><b>www.summasilver.com</b></a></p><p><b>Investor Relations Contact:</b><br /><b>Giordy Belfiore</b><br />Corporate Development and Investor Relations<br /><b>604-288-8004</b><br /><a href=\"mailto:giordy@summasilver.com\"><b>giordy@summasilver.com</b></a><br /><a href=\"https://api.newsfilecorp.com/redirect/pEPY0hjX7D\"><b>www.summasilver.com</b></a></p><p><i>Neither the TSX Venture Exchange nor its Regulation Services Provider (as that term is defined in the policies of the TSX Venture Exchange) accepts responsibility for the adequacy or accuracy of this release.</i></p><p><i>Cautionary note regarding forward-looking statements</i></p><p><i>This news release contains certain \"forward looking statements\" and certain \"forward-looking information\" as defined under applicable Canadian and U.S. securities laws. Forward-looking statements and information can generally be identified by the use of forward-looking terminology such as \"may\", \"will\", \"should\", \"expect\", \"intend\", \"estimate\", \"anticipate\", \"believe\", \"continue\", \"plans\" or similar terminology. The forward-looking information contained herein is provided for the purpose of assisting readers in understanding management's current expectations and plans relating to the future. These forward&#8208;looking statements or information relate to, among other things: the exploration and development of the Company's mineral exploration; and issuance of the Consideration Shares.</i></p><p><i>Forward-looking information is subject to known and unknown risks, uncertainties and other factors that may cause the actual actions, events or results to be materially different from those expressed or implied by such forward-looking information, including but not limited to: the requirement for regulatory approvals; enhanced uncertainty in global financial markets as a result of the current COVID-19 pandemic; unquantifiable risks related to government actions and interventions; stock market volatility; regulatory restrictions; and other related risks and uncertainties.</i></p><p><i>Forward-looking information are based on management of the parties' reasonable assumptions, estimates, expectations, analyses and opinions, which are based on such management's experience and perception of trends, current conditions and expected developments, and other factors that management believes are relevant and reasonable in the circumstances, but which may prove to be incorrect.</i></p><p><i>The Company undertakes no obligation to update forward-looking information except as required by applicable law. Such forward-looking information represents management's best judgment based on information currently available. No forward-looking statement can be guaranteed and actual future results may vary materially. Accordingly, readers are advised not to place undue reliance on forward-looking statements or information.</i></p><p id=\"corporateNewsLogoContainer\"><img src=\"https://images.newsfilecorp.com/files/7983/184610_419447f3c40fca5f_logo.jpg\" id=\"corporateNewsLogo\" alt=\"Corporate Logo\" /></p><p id=\"corporateLinkBack\">To view the source version of this press release, please visit <a href=\"https://api.newsfilecorp.com/redirect/YYw3XtXb7z\">https://www.newsfilecorp.com/release/184610</a></p>",
    "search_terms": "Mogollon,Summa Silver Corp.,SSVR",
    "master_gid": 2302,
    "date": "2023-10-19T23:00:00.000Z",
    "tags": "Mexico,USA|New Mexico||Gold,Silver|Project Acquisition",
    "image_id": null,
    "hidden": false,
    "company_id": 70,
    "provider": null,
    "excerpt": "Vancouver, British Columbia--(Newsfile Corp. - October 19, 2023) -Summa Silver Corp.(TSXV: SSVR) (OTCQX: SSVRF) (FSE: 48X)(\"Summa\" or the \"Company\") is pleased to announce that it is completing all option payments to Allegiant Gold Ltd. (\"Allegiant\") (TSXV: AUAU) for the Mogollon Project near Silver City, New Mexico (the \"Project\" or \"Mogollon\")",
    "is_regulatory": false,
    "refined_tags": [
      "Project Acquisition"
    ],
    "ftp_filename": null,
    "company_name": "Summa Silver Corp.",
    "exchange": "TSXV",
    "root_ticker": "SSVR",
    "project_name": "Mogollon",
    "gid": 2302,
    "location": "New Mexico, United States",
    "plan_id": null,
    "description_text": "Vancouver, British Columbia--(Newsfile Corp. - October 19, 2023) - Summa Silver Corp. (TSXV: SSVR) (OTCQX: SSVRF) (FSE: 48X) (\"Summa\" or the \"Company\") is pleased to announce that it is completing all option payments to Allegiant Gold Ltd. (\"Allegiant\") (TSXV: AUAU) for the Mogollon Project near Silver City, New Mexico (the \"Project\" or \"Mogollon\") to earn 100% ownership of the Project. Galen McNamara, CEO, stated: \"Over the past three years, exploration results from Mogollon have shown that it has the potential to be one of the best silver and gold vein fields remaining in the United States. This is a project that we're very happy to own 100%. The world is now changing rapidly. We strongly believe that in the coming years responsibly tapping domestic sources of metals will be vital to both financial security and the green energy transition. I would like to thank Allegiant for their collaborative approach since we optioned the Project in 2020. I'm looking forward to continuing to collaborate closely and welcome them as significant shareholders of the Company.\" Mogollon Project Payment In connection with the option and joint venture agreement dated August 21, 2020, between the Company and Allegiant regarding the Project (the \"Option Agreement\"), the Company intends to issue 8,912,884 common shares (the \"Consideration Shares\") at a deemed price of $0.4579 per Consideration Share to Allegiant pursuant to the Option Agreement. Upon issuance of the Consideration Shares, the Company will have satisfied the requirements to exercise the phase two option pursuant to the Option Agreement and acquire 100% ownership of the Project. The Company expects to issue the Consideration Shares in the coming days. The Consideration Shares will have a statutory hold period of four months and one day from the date of issuance. About Summa Silver Corp Summa Silver Corp. is a junior mineral exploration company. The Company owns a 100% interest in the Hughes project located in central Nevada and, upon issuance of the Consideration Shares, will own a 100% interest in the Mogollon project located in southwestern New Mexico. The high-grade past-producing Belmont Mine, one of the most prolific silver producers in the United States between 1903 and 1929, is located on the Hughes project. The Mogollon project is the largest historic silver producer in New Mexico. Both projects have remained inactive since commercial production ceased and neither have seen modern exploration prior to the Company's involvement. Follow Summa Silver on Twitter: @summasilver LinkedIn: https://www.linkedin.com/company/summa-silver-corp/ ON BEHALF OF THE BOARD OF DIRECTORS \"Galen McNamara\" Galen McNamara, Chief Executive Officer info@summasilver.com www.summasilver.com Investor Relations Contact: Giordy Belfiore Corporate Development and Investor Relations 604-288-8004 giordy@summasilver.com www.summasilver.com Neither the TSX Venture Exchange nor its Regulation Services Provider (as that term is defined in the policies of the TSX Venture Exchange) accepts responsibility for the adequacy or accuracy of this release. Cautionary note regarding forward-looking statements This news release contains certain \"forward looking statements\" and certain \"forward-looking information\" as defined under applicable Canadian and U.S. securities laws. Forward-looking statements and information can generally be identified by the use of forward-looking terminology such as \"may\", \"will\", \"should\", \"expect\", \"intend\", \"estimate\", \"anticipate\", \"believe\", \"continue\", \"plans\" or similar terminology. The forward-looking information contained herein is provided for the purpose of assisting readers in understanding management's current expectations and plans relating to the future. These forward‐looking statements or information relate to, among other things: the exploration and development of the Company's mineral exploration; and issuance of the Consideration Shares. Forward-looking information is subject to known and unknown risks, uncertainties and other factors that may cause the actual actions, events or results to be materially different from those expressed or implied by such forward-looking information, including but not limited to: the requirement for regulatory approvals; enhanced uncertainty in global financial markets as a result of the current COVID-19 pandemic; unquantifiable risks related to government actions and interventions; stock market volatility; regulatory restrictions; and other related risks and uncertainties. Forward-looking information are based on management of the parties' reasonable assumptions, estimates, expectations, analyses and opinions, which are based on such management's experience and perception of trends, current conditions and expected developments, and other factors that management believes are relevant and reasonable in the circumstances, but which may prove to be incorrect. The Company undertakes no obligation to update forward-looking information except as required by applicable law. Such forward-looking information represents management's best judgment based on information currently available. No forward-looking statement can be guaranteed and actual future results may vary materially. Accordingly, readers are advised not to place undue reliance on forward-looking statements or information. To view the source version of this press release, please visit https://www.newsfilecorp.com/release/184610",
    "primary_commodity": "Ag"
  },
  "articleProject": {
    "gid": 2302,
    "project_name": "Mogollon",
    "location": "New Mexico, United States"
  },
  "articleExchange": "TSXV",
  "articleCompanyId": 70,
  "articleTicker": "SSVR",
  "articleCompanyName": "Summa Silver Corp.",
  "allOtherCompanyProjects": [
    {
      "company_id": 70,
      "gid": 9918,
      "project_name": "Kennedy",
      "location": "Nevada, United States"
    },
    {
      "company_id": 70,
      "gid": 2302,
      "project_name": "Mogollon",
      "location": "New Mexico, United States"
    },
    {
      "company_id": 70,
      "gid": 994,
      "project_name": "Hughes",
      "location": "Nevada, USA"
    }
  ],
  "allOtherCompanyNews": [
    {
      "id": 107584,
      "company_id": 70,
      "title": "Summa Silver Provides Quarterly ATM Program Update",
      "link": null,
      "date": "2025-06-10T23:00:00.000Z",
      "hidden": false
    },
    {
      "id": 106819,
      "company_id": 70,
      "title": "Silver47 and Summa Silver Announce Upsize of Brokered Financing to C$6 Million",
      "link": null,
      "date": "2025-06-03T15:30:00.000Z",
      "hidden": false
    },
    {
      "id": 104453,
      "company_id": 70,
      "title": "Silver47 and Summa Silver Announce Merger to Create a Premier U.S. High Grade Silver Explorer & Developer and C$5 Million Brokered Financing",
      "link": null,
      "date": "2025-05-13T11:00:00.000Z",
      "hidden": false
    },
    {
      "id": 100795,
      "company_id": 70,
      "title": "Summa Silver Confirms High-Grade Gold-Silver at the Kennedy Project, Nevada",
      "link": null,
      "date": "2025-04-24T11:00:00.000Z",
      "hidden": false
    },
    {
      "id": 91887,
      "company_id": 70,
      "title": "Summa Silver Announces Mogollon Project Anniversary Payment pursuant to Amended Lease Agreements",
      "link": null,
      "date": "2025-03-19T23:00:00.000Z",
      "hidden": false
    },
    {
      "id": 89945,
      "company_id": 70,
      "title": "Summa Silver Files Technical Reports for its Two American High-Grade Silver Projects",
      "link": "https://www.newsfilecorp.com/release/243187/Summa-Silver-Files-Technical-Reports-for-its-Two-American-HighGrade-Silver-Projects",
      "date": "2025-03-04T00:11:00.000Z",
      "hidden": false
    },
    {
      "id": 89431,
      "company_id": 70,
      "title": "Summa Silver Announces Staking of the High-Grade Gold-Silver Kennedy Project, Nevada",
      "link": "https://www.newsfilecorp.com/release/242579/Summa-Silver-Announces-Staking-of-the-HighGrade-GoldSilver-Kennedy-Project-Nevada",
      "date": "2025-02-27T12:00:00.000Z",
      "hidden": false
    },
    {
      "id": -165741,
      "company_id": 70,
      "title": "Summa Silver Announces Grant of Stock Options",
      "link": "https://www.newsfilecorp.com/release/238415/Summa-Silver-Announces-Grant-of-Stock-Options",
      "date": "2025-01-25T00:30:00.000Z",
      "hidden": false
    },
    {
      "id": 84298,
      "company_id": 70,
      "title": "Summa Silver Announces First-Ever Mineral Resource Estimates on its Two American High-Grade Silver Projects",
      "link": "https://www.newsfilecorp.com/release/237388/Summa-Silver-Announces-FirstEver-Mineral-Resource-Estimates-on-its-Two-American-HighGrade-Silver-Projects",
      "date": "2025-01-16T12:00:00.000Z",
      "hidden": false
    },
    {
      "id": 82174,
      "company_id": 70,
      "title": "Summa Silver Outlines Timeline for Mineral Resource Estimates on the Hughes and Mogollon Projects, Southwest United States",
      "link": "https://www.newsfilecorp.com/release/234076/Summa-Silver-Outlines-Timeline-for-Mineral-Resource-Estimates-on-the-Hughes-and-Mogollon-Projects-Southwest-United-States",
      "date": "2024-12-17T12:00:00.000Z",
      "hidden": false
    }
  ]
}
