{
  "article": {
    "id": 33038,
    "link": "https://www.thenewswire.com/press-releases?id=1kx7F28z3",
    "title": "Nickel Rock Adds an Additional Lithium Project in Nevada to its Property Portfolio",
    "description": "<table style='width:fit-content; border: none;'><tr style='background: none;'><td colspan='10' style='padding: 0; margin: 0; border: none; background: none;' valign='bottom'><a target='_blank' href='www.nickelrockresources.com'><img src=\"https://www.thenewswire.com/data/tnw/clients/logos/kVGFYP2A.png\" alt=\"Nickel Rock Resources Inc.\" /></a></td></tr><tr style='background: none;'><td style='width: 34px; padding: 0; margin: 0; border: none; background: none;' valign='bottom'><a target='_blank' href='https://thenewswire.com/api/apps/tnw/r?i=kVGFYP2A&amp;m=fac'><img src=\"https://www.thenewswire.com/data/tnw/img/fac.png\" /></a></td><td style='width: 34px; padding: 0; margin: 0; border: none; background: none;' valign='bottom'><a target='_blank' href='https://thenewswire.com/api/apps/tnw/r?i=kVGFYP2A&amp;m=twi'><img src=\"https://www.thenewswire.com/data/tnw/img/twi.png\" /></a></td><td style='width: 34px; padding: 0; margin: 0; border: none; background: none;' valign='bottom'><a target='_blank' href='https://thenewswire.com/api/apps/tnw/r?i=kVGFYP2A&amp;m=lin'><img src=\"https://www.thenewswire.com/data/tnw/img/lin.png\" /></a></td><td style='padding: 0; margin: 0; border: none; background: none;'></td></tr></table>  \n<p style='text-align:justify; '>\n<a href='' target='_blank'></a><span style='font-weight:bold; '>Coquitlam, BC – </span><span style='font-weight:bold; '>TheNewswire -</span><span style='font-weight:bold; '> March 29, 202</span><span style='font-weight:bold; '>3 </span><span style='font-weight:bold; '>- </span><span style=''>Nickel Rock Resources Inc. (the “Company” or “Nickel Rock”) (TSXV:NIC</span><span style=''>)</span><span style=''>, </span><span style=''>(</span><span style=''>OTC:NICKLF</span><span style=''>)</span><span style=''>, </span><span style=''>(</span><span style=''>FRA:NMK2) </span><span style=''>announces </span><span style=''>that the Company has staked </span><span style=''>80 placer claims (MVS1–MVS80) covering approximately 635 hectares of alluvial sediments and clays located 122 km northeast of Tonopah, Nevada (the “Volt Canyon Lithium Property”).</span>\n</p>\n\n<p style='text-align:justify; '>\n<span style=''>The Volt Canyon Lithium Property is located in Monitor Valley, Nevada, about 122 km north-northeast of Tonopah, Nevada. The center of the property is about 38.96° North Latitude, 116.70</span><a href='' target='_blank'></a><span style=''>°</span><span style=''> West Longitude. </span>\n</p>\n \n<p style='text-align:justify; '>\n<span style=''>Geology and Mineralization </span>\n</p>\n \n<p style='text-align:justify; '>\n<span style=''>The Volt Canyon Lithium Property is sediment-hosted lithium clay targets. Access to the property is good and both future exploration and exploitation work could be conducted year-round. Minimal work has been conducted on the project to date, but surface samples reported in regional NURE data run up to 108 ppm Li near the claim block.</span>\n</p>\n \n<p style='text-align:justify; '>\n<span style=''>The origin of this lithium deposit is suspected to be similar to Clayton Valley clay deposits located about 180 km to the south. Both areas are reasonably well represented by the USGS preliminary deposit model, which describes the primary characteristics as light-colored, ash-rich, lacustrine (lake) rocks containing swelling clays.</span>\n</p>\n \n<p style='text-align:justify; '>\n<span style=''>Mr. Tim Fernback, Nickel Rock’s President &amp; CEO comments </span><span style='font-style:italic; '>“Volt Canyon Lithium Project has been relatively unexplored to date, but the lithium exploration potential due to the geothermal activity in the project area is compelling.  Our geological team has been assessing this overall area for several months for its lithium exploration potential.  It is the Company’s intention to rapidly evaluate the lithium potential of this project over the coming months.  It is Nickel Rock’s intent to complete an initial NI #43-101 Technical Report on the property in the near future”.</span>\n</p>\n\n<p style='text-align:justify; '>\n<a href='' target='_blank'></a><span style='text-align:center; '>\n<p style=''>\n<a href='https://www.thenewswire.com/data/tnw/clients/img/b36ee16588c33972d532b59622d3d17a.png' target='_blank'><img src=\"https://www.thenewswire.com/data/tnw/clients/img/b36ee16588c33972d532b59622d3d17a_.png\" /></a><br />\nClick Image To View Full Size\n</p>\n</span>\n</p>\n\n<p style='text-align:justify; '>\n<span style='font-weight:bold; '>Qualified Person as Defined Under National Instrument 43-101</span>\n</p>\n\n<p style='text-align:justify; '>\n<span style=''>Alan J. Morris, CPG</span><span style=''> of Spring Creek, Nevada, a Qualified Person as defined under Nation Instrument 43-101 has reviewed and approved the technical aspects of this news release.</span>\n</p>\n\n<p style='text-align:justify; '>\n<span style='font-weight:bold; '>About Nickel Rock Resources Inc. </span>\n</p>\n \n<p style='text-align:justify; '>\n<span style=''>Nickel Rock Resources Inc. is a Canadian based exploration company whose primary listing is on the TSX Venture Exchange.  The Company’s maintains a focus on exploration for high value battery metals required for the electric vehicle (EV) market.  </span><a href='http://www.nickelrockresources.com/' target='_blank'><span style=''>www.nickelrockresources.com</span></a>\n</p>\n \n<p style='text-align:justify; '>\n<span style='font-weight:bold; '>About the British Columbia, Nickel Projects</span>\n</p>\n \n<p style='text-align:justify; '>\n<span style=''>The Mount Sidney Williams Group consists of three claim blocks with a total area of 10,569 hectares in the area surrounding Mount Sidney Williams, both adjoining and near the Decar project of FPX Nickel Corp., located 100 kilometres northwest of Fort St. James, B.C., in the Omineca mining division. Metallic mineralization includes nickel, cobalt, and chromium. At least some of the nickel mineralization occurs as awaruite.  The Mitchell Range Group area claim consist of one claim block covering 8,659 hectares with demonstrated metallic mineralization including nickel, cobalt, and chromium. Nickel cobalt mineralization has not been well explored, but the presence of awaruite has been documented. The Company has </span><span style=''>optioned out an 80% interest on certain mineral claims within the Hard Nickel 4 and Nickel 100 exploration project, to Surge Battery Metals Inc. (TSXV:NILI).</span>\n</p>\n \n<p style='text-align:justify; '>\n<span style='font-weight:bold; '>About Clayton Valley Lithium Project</span>\n</p>\n \n<p style='text-align:justify; '>\n<span style=''>The Company owns a 100% in 113 lithium lode and placer claims covering over 640 hectares in Clayton Valley. Clayton Valley is a down-dropped closed basin formed by the Miocene age Great Basin extension and is still active due to movement along the Walker Lane structural zone.  As a result, the basin has preserved multiple layers of lithium bearing volcanic ash, resulting from multiple eruptive events over the past 6 million years including eruptions from the 700,000-year-old Long Valley Caldera system and related events.  These ash layers are thought to contribute to the lithium brines extracted by Albemarle and are also likely involved in the formation of the exposed lithium rich clay deposits on the east side of Clayton Valley. </span>\n</p>\n  \n<p style='text-align:left; '>\n<span style=''>On Behalf of the Board of Directors</span>\n</p>\n \n<p style='text-align:justify; '>\n<span style='font-style:italic; '>“Tim Fernback”</span>\n</p>\n\n<p style='text-align:justify; '>\n<span style=''>604-428-5690</span>\n</p>\n \n<p style='text-align:justify; '>\n<span style=''>Tim Fernback, President &amp; CEO</span>\n</p>\n \n<p style='text-align:justify; '>\n<span style='font-style:italic; '>Neither the TSX Venture Exchange nor its Regulation Services Provider (as that term is defined in the policies of the TSX Venture Exchange) accepts responsibility for the adequacy or accuracy of this release. </span>\n</p>\n \n<p style='text-align:justify; '>\n<span style='font-style:italic; '>This news release may contain forward-looking statements which include, but are not limited to, comments that involve future events and conditions, which are subject to various risks and uncertainties. Except for statements of historical facts, comments that address resource potential, upcoming work programs, geological interpretations, receipt and security of mineral property titles, availability of funds, and others are forward-looking. Forward-looking statements are not guarantees of future performance and actual results may vary materially from those statements. General business conditions are factors that could cause actual results to vary materially from forward-looking statements.</span>\n</p>\n \n\n<p>Copyright (c) 2023 TheNewswire - All rights reserved.</p>\n",
    "search_terms": "Volt Canyon Lithium,Grid Battery Metals Inc.,NICL",
    "master_gid": 4309,
    "date": "2023-03-29T11:30:00.000Z",
    "tags": "USA|Nevada||Lithium,Nickel|Project Acquisition",
    "image_id": null,
    "hidden": false,
    "company_id": 42,
    "provider": null,
    "excerpt": "  Coquitlam, BC –TheNewswire -March 29, 2023-Nickel Rock Resources Inc. (the “Company” or “Nickel Rock”) (TSXV:NIC),(OTC:NICKLF),(FRA:NMK2)announcesthat the Company has staked80 placer claims (MVS1–MVS80) covering approximately 635 hectares of alluvial sediments and clays located 122 km northeast of Tonopah, Nevada (the “Volt Canyon Lithium Property”).The Volt Canyon Lithium Property is located in Monitor",
    "is_regulatory": false,
    "refined_tags": [
      "Project Acquisition"
    ],
    "ftp_filename": null,
    "company_name": "Grid Battery Metals Inc.",
    "exchange": "TSXV",
    "root_ticker": "CELL",
    "project_name": "Volt Canyon Lithium",
    "gid": 4309,
    "location": "Nevada, United States",
    "plan_id": null,
    "description_text": "Coquitlam, BC – TheNewswire - March 29, 202 3 - Nickel Rock Resources Inc. (the “Company” or “Nickel Rock”) (TSXV:NIC ) , ( OTC:NICKLF ) , ( FRA:NMK2) announces that the Company has staked 80 placer claims (MVS1–MVS80) covering approximately 635 hectares of alluvial sediments and clays located 122 km northeast of Tonopah, Nevada (the “Volt Canyon Lithium Property”). The Volt Canyon Lithium Property is located in Monitor Valley, Nevada, about 122 km north-northeast of Tonopah, Nevada. The center of the property is about 38.96° North Latitude, 116.70 ° West Longitude. Geology and Mineralization The Volt Canyon Lithium Property is sediment-hosted lithium clay targets. Access to the property is good and both future exploration and exploitation work could be conducted year-round. Minimal work has been conducted on the project to date, but surface samples reported in regional NURE data run up to 108 ppm Li near the claim block. The origin of this lithium deposit is suspected to be similar to Clayton Valley clay deposits located about 180 km to the south. Both areas are reasonably well represented by the USGS preliminary deposit model, which describes the primary characteristics as light-colored, ash-rich, lacustrine (lake) rocks containing swelling clays. Mr. Tim Fernback, Nickel Rock’s President & CEO comments “Volt Canyon Lithium Project has been relatively unexplored to date, but the lithium exploration potential due to the geothermal activity in the project area is compelling.  Our geological team has been assessing this overall area for several months for its lithium exploration potential.  It is the Company’s intention to rapidly evaluate the lithium potential of this project over the coming months.  It is Nickel Rock’s intent to complete an initial NI #43-101 Technical Report on the property in the near future”. Click Image To View Full Size Qualified Person as Defined Under National Instrument 43-101 Alan J. Morris, CPG of Spring Creek, Nevada, a Qualified Person as defined under Nation Instrument 43-101 has reviewed and approved the technical aspects of this news release. About Nickel Rock Resources Inc. Nickel Rock Resources Inc. is a Canadian based exploration company whose primary listing is on the TSX Venture Exchange.  The Company’s maintains a focus on exploration for high value battery metals required for the electric vehicle (EV) market. www.nickelrockresources.com About the British Columbia, Nickel Projects The Mount Sidney Williams Group consists of three claim blocks with a total area of 10,569 hectares in the area surrounding Mount Sidney Williams, both adjoining and near the Decar project of FPX Nickel Corp., located 100 kilometres northwest of Fort St. James, B.C., in the Omineca mining division. Metallic mineralization includes nickel, cobalt, and chromium. At least some of the nickel mineralization occurs as awaruite.  The Mitchell Range Group area claim consist of one claim block covering 8,659 hectares with demonstrated metallic mineralization including nickel, cobalt, and chromium. Nickel cobalt mineralization has not been well explored, but the presence of awaruite has been documented. The Company has optioned out an 80% interest on certain mineral claims within the Hard Nickel 4 and Nickel 100 exploration project, to Surge Battery Metals Inc. (TSXV:NILI). About Clayton Valley Lithium Project The Company owns a 100% in 113 lithium lode and placer claims covering over 640 hectares in Clayton Valley. Clayton Valley is a down-dropped closed basin formed by the Miocene age Great Basin extension and is still active due to movement along the Walker Lane structural zone.  As a result, the basin has preserved multiple layers of lithium bearing volcanic ash, resulting from multiple eruptive events over the past 6 million years including eruptions from the 700,000-year-old Long Valley Caldera system and related events.  These ash layers are thought to contribute to the lithium brines extracted by Albemarle and are also likely involved in the formation of the exposed lithium rich clay deposits on the east side of Clayton Valley. On Behalf of the Board of Directors “Tim Fernback” 604-428-5690 Tim Fernback, President & CEO Neither the TSX Venture Exchange nor its Regulation Services Provider (as that term is defined in the policies of the TSX Venture Exchange) accepts responsibility for the adequacy or accuracy of this release. This news release may contain forward-looking statements which include, but are not limited to, comments that involve future events and conditions, which are subject to various risks and uncertainties. Except for statements of historical facts, comments that address resource potential, upcoming work programs, geological interpretations, receipt and security of mineral property titles, availability of funds, and others are forward-looking. Forward-looking statements are not guarantees of future performance and actual results may vary materially from those statements. General business conditions are factors that could cause actual results to vary materially from forward-looking statements. Copyright (c) 2023 TheNewswire - All rights reserved.",
    "primary_commodity": "Li"
  },
  "articleProject": {
    "gid": 4309,
    "project_name": "Volt Canyon Lithium",
    "location": "Nevada, United States"
  },
  "articleExchange": "TSXV",
  "articleCompanyId": 42,
  "articleTicker": "CELL",
  "articleCompanyName": "Grid Battery Metals Inc.",
  "allOtherCompanyProjects": [
    {
      "company_id": 42,
      "gid": 9871,
      "project_name": "Grid Copper",
      "location": "British Columbia, Canada"
    },
    {
      "company_id": 42,
      "gid": 5384,
      "project_name": "Texas Springs",
      "location": "Nevada, United States"
    },
    {
      "company_id": 42,
      "gid": 4309,
      "project_name": "Volt Canyon Lithium",
      "location": "Nevada, United States"
    },
    {
      "company_id": 42,
      "gid": 5474,
      "project_name": "Grid Nickel Group",
      "location": "British Columbia, Canada"
    },
    {
      "company_id": 42,
      "gid": 6320,
      "project_name": "Clayton Valley",
      "location": "Nevada, United States"
    }
  ],
  "allOtherCompanyNews": [
    {
      "id": 106216,
      "company_id": 42,
      "title": "Grid Battery Revises TD Media d/b/a Life Water Media Contract to Provide Media Services",
      "link": null,
      "date": "2025-05-29T11:30:00.000Z",
      "hidden": false
    },
    {
      "id": 105190,
      "company_id": 42,
      "title": "Grid Battery Awards Contract for 2025 Exploration Program on its Copper-Gold Property to Hardline Exploration",
      "link": "https://www.thenewswire.com/press-releases?id=1AdyFqW2x",
      "date": "2025-05-20T11:30:00.000Z",
      "hidden": false
    },
    {
      "id": 104765,
      "company_id": 42,
      "title": "Grid Battery Re-Engages TD Media d/b/a Life Water Media to Provide Media Services",
      "link": "https://www.thenewswire.com/press-releases?id=1LYzFbyr1",
      "date": "2025-05-15T02:30:00.000Z",
      "hidden": false
    },
    {
      "id": 103830,
      "company_id": 42,
      "title": "Grid Battery Metals Provides a CEO Update",
      "link": "https://www.thenewswire.com/press-releases?id=1kZaFqzdg",
      "date": "2025-05-07T11:30:00.000Z",
      "hidden": false
    },
    {
      "id": 91577,
      "company_id": 42,
      "title": "Grid Battery Closes Acquisition of Copper Property with AC/DC Battery Metals Inc.",
      "link": "https://www.thenewswire.com/press-releases?id=1BOxF1d9M",
      "date": "2025-03-17T17:50:00.000Z",
      "hidden": false
    },
    {
      "id": 84732,
      "company_id": 42,
      "title": "Grid Battery Metals Update - Fall 2024 Drilling Results on its Clayton Valley Lithium Project",
      "link": "https://www.thenewswire.com/press-releases?id=1AD4FzzpY",
      "date": "2025-01-21T12:30:00.000Z",
      "hidden": false
    },
    {
      "id": 83381,
      "company_id": 42,
      "title": "Grid Battery Re-Engages TD Media d/b/a Life Water Media to Provide Media Services",
      "link": "https://www.accesswire.com/964742/grid-battery-re-engages-td-media-dba-life-water-media-to-provide-media-services",
      "date": "2025-01-07T12:30:00.000Z",
      "hidden": false
    },
    {
      "id": 76259,
      "company_id": 42,
      "title": "Grid Battery Metals Update - Drilling Completed on its Clayton Valley Lithium Project ",
      "link": "https://www.thenewswire.com/press-releases?id=1Bz4Fba9K",
      "date": "2024-10-28T11:30:00.000Z",
      "hidden": false
    },
    {
      "id": 72660,
      "company_id": 42,
      "title": "Grid Battery Metals Drilling Update on its Clayton Valley Lithium Project",
      "link": "https://www.thenewswire.com/press-releases?id=1BKRFpYYq",
      "date": "2024-09-26T11:30:00.000Z",
      "hidden": false
    },
    {
      "id": 71171,
      "company_id": 42,
      "title": "Grid Battery Metals Begins Drilling the Clayton Valley Lithium Project",
      "link": "https://www.accesswire.com/viewarticle.aspx?id=916546&lang=en",
      "date": "2024-09-12T11:30:00.000Z",
      "hidden": false
    }
  ]
}
