{
  "article": {
    "id": 81769,
    "link": "https://www.accesswire.com/953074/orogen-royalties-sells-the-celts-gold-project-to-eminent-gold",
    "title": "Orogen Royalties Sells the Celts Gold Project to Eminent Gold",
    "description": "<p><strong id=\"dateline\">VANCOUVER, BC / ACCESSWIRE / December 12, 2024 / </strong><strong>(TSXV:OGN)(OTCQX:OGNRF) </strong>Orogen Royalties Inc. (&quot;Orogen&quot; or the &quot;Company&quot;) is pleased to announce that the Company has signed a purchase and sale agreement (the &quot;Agreement&quot;) with a wholly-owned U.S. subsidiary of Eminent Gold (&quot;Eminent&quot;) (TSX.V: EMNT) whereby Eminent has acquired the Celts gold project (&quot;Celts&quot; or the &quot;Project&quot;), located in Nevada, USA.</p><p>To acquire a 100% interest in Celts, Eminent will pay a total of US$400,000 consisting of cash and/or shares, subject to regulatory approval, and will grant a 3% net smelter return (&quot;NSR&quot;) royalty, of which 1% can be purchased for US$1.5 million.</p><p>Pursuant to the terms of a generative alliance (the &quot;Alliance&quot;) agreement between Altius Minerals Corporation (TSX:ALS) (&quot;Altius&quot;) and Orogen previously announced September 12, 2022<sup>1</sup>, proceeds from the sale of the Project will be split evenly between the Alliance participants whereby each party will receive US$200,000 in cash and/or shares and a 1.5% NSR royalty.</p><p>&quot;Celts is one of four projects generated and the second sold to date under the Alliance with Altius, a collaboration of technical expertise to identify targets with geological similarities to the Expanded Silicon project in the Walker Lane Trend, Nevada,&quot; commented Orogen's CEO and President, Paddy Nicol. &quot;Celts is representative of Orogen's business model of organic royalty generation, creating exposure to new discoveries with significant leverage to value potential. We are excited to partner with the Eminent team and look forward to their exploration efforts.&quot;</p><figure class=\"image image_resized\" style=\"width:100%;text-align:center;margin:0.9em auto\" width=\"100%\"><a href=\"https://pr.report/4wj9\" rel=\"nofollow\"><img src=\"https://www.accesswire.com/imagelibrary/895bed4e-f686-44a5-a3c0-1729cf57e16f/953074/orogen-fig1121124.png\" width=\"100%\" /></a></figure><div style=\"clear: both\"> </div><div> </div><div> </div><div> </div><p style=\"text-align:center;\"><br /><strong>Figure 1: Location of the Celts project</strong></p><p><strong><u>About the Celts Gold Project</u></strong></p><p>The 560-hectare Celts project is located in southeastern Nevada, thirteen kilometres northeast of the historic high-sulphidation Goldfield district and one-hundred kilometres northwest of the Silicon discovery (Figure 1). Celts contains a cell of advanced argillic alteration that is recognized to be steam heated alteration within a low-sulphidation system. The steam cap remains undrilled.</p><p>The alteration cell at Celts is centered on a Tertiary rhyolite dome with an eight-hundred metre diameter zone of alteration composed of alunite and kaolinite interspersed with regions of fine-grained silica flooding (Figure 2). Celts could be one of the few epithermal systems in Nevada associated with slab window magmatism, like the Silicon (3.4Moz of indicated and 800Koz inferred gold resources) and Merlin (9.05Moz gold resource inferred) deposits, where Orogen holds a 1% NSR royalty.</p><p>Similar to the Silicon deposit, there is no gold at surface in the steam cap, but peripheral gold, including grab samples up to 33 grams per tonne, occurs in quartz veins associated with illite and adularia at lower elevations one to two kilometres from the dome (Figure 2). Taken together, the central steam cap and peripheral gold-bearing mineralized structures define a four-square kilometre mineral system.</p><p>The property is on road-accessible BLM land with a clear and unencumbered pathway to drill testing.</p><p><strong><u>Transaction Details</u></strong></p><p>Orogen, Altius and Eminent have signed an Agreement whereby Eminent has acquired a 100% interest in the Celts Project by paying US$400,000 consisting of US$30,000 cash and US$45,000 in common shares of Eminent at closing, and US$325,000 consisting of cash and/or shares, at the discretion of Eminent, within six months from the date of signing. Eminent will also grant a 3% net smelter return (&quot;NSR&quot;) royalty, of which 1% can be purchased for US$1.5 million.</p><p>The issuance of Eminent shares is subject to regulatory approval of the TSX Venture Exchange.</p><figure class=\"image image_resized\" style=\"width:100%;text-align:center;margin:0.9em auto\" width=\"100%\"><a href=\"https://pr.report/4wja\" rel=\"nofollow\"><img src=\"https://www.accesswire.com/imagelibrary/492c2b70-569b-418c-8456-3867f9699814/953074/orogen-fig2121124.png\" width=\"100%\" /></a></figure><div style=\"clear: both\"> </div><div> </div><div> </div><div> </div><p style=\"text-align:center;\"><br /><strong>Figure 2: Simplified Geology, Alteration and Gold Geochemistry at Celts</strong></p><p><strong><u>Qualified Person Statement</u></strong></p><p>All technical data, as disclosed in this press release, has been verified by Laurence Pryer, Ph.D., P.Geo. VP Exploration for the Company. Dr. Pryer is a qualified person as defined under the terms of National Instrument 43-101.</p><p><strong><u>About Orogen Royalties Inc.</u></strong></p><p>Orogen Royalties Inc. is focused on organic royalty creation and royalty acquisitions on precious and base metal discoveries in western North America. The Company's royalty portfolio includes the Ermita単o gold and silver mine in Sonora, Mexico (2% NSR royalty) being mined by First Majestic Silver Corp. and the Expanded Silicon gold project (1% NSR royalty) in Nevada, USA, being advanced by AngloGold Ashanti NA. The Company is well financed with several projects actively being explored under joint ventures.</p><p>On Behalf of the Board</p><p><strong>OROGEN ROYALTIES INC.</strong></p><p>Paddy Nicol<br />President &amp; CEO</p><p>To find out more about Orogen, please contact Paddy Nicol, President &amp; CEO at 604-248-8648, and Marco LoCascio, Vice President, Corporate Development at 604-248-8648. Visit our website at <a rel=\"nofollow\" href=\"https://pr.report/4wjb\">www.orogenroyalties.com</a>.</p><p>Orogen Royalties Inc.<br />1015 - 789 West Pender Street<br />Vancouver, BC<br />Canada V6C 1H2<br /><a rel=\"nofollow\" href=\"mailto:info@orogenroyalties.com\">info@orogenroyalties.com</a></p><ol><li><p><a rel=\"nofollow\" href=\"https://pr.report/4wjc\"><u>https://orogenroyalties.com/news-releases/orogen-royalties-and-altius-minerals-form-nevada-generative-alliance-and-announce-acquisition-of-the-cuprite-epithermal-gold-pro/</u></a></p></li><li><p><a rel=\"nofollow\" href=\"https://pr.report/4wjd\"><u>https://www.anglogoldashanti.com/portfolio/reserves-resources/</u></a></p></li></ol><p><strong>Forward Looking Information</strong></p><p>This news release includes certain statements that may be deemed &quot;forward looking statements&quot;. All statements in this presentation, other than statements of historical facts, that address events or developments that Orogen Royalties Inc. (the &quot;Company&quot;) expect to occur, are forward looking statements. Forward looking statements are statements that are not historical facts and are generally, but not always, identified by the words &quot;expects&quot;, &quot;plans&quot;, &quot;anticipates&quot;, &quot;believes&quot;, &quot;intends&quot;, &quot;estimates&quot;, &quot;projects&quot;, &quot;potential&quot; and similar expressions, or that events or conditions &quot;will&quot;, &quot;would&quot;, &quot;may&quot;, &quot;could&quot; or &quot;should&quot; occur.</p><p>Although the Company believe the expectations expressed in such forward looking statements are based on reasonable assumptions, such statements are not guarantees of future performance and actual results may differ materially from those in the forward looking statements. Factors that could cause the actual results to differ materially from those in forward looking statements include market prices, exploitation and exploration successes, and continued availability of capital and financing, and general economic, market or business conditions. Furthermore, the extent to which COVID-19 may impact the Company's business will depend on future developments such as the geographic spread of the disease, the duration of the outbreak, travel restrictions, physical distancing, business closures or business disruptions, and the effectiveness of actions taken in Canada and other countries to contain and treat the disease. Although it is not possible to reliably estimate the length or severity of these developments and their financial impact as of the date of approval of these condensed interim consolidated financial statements, continuation of the prevailing conditions could have a significant adverse impact on the Company's financial position and results of operations for future periods.</p><p>Investors are cautioned that any such statements are not guarantees of future performance and actual results or developments may differ materially from those projected in the forward looking statements. Forward looking statements are based on the beliefs, estimates and opinions of the Company's management on the date the statements are made. Except as required by securities laws, the Company undertakes no obligation to update these forward looking statements in the event that management's beliefs, estimates or opinions, or other factors, should change.</p><p><strong>SOURCE:</strong> Orogen Royalties Inc</p><br /><br />View the original <a href='https://www.accesswire.com/953074/orogen-royalties-sells-the-celts-gold-project-to-eminent-gold'>press release</a> on accesswire.com<br /><br />",
    "search_terms": "Celt,Orogen Royalties Inc.,OGN",
    "master_gid": 9250,
    "date": "2024-12-12T12:30:00.000Z",
    "tags": "USA|Nevada||Gold|Project Acquisition",
    "image_id": null,
    "hidden": false,
    "company_id": 195,
    "provider": "accesswire",
    "excerpt": "VANCOUVER, BC / ACCESSWIRE / December 12, 2024 /(TSXV:OGN)(OTCQX:OGNRF)Orogen Royalties Inc. (&quot;Orogen&quot; or the &quot;Company&quot;) is pleased to announce that the Company has signed a purchase and sale agreement (the &quot;Agreement&quot;) with a wholly-owned U.S. subsidiary of Eminent Gold (&quot;Eminent&quot;) (TSX.V: EMNT) whereby Eminent has acquired the Celts gold project",
    "is_regulatory": false,
    "refined_tags": null,
    "ftp_filename": null,
    "company_name": "Orogen Royalties Inc.",
    "exchange": "TSXV",
    "root_ticker": "OGN",
    "project_name": "Celts",
    "gid": 9250,
    "location": "Nevada, United States",
    "plan_id": null,
    "description_text": "VANCOUVER, BC / ACCESSWIRE / December 12, 2024 / (TSXV:OGN)(OTCQX:OGNRF) Orogen Royalties Inc. (\"Orogen\" or the \"Company\") is pleased to announce that the Company has signed a purchase and sale agreement (the \"Agreement\") with a wholly-owned U.S. subsidiary of Eminent Gold (\"Eminent\") (TSX.V: EMNT) whereby Eminent has acquired the Celts gold project (\"Celts\" or the \"Project\"), located in Nevada, USA. To acquire a 100% interest in Celts, Eminent will pay a total of US$400,000 consisting of cash and/or shares, subject to regulatory approval, and will grant a 3% net smelter return (\"NSR\") royalty, of which 1% can be purchased for US$1.5 million. Pursuant to the terms of a generative alliance (the \"Alliance\") agreement between Altius Minerals Corporation (TSX:ALS) (\"Altius\") and Orogen previously announced September 12, 2022 1 , proceeds from the sale of the Project will be split evenly between the Alliance participants whereby each party will receive US$200,000 in cash and/or shares and a 1.5% NSR royalty. \"Celts is one of four projects generated and the second sold to date under the Alliance with Altius, a collaboration of technical expertise to identify targets with geological similarities to the Expanded Silicon project in the Walker Lane Trend, Nevada,\" commented Orogen's CEO and President, Paddy Nicol. \"Celts is representative of Orogen's business model of organic royalty generation, creating exposure to new discoveries with significant leverage to value potential. We are excited to partner with the Eminent team and look forward to their exploration efforts.\" Figure 1: Location of the Celts project About the Celts Gold Project The 560-hectare Celts project is located in southeastern Nevada, thirteen kilometres northeast of the historic high-sulphidation Goldfield district and one-hundred kilometres northwest of the Silicon discovery (Figure 1). Celts contains a cell of advanced argillic alteration that is recognized to be steam heated alteration within a low-sulphidation system. The steam cap remains undrilled. The alteration cell at Celts is centered on a Tertiary rhyolite dome with an eight-hundred metre diameter zone of alteration composed of alunite and kaolinite interspersed with regions of fine-grained silica flooding (Figure 2). Celts could be one of the few epithermal systems in Nevada associated with slab window magmatism, like the Silicon (3.4Moz of indicated and 800Koz inferred gold resources) and Merlin (9.05Moz gold resource inferred) deposits, where Orogen holds a 1% NSR royalty. Similar to the Silicon deposit, there is no gold at surface in the steam cap, but peripheral gold, including grab samples up to 33 grams per tonne, occurs in quartz veins associated with illite and adularia at lower elevations one to two kilometres from the dome (Figure 2). Taken together, the central steam cap and peripheral gold-bearing mineralized structures define a four-square kilometre mineral system. The property is on road-accessible BLM land with a clear and unencumbered pathway to drill testing. Transaction Details Orogen, Altius and Eminent have signed an Agreement whereby Eminent has acquired a 100% interest in the Celts Project by paying US$400,000 consisting of US$30,000 cash and US$45,000 in common shares of Eminent at closing, and US$325,000 consisting of cash and/or shares, at the discretion of Eminent, within six months from the date of signing. Eminent will also grant a 3% net smelter return (\"NSR\") royalty, of which 1% can be purchased for US$1.5 million. The issuance of Eminent shares is subject to regulatory approval of the TSX Venture Exchange. Figure 2: Simplified Geology, Alteration and Gold Geochemistry at Celts Qualified Person Statement All technical data, as disclosed in this press release, has been verified by Laurence Pryer, Ph.D., P.Geo. VP Exploration for the Company. Dr. Pryer is a qualified person as defined under the terms of National Instrument 43-101. About Orogen Royalties Inc. Orogen Royalties Inc. is focused on organic royalty creation and royalty acquisitions on precious and base metal discoveries in western North America. The Company's royalty portfolio includes the Ermita単o gold and silver mine in Sonora, Mexico (2% NSR royalty) being mined by First Majestic Silver Corp. and the Expanded Silicon gold project (1% NSR royalty) in Nevada, USA, being advanced by AngloGold Ashanti NA. The Company is well financed with several projects actively being explored under joint ventures. On Behalf of the Board OROGEN ROYALTIES INC. Paddy Nicol President & CEO To find out more about Orogen, please contact Paddy Nicol, President & CEO at 604-248-8648, and Marco LoCascio, Vice President, Corporate Development at 604-248-8648. Visit our website at www.orogenroyalties.com . Orogen Royalties Inc. 1015 - 789 West Pender Street Vancouver, BC Canada V6C 1H2 info@orogenroyalties.com https://orogenroyalties.com/news-releases/orogen-royalties-and-altius-minerals-form-nevada-generative-alliance-and-announce-acquisition-of-the-cuprite-epithermal-gold-pro/ https://www.anglogoldashanti.com/portfolio/reserves-resources/ Forward Looking Information This news release includes certain statements that may be deemed \"forward looking statements\". All statements in this presentation, other than statements of historical facts, that address events or developments that Orogen Royalties Inc. (the \"Company\") expect to occur, are forward looking statements. Forward looking statements are statements that are not historical facts and are generally, but not always, identified by the words \"expects\", \"plans\", \"anticipates\", \"believes\", \"intends\", \"estimates\", \"projects\", \"potential\" and similar expressions, or that events or conditions \"will\", \"would\", \"may\", \"could\" or \"should\" occur. Although the Company believe the expectations expressed in such forward looking statements are based on reasonable assumptions, such statements are not guarantees of future performance and actual results may differ materially from those in the forward looking statements. Factors that could cause the actual results to differ materially from those in forward looking statements include market prices, exploitation and exploration successes, and continued availability of capital and financing, and general economic, market or business conditions. Furthermore, the extent to which COVID-19 may impact the Company's business will depend on future developments such as the geographic spread of the disease, the duration of the outbreak, travel restrictions, physical distancing, business closures or business disruptions, and the effectiveness of actions taken in Canada and other countries to contain and treat the disease. Although it is not possible to reliably estimate the length or severity of these developments and their financial impact as of the date of approval of these condensed interim consolidated financial statements, continuation of the prevailing conditions could have a significant adverse impact on the Company's financial position and results of operations for future periods. Investors are cautioned that any such statements are not guarantees of future performance and actual results or developments may differ materially from those projected in the forward looking statements. Forward looking statements are based on the beliefs, estimates and opinions of the Company's management on the date the statements are made. Except as required by securities laws, the Company undertakes no obligation to update these forward looking statements in the event that management's beliefs, estimates or opinions, or other factors, should change. SOURCE: Orogen Royalties Inc View the original press release on accesswire.com",
    "primary_commodity": "Au"
  },
  "articleProject": {
    "gid": 9250,
    "project_name": "Celts",
    "location": "Nevada, United States"
  },
  "articleExchange": "TSXV",
  "articleCompanyId": 195,
  "articleTicker": "OGN",
  "articleCompanyName": "Orogen Royalties Inc.",
  "allOtherCompanyProjects": [
    {
      "company_id": 195,
      "gid": 1061,
      "project_name": "Ghost Ranch",
      "location": "Nevada, USA"
    },
    {
      "company_id": 195,
      "gid": 5228,
      "project_name": "Silicon-Merlin",
      "location": "Nevada, United States"
    },
    {
      "company_id": 195,
      "gid": 1076,
      "project_name": "Cine Mountain",
      "location": "Nevada, USA"
    },
    {
      "company_id": 195,
      "gid": 1068,
      "project_name": "Jake Creek",
      "location": "Nevada, USA"
    },
    {
      "company_id": 195,
      "gid": 850,
      "project_name": "Maggie Creek",
      "location": "Nevada, USA"
    },
    {
      "company_id": 195,
      "gid": 1070,
      "project_name": "Buffalo Canyon",
      "location": "Nevada, USA"
    },
    {
      "company_id": 195,
      "gid": 1074,
      "project_name": "Elba",
      "location": "Nevada, USA"
    },
    {
      "company_id": 195,
      "gid": 1078,
      "project_name": "Jupiter",
      "location": "Nevada, USA"
    },
    {
      "company_id": 195,
      "gid": 1065,
      "project_name": "Diamond Point",
      "location": "Nevada, USA"
    },
    {
      "company_id": 195,
      "gid": 423,
      "project_name": "Lemon Lake",
      "location": "British Columbia, Canada"
    },
    {
      "company_id": 195,
      "gid": 1067,
      "project_name": "South Roberts",
      "location": "Nevada, USA"
    },
    {
      "company_id": 195,
      "gid": 1072,
      "project_name": "Pearl String",
      "location": "Nevada, USA"
    },
    {
      "company_id": 195,
      "gid": 7747,
      "project_name": "TCS",
      "location": null
    },
    {
      "company_id": 195,
      "gid": 9250,
      "project_name": "Celts",
      "location": "Nevada, United States"
    }
  ],
  "allOtherCompanyNews": [
    {
      "id": 107107,
      "company_id": 195,
      "title": "Orogen Royalties Announces Filing and Mailing of the Management Information Circular in Connection with the Annual General and Special Meeting of Shareholders",
      "link": null,
      "date": "2025-06-05T12:30:00.000Z",
      "hidden": false
    },
    {
      "id": 106547,
      "company_id": 195,
      "title": "Orogen Royalties Announces Profitable Q1-2025 Results and Expansion of High-Grade Gold and Silver Mineralization at Navidad ",
      "link": null,
      "date": "2025-06-02T11:30:00.000Z",
      "hidden": false
    },
    {
      "id": -197091,
      "company_id": 195,
      "title": "Consolidated Financial Statements For the Years Ended December 31, 2024 and 2023",
      "link": "https://app.quotemedia.com/data/downloadFiling?webmasterId=104408&ref=6810b8dd6691e212987e5e35&type=PDFC&formType=002-002-001089-003001&formDescription=News+release&dateFiled=2025-04-29",
      "date": "2025-04-29T11:32:45.000Z",
      "hidden": false
    },
    {
      "id": 102150,
      "company_id": 195,
      "title": "Orogen Royalties Announces Record Year End Financial Performance",
      "link": null,
      "date": "2025-04-29T11:30:00.000Z",
      "hidden": false
    },
    {
      "id": 102885,
      "company_id": 195,
      "title": "TRIPLE FLAG TO ACQUIRE OROGEN ROYALTIES AND ITS 1.0% NSR ROYALTY ON THE EXPANDED SILICON GOLD PROJECT",
      "link": "https://app.quotemedia.com/data/downloadFiling?webmasterId=104408&ref=680785585089ea2bf14028c1&type=PDFC&formType=002-002-001089-003001&formDescription=News+release&dateFiled=2025-04-22",
      "date": "2025-04-22T05:02:32.000Z",
      "hidden": false
    },
    {
      "id": 98862,
      "company_id": 195,
      "title": "Orogen Royalties Announces Mineral Resource and Reserve Update on Producing Ermita単o Royalty Including Initial Inferred Resource for the Navidad Vein",
      "link": null,
      "date": "2025-04-07T11:30:00.000Z",
      "hidden": false
    },
    {
      "id": 91809,
      "company_id": 195,
      "title": "Orogen Royalties Announces Preliminary 2024 Year End Financial Results  ",
      "link": null,
      "date": "2025-03-19T11:30:00.000Z",
      "hidden": false
    },
    {
      "id": 88663,
      "company_id": 195,
      "title": "CORRECTION: Orogen Royalties Announces 34% Increase in Gold Resources at the Merlin Deposit",
      "link": "https://www.accessnewswire.com/newsroom/en/metals-and-mining/correction-orogen-royalties-announces-34-increase-in-gold-resources-at-the-merlin--988454",
      "date": "2025-02-20T14:05:00.000Z",
      "hidden": false
    },
    {
      "id": 88617,
      "company_id": 195,
      "title": "Orogen Royalties Announces 34% Increase in Gold Resources at the Merlin Deposit",
      "link": "https://www.accessnewswire.com/newsroom/en/metals-and-mining/orogen-royalties-announces-34-increase-in-gold-resources-at-the-merlin-deposit-988238",
      "date": "2025-02-20T12:30:00.000Z",
      "hidden": false
    },
    {
      "id": 86910,
      "company_id": 195,
      "title": "Orogen Royalties Announces the Expansion of the Navidad Gold-Silver Target at Ermita単o ",
      "link": "https://www.accessnewswire.com/newsroom/en/metals-and-mining/orogen-royalties-announces-the-expansion-of-the-navidad-gold-silver-target-at-ermi-979852",
      "date": "2025-02-05T12:30:00.000Z",
      "hidden": false
    }
  ]
}
