{
  "article": {
    "id": 81768,
    "link": "https://www.newsfilecorp.com/release/233463/Eminent-Acquires-Silicon-Analogue-Celts-Project-in-Nevada",
    "title": "Eminent Acquires Silicon Analogue, Celts Project in Nevada",
    "description": "<img src=\"https://api.newsfilecorp.com/newsinfo/233463/367\" id=\"367\" width=\"2\" height=\"2\" style=\"width: 1px;  height: 1px;border: 0px solid;\" /><p style=\"text-align: justify;\">Vancouver, British Columbia--(Newsfile Corp. - December 12, 2024) - Eminent Gold Corp. (TSXV: EMNT) (OTCQB: EMGDF) (\"the Company\" or \"Eminent\") is pleased to announce the signing of an agreement to acquire a 100% interest in the Celts Project (\"<b>Celts</b>\" or \"<b>Property</b>\") in Nevada, USA, from Orogen Royalties Inc. (TSXV:OGN) (\"Orogen\"), for a total purchase price of USD $400,000, payable in two tranches over the next six months. <b>Eminent believes the Celts project represents a strong exploration analogue to the recent Silicon discovery, located 100 kilometers south.</b> The Expanded Silicon Project collectively boasts an impressive total mineral resource of 13.27 million ounces of gold, including 4.22 million ounces of indicated and inferred resources from the Silicon deposit and 9.05 million ounces of inferred resources from the Merlin deposit<sup>1</sup>, underscoring the significant potential of the area. The recent discovery of the Silicon epithermal gold deposit near the Beatty district by AngloGold Ashanti highlights the significant prospects of the Walker Lane Trend, a region renowned for its substantial gold endowment, including 80 million ounces of historically produced gold and extensive estimated gold resources&#178; (Figure 1).</p><p style=\"text-align: justify;\"><b>Paul Sun, President and CEO of the Company commented:</b></p><p style=\"text-align: justify;\"><i>\"We are pleased to announce the inclusion of the Celts project into our portfolio. This aligns with our strategic plan to develop a pipeline of exploration projects with analogous features to world-class deposits in Nevada.</i></p><p style=\"text-align: justify;\"><i>The Celts project presents a substantial opportunity, where we can leverage the extensive groundwork already completed, and advance this project both efficiently and cost-effectively.</i></p><p style=\"text-align: justify;\"><i>We remain disciplined with our Nevada-based technical team committed to maximizing shareholder value through strategic, large-potential exploration and delivering catalyst-rich opportunities in a thriving gold market.</i></p><p style=\"text-align: justify;\"><i>Our current drill program at Hot Springs Range is a significant step in this direction and will be ongoing depending on results. We are preparing final permits to drill Gilbert South and completing the final steps to advance Celts to a drill-ready, permitted stage in the first half of 2025.\"</i></p><p style=\"text-align: justify;\"><b>About the Celts Gold Project</b></p><p style=\"text-align: justify;\">The Celts property was originally identified and staked by Orogen's technical team, the same group responsible for AngloGold Ashanti's recent Silicon discovery, which boasts 3.4 million ounces of indicated gold resources and 800,000 ounces of inferred gold resources&#185;. Following the success at Silicon, AngloGold discovered a more extensive deposit within Orogen's area of interest (<b>AOI</b>), known as Merlin, with an inferred resource of 9.05 million ounces of gold&#185;. Given the similar geology and regional setting, the Celts project represents a significant addition to Eminent's exploration portfolio.</p><p style=\"text-align: justify;\">The Celts project, encompassing 67 unpatented claims over 560 hectares, is located in southeastern Nevada, approximately thirteen kilometers northeast of the historic town of Goldfields. The Goldfields district has an endowment of approximately 5.5 million ounces of gold&#8308;.</p><p style=\"text-align: justify;\">Orogen has identified a substantial steam cap of approximately 800 square meters at Celts, featuring silica and advanced argillic alteration-characteristics it shares with Silicon. This alteration is situated within a rhyolite dome complex, which is of the same age as rhyolite samples from Silicon<sup>5</sup> and intrudes through a thick basalt unit covering much of the property. High-grade gold veins historically mined at the periphery of the property, with grab samples up to 33 g/t Au, highlight the potential target zones beneath the rhyolite dome and basalt, which Orogen considers a potential aquiclude (Figures 2 and 3).</p><p style=\"text-align: justify;\">Similar to Silicon, the steam cap at Celts is devoid of gold and other trace elements, as the alteration occurred above the water table. The low-sulfidation gold deposits that often underlie these steam caps form in boiling zones below the water table and require drilling for confirmation. The evidence for such zones at Celts includes the peripheral veins mentioned earlier. Minimal drilling has occurred near these veins, and none beneath the steam cap and basalt outcroppings. To explore these promising targets, Eminent plans a comprehensive surface exploration program at Celts, leveraging geophysical and geochemical techniques proven effective at Silicon and similar deposits.</p><p style=\"text-align: justify;\"><b>Dan McCoy, Chief Geologist and Director commented:</b></p><p style=\"text-align: justify;\"><i>\"The Silicon discovery, initially identified by Orogen and later acquired by AngloGold Ashanti, has paved the way for Eminent to explore for multi-million-ounce deposits beneath gold-barren, steam-heated alteration caps. The Celts project although early stage is comparable, with its hyperspectral alteration data, matching age of the rhyolite dome, and the low sulfidation state of the historically mined peripheral veins, presents a compelling exploration target akin to Silicon. </i></p><p style=\"text-align: justify;\"><i>We are enthusiastic about commencing exploration activities, as this project aligns perfectly with our strategic objective of discovering multi-million-ounce gold deposits in Nevada's prolific mining region.\"</i></p><p style=\"text-align: justify;\">All scientific and technical information in this news release has been prepared by, or approved by Michael Dufresne, PGeo. Mr. Dufresne is a qualified person for the purposes of National Instrument 43-101 - Standards of Disclosure for Mineral Projects.</p><p style=\"text-align: justify;\"><b>Transaction Highlights:</b></p><p style=\"text-align: justify;\">Total Payment: US$400,000</p><p style=\"text-align: justify;\">At Closing:</p><ul style=\"list-style-type: disc;\"><li>US$30,000 in cash</li><li>US$45,000 in Eminent common shares</li></ul><p style=\"text-align: justify;\">Within Six Months of Closing:</p><ul style=\"list-style-type: disc;\"><li>US$325,000 in cash or Eminent common shares (at Eminent's discretion, subject to regulatory approval)</li></ul><p style=\"text-align: justify;\">Property Claims: </p><ul style=\"list-style-type: disc;\"><li>3% net smelter return (NSR) royalty</li></ul><ul style=\"list-style-type: disc;\"><li>Option to repurchase 1% of the royalty for US$1.5 million (reducing the NSR to 2%)</li></ul><p style=\"text-align: justify;\">Proceeds Split:</p><ul style=\"list-style-type: disc;\"><li>US$200,000 in cash and/or shares to each Orogen and a subsidiary of Altius Minerals Corporation (\"Altius\")</li><li>1.5% NSR royalty to each Orogen and Altius</li></ul><p style=\"text-align: justify;\">Finder's Fee:</p><ul style=\"list-style-type: disc;\"><li>US$10,000 in cash to 3L Capital Inc.</li><li>Approximately 1.78% of the purchase consideration</li><li>Subject to TSX Venture Exchange acceptance</li></ul><p style=\"text-align: justify;\">  <a rel=\"nofollow\" href=\"https://images.newsfilecorp.com/files/1937/233463_4fde0872740608ec_002full.jpg\"><img src=\"https://images.newsfilecorp.com/files/1937/233463_4fde0872740608ec_002.jpg\" style=\"border-width: 0px;\" alt=\"Cannot view this image? Visit: https://images.newsfilecorp.com/files/1937/233463_4fde0872740608ec_002.jpg\" /></a><br /><br />Fig 1. Celts Location Map</p><p style=\"text-align: justify;\">To view an enhanced version of this graphic, please visit:<br /><a rel=\"nofollow\" href=\"https://images.newsfilecorp.com/files/1937/233463_4fde0872740608ec_002full.jpg\">https://images.newsfilecorp.com/files/1937/233463_4fde0872740608ec_002full.jpg</a></p><p style=\"text-align: justify;\"><a rel=\"nofollow\" href=\"https://images.newsfilecorp.com/files/1937/233463_4fde0872740608ec_003full.jpg\"><img src=\"https://images.newsfilecorp.com/files/1937/233463_4fde0872740608ec_003.jpg\" style=\"border-width: 0px;\" alt=\"Cannot view this image? Visit: https://images.newsfilecorp.com/files/1937/233463_4fde0872740608ec_003.jpg\" /></a><br /><br />Fig 2. geology, alteration, and vein map with alteration minerals obtained by hyperspectral imaging</p><p style=\"text-align: justify;\">To view an enhanced version of this graphic, please visit:<br /><a rel=\"nofollow\" href=\"https://images.newsfilecorp.com/files/1937/233463_4fde0872740608ec_003full.jpg\">https://images.newsfilecorp.com/files/1937/233463_4fde0872740608ec_003full.jpg</a></p><p style=\"text-align: justify;\"><a rel=\"nofollow\" href=\"https://images.newsfilecorp.com/files/1937/233463_4fde0872740608ec_004full.jpg\"><img src=\"https://images.newsfilecorp.com/files/1937/233463_4fde0872740608ec_004.jpg\" style=\"border-width: 0px;\" alt=\"Cannot view this image? Visit: https://images.newsfilecorp.com/files/1937/233463_4fde0872740608ec_004.jpg\" /></a><br /><br />Fig 3A. Google Earth image showing dome and steam cap at Celts, Fig. 3B Geology, Alteration and Property Map of the Celts property showing the section trace of Fig. 3C. Fig 3C. Schematic cross-section of the Celts property showing mineralization model below the rhyolite dome and basalt.  Except for the drillholes at the Gold Button shaft, there has been no drillhholes to test the model.&#160;</p><p style=\"text-align: justify;\">To view an enhanced version of this graphic, please visit:<br /><a rel=\"nofollow\" href=\"https://images.newsfilecorp.com/files/1937/233463_4fde0872740608ec_004full.jpg\">https://images.newsfilecorp.com/files/1937/233463_4fde0872740608ec_004full.jpg</a></p><p style=\"text-align: justify;\"><a rel=\"nofollow\" href=\"https://images.newsfilecorp.com/files/1937/233463_4fde0872740608ec_005full.jpg\"><img src=\"https://images.newsfilecorp.com/files/1937/233463_4fde0872740608ec_005.jpg\" style=\"border-width: 0px;\" alt=\"Cannot view this image? Visit: https://images.newsfilecorp.com/files/1937/233463_4fde0872740608ec_005.jpg\" /></a><br /><br /></p><p style=\"text-align: justify;\">Fig 4. Photo of advanced argillic alteration in the rhyolite dome at Celts. Photo looking towards the northeast.</p><p style=\"text-align: justify;\">To view an enhanced version of this graphic, please visit:<br /><a rel=\"nofollow\" href=\"https://images.newsfilecorp.com/files/1937/233463_4fde0872740608ec_005full.jpg\">https://images.newsfilecorp.com/files/1937/233463_4fde0872740608ec_005full.jpg</a></p><ol><li style=\"margin-top: 12pt;\">&#160;AngloGold Ashanti. (2024). <i>Annual report 2023</i>.<br /><a href=\"https://api.newsfilecorp.com/redirect/nVkbzHAPzJ\">https://reports.anglogoldashanti.com/23/wp-content/uploads/2024/04/AGA-RR23.pdf</a></li><li style=\"margin-top: 12pt;\"> Energyandgold.com. (2020, August 24). <i>A junior mining management team that doesn&#8217;t <br />know how to lose is back with the next incredible opportunity in Nevada gold exploration</i>.<br />Retrieved from Energy and Gold</li><li style=\"margin-top: 12pt;\"> University of Nevada, Reno. (n.d.). <i>Tonopah Silver District</i>. Retrieved from<br />https://gisweb.unr.edu/MiningDistricts/4. John, D. A., &#38; Henry, C. D. (2020). Magmatic-tectonic settings<br />of Cenozoic epithermal gold-silver deposits of the Great Basin, western United States. In Geological<br />Society of Nevada 2020 Symposium Volume.<br /><br /></li><li>John, D. A., &#38; Henry, C. D. (2020). Magmatic-tectonic settings of Cenozoic epithermal gold-silver<br />deposits of the Great Basin, western United States. In Geological Society of Nevada 2020 Symposium<br />Volume.<br /><br /></li><li> Nevada Bureau of Mines and Geology. (n.d.). <i>Open source ArcGIS datasets: Age of the rhyolite dome <br />in the Tonopah district</i>. Retrieved from https://data-nbmg.opendata.arcgis.com</li></ol><p style=\"text-align: justify;\">ON BEHALF OF THE BOARD OF DIRECTORS</p><p style=\"text-align: justify;\"><b>Paul Sun</b><br />CEO &#38; Director</p><p style=\"text-align: justify;\">For further information, please contact:</p><div id=\"contactInfo\" style=\"text-align: justify;\"><p><b>Eminent Gold Corp.</b></p><p>Phone: +1 604-505-7751</p><p>Email: <a href=\"mailto:michael@eminentgoldcorp.com\">michael@eminentgoldcorp.com</a></p><p>Website: <a href=\"https://api.newsfilecorp.com/redirect/yE0bqIGvXW\">www.eminentgoldcorp.com</a></p><p>Twitter: <a href=\"https://api.newsfilecorp.com/redirect/1pLamCVjOz\">@eminent_gold</a> <br /><br />LinkedIn: <a href=\"https://api.newsfilecorp.com/redirect/AMbvXUwbN7\">www.linkedin.com/company/eminent-gold-corp/</a></p></div><p style=\"text-align: justify;\"><b>About Eminent Gold</b></p><p style=\"text-align: justify;\">Eminent Gold is a gold exploration company focused on creating shareholder value through the exploration and discovery of world-class gold deposits in Nevada. Its multidisciplinary team has had multiple successes in gold discoveries and brings expertise and new ideas to the Great Basin. The Company's exploration assets in the Great Basin include: Hot Springs Range Project, Gilbert South, and Celts.</p><p style=\"text-align: justify;\"><i>Neither TSX Venture Exchange nor its Regulation Services Provider (as that term is defined in the policies of the TSX Venture Exchange) accepts responsibility for the adequacy or accuracy of this release. </i></p><p style=\"text-align: justify;\"><i>This news release contains certain statements that may be deemed \"forward-looking statements\" with respect to the Company within the meaning of applicable securities laws. Forward-looking statements are statements that are not historical facts and are generally, but not always, identified by the words \"expects\", \"plans\", \"anticipates\", \"believes\", \"intends\", \"estimates\", \"projects\", \"potential\" and similar expressions, or that events or conditions \"will\", \"would\", \"may\", \"could\" or \"should\" occur.  Forward-looking statements made in this news release include the anticipated completion of the private placement and the use of proceeds from the private placement.  Although Eminent Gold Corp. believes the expectations expressed in such forward-looking statements are based on reasonable assumptions, including the assumption that records and reports of historical work are accurate and correct, such statements are not guarantees of future performance, are subject to risks and uncertainties, and actual results or realities may differ materially from those in the forward-looking statements. Such material risks and uncertainties include, but are not limited to, the Company's ability to raise sufficient capital to fund its obligations under its property agreements going forward, to maintain its mineral tenures and concessions in good standing, to explore and develop the Company's projects or its other projects, to repay its debt and for general working capital purposes; changes in economic conditions or financial markets; the inherent hazards associates with mineral exploration and mining operations, future prices of gold, silver and other metals, changes in general economic conditions, accuracy of mineral resource and reserve estimates, the ability of the Company to obtain the necessary permits and consents required to explore, drill and develop the Company's projects and if obtained, to obtain such permits and consents in a timely fashion relative to the Company's plans and business objectives for the projects; the general ability of the Company to monetize its mineral resources; and changes in environmental and other laws or regulations that could have an impact on the Company's operations, compliance with environmental laws and regulations, aboriginal title claims and rights to consultation and accommodation, dependence on key management personnel and general competition in the mining industry. Forward-looking statements are based on the reasonable beliefs, estimates and opinions of the Company's management on the date the statements are made. Except as required by law, the Company undertakes no obligation to update these forward-looking statements in the event that management's beliefs, estimates or opinions, or other factors, should change.</i></p><p id=\"corporateNewsLogoContainer\" style=\"text-align: justify;\"><img src=\"https://images.newsfilecorp.com/files/1937/233463_logo150.jpg\" alt=\"Corporate Logo\" id=\"corporateNewsLogo\" /></p><p id=\"corporateLinkBack\" style=\"text-align: justify;\">To view the source version of this press release, please visit <a href=\"https://api.newsfilecorp.com/redirect/ZAbWvUxBRv\">https://www.newsfilecorp.com/release/233463</a></p>",
    "search_terms": "Celt,Eminent Gold Corp.,EMNT",
    "master_gid": 9250,
    "date": "2024-12-12T12:30:00.000Z",
    "tags": "USA|Nevada||Gold|Project Acquisition",
    "image_id": null,
    "hidden": false,
    "company_id": 136,
    "provider": "newsfilecorp",
    "excerpt": "Vancouver, British Columbia--(Newsfile Corp. - December 12, 2024) - Eminent Gold Corp. (TSXV: EMNT) (OTCQB: EMGDF) (\"the Company\" or \"Eminent\") is pleased to announce the signing of an agreement to acquire a 100% interest in the Celts Project (\"Celts\" or \"Property\") in Nevada, USA, from Orogen Royalties Inc. (TSXV:OGN) (\"Orogen\"),",
    "is_regulatory": false,
    "refined_tags": null,
    "ftp_filename": null,
    "company_name": "Orogen Royalties Inc.",
    "exchange": "TSXV",
    "root_ticker": "EMNT",
    "project_name": "Celts",
    "gid": 9250,
    "location": "Nevada, United States",
    "plan_id": null,
    "description_text": "Vancouver, British Columbia--(Newsfile Corp. - December 12, 2024) - Eminent Gold Corp. (TSXV: EMNT) (OTCQB: EMGDF) (\"the Company\" or \"Eminent\") is pleased to announce the signing of an agreement to acquire a 100% interest in the Celts Project (\" Celts \" or \" Property \") in Nevada, USA, from Orogen Royalties Inc. (TSXV:OGN) (\"Orogen\"), for a total purchase price of USD $400,000, payable in two tranches over the next six months. Eminent believes the Celts project represents a strong exploration analogue to the recent Silicon discovery, located 100 kilometers south. The Expanded Silicon Project collectively boasts an impressive total mineral resource of 13.27 million ounces of gold, including 4.22 million ounces of indicated and inferred resources from the Silicon deposit and 9.05 million ounces of inferred resources from the Merlin deposit 1 , underscoring the significant potential of the area. The recent discovery of the Silicon epithermal gold deposit near the Beatty district by AngloGold Ashanti highlights the significant prospects of the Walker Lane Trend, a region renowned for its substantial gold endowment, including 80 million ounces of historically produced gold and extensive estimated gold resources² (Figure 1). Paul Sun, President and CEO of the Company commented: \"We are pleased to announce the inclusion of the Celts project into our portfolio. This aligns with our strategic plan to develop a pipeline of exploration projects with analogous features to world-class deposits in Nevada. The Celts project presents a substantial opportunity, where we can leverage the extensive groundwork already completed, and advance this project both efficiently and cost-effectively. We remain disciplined with our Nevada-based technical team committed to maximizing shareholder value through strategic, large-potential exploration and delivering catalyst-rich opportunities in a thriving gold market. Our current drill program at Hot Springs Range is a significant step in this direction and will be ongoing depending on results. We are preparing final permits to drill Gilbert South and completing the final steps to advance Celts to a drill-ready, permitted stage in the first half of 2025.\" About the Celts Gold Project The Celts property was originally identified and staked by Orogen's technical team, the same group responsible for AngloGold Ashanti's recent Silicon discovery, which boasts 3.4 million ounces of indicated gold resources and 800,000 ounces of inferred gold resources¹. Following the success at Silicon, AngloGold discovered a more extensive deposit within Orogen's area of interest ( AOI ), known as Merlin, with an inferred resource of 9.05 million ounces of gold¹. Given the similar geology and regional setting, the Celts project represents a significant addition to Eminent's exploration portfolio. The Celts project, encompassing 67 unpatented claims over 560 hectares, is located in southeastern Nevada, approximately thirteen kilometers northeast of the historic town of Goldfields. The Goldfields district has an endowment of approximately 5.5 million ounces of gold⁴. Orogen has identified a substantial steam cap of approximately 800 square meters at Celts, featuring silica and advanced argillic alteration-characteristics it shares with Silicon. This alteration is situated within a rhyolite dome complex, which is of the same age as rhyolite samples from Silicon 5 and intrudes through a thick basalt unit covering much of the property. High-grade gold veins historically mined at the periphery of the property, with grab samples up to 33 g/t Au, highlight the potential target zones beneath the rhyolite dome and basalt, which Orogen considers a potential aquiclude (Figures 2 and 3). Similar to Silicon, the steam cap at Celts is devoid of gold and other trace elements, as the alteration occurred above the water table. The low-sulfidation gold deposits that often underlie these steam caps form in boiling zones below the water table and require drilling for confirmation. The evidence for such zones at Celts includes the peripheral veins mentioned earlier. Minimal drilling has occurred near these veins, and none beneath the steam cap and basalt outcroppings. To explore these promising targets, Eminent plans a comprehensive surface exploration program at Celts, leveraging geophysical and geochemical techniques proven effective at Silicon and similar deposits. Dan McCoy, Chief Geologist and Director commented: \"The Silicon discovery, initially identified by Orogen and later acquired by AngloGold Ashanti, has paved the way for Eminent to explore for multi-million-ounce deposits beneath gold-barren, steam-heated alteration caps. The Celts project although early stage is comparable, with its hyperspectral alteration data, matching age of the rhyolite dome, and the low sulfidation state of the historically mined peripheral veins, presents a compelling exploration target akin to Silicon. We are enthusiastic about commencing exploration activities, as this project aligns perfectly with our strategic objective of discovering multi-million-ounce gold deposits in Nevada's prolific mining region.\" All scientific and technical information in this news release has been prepared by, or approved by Michael Dufresne, PGeo. Mr. Dufresne is a qualified person for the purposes of National Instrument 43-101 - Standards of Disclosure for Mineral Projects. Transaction Highlights: Total Payment: US$400,000 At Closing: US$30,000 in cash US$45,000 in Eminent common shares Within Six Months of Closing: US$325,000 in cash or Eminent common shares (at Eminent's discretion, subject to regulatory approval) Property Claims: 3% net smelter return (NSR) royalty Option to repurchase 1% of the royalty for US$1.5 million (reducing the NSR to 2%) Proceeds Split: US$200,000 in cash and/or shares to each Orogen and a subsidiary of Altius Minerals Corporation (\"Altius\") 1.5% NSR royalty to each Orogen and Altius Finder's Fee: US$10,000 in cash to 3L Capital Inc. Approximately 1.78% of the purchase consideration Subject to TSX Venture Exchange acceptance Fig 1. Celts Location Map To view an enhanced version of this graphic, please visit: https://images.newsfilecorp.com/files/1937/233463_4fde0872740608ec_002full.jpg Fig 2. geology, alteration, and vein map with alteration minerals obtained by hyperspectral imaging To view an enhanced version of this graphic, please visit: https://images.newsfilecorp.com/files/1937/233463_4fde0872740608ec_003full.jpg Fig 3A. Google Earth image showing dome and steam cap at Celts, Fig. 3B Geology, Alteration and Property Map of the Celts property showing the section trace of Fig. 3C. Fig 3C. Schematic cross-section of the Celts property showing mineralization model below the rhyolite dome and basalt.  Except for the drillholes at the Gold Button shaft, there has been no drillhholes to test the model. To view an enhanced version of this graphic, please visit: https://images.newsfilecorp.com/files/1937/233463_4fde0872740608ec_004full.jpg Fig 4. Photo of advanced argillic alteration in the rhyolite dome at Celts. Photo looking towards the northeast. To view an enhanced version of this graphic, please visit: https://images.newsfilecorp.com/files/1937/233463_4fde0872740608ec_005full.jpg AngloGold Ashanti. (2024). Annual report 2023 . https://reports.anglogoldashanti.com/23/wp-content/uploads/2024/04/AGA-RR23.pdf Energyandgold.com. (2020, August 24). A junior mining management team that doesn’t know how to lose is back with the next incredible opportunity in Nevada gold exploration . Retrieved from Energy and Gold University of Nevada, Reno. (n.d.). Tonopah Silver District . Retrieved from https://gisweb.unr.edu/MiningDistricts/4. John, D. A., & Henry, C. D. (2020). Magmatic-tectonic settings of Cenozoic epithermal gold-silver deposits of the Great Basin, western United States. In Geological Society of Nevada 2020 Symposium Volume. John, D. A., & Henry, C. D. (2020). Magmatic-tectonic settings of Cenozoic epithermal gold-silver deposits of the Great Basin, western United States. In Geological Society of Nevada 2020 Symposium Volume. Nevada Bureau of Mines and Geology. (n.d.). Open source ArcGIS datasets: Age of the rhyolite dome in the Tonopah district . Retrieved from https://data-nbmg.opendata.arcgis.com ON BEHALF OF THE BOARD OF DIRECTORS Paul Sun CEO & Director For further information, please contact: Eminent Gold Corp. Phone: +1 604-505-7751 Email: michael@eminentgoldcorp.com Website: www.eminentgoldcorp.com Twitter: @eminent_gold LinkedIn: www.linkedin.com/company/eminent-gold-corp/ About Eminent Gold Eminent Gold is a gold exploration company focused on creating shareholder value through the exploration and discovery of world-class gold deposits in Nevada. Its multidisciplinary team has had multiple successes in gold discoveries and brings expertise and new ideas to the Great Basin. The Company's exploration assets in the Great Basin include: Hot Springs Range Project, Gilbert South, and Celts. Neither TSX Venture Exchange nor its Regulation Services Provider (as that term is defined in the policies of the TSX Venture Exchange) accepts responsibility for the adequacy or accuracy of this release. This news release contains certain statements that may be deemed \"forward-looking statements\" with respect to the Company within the meaning of applicable securities laws. Forward-looking statements are statements that are not historical facts and are generally, but not always, identified by the words \"expects\", \"plans\", \"anticipates\", \"believes\", \"intends\", \"estimates\", \"projects\", \"potential\" and similar expressions, or that events or conditions \"will\", \"would\", \"may\", \"could\" or \"should\" occur.  Forward-looking statements made in this news release include the anticipated completion of the private placement and the use of proceeds from the private placement.  Although Eminent Gold Corp. believes the expectations expressed in such forward-looking statements are based on reasonable assumptions, including the assumption that records and reports of historical work are accurate and correct, such statements are not guarantees of future performance, are subject to risks and uncertainties, and actual results or realities may differ materially from those in the forward-looking statements. Such material risks and uncertainties include, but are not limited to, the Company's ability to raise sufficient capital to fund its obligations under its property agreements going forward, to maintain its mineral tenures and concessions in good standing, to explore and develop the Company's projects or its other projects, to repay its debt and for general working capital purposes; changes in economic conditions or financial markets; the inherent hazards associates with mineral exploration and mining operations, future prices of gold, silver and other metals, changes in general economic conditions, accuracy of mineral resource and reserve estimates, the ability of the Company to obtain the necessary permits and consents required to explore, drill and develop the Company's projects and if obtained, to obtain such permits and consents in a timely fashion relative to the Company's plans and business objectives for the projects; the general ability of the Company to monetize its mineral resources; and changes in environmental and other laws or regulations that could have an impact on the Company's operations, compliance with environmental laws and regulations, aboriginal title claims and rights to consultation and accommodation, dependence on key management personnel and general competition in the mining industry. Forward-looking statements are based on the reasonable beliefs, estimates and opinions of the Company's management on the date the statements are made. Except as required by law, the Company undertakes no obligation to update these forward-looking statements in the event that management's beliefs, estimates or opinions, or other factors, should change. To view the source version of this press release, please visit https://www.newsfilecorp.com/release/233463",
    "primary_commodity": "Au"
  },
  "articleProject": {
    "gid": 9250,
    "project_name": "Celts",
    "location": "Nevada, United States"
  },
  "articleExchange": "TSXV",
  "articleCompanyId": 136,
  "articleTicker": "EMNT",
  "articleCompanyName": "Eminent Gold Corp.",
  "allOtherCompanyProjects": [
    {
      "company_id": 136,
      "gid": 988,
      "project_name": "Gilbert South",
      "location": "Nevada, USA"
    },
    {
      "company_id": 136,
      "gid": 6615,
      "project_name": "Hot Springs Range",
      "location": "Nevada, United States"
    }
  ],
  "allOtherCompanyNews": [
    {
      "id": 103829,
      "company_id": 136,
      "title": "Eminent Provides Drilling Update at Hot Springs Range Project",
      "link": null,
      "date": "2025-05-07T11:30:00.000Z",
      "hidden": false
    },
    {
      "id": 103457,
      "company_id": 136,
      "title": "Eminent Closes Private Placement Including $3 Million Strategic Investment by Kinross Gold Corp.",
      "link": null,
      "date": "2025-05-05T11:30:00.000Z",
      "hidden": false
    },
    {
      "id": 99504,
      "company_id": 136,
      "title": "Eminent Acquires 100% Ownership of Getchell Trend Analogue, Hot Springs Range Project",
      "link": null,
      "date": "2025-04-11T20:05:00.000Z",
      "hidden": false
    },
    {
      "id": 98861,
      "company_id": 136,
      "title": "Eminent To Raise $5 Million Led by Strategic Investor, Kinross Gold Corp.",
      "link": null,
      "date": "2025-04-07T11:30:00.000Z",
      "hidden": false
    },
    {
      "id": 90771,
      "company_id": 136,
      "title": "Eminent Confirms Structure Under Celts Steam Cap Analogous to Silicon",
      "link": null,
      "date": "2025-03-12T11:30:00.000Z",
      "hidden": false
    },
    {
      "id": 89850,
      "company_id": 136,
      "title": "Eminent Begins IP Program at Celts Project in Nevada",
      "link": "https://www.newsfilecorp.com/release/242990/Eminent-Begins-IP-Program-at-Celts-Project-in-Nevada",
      "date": "2025-03-03T12:30:00.000Z",
      "hidden": false
    },
    {
      "id": 87599,
      "company_id": 136,
      "title": "Eminent Closes Acquisition of Celts Project in Nevada",
      "link": "https://www.globenewswire.com/news-release/2025/02/12/3024941/0/en/Eminent-Closes-Acquisition-of-Celts-Project-in-Nevada.html",
      "date": "2025-02-12T12:30:00.000Z",
      "hidden": false
    },
    {
      "id": 86908,
      "company_id": 136,
      "title": "Eminent's Remaining Assays from First Completed Drill Hole Hits up to 8 g/t Gold in Getchell Trend Analogue",
      "link": "https://www.newsfilecorp.com/release/239648/Eminents-Remaining-Assays-from-First-Completed-Drill-Hole-Hits-up-to-8-gt-Gold-in-Getchell-Trend-Analogue",
      "date": "2025-02-05T12:30:00.000Z",
      "hidden": false
    },
    {
      "id": 84275,
      "company_id": 136,
      "title": "Eminent's First Drill Hole Hits Significant Gold-Arsenic in Getchell Trend Analogue and Commences Second Hole at Hot Springs Range Project",
      "link": "https://www.newsfilecorp.com/release/237380/Eminents-First-Drill-Hole-Hits-Significant-GoldArsenic-in-Getchell-Trend-Analogue-and-Commences-Second-Hole-at-Hot-Springs-Range-Project",
      "date": "2025-01-16T11:00:00.000Z",
      "hidden": false
    },
    {
      "id": 84194,
      "company_id": 136,
      "title": "Eminent Gold Corp. Invites Shareholders and Investment Community to Visit Us at Booth 118 at the VRIC in Vancouver, January 19-20, 2025",
      "link": "https://www.newsfilecorp.com/release/237323/Eminent-Gold-Corp.-Invites-Shareholders-and-Investment-Community-to-Visit-Us-at-Booth-118-at-the-VRIC-in-Vancouver-January-1920-2025",
      "date": "2025-01-15T16:56:00.000Z",
      "hidden": false
    }
  ]
}