{
  "article": {
    "id": 87599,
    "link": "https://www.globenewswire.com/news-release/2025/02/12/3024941/0/en/Eminent-Closes-Acquisition-of-Celts-Project-in-Nevada.html",
    "title": "Eminent Closes Acquisition of Celts Project in Nevada",
    "description": "<p align=\"justify\">VANCOUVER, British Columbia, Feb.  12, 2025  (GLOBE NEWSWIRE) -- Eminent Gold Corp. (TSXV: EMNT) (OTCQB: EMGDF) (the “<strong>Company</strong>\" or \"<strong>Eminent</strong>\") is pleased to announce that, pursuant to a purchase agreement (the “<strong>Purchase Agreement</strong>”) among the Company, Hot Springs Resources Corp., a wholly owned subsidiary of the Company (“<strong>Hot Springs</strong>”), Renaissance Exploration Inc., a wholly owned indirect subsidiary of Orogen Royalties Inc. (“<strong>Orogen</strong>”) and Altius Resources Inc. (“<strong>Altius</strong>” and, together with Orogen, the “<strong>Sellers</strong>”) previously announced on December 12, 2024, the Company has completed its acquisition of the Celts mineral property (the \"<strong>Celts Project</strong>\") in Nevada, USA, from the Sellers for an aggregate purchase price of US$400,000 (the “<strong>Acquisition</strong>”). Following completion of the Acquisition, the Company holds a 100% interest in the Celts Project indirectly through Hot Springs, subject to the NSR Royalty (as defined herein).</p>  <p align=\"justify\"><strong>Paul Sun, President and CEO of the Company commented:</strong></p>  <p align=\"justify\"><em>\"The acquisition of the Celts Project is a significant milestone for Eminent, due to its similarities to the recently discovered Silicon multimillion-ounce mining complex located approximately 100 km southeast. We are currently preparing a work program that includes a geophysical survey. Once complete, we will be ready to initiate a maiden drill program.</em></p>  <p align=\"justify\"><em>This timely acquisition supports our goal of building a large-scale gold exploration portfolio in Nevada, driven by new concepts and maiden drill programs, as gold prices reach record highs. Our current drilling at Hot Springs Range is advancing well, and we eagerly await the assay results from our second hole, which is crossing a key fault and has reached approximately 1,400 feet of an estimated 1,600-foot target.\"</em></p>  <p align=\"justify\">Pursuant to the Purchase Agreement, the Company: (i) paid the Sellers an aggregate of US$30,000 in cash; and (ii) issued to the Sellers 145,384 common shares in the capital of the Company (each, a “<strong>Common Share</strong>”) at a deemed price of CAD$0.452 per Common Share for an aggregate value of US$45,000. The Common Shares issued at closing are subject to a statutory hold period under applicable securities laws, expiring on June 12, 2025. Additionally, on or before the date that is six months following the closing of the Acquisition, the Company will either pay to the Sellers an aggregate of US$325,000 in cash or issue to the Sellers a number of Common Shares having an aggregate value of US$325,000, at a deemed price per Common Share equal to the volume weighted average price of the Common Shares on the TSX Venture Exchange (the “<strong>Exchange</strong>”) for the five trading days immediately prior to the issuance (the “<strong>Anniversary Consideration</strong>”). Any Common Shares issued in satisfaction of the Anniversary Consideration will be subject to a four month plus one day statutory hold period under applicable securities laws.</p>  <p align=\"justify\">Furthermore, in connection with the Purchase Agreement, the Company entered into royalty agreements with each of Orogen and an affiliate of Altius, in respect of the NSR Royalty (collectively, the “<strong>Royalty Agreements</strong>”). Pursuant to the Royalty Agreements, the Company granted to the respective counterparties an aggregate 3% net smelter returns royalty in respect of the Celts Project, including any future claims staked by the Company within one kilometre of the Celts Project (the “<strong>Area of Interest</strong>”), and an aggregate 1.5% net smelter returns royalty in respect of certain claims within the Area of Interest owned by a certain third-party arm’s length to the Company, if the Company ever acquires such claims (collectively, the “<strong>NSR Royalty</strong>”). Pursuant to the terms of each Royalty Agreement, the Company may reduce the NSR Royalty by one-sixth in exchange for a cash payment of US$750,000, thereby entitling the Company to reduce the NSR Royalty by an aggregate of one-third (i.e. from an aggregate of 3% of net smelter returns to an aggregate of 2% of net smelter returns) in exchange for an aggregate cash payment of US$1,500,000.</p>  <p align=\"justify\">The Company also paid a cash finder’s fee of C$10,000 to 3L Capital Inc. in connection with the Acquisition.</p>  <p align=\"justify\"><strong>Dan McCoy, Chief Geologist and Director commented:</strong></p>  <p align=\"justify\"><em>“We are very enthusiastic about advancing the Celts Project as it represents a rare opportunity to explore a remarkable analogue to the recent AngloGold Ashanti Silicon discovery. As we prepare to commence exploration activities later this year, we are excited about the significant potential this project holds.\"</em></p>  <p align=\"justify\"><strong>About the Celts Gold Project</strong></p>  <p align=\"justify\">The Celts property was originally identified and staked by Orogen’s technical team, the same group responsible for AngloGold Ashanti’s recent Silicon discovery, which boasts 3.4 million ounces of indicated gold (Au) resources and 800,000 ounces of inferred gold resources¹. Following the success at Silicon, AngloGold discovered a more extensive deposit within Orogen’s area of interest (<strong>AOI</strong>), known as Merlin, with an inferred resource of 9.02 million ounces of gold¹. Given the similar geology and regional setting, the Celts Project represents a significant addition to Eminent’s exploration portfolio.</p>  <p align=\"justify\">The Celts Project, encompassing 67 unpatented claims over 560 hectares, is located in southwestern Nevada, approximately thirteen kilometers northeast of the historic town of Goldfields. The Goldfields district has an endowment of approximately 5.5 million ounces of gold⁴.</p>  <p align=\"justify\">Orogen has identified a substantial steam cap of approximately 800 square meters at the Celts Project, featuring silica and advanced argillic alteration—characteristics it shares with Silicon. This alteration is situated within a rhyolite dome complex, which is of the same age as rhyolite samples from Silicon<sup>5</sup> and intrudes through a thick basalt unit covering much of the property. High-grade gold veins historically mined at the periphery of the property, with grab samples up to 33 grams per tonne (g/t) Au, highlight the potential target zones beneath the rhyolite dome and basalt, which Orogen considers a potential aquiclude (Figures 2 and 3).</p>  <p align=\"justify\">Similar to Silicon, the steam cap at the Celts Project is devoid of gold and other trace elements, as the alteration occurred above the water table. The low-sulfidation gold deposits that often underlie these steam caps form in boiling zones below the water table and require drilling for confirmation. The evidence for such zones at the Celts Project includes the peripheral veins mentioned earlier. Minimal drilling has occurred near these veins, and none beneath the steam cap and basalt outcroppings. To explore these promising targets, Eminent plans a comprehensive surface exploration program at the Celts Project, leveraging geophysical and geochemical techniques proven effective at Silicon and similar deposits.</p>  <p align=\"justify\">The area around the Celts Project claims has also seen staking activity from Barrick, one of the world’s largest gold producers.</p>  <p align=\"justify\">All scientific and technical information in this news release has been prepared by, or approved by Michael Dufresne, P.Geo. Mr. Dufresne is an independent qualified person for the purposes of National Instrument 43-101 - Standards of Disclosure for Mineral Projects.</p>  <p align=\"justify\"><img alt=\"Fig1. Celts Project Location Map\" data-mce-style=\"display: block; margin-left: auto; margin-right: auto;\" height=\"561.3px\" name=\"GNW_RichHtml_IMG\" src=\"https://ml.globenewswire.com/Resource/Download/1085c907-75ef-4eef-902e-3536cba4b361/image2.png\" style=\"display:block; margin-left:auto; margin-right:auto;\" width=\"589.93px\" />Fig1. Celts Project Location Map</p>  <p><img alt=\"Fig 2. Geology, alteration, and vein map with alteration minerals obtained by hyperspectral imaging\" data-mce-style=\"display: block; margin-left: auto; margin-right: auto;\" height=\"570.0px\" name=\"GNW_RichHtml_IMG\" src=\"https://ml.globenewswire.com/Resource/Download/ae1a0dd2-e9de-448c-9db9-dcaf416186e8/image3.png\" style=\"display:block; margin-left:auto; margin-right:auto;\" width=\"624.0px\" /><br />Fig 2. Geology, alteration, and vein map with alteration minerals obtained by hyperspectral imaging</p>  <p><img alt=\"Figure 3\" data-mce-style=\"display: block; margin-left: auto; margin-right: auto;\" height=\"357.0px\" name=\"GNW_RichHtml_IMG\" src=\"https://ml.globenewswire.com/Resource/Download/52de419d-1e05-4599-b39d-ad93b94519dc/image4.png\" style=\"display:block; margin-left:auto; margin-right:auto;\" width=\"624.0px\" />Fig 3A. Google Earth image showing dome and steam cap at Celts, Fig. 3B Geology, Alteration and Property Map of the Celts property showing the section trace of Fig. 3C. Fig 3C. Schematic cross-section of the Celts property showing mineralization model below the rhyolite dome and basalt. Except for the drillholes at the Gold Button shaft, there has been no drillhholes to test the model.</p>  <p><img alt=\"Fig 4. Photo of advanced argillic alteration in the rhyolite dome at Celts. Photo looking towards the northeast.\" data-mce-style=\"display: block; margin-left: auto; margin-right: auto;\" height=\"462.0px\" name=\"GNW_RichHtml_IMG\" src=\"https://ml.globenewswire.com/Resource/Download/a8c454ea-50f0-4be5-bb7a-25dd18f0ceb1/image5.png\" style=\"display:block; margin-left:auto; margin-right:auto;\" width=\"624.0px\" />Fig 4. Photo of advanced argillic alteration in the rhyolite dome at Celts. Photo looking towards the northeast.</p>  <ol><li>AngloGold Ashanti. (2024). <em>Annual report 2023</em>.<br /><a href=\"https://www.globenewswire.com/Tracker?data=Qa6bRTOTZQg8YFvJdMlZzXVf8Ug-WUO1upOebNpd2w4kdYiMPVIXeS1QcLUlSXqqL650OKp9zo-Sx8JiHhMfpyRQxCOZUghQDyOMW9CavFtxaZUjccOicMCgYAyKiHqHq0bqifdgCGX0KukWGCTB_WOyUJqz2YCwQCOjyDLzrWrS3740ZkIRnD3zt8Z5_ZcqYAmHoZhFvQgreYWbH_S3enGk6cc1bhEIwiDGVzvxnTJcAKvS5v1FGk7BIciUPqR6\" rel=\"nofollow\" target=\"_blank\" title=\"\">https://reports.anglogoldashanti.com/23/wp-content/uploads/2024/04/AGA-RR23.pdf<br /><br /></a></li><li>Energyandgold.com. (2020, August 24). <em>A junior mining management team that doesn’t </em><em>know how to lose is back with the next incredible opportunity in Nevada gold exploration</em>. Retrieved from Energy and Gold<br /><br /></li><li>University of Nevada, Reno. (n.d.). <em>Tonopah Silver District</em>. Retrieved from https://gisweb.unr.edu/MiningDistricts/4. John, D. A., &amp; Henry, C. D. (2020). Magmatic-tectonic settings of Cenozoic epithermal gold-silver deposits of the Great Basin, western United States. In Geological Society of Nevada 2020 Symposium Volume.<br /><br /></li><li>John, D. A., &amp; Henry, C. D. (2020). Magmatic-tectonic settings of Cenozoic epithermal gold-silver deposits of the Great Basin, western United States. In Geological Society of Nevada 2020 Symposium Volume.<br /><br /></li><li>Nevada Bureau of Mines and Geology. (n.d.). <em>Open source ArcGIS datasets: Age of the rhyolite dome </em><em>in the Tonopah district</em>. Retrieved from https://data-nbmg.opendata.arcgis.com</li></ol>  <p>ON BEHALF OF THE BOARD OF DIRECTORS</p>  <p align=\"justify\"><strong>Paul Sun</strong><br />CEO &amp; Director</p>  <p>For further information, please contact:</p>  <p><strong>Eminent Gold Corp.</strong></p>  <p>Phone: +1 604-505-7751</p>  <p>Email: <a href=\"https://www.globenewswire.com/Tracker?data=UwbOrCzYocGdpW4Wkl0RKgnwQaHTNjEW2giYIMUS5xoU567715f7a4-fjpwah7uyjdqNkGfwsxXEnUIu69j5G_ra6n3pTlYYldQ2JLHlbieFk-vA_DumckLfJ0uZqdkJ\" rel=\"nofollow\" target=\"_blank\" title=\"michael@eminentgoldcorp.com\">michael@eminentgoldcorp.com</a></p>  <p>Website: <a href=\"https://www.globenewswire.com/Tracker?data=olwwSQBPZz9nxSFgKKPZImLvT4f1moYZj0eaTSptA5oF4K8RX9WRVFYodfwtXEYdl20RXw05B-4MB3nyaQgVQTgoVfJ5sVwXYp5GzfyrURc=\" rel=\"nofollow\" target=\"_blank\" title=\"www.eminentgoldcorp.com\">www.eminentgoldcorp.com</a></p>  <p>Twitter: <a href=\"https://www.globenewswire.com/Tracker?data=1wC3zODZ8Q8doT9_wUg6JKlvF24DqicezuS4bz1xd8q7wrsszLhI6sQAtaxEUjgdXbVrru4dc7SRlgiiNAeY7Q==\" rel=\"nofollow\" target=\"_blank\" title=\"@eminent_gold\">@eminent_gold</a></p>  <p>LinkedIn: <a href=\"https://www.globenewswire.com/Tracker?data=esdipzKTK7uygxcyrPe2W_CvCJoW1Y-v7uDr0EIJbUNqmDRMiilZdf1GIW-OgE1bQp6KQPVcCJBZqR9aJwwPrjZ73jRGiHMPuQDgw6f79Fub9sVLp4_NYupAGF5D71DNNtH78QP7QAO_rBWEWVG4esQUThuYXBYtJEdiX1FjLJc=\" rel=\"nofollow\" target=\"_blank\" title=\"www.linkedin.com/company/eminent-gold-corp/\">www.linkedin.com/company/eminent-gold-corp/</a></p>  <p><strong>About Eminent Gold</strong></p>  <p align=\"justify\">Eminent Gold is a gold exploration company focused on creating shareholder value through the exploration and discovery of world-class gold deposits in Nevada. Its multidisciplinary team has had multiple successes in gold discoveries and brings expertise and new ideas to the Great Basin. The Company’s exploration assets in the Great Basin include: Hot Springs Range Project, Gilbert South, and Celts.</p>  <p align=\"justify\"><em>Neither TSX Venture Exchange nor its Regulation Services Provider (as that term is defined in the policies of the TSX Venture Exchange) accepts responsibility for the adequacy or accuracy of this release. </em></p>  <p align=\"justify\"><em>This news release contains certain statements that may be deemed “forward-looking statements” with respect to the Company within the meaning of applicable securities laws. Forward-looking statements are statements that are not historical facts and are generally, but not always, identified by the words “expects”, “plans”, “anticipates”, “believes”, “intends”, “estimates”, “projects”, “potential” and similar expressions, or that events or conditions “will”, “would”, “may”, “could” or “should” occur. Forward-looking statements made in this news release include the anticipated completion of the private placement and the use of proceeds from the private placement. Although Eminent Gold Corp. believes the expectations expressed in such forward-looking statements are based on reasonable assumptions, including the assumption that records and reports of historical work are accurate and correct, such statements are not guarantees of future performance, are subject to risks and uncertainties, and actual results or realities may differ materially from those in the forward-looking statements. Such material risks and uncertainties include, but are not limited to, the Company’s ability to raise sufficient capital to fund its obligations under its property agreements going forward, to maintain its mineral tenures and concessions in good standing, to explore and develop the Company’s projects or its other projects, to repay its debt and for general working capital purposes; changes in economic conditions or financial markets; the inherent hazards associates with mineral exploration and mining operations, future prices of gold, silver and other metals, changes in general economic conditions, accuracy of mineral resource and reserve estimates, the ability of the Company to obtain the necessary permits and consents required to explore, drill and develop the Company’s projects and if obtained, to obtain such permits and consents in a timely fashion relative to the Company’s plans and business objectives for the projects; the general ability of the Company to monetize its mineral resources; and changes in environmental and other laws or regulations that could have an impact on the Company’s operations, compliance with environmental laws and regulations, aboriginal title claims and rights to consultation and accommodation, dependence on key management personnel and general competition in the mining industry. Forward-looking statements are based on the reasonable beliefs, estimates and opinions of the Company’s management on the date the statements are made. Except as required by law, the Company undertakes no obligation to update these forward-looking statements in the event that management’s beliefs, estimates or opinions, or other factors, should change.</em></p>  <p>Photos accompanying this announcement are available at:<br /><img src=\"https://ml.globenewswire.com/Resource/Download/1085c907-75ef-4eef-902e-3536cba4b361?size=original\" alt=\"\"/><a href=\"https://www.globenewswire.com/Tracker?data=AvDqE1mNOrjayOo_KLWsAmDj833vi19xt99_t-12s2UE5mwnrreFnLTJDdnRJxSJbjd_Rbvu843kiTIbJAYPcYjOQEJMNAgJqU7Ul6n2T4RHG2hp66Y-c9FEhbHVt9irx93yphNa97s59Uz5SDpdggFejHFFbueyj_gZ1uNCt1I=\" rel=\"nofollow\" target=\"_blank\" title=\"\"><br /></a><img src=\"https://ml.globenewswire.com/Resource/Download/ae1a0dd2-e9de-448c-9db9-dcaf416186e8?size=original\" alt=\"\"/><a href=\"https://www.globenewswire.com/Tracker?data=aoGFjfpLpN1lLK9wo5WPPZx8tG6vHcVDbmMRL_oIf3h9hK8umLie2oYgTiYbMRLCq6gNVK9-PAJ5qKeupIiHgxZxHf9JB6XZGLHy7kd8cOJB2JaPMR1y8EHlIjIKGmf-ntAnNC4gTntdDP17U3ZQZKhPOAM1Pe2k5P4rJu1mcZc=\" rel=\"nofollow\" target=\"_blank\" title=\"\"><br /></a><img src=\"https://ml.globenewswire.com/Resource/Download/52de419d-1e05-4599-b39d-ad93b94519dc?size=original\" alt=\"\"/><a href=\"https://www.globenewswire.com/Tracker?data=xyKIvD7FiJ1PTrb_0esgNXqqPYHvtseP7q99v7yKjX2_m9av-oYBqNn7FqH7a6TdoJ4bGX9Jlxf6PK6YWT-p5UevhgRat5ChfL34S6hiM1Qukvyc-0UNdvpdZhyg4PjDhJsAwarnyorRsT_PeJckF4MRX3NRauxcr_wRnZqshyg=\" rel=\"nofollow\" target=\"_blank\" title=\"\"><br /></a><img src=\"https://ml.globenewswire.com/Resource/Download/a8c454ea-50f0-4be5-bb7a-25dd18f0ceb1?size=original\" alt=\"\"/></p>  <br /><img alt=\"\" src='https://ml.globenewswire.com/media/ODk0NWY0NWEtYjFjNi00M2M2LTkxM2YtMjFlODc5ZTk0YzAyLTEyNjYyMTc=/tiny/Eminent-Gold-Corp.png' referrerpolicy='no-referrer-when-downgrade' />",
    "search_terms": "Celt,Eminent Gold Corp.,EMNT",
    "master_gid": 9250,
    "date": "2025-02-12T12:30:00.000Z",
    "tags": "|||Gold|Project Acquisition",
    "image_id": null,
    "hidden": false,
    "company_id": 136,
    "provider": "globenewswire",
    "excerpt": "VANCOUVER, British Columbia, Feb. 12, 2025 (GLOBE NEWSWIRE) -- Eminent Gold Corp. (TSXV: EMNT) (OTCQB: EMGDF) (the “Company\" or \"Eminent\") is pleased to announce that, pursuant to a purchase agreement (the “Purchase Agreement”) among the Company, Hot Springs Resources Corp., a wholly owned subsidiary of the Company (“Hot Springs”), Renaissance",
    "is_regulatory": false,
    "refined_tags": null,
    "ftp_filename": null,
    "company_name": "Orogen Royalties Inc.",
    "exchange": "TSXV",
    "root_ticker": "EMNT",
    "project_name": "Celts",
    "gid": 9250,
    "location": "Nevada, United States",
    "plan_id": null,
    "description_text": "VANCOUVER, British Columbia, Feb.  12, 2025  (GLOBE NEWSWIRE) -- Eminent Gold Corp. (TSXV: EMNT) (OTCQB: EMGDF) (the “ Company \" or \" Eminent \") is pleased to announce that, pursuant to a purchase agreement (the “ Purchase Agreement ”) among the Company, Hot Springs Resources Corp., a wholly owned subsidiary of the Company (“ Hot Springs ”), Renaissance Exploration Inc., a wholly owned indirect subsidiary of Orogen Royalties Inc. (“ Orogen ”) and Altius Resources Inc. (“ Altius ” and, together with Orogen, the “ Sellers ”) previously announced on December 12, 2024, the Company has completed its acquisition of the Celts mineral property (the \" Celts Project \") in Nevada, USA, from the Sellers for an aggregate purchase price of US$400,000 (the “ Acquisition ”). Following completion of the Acquisition, the Company holds a 100% interest in the Celts Project indirectly through Hot Springs, subject to the NSR Royalty (as defined herein). Paul Sun, President and CEO of the Company commented: \"The acquisition of the Celts Project is a significant milestone for Eminent, due to its similarities to the recently discovered Silicon multimillion-ounce mining complex located approximately 100 km southeast. We are currently preparing a work program that includes a geophysical survey. Once complete, we will be ready to initiate a maiden drill program. This timely acquisition supports our goal of building a large-scale gold exploration portfolio in Nevada, driven by new concepts and maiden drill programs, as gold prices reach record highs. Our current drilling at Hot Springs Range is advancing well, and we eagerly await the assay results from our second hole, which is crossing a key fault and has reached approximately 1,400 feet of an estimated 1,600-foot target.\" Pursuant to the Purchase Agreement, the Company: (i) paid the Sellers an aggregate of US$30,000 in cash; and (ii) issued to the Sellers 145,384 common shares in the capital of the Company (each, a “ Common Share ”) at a deemed price of CAD$0.452 per Common Share for an aggregate value of US$45,000. The Common Shares issued at closing are subject to a statutory hold period under applicable securities laws, expiring on June 12, 2025. Additionally, on or before the date that is six months following the closing of the Acquisition, the Company will either pay to the Sellers an aggregate of US$325,000 in cash or issue to the Sellers a number of Common Shares having an aggregate value of US$325,000, at a deemed price per Common Share equal to the volume weighted average price of the Common Shares on the TSX Venture Exchange (the “ Exchange ”) for the five trading days immediately prior to the issuance (the “ Anniversary Consideration ”). Any Common Shares issued in satisfaction of the Anniversary Consideration will be subject to a four month plus one day statutory hold period under applicable securities laws. Furthermore, in connection with the Purchase Agreement, the Company entered into royalty agreements with each of Orogen and an affiliate of Altius, in respect of the NSR Royalty (collectively, the “ Royalty Agreements ”). Pursuant to the Royalty Agreements, the Company granted to the respective counterparties an aggregate 3% net smelter returns royalty in respect of the Celts Project, including any future claims staked by the Company within one kilometre of the Celts Project (the “ Area of Interest ”), and an aggregate 1.5% net smelter returns royalty in respect of certain claims within the Area of Interest owned by a certain third-party arm’s length to the Company, if the Company ever acquires such claims (collectively, the “ NSR Royalty ”). Pursuant to the terms of each Royalty Agreement, the Company may reduce the NSR Royalty by one-sixth in exchange for a cash payment of US$750,000, thereby entitling the Company to reduce the NSR Royalty by an aggregate of one-third (i.e. from an aggregate of 3% of net smelter returns to an aggregate of 2% of net smelter returns) in exchange for an aggregate cash payment of US$1,500,000. The Company also paid a cash finder’s fee of C$10,000 to 3L Capital Inc. in connection with the Acquisition. Dan McCoy, Chief Geologist and Director commented: “We are very enthusiastic about advancing the Celts Project as it represents a rare opportunity to explore a remarkable analogue to the recent AngloGold Ashanti Silicon discovery. As we prepare to commence exploration activities later this year, we are excited about the significant potential this project holds.\" About the Celts Gold Project The Celts property was originally identified and staked by Orogen’s technical team, the same group responsible for AngloGold Ashanti’s recent Silicon discovery, which boasts 3.4 million ounces of indicated gold (Au) resources and 800,000 ounces of inferred gold resources¹. Following the success at Silicon, AngloGold discovered a more extensive deposit within Orogen’s area of interest ( AOI ), known as Merlin, with an inferred resource of 9.02 million ounces of gold¹. Given the similar geology and regional setting, the Celts Project represents a significant addition to Eminent’s exploration portfolio. The Celts Project, encompassing 67 unpatented claims over 560 hectares, is located in southwestern Nevada, approximately thirteen kilometers northeast of the historic town of Goldfields. The Goldfields district has an endowment of approximately 5.5 million ounces of gold⁴. Orogen has identified a substantial steam cap of approximately 800 square meters at the Celts Project, featuring silica and advanced argillic alteration—characteristics it shares with Silicon. This alteration is situated within a rhyolite dome complex, which is of the same age as rhyolite samples from Silicon 5 and intrudes through a thick basalt unit covering much of the property. High-grade gold veins historically mined at the periphery of the property, with grab samples up to 33 grams per tonne (g/t) Au, highlight the potential target zones beneath the rhyolite dome and basalt, which Orogen considers a potential aquiclude (Figures 2 and 3). Similar to Silicon, the steam cap at the Celts Project is devoid of gold and other trace elements, as the alteration occurred above the water table. The low-sulfidation gold deposits that often underlie these steam caps form in boiling zones below the water table and require drilling for confirmation. The evidence for such zones at the Celts Project includes the peripheral veins mentioned earlier. Minimal drilling has occurred near these veins, and none beneath the steam cap and basalt outcroppings. To explore these promising targets, Eminent plans a comprehensive surface exploration program at the Celts Project, leveraging geophysical and geochemical techniques proven effective at Silicon and similar deposits. The area around the Celts Project claims has also seen staking activity from Barrick, one of the world’s largest gold producers. All scientific and technical information in this news release has been prepared by, or approved by Michael Dufresne, P.Geo. Mr. Dufresne is an independent qualified person for the purposes of National Instrument 43-101 - Standards of Disclosure for Mineral Projects. Fig1. Celts Project Location Map Fig 2. Geology, alteration, and vein map with alteration minerals obtained by hyperspectral imaging Fig 3A. Google Earth image showing dome and steam cap at Celts, Fig. 3B Geology, Alteration and Property Map of the Celts property showing the section trace of Fig. 3C. Fig 3C. Schematic cross-section of the Celts property showing mineralization model below the rhyolite dome and basalt. Except for the drillholes at the Gold Button shaft, there has been no drillhholes to test the model. Fig 4. Photo of advanced argillic alteration in the rhyolite dome at Celts. Photo looking towards the northeast. AngloGold Ashanti. (2024). Annual report 2023 . https://reports.anglogoldashanti.com/23/wp-content/uploads/2024/04/AGA-RR23.pdf Energyandgold.com. (2020, August 24). A junior mining management team that doesn’t know how to lose is back with the next incredible opportunity in Nevada gold exploration . Retrieved from Energy and Gold University of Nevada, Reno. (n.d.). Tonopah Silver District . Retrieved from https://gisweb.unr.edu/MiningDistricts/4. John, D. A., & Henry, C. D. (2020). Magmatic-tectonic settings of Cenozoic epithermal gold-silver deposits of the Great Basin, western United States. In Geological Society of Nevada 2020 Symposium Volume. John, D. A., & Henry, C. D. (2020). Magmatic-tectonic settings of Cenozoic epithermal gold-silver deposits of the Great Basin, western United States. In Geological Society of Nevada 2020 Symposium Volume. Nevada Bureau of Mines and Geology. (n.d.). Open source ArcGIS datasets: Age of the rhyolite dome in the Tonopah district . Retrieved from https://data-nbmg.opendata.arcgis.com ON BEHALF OF THE BOARD OF DIRECTORS Paul Sun CEO & Director For further information, please contact: Eminent Gold Corp. Phone: +1 604-505-7751 Email: michael@eminentgoldcorp.com Website: www.eminentgoldcorp.com Twitter: @eminent_gold LinkedIn: www.linkedin.com/company/eminent-gold-corp/ About Eminent Gold Eminent Gold is a gold exploration company focused on creating shareholder value through the exploration and discovery of world-class gold deposits in Nevada. Its multidisciplinary team has had multiple successes in gold discoveries and brings expertise and new ideas to the Great Basin. The Company’s exploration assets in the Great Basin include: Hot Springs Range Project, Gilbert South, and Celts. Neither TSX Venture Exchange nor its Regulation Services Provider (as that term is defined in the policies of the TSX Venture Exchange) accepts responsibility for the adequacy or accuracy of this release. This news release contains certain statements that may be deemed “forward-looking statements” with respect to the Company within the meaning of applicable securities laws. Forward-looking statements are statements that are not historical facts and are generally, but not always, identified by the words “expects”, “plans”, “anticipates”, “believes”, “intends”, “estimates”, “projects”, “potential” and similar expressions, or that events or conditions “will”, “would”, “may”, “could” or “should” occur. Forward-looking statements made in this news release include the anticipated completion of the private placement and the use of proceeds from the private placement. Although Eminent Gold Corp. believes the expectations expressed in such forward-looking statements are based on reasonable assumptions, including the assumption that records and reports of historical work are accurate and correct, such statements are not guarantees of future performance, are subject to risks and uncertainties, and actual results or realities may differ materially from those in the forward-looking statements. Such material risks and uncertainties include, but are not limited to, the Company’s ability to raise sufficient capital to fund its obligations under its property agreements going forward, to maintain its mineral tenures and concessions in good standing, to explore and develop the Company’s projects or its other projects, to repay its debt and for general working capital purposes; changes in economic conditions or financial markets; the inherent hazards associates with mineral exploration and mining operations, future prices of gold, silver and other metals, changes in general economic conditions, accuracy of mineral resource and reserve estimates, the ability of the Company to obtain the necessary permits and consents required to explore, drill and develop the Company’s projects and if obtained, to obtain such permits and consents in a timely fashion relative to the Company’s plans and business objectives for the projects; the general ability of the Company to monetize its mineral resources; and changes in environmental and other laws or regulations that could have an impact on the Company’s operations, compliance with environmental laws and regulations, aboriginal title claims and rights to consultation and accommodation, dependence on key management personnel and general competition in the mining industry. Forward-looking statements are based on the reasonable beliefs, estimates and opinions of the Company’s management on the date the statements are made. Except as required by law, the Company undertakes no obligation to update these forward-looking statements in the event that management’s beliefs, estimates or opinions, or other factors, should change. Photos accompanying this announcement are available at:",
    "primary_commodity": "Au"
  },
  "articleProject": {
    "gid": 9250,
    "project_name": "Celts",
    "location": "Nevada, United States"
  },
  "articleExchange": "TSXV",
  "articleCompanyId": 136,
  "articleTicker": "EMNT",
  "articleCompanyName": "Eminent Gold Corp.",
  "allOtherCompanyProjects": [
    {
      "company_id": 136,
      "gid": 988,
      "project_name": "Gilbert South",
      "location": "Nevada, USA"
    },
    {
      "company_id": 136,
      "gid": 6615,
      "project_name": "Hot Springs Range",
      "location": "Nevada, United States"
    }
  ],
  "allOtherCompanyNews": [
    {
      "id": 103829,
      "company_id": 136,
      "title": "Eminent Provides Drilling Update at Hot Springs Range Project",
      "link": null,
      "date": "2025-05-07T11:30:00.000Z",
      "hidden": false
    },
    {
      "id": 103457,
      "company_id": 136,
      "title": "Eminent Closes Private Placement Including $3 Million Strategic Investment by Kinross Gold Corp.",
      "link": null,
      "date": "2025-05-05T11:30:00.000Z",
      "hidden": false
    },
    {
      "id": 99504,
      "company_id": 136,
      "title": "Eminent Acquires 100% Ownership of Getchell Trend Analogue, Hot Springs Range Project",
      "link": null,
      "date": "2025-04-11T20:05:00.000Z",
      "hidden": false
    },
    {
      "id": 98861,
      "company_id": 136,
      "title": "Eminent To Raise $5 Million Led by Strategic Investor, Kinross Gold Corp.",
      "link": null,
      "date": "2025-04-07T11:30:00.000Z",
      "hidden": false
    },
    {
      "id": 90771,
      "company_id": 136,
      "title": "Eminent Confirms Structure Under Celts Steam Cap Analogous to Silicon",
      "link": null,
      "date": "2025-03-12T11:30:00.000Z",
      "hidden": false
    },
    {
      "id": 89850,
      "company_id": 136,
      "title": "Eminent Begins IP Program at Celts Project in Nevada",
      "link": "https://www.newsfilecorp.com/release/242990/Eminent-Begins-IP-Program-at-Celts-Project-in-Nevada",
      "date": "2025-03-03T12:30:00.000Z",
      "hidden": false
    },
    {
      "id": 87599,
      "company_id": 136,
      "title": "Eminent Closes Acquisition of Celts Project in Nevada",
      "link": "https://www.globenewswire.com/news-release/2025/02/12/3024941/0/en/Eminent-Closes-Acquisition-of-Celts-Project-in-Nevada.html",
      "date": "2025-02-12T12:30:00.000Z",
      "hidden": false
    },
    {
      "id": 86908,
      "company_id": 136,
      "title": "Eminent's Remaining Assays from First Completed Drill Hole Hits up to 8 g/t Gold in Getchell Trend Analogue",
      "link": "https://www.newsfilecorp.com/release/239648/Eminents-Remaining-Assays-from-First-Completed-Drill-Hole-Hits-up-to-8-gt-Gold-in-Getchell-Trend-Analogue",
      "date": "2025-02-05T12:30:00.000Z",
      "hidden": false
    },
    {
      "id": 84275,
      "company_id": 136,
      "title": "Eminent's First Drill Hole Hits Significant Gold-Arsenic in Getchell Trend Analogue and Commences Second Hole at Hot Springs Range Project",
      "link": "https://www.newsfilecorp.com/release/237380/Eminents-First-Drill-Hole-Hits-Significant-GoldArsenic-in-Getchell-Trend-Analogue-and-Commences-Second-Hole-at-Hot-Springs-Range-Project",
      "date": "2025-01-16T11:00:00.000Z",
      "hidden": false
    },
    {
      "id": 84194,
      "company_id": 136,
      "title": "Eminent Gold Corp. Invites Shareholders and Investment Community to Visit Us at Booth 118 at the VRIC in Vancouver, January 19-20, 2025",
      "link": "https://www.newsfilecorp.com/release/237323/Eminent-Gold-Corp.-Invites-Shareholders-and-Investment-Community-to-Visit-Us-at-Booth-118-at-the-VRIC-in-Vancouver-January-1920-2025",
      "date": "2025-01-15T16:56:00.000Z",
      "hidden": false
    }
  ]
}