{
  "article": {
    "id": 51637,
    "link": "https://www.newsfilecorp.com/release/204646/Canter-Resources-Expands-the-Columbus-Project-to-Approximately-30000-Acres-to-Cover-West-Trending-Lithium-Brine-Target",
    "title": "Canter Resources Expands the Columbus Project to Approximately 30,000 Acres to Cover West Trending Lithium Brine Target",
    "description": "<img src=\"https://api.newsfilecorp.com/newsinfo/204646/367\" id=\"367\" width=\"2\" height=\"2\" style=\"width: 1px;  height: 1px;border: 0px solid;\" /><p>Vancouver, British Columbia--(Newsfile Corp. - April 7, 2024) - <b>Canter Resources Corp. (CSE: CRC) (OTC Pink: CNRCF) (FSE: 6O1)</b> (\"<b>Canter</b>\" or the \"<b>Company</b>\") is pleased to report that, after interpreting recently acquired third party data and completing 3D modeling, the Company's technical team immediately mobilized to site to stake the limited open ground along the western edge of the Columbus Lithium-Boron Project (\"<b>Columbus</b>\" or the \"<b>Project</b>\"). The full surface sampling dataset, shown in Figure 1, includes highly anomalous lithium (\"Li\") values along the Company's previous western boundary and beyond. Furthermore, the Company's 3D modeling, and particularly the HSAMT resistivity shells, highlighted a broadening and open-ended conductive zone trending west with only two (2) kilometres to the limits of the Company's previous property boundary (see press release dated March 30, 2024). The land package now stands at a commanding 29,600 acres (119 km&#178;). </p><p>\"We are thrilled to have significantly expanded our land package at Columbus to encompass the full extent of the most prospective ground for lithium-enriched brines before commencing our drill campaigns,\" stated Joness Lang, CEO of Canter Resources. \"Our team sees tremendous potential at Columbus and we are excited to get underway with Geoprobe drilling, which will commence imminently.\"</p><p><b>Watch:</b> Video animation highlighting Columbus surface and 3D model results, newly staked ground and substantial Li-brine target with initial drill locations. <a href=\"https://api.newsfilecorp.com/redirect/eL2MLS8Q4Q\"><b>Watch Video Here &#62;</b></a>  </p><p>The 3D modeling has been instrumental in revealing the expansive potential within the Columbus Project area. By carefully analyzing the geological structures and resistivity patterns, the Company has identified a westward-trending conductive zone that signifies a broadening corridor of potential lithium-bearing brines. This insight is critical, as it suggests a continuous zone extending beyond the original property boundaries (see Figure 1).</p><p>Moreover, the HSAMT data has been pivotal in understanding the subsurface characteristics of the Project area. The HSAMT survey's leading edge terminated within an area exhibiting extremely low resistivity, indicative of highly conductive material likely associated with brine concentrations. This cutoff, due to the survey reaching its westernmost extent, aligned with the trend of anomalous lithium values in surface sediments extending westward. This discovery underpins the decision to expand the land package, thereby increasing the scope for further exploration and potential resource identification.</p><p style=\"text-align: center;\"><a rel=\"nofollow\" href=\"https://images.newsfilecorp.com/files/10112/204646_3118d57ac445eb1f_001full.jpg\"><img src=\"https://images.newsfilecorp.com/files/10112/204646_3118d57ac445eb1f_001.jpg\" style=\"border-width: 0px;\" alt=\"Cannot view this image? Visit: https://images.newsfilecorp.com/files/10112/204646_3118d57ac445eb1f_001.jpg\" /></a></p><p style=\"text-align: center;\"><b>Figure 1:</b> Figure showing expanded land package, differentiating between current claim boundary and newly staked ground, highlighting the &#60;0.5 ohm-metre HSAMT openness to the west and full third-party data including the western flank samples within previous boundary and extending beyond.</p><p style=\"text-align: center;\">To view an enhanced version of this graphic, please visit:<br /><a rel=\"nofollow\" href=\"https://images.newsfilecorp.com/files/10112/204646_3118d57ac445eb1f_001full.jpg\">https://images.newsfilecorp.com/files/10112/204646_3118d57ac445eb1f_001full.jpg</a></p><p>Canter Resources is now poised to implement a more comprehensive Phase II exploration program. This next phase will include expanded geophysical survey coverage, aiming to thoroughly map out the resistivity and structural profiles across the newly acquired acreage. </p><p style=\"text-align: center;\"><a rel=\"nofollow\" href=\"https://images.newsfilecorp.com/files/10112/204646_3118d57ac445eb1f_002full.jpg\"><img src=\"https://images.newsfilecorp.com/files/10112/204646_3118d57ac445eb1f_002.jpg\" style=\"border-width: 0px;\" alt=\"Cannot view this image? Visit: https://images.newsfilecorp.com/files/10112/204646_3118d57ac445eb1f_002.jpg\" /></a></p><p style=\"text-align: center;\"><b>Photo 1:</b> Canter's Senior Geologist, Trevor Hawkins, staking a Geoprobe collar location during the recent western expansion claim staking trip at the Company's Columbus Lithium-Boron Project.</p><p style=\"text-align: center;\">To view an enhanced version of this graphic, please visit:<br /><a rel=\"nofollow\" href=\"https://images.newsfilecorp.com/files/10112/204646_3118d57ac445eb1f_002full.jpg\">https://images.newsfilecorp.com/files/10112/204646_3118d57ac445eb1f_002full.jpg</a></p><p>Qualified Person (QP)</p><p>The technical information contained in this news release was reviewed and approved by Eric Saderholm P.Geo, Director and Technical Advisor of Canter Resources, a Qualified Person (QP), as defined under National Instrument 43- 101 - Standards of Disclosure for Mineral Projects.</p><p>About Canter Resources Corp.</p><p>Canter Resources Corp. is a Canadian junior mineral exploration company advancing the Columbus Lithium-Boron Project in Nevada, USA and the Beaver Creek Lithium Property in Montana, USA. The Company is preparing for a Phase I drill campaign at Columbus to test a highly prospective lithium-brine target and plans to leverage the Company's critical metals targeting database to generate a portfolio of high-quality projects with the aim of defining mineral resources that support the domestic clean energy supply chain in North America.</p><p>For further information contact:</p><p>Joness Lang<br />Chief Executive Officer <br />Canter Resources Corp. <br /><a href=\"mailto:jlang@canterresources.com\">jlang@canterresources.com</a></p><p>For investor inquiries contact:</p><p>Kristina Pillon, High Tide Consulting Corp.<br />Tel: 604.908.1695<br /><a href=\"mailto:investors@canterresources.com\">investors@canterresources.com</a> </p><p><i>The Canadian Securities Exchange has neither approved nor disapproved the contents of this news release. The Canadian Securities Exchange does not accept responsibility for the adequacy or accuracy of this news release.</i></p><p id=\"corporateNewsLogoContainer\"><img src=\"https://images.newsfilecorp.com/files/10112/204646_3118d57ac445eb1f_logo.jpg\" id=\"corporateNewsLogo\" alt=\"Corporate Logo\" /></p><p id=\"corporateLinkBack\">To view the source version of this press release, please visit <a href=\"https://api.newsfilecorp.com/redirect/85rX5C4mP5\">https://www.newsfilecorp.com/release/204646</a></p>",
    "search_terms": "Columbus,Canter Resources Corp,CRC",
    "master_gid": 5794,
    "date": "2024-04-08T02:00:00.000Z",
    "tags": "|||Lithium|Project Acquisition",
    "image_id": null,
    "hidden": false,
    "company_id": 1933,
    "provider": null,
    "excerpt": "Vancouver, British Columbia--(Newsfile Corp. - April 7, 2024) -Canter Resources Corp. (CSE: CRC) (OTC Pink: CNRCF) (FSE: 6O1)(\"Canter\" or the \"Company\") is pleased to report that, after interpreting recently acquired third party data and completing 3D modeling, the Company's technical team immediately mobilized to site to stake the limited open",
    "is_regulatory": false,
    "refined_tags": [
      "Project Acquisition"
    ],
    "ftp_filename": null,
    "company_name": "Canter Resources Corp",
    "exchange": "CSE",
    "root_ticker": "CRC",
    "project_name": "Columbus",
    "gid": 5794,
    "location": "Nevada, United States",
    "plan_id": "companytier2",
    "description_text": "Vancouver, British Columbia--(Newsfile Corp. - April 7, 2024) - Canter Resources Corp. (CSE: CRC) (OTC Pink: CNRCF) (FSE: 6O1) (\" Canter \" or the \" Company \") is pleased to report that, after interpreting recently acquired third party data and completing 3D modeling, the Company's technical team immediately mobilized to site to stake the limited open ground along the western edge of the Columbus Lithium-Boron Project (\" Columbus \" or the \" Project \"). The full surface sampling dataset, shown in Figure 1, includes highly anomalous lithium (\"Li\") values along the Company's previous western boundary and beyond. Furthermore, the Company's 3D modeling, and particularly the HSAMT resistivity shells, highlighted a broadening and open-ended conductive zone trending west with only two (2) kilometres to the limits of the Company's previous property boundary (see press release dated March 30, 2024). The land package now stands at a commanding 29,600 acres (119 km²). \"We are thrilled to have significantly expanded our land package at Columbus to encompass the full extent of the most prospective ground for lithium-enriched brines before commencing our drill campaigns,\" stated Joness Lang, CEO of Canter Resources. \"Our team sees tremendous potential at Columbus and we are excited to get underway with Geoprobe drilling, which will commence imminently.\" Watch: Video animation highlighting Columbus surface and 3D model results, newly staked ground and substantial Li-brine target with initial drill locations. Watch Video Here > The 3D modeling has been instrumental in revealing the expansive potential within the Columbus Project area. By carefully analyzing the geological structures and resistivity patterns, the Company has identified a westward-trending conductive zone that signifies a broadening corridor of potential lithium-bearing brines. This insight is critical, as it suggests a continuous zone extending beyond the original property boundaries (see Figure 1). Moreover, the HSAMT data has been pivotal in understanding the subsurface characteristics of the Project area. The HSAMT survey's leading edge terminated within an area exhibiting extremely low resistivity, indicative of highly conductive material likely associated with brine concentrations. This cutoff, due to the survey reaching its westernmost extent, aligned with the trend of anomalous lithium values in surface sediments extending westward. This discovery underpins the decision to expand the land package, thereby increasing the scope for further exploration and potential resource identification. Figure 1: Figure showing expanded land package, differentiating between current claim boundary and newly staked ground, highlighting the <0.5 ohm-metre HSAMT openness to the west and full third-party data including the western flank samples within previous boundary and extending beyond. To view an enhanced version of this graphic, please visit: https://images.newsfilecorp.com/files/10112/204646_3118d57ac445eb1f_001full.jpg Canter Resources is now poised to implement a more comprehensive Phase II exploration program. This next phase will include expanded geophysical survey coverage, aiming to thoroughly map out the resistivity and structural profiles across the newly acquired acreage. Photo 1: Canter's Senior Geologist, Trevor Hawkins, staking a Geoprobe collar location during the recent western expansion claim staking trip at the Company's Columbus Lithium-Boron Project. To view an enhanced version of this graphic, please visit: https://images.newsfilecorp.com/files/10112/204646_3118d57ac445eb1f_002full.jpg Qualified Person (QP) The technical information contained in this news release was reviewed and approved by Eric Saderholm P.Geo, Director and Technical Advisor of Canter Resources, a Qualified Person (QP), as defined under National Instrument 43- 101 - Standards of Disclosure for Mineral Projects. About Canter Resources Corp. Canter Resources Corp. is a Canadian junior mineral exploration company advancing the Columbus Lithium-Boron Project in Nevada, USA and the Beaver Creek Lithium Property in Montana, USA. The Company is preparing for a Phase I drill campaign at Columbus to test a highly prospective lithium-brine target and plans to leverage the Company's critical metals targeting database to generate a portfolio of high-quality projects with the aim of defining mineral resources that support the domestic clean energy supply chain in North America. For further information contact: Joness Lang Chief Executive Officer Canter Resources Corp. jlang@canterresources.com For investor inquiries contact: Kristina Pillon, High Tide Consulting Corp. Tel: 604.908.1695 investors@canterresources.com The Canadian Securities Exchange has neither approved nor disapproved the contents of this news release. The Canadian Securities Exchange does not accept responsibility for the adequacy or accuracy of this news release. To view the source version of this press release, please visit https://www.newsfilecorp.com/release/204646",
    "primary_commodity": "Li"
  },
  "articleProject": {
    "gid": 5794,
    "project_name": "Columbus",
    "location": "Nevada, United States"
  },
  "articleExchange": "CSE",
  "articleCompanyId": 1933,
  "articleTicker": "CRC",
  "articleCompanyName": "Canter Resources Corp",
  "allOtherCompanyProjects": [
    {
      "company_id": 1933,
      "gid": 8572,
      "project_name": "Railroad Valley",
      "location": null
    },
    {
      "company_id": 1933,
      "gid": 6827,
      "project_name": "Beaver Creek",
      "location": null
    },
    {
      "company_id": 1933,
      "gid": 5794,
      "project_name": "Columbus",
      "location": "Nevada, United States"
    }
  ],
  "allOtherCompanyNews": [
    {
      "id": 106746,
      "company_id": 1933,
      "title": "Canter Resources Advances Railroad Valley Project with Integration of Historical Data Sets",
      "link": null,
      "date": "2025-06-03T11:00:00.000Z",
      "hidden": false
    },
    {
      "id": 99780,
      "company_id": 1933,
      "title": "Canter Appoints Warwick Smith as Executive Chairman",
      "link": null,
      "date": "2025-04-15T11:00:00.000Z",
      "hidden": false
    },
    {
      "id": 99328,
      "company_id": 1933,
      "title": "Canter Resources Provides Corporate Updates and Comments on Potential Impact of Tariffs on Lithium and Boron Markets",
      "link": null,
      "date": "2025-04-10T11:00:00.000Z",
      "hidden": false
    },
    {
      "id": 98847,
      "company_id": 1933,
      "title": "Canter Resources Receives Approval of Amended Notice of Intent, Clearing Path for Expanded Drilling at the Columbus Lithium-Boron Project",
      "link": null,
      "date": "2025-04-07T11:00:00.000Z",
      "hidden": false
    },
    {
      "id": 89958,
      "company_id": 1933,
      "title": "Canter Submits Amended Notice of Intent for Columbus Lithium-Boron Project to Bureau of Land Management",
      "link": "https://www.newsfilecorp.com/release/243079/Canter-Submits-Amended-Notice-of-Intent-for-Columbus-LithiumBoron-Project-to-Bureau-of-Land-Management",
      "date": "2025-03-04T12:00:00.000Z",
      "hidden": false
    },
    {
      "id": 87729,
      "company_id": 1933,
      "title": "Canter Engages Sunstone Environmental Solutions to Finalize Amended Notice of Intent Submission with Bureau of Land Management",
      "link": "https://www.newsfilecorp.com/release/240733/Canter-Engages-Sunstone-Environmental-Solutions-to-Finalize-Amended-Notice-of-Intent-Submission-with-Bureau-of-Land-Management",
      "date": "2025-02-13T12:00:00.000Z",
      "hidden": false
    },
    {
      "id": 85025,
      "company_id": 1933,
      "title": "Canter Completes Updated 3D Model for The Columbus Lithium-Boron Project in Nevada",
      "link": "https://www.newsfilecorp.com/release/238162/Canter-Completes-Updated-3D-Model-for-The-Columbus-LithiumBoron-Project-in-Nevada",
      "date": "2025-01-23T12:00:00.000Z",
      "hidden": false
    },
    {
      "id": 81440,
      "company_id": 1933,
      "title": "Canter Acquires Key Central Claims at Columbus, Reports Highest Boron Grades To-date and Provides Targeting Update",
      "link": "https://www.newsfilecorp.com/release/233149/Canter-Acquires-Key-Central-Claims-at-Columbus-Reports-Highest-Boron-Grades-Todate-and-Provides-Targeting-Update",
      "date": "2024-12-10T12:00:00.000Z",
      "hidden": false
    },
    {
      "id": 76784,
      "company_id": 1933,
      "title": "Canter Completes Amendments to Columbus Project Agreements",
      "link": "https://www.newsfilecorp.com/release/228306/Canter-Completes-Amendments-to-Columbus-Project-Agreements",
      "date": "2024-10-30T11:00:00.000Z",
      "hidden": false
    },
    {
      "id": 75141,
      "company_id": 1933,
      "title": "Canter Completes Railroad Valley Acquisition",
      "link": "https://www.newsfilecorp.com/release/226911/Canter-Completes-Railroad-Valley-Acquisition",
      "date": "2024-10-17T13:25:00.000Z",
      "hidden": false
    }
  ]
}
