{
  "article": {
    "id": 70921,
    "link": "https://www.globenewswire.com/news-release/2024/09/10/2943798/0/en/Brixton-Metals-Acquires-Infill-Claims-to-its-Thorn-Project-Near-the-Past-Producing-Golden-Bear-Mine.html",
    "title": "Brixton Metals Acquires Infill Claims to its Thorn Project Near the Past Producing Golden Bear Mine",
    "description": "<p><em>Several Gold-In-Soil Anomalies Identified on Mine Trend</em></p><p align=\"left\">VANCOUVER, British Columbia, Sept.  10, 2024  (GLOBE NEWSWIRE) -- Brixton Metals Corporation<strong> (TSX-V: BBB, OTCQB: BBBXF) </strong>(the “<strong>Company</strong>” or “<strong>Brixton</strong>”) is pleased to announce it shall acquire one hundred percent interest in mineral claims totaling 6446 hectares or 64.4 square kilometers within the Thorn Project, not previously controlled, located north and northwest from the past producing Golden Bear Mine.<br /></p>  <p align=\"justify\"><strong>Deal Terms</strong></p>  <ul type=\"disc\"><li style=\"text-align:justify;\">Under a Purchase and Sale Agreement with arm’s length private Vendors, Brixton shall pay the Vendors CAD$75,000 and issue 1,250,000 common shares of Brixton upon Exchange approval;<br /></li><li style=\"text-align:justify;\">Brixton shall grant the Vendors a one percent Net Smelter Royalty Return (“NSR”) where Brixton holds the right to buydown 50% of the NSR, half of 1% for CAD$1,000,000 prior to commercial production.<br /></li></ul>  <p align=\"justify\">Chairman and CEO, Gary R. Thompson, stated, “We are excited to further consolidate the Thorn Project by adding more gold potential to the copper porphyry district play. Several gold geochemical anomalies have been identified adjacent to and on trend with a past producer of high-grade gold. Follow up exploration work is planned on these newly acquired claims to define drill targets.”</p>  <p align=\"justify\">Figure 1. Thorn Project Location Map with Gold Geochemistry.</p>  <p align=\"center\"><img alt=\"Figure 1_10Sept2024\" data-mce-selected=\"1\" height=\"273\" name=\"GNW_RichHtml_External_IMG\" src=\"https://ml.globenewswire.com/Resource/Download/094c87ba-37fd-451e-8730-096394369694/figure-1-10sept2024.png\" width=\"600\" /><br /></p>  <p align=\"justify\">Please see link for an interactive map of Gold Geochem and Drilling for the Thorn Project here: <a href=\"https://app.mininghub.com/sh/A0c138c6\" rel=\"nofollow\" target=\"_blank\" title=\"\">https://app.mininghub.com/sh/A0c138c6</a></p>  <p align=\"justify\"><strong>Discussion</strong></p>  <p align=\"justify\">As shown in Figure 2, several gold-in-soil geochemical anomalies have been identified and appear to be open for expansion. The newly acquired claims are located north and northwest from the past producing Golden Bear Mine.</p>  <p align=\"justify\">Figure 2. Gold-in-soil Geochemistry on the Newly Acquired Mineral Claims.</p>  <p align=\"justify\"><img alt=\"Figure 2_10Sept2024\" height=\"517\" name=\"GNW_RichHtml_External_IMG\" src=\"https://ml.globenewswire.com/Resource/Download/32889371-9d07-41af-903e-465328c91a1c/figure-2-10sept2024.png\" width=\"600\" /><br /></p>  <p align=\"justify\">Previous operators include Chevron, Homestake, North American Metals and Decoors Mining. Historic rock samples collected returned 284 sample greater than 20 ppb Au with a high of 124.85 g/t gold and 77.47 g/t silver from the Shoulder Zone collected by Homestake 1991 (Hamilton, 1994). In 1984, Chevron collected a rock grab from the Spire Zone that returned 14.00 g/t gold (Bruaset, 1984). The Honk Showing is a shear hosted quartz-pyrite vein along a north-trending splay of the Ophir Break returned 18.07 g/t gold and 64.80 g/t silver from a rock grab sample (McBean, 1990). Limited drilling has returned mixed results. One of the best values obtained from drilling was 1.1 g/t gold and 30.3 g/t silver over 4.0m from drillhole R90-7 (Allen, 1990).</p>  <p align=\"justify\">Gold was mined from the Golden Bear Mine from 1990-2001 and is currently held by Newmont Corporation and the site is under remediation and reclamation. The Golden Bear deposits, located south and southeast from these newly acquired claims, are Carlin-type and low sulphidation type gold deposits.</p>  <p>The 1987 Reserve Estimate for the Bear Main Zone, which was one of six deposits, was proven and probable of 1.2 MT at 12 g/t gold.</p>  <p>Source: <a href=\"https://minfile.gov.bc.ca/Summary.aspx?minfilno=104K++079\" rel=\"nofollow\" target=\"_blank\" title=\"\">https://minfile.gov.bc.ca/Summary.aspx?minfilno=104K++079</a></p>  <p align=\"justify\">On October 17, 1994, the owners of the Golden Bear Mine announced the discovery of the Grizzly zone where it had drilled 27 g/t Au over a true width of 3.9m and a 15.5m intersection grading 14.4 g/t Au. Source: The Northern Miner news publication, 1994.</p>  <p align=\"justify\">Gold mineralization in the mine area is structurally controlled as north-south to northwest structures. A major north to northwest trending fault, known as the Ophir Break Zone, extends through the area for over 10km and is defined by areas of intense fracturing with abundant slickensides, areas of carbonaceous and siliceous black siltstone and gouge, and linear quartz-iron carbonate-pyrite- listwanites and quartz-dolomite alteration zones.</p>  <p align=\"justify\">Mineralization consists of pyrite, trace arsenopyrite and scorodite, native gold, pyrrhotite, chalcopyrite, stibnite and tetrahedrite. Pyrite occurs as late-stage veinlets and as earlier breccia matrix filling, fragments within breccias.</p>  <p align=\"justify\"><em>Source:</em> <a href=\"https://minfile.gov.bc.ca/Summary.aspx?minfilno=104K++079\" rel=\"nofollow\" target=\"_blank\" title=\"\">https://minfile.gov.bc.ca/Summary.aspx?minfilno=104K++079</a></p>  <p align=\"justify\">These newly acquired claims do not contain any reserves or resources and are considered early-stage exploration targets for its high-grade underground potential. There are no assurances that future work will define resources or reserves.</p>  <p align=\"justify\"><strong>Qualified Person (QP)</strong></p>  <p align=\"justify\">Mr. Gary Thompson, P.Geo., is Chairman and CEO for the Company who is a qualified person as defined by National Instrument 43-101. Mr. Thompson has verified the referenced data but not the analytical results disclosed in this press release and has approved the technical information presented herein.</p>  <p align=\"justify\"><strong>About Brixton Metals Corporation</strong></p>  <p align=\"justify\">Brixton Metals is a Canadian exploration company focused on the advancement of its mining projects. Brixton wholly owns four exploration projects: Brixton’s flagship Thorn copper-gold-silver-molybdenum Project, the Hog Heaven copper-silver-gold Project in NW Montana, USA, which is optioned to Ivanhoe Electric Inc., the Langis-HudBay silver-cobalt-nickel Project in Ontario and the Atlin Goldfields Project located in northwest BC which is optioned to Eldorado Gold Corporation. Brixton Metals Corporation shares trade on the TSX-V under the ticker symbol <strong>BBB</strong>, and on the OTCQB under the ticker symbol <strong>BBBXF</strong>. For more information about Brixton, please visit our website at <a href=\"http://www.brixtonmetals.com/\" rel=\"nofollow\" target=\"_blank\" title=\"\"><u>www.brixtonmetals.com</u></a>.</p>  <p align=\"justify\">On Behalf of the Board of Directors</p>  <p align=\"justify\">Mr. Gary R. Thompson, Chairman and CEO</p>  <p align=\"justify\">For Investor Relations inquiries please contact: Mr. Michael Rapsch, Senior Manager, Investor Relations. email: <a href=\"mailto:michael.rapsch@brixtonmetals.com\" rel=\"nofollow\" target=\"_blank\" title=\"michael.rapsch@brixtonmetals.com\">michael.rapsch@brixtonmetals.com</a> or call Tel: 604-630-9707 <br /><em>Neither the TSX Venture Exchange nor its Regulation Services Provider (as that term is defined in the policies of the TSX Venture Exchange) accepts responsibility for the adequacy or accuracy of this release.</em><br /><em>Information set forth in this news release may involve forward-looking statements under applicable securities laws. Forward-looking statements are statements that relate to future, not past, events. In this context, forward-looking statements often address expected future business and financial performance, and often contain words such as “anticipate”, “believe”, “plan”, “estimate”, “expect”, and “intend”, statements that an action or event “may”, “might”, “could”, “should”, or “will” be taken or occur, including statements that address potential quantity and/or grade of minerals, potential size and expansion of a mineralized zone, proposed timing of exploration and development plans, or other similar expressions. All statements, other than statements of historical fact included herein including, without limitation, statements regarding the use of proceeds. By their nature, forward-looking statements involve known and unknown risks, uncertainties and other factors which may cause our actual results, performance or achievements, or other future events, to be materially different from any future results, performance or achievements expressed or implied by such forward-looking statements. Such factors include, among others, the following risks: the need for additional financing; operational risks associated with mineral exploration; fluctuations in commodity prices; title matters; and the additional risks identified in the annual information form of the Company or other reports and filings with the TSXV and applicable Canadian securities regulators. Forward-looking statements are made based on management’s beliefs, estimates and opinions on the date that statements are made and the Company undertakes no obligation to update forward-looking statements if these beliefs, estimates and opinions or other circumstances should change, except as required by applicable securities laws. Investors are cautioned against attributing undue certainty to forward-looking statements. </em></p>  <p align=\"justify\">Links:</p>  <p align=\"justify\"><a href=\"https://brixtonmetals.com/wp-content/uploads/2024/09/Figure-1_10Sept2024.png\" rel=\"nofollow\" target=\"_blank\" title=\"\">https://brixtonmetals.com/wp-content/uploads/2024/09/Figure-1_10Sept2024.png</a></p>  <p align=\"justify\"><a href=\"https://brixtonmetals.com/wp-content/uploads/2024/09/Figure-2_10Sept2024.png\" rel=\"nofollow\" target=\"_blank\" title=\"\">https://brixtonmetals.com/wp-content/uploads/2024/09/Figure-2_10Sept2024.png</a></p>  <br /><img src='https://ml.globenewswire.com/media/NmMxNzAxOTgtODVhOS00ZTkzLWEwNWMtNjdlNGZmZmY3YjVmLTExMDg1MDU=/tiny/Brixton-Metals-Corporation.png' referrerpolicy='no-referrer-when-downgrade' />",
    "search_terms": "Thorn,Brixton Metals Corporation,BBB",
    "master_gid": 67,
    "date": "2024-09-10T13:30:00.000Z",
    "tags": "Canada||||Project Acquisition",
    "image_id": null,
    "hidden": false,
    "company_id": 112,
    "provider": "globenewswire",
    "excerpt": "Several Gold-In-Soil Anomalies Identified on Mine TrendVANCOUVER, British Columbia, Sept. 10, 2024 (GLOBE NEWSWIRE) -- Brixton Metals Corporation(TSX-V: BBB, OTCQB: BBBXF)(the “Company” or “Brixton”) is pleased to announce it shall acquire one hundred percent interest in mineral claims totaling 6446 hectares or 64.4 square kilometers within the Thorn Project, not",
    "is_regulatory": false,
    "refined_tags": null,
    "ftp_filename": null,
    "company_name": "Brixton Metals Corporation",
    "exchange": "TSXV",
    "root_ticker": "BBB",
    "project_name": "Thorn",
    "gid": 67,
    "location": null,
    "plan_id": "companytier2",
    "description_text": "Several Gold-In-Soil Anomalies Identified on Mine Trend VANCOUVER, British Columbia, Sept.  10, 2024  (GLOBE NEWSWIRE) -- Brixton Metals Corporation (TSX-V: BBB, OTCQB: BBBXF) (the “ Company ” or “ Brixton ”) is pleased to announce it shall acquire one hundred percent interest in mineral claims totaling 6446 hectares or 64.4 square kilometers within the Thorn Project, not previously controlled, located north and northwest from the past producing Golden Bear Mine. Deal Terms Under a Purchase and Sale Agreement with arm’s length private Vendors, Brixton shall pay the Vendors CAD$75,000 and issue 1,250,000 common shares of Brixton upon Exchange approval; Brixton shall grant the Vendors a one percent Net Smelter Royalty Return (“NSR”) where Brixton holds the right to buydown 50% of the NSR, half of 1% for CAD$1,000,000 prior to commercial production. Chairman and CEO, Gary R. Thompson, stated, “We are excited to further consolidate the Thorn Project by adding more gold potential to the copper porphyry district play. Several gold geochemical anomalies have been identified adjacent to and on trend with a past producer of high-grade gold. Follow up exploration work is planned on these newly acquired claims to define drill targets.” Figure 1. Thorn Project Location Map with Gold Geochemistry. Please see link for an interactive map of Gold Geochem and Drilling for the Thorn Project here: https://app.mininghub.com/sh/A0c138c6 Discussion As shown in Figure 2, several gold-in-soil geochemical anomalies have been identified and appear to be open for expansion. The newly acquired claims are located north and northwest from the past producing Golden Bear Mine. Figure 2. Gold-in-soil Geochemistry on the Newly Acquired Mineral Claims. Previous operators include Chevron, Homestake, North American Metals and Decoors Mining. Historic rock samples collected returned 284 sample greater than 20 ppb Au with a high of 124.85 g/t gold and 77.47 g/t silver from the Shoulder Zone collected by Homestake 1991 (Hamilton, 1994). In 1984, Chevron collected a rock grab from the Spire Zone that returned 14.00 g/t gold (Bruaset, 1984). The Honk Showing is a shear hosted quartz-pyrite vein along a north-trending splay of the Ophir Break returned 18.07 g/t gold and 64.80 g/t silver from a rock grab sample (McBean, 1990). Limited drilling has returned mixed results. One of the best values obtained from drilling was 1.1 g/t gold and 30.3 g/t silver over 4.0m from drillhole R90-7 (Allen, 1990). Gold was mined from the Golden Bear Mine from 1990-2001 and is currently held by Newmont Corporation and the site is under remediation and reclamation. The Golden Bear deposits, located south and southeast from these newly acquired claims, are Carlin-type and low sulphidation type gold deposits. The 1987 Reserve Estimate for the Bear Main Zone, which was one of six deposits, was proven and probable of 1.2 MT at 12 g/t gold. Source: https://minfile.gov.bc.ca/Summary.aspx?minfilno=104K++079 On October 17, 1994, the owners of the Golden Bear Mine announced the discovery of the Grizzly zone where it had drilled 27 g/t Au over a true width of 3.9m and a 15.5m intersection grading 14.4 g/t Au. Source: The Northern Miner news publication, 1994. Gold mineralization in the mine area is structurally controlled as north-south to northwest structures. A major north to northwest trending fault, known as the Ophir Break Zone, extends through the area for over 10km and is defined by areas of intense fracturing with abundant slickensides, areas of carbonaceous and siliceous black siltstone and gouge, and linear quartz-iron carbonate-pyrite- listwanites and quartz-dolomite alteration zones. Mineralization consists of pyrite, trace arsenopyrite and scorodite, native gold, pyrrhotite, chalcopyrite, stibnite and tetrahedrite. Pyrite occurs as late-stage veinlets and as earlier breccia matrix filling, fragments within breccias. Source: https://minfile.gov.bc.ca/Summary.aspx?minfilno=104K++079 These newly acquired claims do not contain any reserves or resources and are considered early-stage exploration targets for its high-grade underground potential. There are no assurances that future work will define resources or reserves. Qualified Person (QP) Mr. Gary Thompson, P.Geo., is Chairman and CEO for the Company who is a qualified person as defined by National Instrument 43-101. Mr. Thompson has verified the referenced data but not the analytical results disclosed in this press release and has approved the technical information presented herein. About Brixton Metals Corporation Brixton Metals is a Canadian exploration company focused on the advancement of its mining projects. Brixton wholly owns four exploration projects: Brixton’s flagship Thorn copper-gold-silver-molybdenum Project, the Hog Heaven copper-silver-gold Project in NW Montana, USA, which is optioned to Ivanhoe Electric Inc., the Langis-HudBay silver-cobalt-nickel Project in Ontario and the Atlin Goldfields Project located in northwest BC which is optioned to Eldorado Gold Corporation. Brixton Metals Corporation shares trade on the TSX-V under the ticker symbol BBB , and on the OTCQB under the ticker symbol BBBXF . For more information about Brixton, please visit our website at www.brixtonmetals.com . On Behalf of the Board of Directors Mr. Gary R. Thompson, Chairman and CEO For Investor Relations inquiries please contact: Mr. Michael Rapsch, Senior Manager, Investor Relations. email: michael.rapsch@brixtonmetals.com or call Tel: 604-630-9707 Neither the TSX Venture Exchange nor its Regulation Services Provider (as that term is defined in the policies of the TSX Venture Exchange) accepts responsibility for the adequacy or accuracy of this release. Information set forth in this news release may involve forward-looking statements under applicable securities laws. Forward-looking statements are statements that relate to future, not past, events. In this context, forward-looking statements often address expected future business and financial performance, and often contain words such as “anticipate”, “believe”, “plan”, “estimate”, “expect”, and “intend”, statements that an action or event “may”, “might”, “could”, “should”, or “will” be taken or occur, including statements that address potential quantity and/or grade of minerals, potential size and expansion of a mineralized zone, proposed timing of exploration and development plans, or other similar expressions. All statements, other than statements of historical fact included herein including, without limitation, statements regarding the use of proceeds. By their nature, forward-looking statements involve known and unknown risks, uncertainties and other factors which may cause our actual results, performance or achievements, or other future events, to be materially different from any future results, performance or achievements expressed or implied by such forward-looking statements. Such factors include, among others, the following risks: the need for additional financing; operational risks associated with mineral exploration; fluctuations in commodity prices; title matters; and the additional risks identified in the annual information form of the Company or other reports and filings with the TSXV and applicable Canadian securities regulators. Forward-looking statements are made based on management’s beliefs, estimates and opinions on the date that statements are made and the Company undertakes no obligation to update forward-looking statements if these beliefs, estimates and opinions or other circumstances should change, except as required by applicable securities laws. Investors are cautioned against attributing undue certainty to forward-looking statements. Links: https://brixtonmetals.com/wp-content/uploads/2024/09/Figure-1_10Sept2024.png https://brixtonmetals.com/wp-content/uploads/2024/09/Figure-2_10Sept2024.png",
    "primary_commodity": "Au"
  },
  "articleProject": {
    "gid": 67,
    "project_name": "Thorn",
    "location": null
  },
  "articleExchange": "TSXV",
  "articleCompanyId": 112,
  "articleTicker": "BBB",
  "articleCompanyName": "Brixton Metals Corporation",
  "allOtherCompanyProjects": [
    {
      "company_id": 112,
      "gid": 1538,
      "project_name": "Langis",
      "location": null
    },
    {
      "company_id": 112,
      "gid": 3839,
      "project_name": "Hog Heaven",
      "location": "Montana, United States"
    },
    {
      "company_id": 112,
      "gid": 67,
      "project_name": "Thorn",
      "location": null
    }
  ],
  "allOtherCompanyNews": [
    {
      "id": 106052,
      "company_id": 112,
      "title": "Brixton Metals Commences Drilling at its Thorn Copper-Gold Project",
      "link": null,
      "date": "2025-05-28T11:30:00.000Z",
      "hidden": false
    },
    {
      "id": 103659,
      "company_id": 112,
      "title": "Brixton Metals Provides Exploration Plans for Gold and Copper Drill Targets for its Fully Funded 2025 Program at its Thorn Project",
      "link": null,
      "date": "2025-05-06T12:30:00.000Z",
      "hidden": false
    },
    {
      "id": 83980,
      "company_id": 112,
      "title": "Brixton Metals Identifies Several New Porphyry Targets from its 2024 Regional Prospecting Program, Sampling up to 46.9 g/t gold, 35.3% copper, 1525 g/t silver at its Thorn Project",
      "link": "https://www.globenewswire.com/news-release/2025/01/14/3009201/0/en/Brixton-Metals-Identifies-Several-New-Porphyry-Targets-from-its-2024-Regional-Prospecting-Program-Sampling-up-to-46-9-g-t-gold-35-3-copper-1525-g-t-silver-at-its-Thorn-Project.html",
      "date": "2025-01-14T12:30:00.000Z",
      "hidden": false
    },
    {
      "id": 83432,
      "company_id": 112,
      "title": "Brixton Metals Provides Results from Ivanhoe Electric’s 2024 Drilling at the Hog Heaven Project, Montana, USA",
      "link": "https://www.globenewswire.com/news-release/2025/01/07/3005802/0/en/Brixton-Metals-Provides-Results-from-Ivanhoe-Electric-s-2024-Drilling-at-the-Hog-Heaven-Project-Montana-USA.html",
      "date": "2025-01-07T20:55:00.000Z",
      "hidden": false
    },
    {
      "id": 82054,
      "company_id": 112,
      "title": "Brixton Metals Discovers Multiple Porphyry Systems at the North Target on its Thorn Project",
      "link": "https://www.globenewswire.com/news-release/2024/12/16/2997417/0/en/Brixton-Metals-Discovers-Multiple-Porphyry-Systems-at-the-North-Target-on-its-Thorn-Project.html",
      "date": "2024-12-16T12:30:00.000Z",
      "hidden": false
    },
    {
      "id": 81311,
      "company_id": 112,
      "title": "Brixton Metals Drills 647.83m of 0.49% Copper Equivalent and Discovers a New Gold Zone 8.00m of 4.52 g/t Gold, 149 g/t Silver in the Camp Creek Corridor",
      "link": "https://www.globenewswire.com/news-release/2024/12/09/2993662/0/en/Brixton-Metals-Drills-647-83m-of-0-49-Copper-Equivalent-and-Discovers-a-New-Gold-Zone-8-00m-of-4-52-g-t-Gold-149-g-t-Silver-in-the-Camp-Creek-Corridor.html",
      "date": "2024-12-09T12:30:00.000Z",
      "hidden": false
    },
    {
      "id": 79952,
      "company_id": 112,
      "title": "Brixton Metals Closes Private Placement",
      "link": "https://www.globenewswire.com/news-release/2024/11/25/2986954/0/en/Brixton-Metals-Closes-Private-Placement.html",
      "date": "2024-11-25T17:36:00.000Z",
      "hidden": false
    },
    {
      "id": 79240,
      "company_id": 112,
      "title": "Brixton Metals Drills 3.00m of 5.67 g/t Gold within 48.50m of 1.16 g/t Gold at its Trapper Gold Target",
      "link": "https://www.globenewswire.com/news-release/2024/11/19/2983479/0/en/Brixton-Metals-Drills-3-00m-of-5-67-g-t-Gold-within-48-50m-of-1-16-g-t-Gold-at-its-Trapper-Gold-Target.html",
      "date": "2024-11-19T12:30:00.000Z",
      "hidden": false
    },
    {
      "id": 78612,
      "company_id": 112,
      "title": "Brixton Metals Announces Fully Subscribed Flow-Through Private Placement of up to $6 Million",
      "link": "https://www.globenewswire.com/news-release/2024/11/13/2980155/0/en/Brixton-Metals-Announces-Fully-Subscribed-Flow-Through-Private-Placement-of-up-to-6-Million.html",
      "date": "2024-11-13T12:30:00.000Z",
      "hidden": false
    },
    {
      "id": 76770,
      "company_id": 112,
      "title": "Brixton Metals Releases Additional High-Grade Gold Assays From its Exciting Trapper Gold Target on its Wholly Owned Thorn Project",
      "link": "https://www.globenewswire.com/news-release/2024/10/30/2971598/0/en/Brixton-Metals-Releases-Additional-High-Grade-Gold-Assays-From-its-Exciting-Trapper-Gold-Target-on-its-Wholly-Owned-Thorn-Project.html",
      "date": "2024-10-30T11:30:00.000Z",
      "hidden": false
    }
  ]
}
