{
  "article": {
    "id": 55081,
    "link": "https://www.thenewswire.com/press-releases?id=1AdyFeYVd",
    "title": "Westward Gold Expands Flagship Toiyabe Hills Project Footprint by 43%, Bolstering its Emerging District-Scale Exploration Play in Nevada",
    "description": "<table style='width:fit-content; border: none;'><tr style='background: none;'><td colspan='10' style='padding: 0; margin: 0; border: none; background: none;' valign='bottom'><a target='_blank' href='www.westwardgold.com'><img src=\"https://www.thenewswire.com/data/tnw/clients/logos/1LYzFPXdg.png?t=1633624398\" alt=\"Westward Gold Inc.\" /></a></td></tr><tr style='background: none;'><td style='width: 34px; padding: 0; margin: 0; border: none; background: none;' valign='bottom'><a target='_blank' href='https://thenewswire.com/api/apps/tnw/r?i=1LYzFPXdg&amp;m=fac'><img src=\"https://www.thenewswire.com/data/tnw/img/fac.png\" /></a></td><td style='width: 34px; padding: 0; margin: 0; border: none; background: none;' valign='bottom'><a target='_blank' href='https://thenewswire.com/api/apps/tnw/r?i=1LYzFPXdg&amp;m=twi'><img src=\"https://www.thenewswire.com/data/tnw/img/twi.png\" /></a></td><td style='width: 34px; padding: 0; margin: 0; border: none; background: none;' valign='bottom'><a target='_blank' href='https://thenewswire.com/api/apps/tnw/r?i=1LYzFPXdg&amp;m=lin'><img src=\"https://www.thenewswire.com/data/tnw/img/lin.png\" /></a></td><td style='width: 34px; padding: 0; margin: 0; border: none; background: none;' valign='bottom'><a target='_blank' href='https://thenewswire.com/api/apps/tnw/r?i=1LYzFPXdg&amp;m=you'><img src=\"https://www.thenewswire.com/data/tnw/img/you.png\" /></a></td><td style='width: 34px; padding: 0; margin: 0; border: none; background: none;' valign='bottom'><a target='_blank' href='https://thenewswire.com/api/apps/tnw/r?i=1LYzFPXdg&amp;m=ins'><img src=\"https://www.thenewswire.com/data/tnw/img/ins.png\" /></a></td><td style='padding: 0; margin: 0; border: none; background: none;'></td></tr></table>\n\n\n\n\n<p style='text-align:justify; '>\nVancouver, British Columbia, June 4, 2024 – <span style=''>TheNewswire – </span>Westward Gold Inc. (CSE: WG, OTCQB: WGLIF, FSE: IM50) (<span style='font-weight:bold; '>“Westward”</span> or the <span style='font-weight:bold; '>“Company”</span>) is pleased to <a href='' target='_blank'></a>announce the acquisition of 202 unpatented mining claims, adjacent to and contiguous with its Turquoise Canyon and East Saddle Properties along the Cortez Gold Trend in Lander County, Nevada. The claims (the <span style='font-weight:bold; '>“ES Extension”</span>) were acquired through open staking in April 2024, increasing the Company’s total footprint in the area to approximately 55 square kilometers, a significant increase of 43%. Westward continues to reinforce its status as the dominant exploration company in the area, and is ideally positioned to strategically apply district-scale exploration techniques to its sizeable property package. Moving forward, Westward’s consolidated flagship asset will be referred to as the Toiyabe Hills Project – the combination of several 100%-owned claim blocks acquired since the Company’s entrance into Nevada in April of 2021. Figure 1 below illustrates the systematic growth of Westward’s exploration ground, accomplished via a combination of corporate transactions and direct claim-staking.\n</p>\n\n\n\n<p style='text-align:justify; '>\nColin Moore, President and CEO, commented: “In the span of three years, Westward has grown from a company with an option agreement on 165 claims – to one with 100% ownership of 776 claims across two consolidated land packages on each of the two most productive gold trends in Nevada. While we have been busy accumulating prospective exploration ground, we have also been persistent in attracting the vital technical talent necessary to unlock its discovery potential. Our expert team with multiple Carlin-type gold discoveries to their credit has been instrumental in guiding our growth story, and this most recent land acquisition will enable them to apply their skills with even greater impact.” \n</p>\n\n\n\n<p style='text-align:justify; '>\nRobert Edie, Vice President Exploration, noted: “Combining 2023 geochemical results with other available datasets revealed that key markers for Carlin-type mineralization on our property trend to the south and east. The additional ground acquired has the necessary scale – and prospective geologic setting – to host a potential major new discovery in its own right; it will form a key piece of our camp-scale land package. I’m excited to systematically evaluate this surprisingly underexplored ground on a major gold trend with data-driven regional exploration.”\n</p>\n\n\n\n<p style='text-align:center; '>\n<span style='font-weight:bold; '>Figure 1: The Evolution of Westward’s Toiyabe Hills Property</span>\n</p>\n\n\n\n\n<p style='text-align:center; '>\n\n\n<span style='text-align:center; '><a href='https://www.thenewswire.com/data/tnw/clients/img/8ddb9aec1e0a50b6fc5d14b3ed98fdfb.png' target='_blank'><img src=\"https://www.thenewswire.com/data/tnw/clients/img/8ddb9aec1e0a50b6fc5d14b3ed98fdfb_.png\" /></a><br />\nClick Image To View Full Size</span>\n</p>\n\n\n\n<p style='text-align:center; '>\n<span style='font-weight:bold; '>Figure 2: Addition of East Saddle Extension</span>\n</p>\n\n\n\n\n<p style='text-align:center; '>\n\n\n<span style='text-align:center; '><a href='https://www.thenewswire.com/data/tnw/clients/img/db91256620d985fbc7411f5b097571eb.png' target='_blank'><img src=\"https://www.thenewswire.com/data/tnw/clients/img/db91256620d985fbc7411f5b097571eb_.png\" /></a><br />\nClick Image To View Full Size</span>\n</p>\n\n\n\n<p style='text-align:justify; '>\n<span style='font-style:italic; '>Note: Windows shown in Figure 2 indicate a total of three third-party claim inliers (two of which are in the ES Extension block).</span>\n</p>\n\n\n\n<p style='text-align:justify; '>\nA confluence of several prospective geologic features pointed towards the strategic importance of acquiring the ES Extension ground – including stratigraphy, structure, geochemistry, and geophysics. The Hilltop Corridor, a structural feature based upon interpretations of the horizontal gradient of gravity, also contains elevated gold and Carlin pathfinder elements (notably, arsenic and antimony) in soils and rocks. This prospective corridor has two parallel features on the property; one is closely associated with the Courtney Zone – a known occurrence of gold mineralization where the large majority of historical drilling has been focused – the second is to the east on the newly-acquired ES Extension (see Figure 3 below).\n</p>\n\n\n\n<p style='text-align:justify; '>\nAt surface, the ES Extension is made up of upper-plate siliciclastic units of the Vinini and Valmy Formations and an 850 m by 500 m exposure of lower-plate Wenban Formation (see Figure 3 below), one of the most important stratigraphic units for hosting gold in the region. Through drillhole re-logging efforts and interpretation of regional stratigraphy, Westward is highly confident that prospective host rocks lie beneath the upper-plate siliciclastic rocks across the ES Extension ground. There is a strong probability that the entire carbonate host section is intact beneath this cover, allowing the Company the opportunity to explore for mineralization that has not been thinned-out by erosion. Evidence for a reasonable depth to host rocks is supported by detailed Induced Polarization (<span style='font-weight:bold; '>“IP”</span>)–Resistivity profiles immediately north of the new ES Extension block, as interpreted by Mr. Jim Wright in December of 2021. IP lines clearly image the layering of conductive upper-plate strata lying upon more resistive lower-plate strata – and generally suggest depths of 50-150 m to lower-plate rocks immediately east of the Courtney Zone, increasing to 250-350 m near the eastern boundary of the property. A similar profile can be expected at the ES Extension moving eastward from the exposed carbonate Wenban Formation. This is an excellent depth range to fully preserve an intact Carlin gold system while allowing relatively easy exploration drilling. \n</p>\n\n\n\n<p style='text-align:center; '>\n<span style='font-weight:bold; '>Figure 3: ES Extension – Stratigraphic, Structural, and Geophysical Evidence for Potential Gold Deposition </span>\n</p>\n\n\n\n\n<p style='text-align:center; '>\n\n\n<span style='text-align:center; '><a href='https://www.thenewswire.com/data/tnw/clients/img/1d4668d39810ee2a1d74ea068be0525b.png' target='_blank'><img src=\"https://www.thenewswire.com/data/tnw/clients/img/1d4668d39810ee2a1d74ea068be0525b_.png\" /></a><br />\nClick Image To View Full Size</span>\n</p>\n\n\n\n<p style='text-align:justify; '>\nSurface rock-chip and soil samples collected by Westward in late 2023 identified several trends of geochemical anomalies vectoring towards the newly-acquired ES Extension <span style='font-style:italic; '>(refer to the Company’s press release dated May 7, 2024, for additional information)</span>. Gold, arsenic, and antimony demonstrate a southeast pattern of zonation (see Figure 4 below). The pattern of strong arsenic-in-soils trending into strong antimony-in-soils indicates the potential for gold mineralization at a reasonable depth beneath upper-plate siliciclastic rocks. The Company will continue to advance these target concepts in 2024 by completing detailed Anaconda-style folio mapping, collecting surface rock and soil samples, and completing a detailed gravity survey on the new ground.\n</p>\n\n\n\n<p style='text-align:center; '>\n<span style='font-weight:bold; '>Figure 4: ES Extension – Geochemical Evidence for Potential Gold Deposition</span>\n</p>\n\n\n\n<p style='text-align:center; '>\n<span style='font-style:italic; '>Note: Left Image Heat Map Shows Arsenic-in-Soils / Right Image Heat Map Shows Antimony-in-Soils</span>\n</p>\n\n\n\n\n<p style='text-align:center; '>\n\n\n<span style='text-align:center; '><a href='https://www.thenewswire.com/data/tnw/clients/img/85f5409d34e8d0f42f58bbe417f62ef1.png' target='_blank'><img src=\"https://www.thenewswire.com/data/tnw/clients/img/85f5409d34e8d0f42f58bbe417f62ef1_.png\" /></a><br />\nClick Image To View Full Size</span>\n</p>\n\n\n\n<p style='text-align:left; '>\n<span style='font-weight:bold; '>2024 Field Season Update</span>\n</p>\n\n\n\n<p style='text-align:justify; '>\n1:5000 scale Anaconda-style folio mapping of the Toiyabe Hills Project is currently underway, building upon past mapping which was largely centered around the Courtney Zone. The initial focus areas are the Hilltop Corridor and the ES Extension – the program is being led by Technical Advisor Steven Koehler and VP Exploration Robert Edie, with ambitions to cover the vast majority of the Westward ground. High-quality surface mapping will represent a key input in emerging priority drill targets, and additional details and findings will be released to the market as the field season progresses. \n</p>\n\n\n\n<p style='text-align:left; '>\n<span style='font-weight:bold; '>Qualified Person</span>\n</p>\n\n\n\n<p style='text-align:justify; '>\nThe technical information contained in this news release was reviewed and approved by Robert Edie, Vice President Exploration of the Company, who is a Qualified Person under National Instrument 43-101 – <span style='font-style:italic; '>Standards of Disclosure for Mineral Projects. </span>Mr. Edie is a Certified Professional Geologist (CPG) through the American Institute of Professional Geologists (AIPG).\n</p>\n\n\n\n<p style='text-align:justify; '>\n<span style='font-weight:bold; '>About Westward Gold</span>\n</p>\n\n\n\n<p style='text-align:justify; '>\nWestward Gold is a mineral exploration company focused on developing the Toiyabe Hills Project located in the Cortez Hills area of Lander County, Nevada, and the Coyote and Rossi Projects located along the Carlin Trend in Elko County, Nevada. From time to time, the Company may also evaluate the acquisition of other mineral exploration assets and opportunities.\n</p>\n\n\n\n<p style='text-align:justify; '>\nFor further information contact: \n</p>\n\n\n\n<p style='text-align:left; '>\nAndrew Nelson <br />\nChief Financial Officer<br />\nWestward Gold Inc. <br />\n+1 (604) 828-7027\n</p>\n\n\n\n<p style='text-align:left; '>\nandrew@westwardgold.com \n</p>\n\n\n\n<p style='text-align:left; '>\nwww.westwardgold.com\n</p>\n\n\n\n<p style='text-align:justify; '>\n<span style='font-style:italic; '>The Canadian Securities Exchange has neither approved nor disapproved the contents of this news release. The Canadian Securities Exchange does not accept responsibility for the adequacy or accuracy of this news release.</span>\n</p>\n\n\n\n<p style='text-align:justify; '>\n<span style='font-style:italic; '>This news release contains or incorporates by reference “forward-looking statements” and “forward-looking information” as defined under applicable Canadian securities legislation. All statements, other than statements of historical fact, which address events, results, outcomes, or developments that the Company expects to occur are, or may be deemed, to be, forward-looking statements. Forward-looking statements are generally, but not always, identified by the use of forward-looking terminology such as &quot;expect&quot;, &quot;believe&quot;, &quot;anticipate&quot;, &quot;intend&quot;, &quot;estimate”, “potential”, “on track”, “forecast&quot;, &quot;budget&quot;, “target”, “outlook”, “continue”, “plan” or variations of such words and phrases and similar expressions or statements that certain actions, events or results “may”, “could”, “would”, “might” or “will” be taken, occur or be achieved or the negative connotation of such terms.</span>\n</p>\n\n\n\n<p style='text-align:justify; '>\n<span style='font-style:italic; '>Such statements include, but may not be limited to, information as to strategy, plans or future financial or operating performance, such as the Company’s expansion plans, project timelines, expected drilling targets, and other statements that express management’s expectations or estimates of future plans and performance.</span>\n</p>\n\n\n\n<p style='text-align:justify; '>\n<span style='font-style:italic; '>Forward-looking statements or information are subject to a variety of known and unknown risks, uncertainties and other factors that could cause actual events or results to differ from those reflected in the forward-looking statements or information, including, without limitation, the need for additional capital by the Company through financings, and the risk that such funds may not be raised; the speculative nature of exploration and the stages of the Company’s properties; the effect of changes in commodity prices; regulatory risks that development of the Company’s material properties will not be acceptable for social, environmental or other reasons, availability of equipment (including drills) and personnel to carry out work programs, that each stage of work will be completed within expected time frames, that current geological models and interpretations prove correct, the results of ongoing work programs may lead to a change of exploration priorities, and the efforts and abilities of the senior management team. This list is not exhaustive of the factors that may affect any of the Company’s forward-looking statements or information. These and other factors may cause the Company to change its exploration and work programs, not proceed with work programs, or change the timing or order of planned work programs. Additional risk factors and details with respect to risk factors that may affect the Company’s ability to achieve the expectations set forth in the forward-looking statements contained in this news release are set out in the Company’s latest management discussion and analysis under “Risks and Uncertainties”, which is available under the Company’s SEDAR+ profile at www.sedarplus.ca. Although the Company has attempted to identify important factors that could cause actual results to differ materially, there may be other factors that cause results not to be as anticipated, estimated, described or intended. Accordingly, readers should not place undue reliance on forward-looking statements or information. The Company’s forward-looking statements and information are based on the assumptions, beliefs, expectations, and opinions of management as of the date of this press release, and other than as required by applicable securities laws, the Company does not assume any obligation to update forward-looking statements and information if circumstances or management’s assumptions, beliefs, expectations or opinions should change, or changes in any other events affecting such statements or information.</span>\n</p>\n\n\n\n<p>Copyright (c) 2024 TheNewswire - All rights reserved.</p>\n",
    "search_terms": "Toiyabe,Westward Gold Inc. ,WG",
    "master_gid": 2705,
    "date": "2024-06-04T13:00:00.000Z",
    "tags": "USA|Nevada||Gold|Project Acquisition",
    "image_id": null,
    "hidden": false,
    "company_id": 1857,
    "provider": "thenewswire",
    "excerpt": "Vancouver, British Columbia, June 4, 2024 –TheNewswire –Westward Gold Inc. (CSE: WG, OTCQB: WGLIF, FSE: IM50) (“Westward”or the“Company”) is pleased toannounce the acquisition of 202 unpatented mining claims, adjacent to and contiguous with its Turquoise Canyon and East Saddle Properties along the Cortez Gold Trend in Lander County, Nevada. The",
    "is_regulatory": false,
    "refined_tags": [],
    "ftp_filename": null,
    "company_name": "Westward Gold Inc.",
    "exchange": "CSE",
    "root_ticker": "WG",
    "project_name": "Toiyabe",
    "gid": 2705,
    "location": null,
    "plan_id": null,
    "description_text": "Vancouver, British Columbia, June 4, 2024 – TheNewswire – Westward Gold Inc. (CSE: WG, OTCQB: WGLIF, FSE: IM50) ( “Westward” or the “Company” ) is pleased to announce the acquisition of 202 unpatented mining claims, adjacent to and contiguous with its Turquoise Canyon and East Saddle Properties along the Cortez Gold Trend in Lander County, Nevada. The claims (the “ES Extension” ) were acquired through open staking in April 2024, increasing the Company’s total footprint in the area to approximately 55 square kilometers, a significant increase of 43%. Westward continues to reinforce its status as the dominant exploration company in the area, and is ideally positioned to strategically apply district-scale exploration techniques to its sizeable property package. Moving forward, Westward’s consolidated flagship asset will be referred to as the Toiyabe Hills Project – the combination of several 100%-owned claim blocks acquired since the Company’s entrance into Nevada in April of 2021. Figure 1 below illustrates the systematic growth of Westward’s exploration ground, accomplished via a combination of corporate transactions and direct claim-staking. Colin Moore, President and CEO, commented: “In the span of three years, Westward has grown from a company with an option agreement on 165 claims – to one with 100% ownership of 776 claims across two consolidated land packages on each of the two most productive gold trends in Nevada. While we have been busy accumulating prospective exploration ground, we have also been persistent in attracting the vital technical talent necessary to unlock its discovery potential. Our expert team with multiple Carlin-type gold discoveries to their credit has been instrumental in guiding our growth story, and this most recent land acquisition will enable them to apply their skills with even greater impact.” Robert Edie, Vice President Exploration, noted: “Combining 2023 geochemical results with other available datasets revealed that key markers for Carlin-type mineralization on our property trend to the south and east. The additional ground acquired has the necessary scale – and prospective geologic setting – to host a potential major new discovery in its own right; it will form a key piece of our camp-scale land package. I’m excited to systematically evaluate this surprisingly underexplored ground on a major gold trend with data-driven regional exploration.” Figure 1: The Evolution of Westward’s Toiyabe Hills Property Click Image To View Full Size Figure 2: Addition of East Saddle Extension Click Image To View Full Size Note: Windows shown in Figure 2 indicate a total of three third-party claim inliers (two of which are in the ES Extension block). A confluence of several prospective geologic features pointed towards the strategic importance of acquiring the ES Extension ground – including stratigraphy, structure, geochemistry, and geophysics. The Hilltop Corridor, a structural feature based upon interpretations of the horizontal gradient of gravity, also contains elevated gold and Carlin pathfinder elements (notably, arsenic and antimony) in soils and rocks. This prospective corridor has two parallel features on the property; one is closely associated with the Courtney Zone – a known occurrence of gold mineralization where the large majority of historical drilling has been focused – the second is to the east on the newly-acquired ES Extension (see Figure 3 below). At surface, the ES Extension is made up of upper-plate siliciclastic units of the Vinini and Valmy Formations and an 850 m by 500 m exposure of lower-plate Wenban Formation (see Figure 3 below), one of the most important stratigraphic units for hosting gold in the region. Through drillhole re-logging efforts and interpretation of regional stratigraphy, Westward is highly confident that prospective host rocks lie beneath the upper-plate siliciclastic rocks across the ES Extension ground. There is a strong probability that the entire carbonate host section is intact beneath this cover, allowing the Company the opportunity to explore for mineralization that has not been thinned-out by erosion. Evidence for a reasonable depth to host rocks is supported by detailed Induced Polarization ( “IP” )–Resistivity profiles immediately north of the new ES Extension block, as interpreted by Mr. Jim Wright in December of 2021. IP lines clearly image the layering of conductive upper-plate strata lying upon more resistive lower-plate strata – and generally suggest depths of 50-150 m to lower-plate rocks immediately east of the Courtney Zone, increasing to 250-350 m near the eastern boundary of the property. A similar profile can be expected at the ES Extension moving eastward from the exposed carbonate Wenban Formation. This is an excellent depth range to fully preserve an intact Carlin gold system while allowing relatively easy exploration drilling. Figure 3: ES Extension – Stratigraphic, Structural, and Geophysical Evidence for Potential Gold Deposition Click Image To View Full Size Surface rock-chip and soil samples collected by Westward in late 2023 identified several trends of geochemical anomalies vectoring towards the newly-acquired ES Extension (refer to the Company’s press release dated May 7, 2024, for additional information) . Gold, arsenic, and antimony demonstrate a southeast pattern of zonation (see Figure 4 below). The pattern of strong arsenic-in-soils trending into strong antimony-in-soils indicates the potential for gold mineralization at a reasonable depth beneath upper-plate siliciclastic rocks. The Company will continue to advance these target concepts in 2024 by completing detailed Anaconda-style folio mapping, collecting surface rock and soil samples, and completing a detailed gravity survey on the new ground. Figure 4: ES Extension – Geochemical Evidence for Potential Gold Deposition Note: Left Image Heat Map Shows Arsenic-in-Soils / Right Image Heat Map Shows Antimony-in-Soils Click Image To View Full Size 2024 Field Season Update 1:5000 scale Anaconda-style folio mapping of the Toiyabe Hills Project is currently underway, building upon past mapping which was largely centered around the Courtney Zone. The initial focus areas are the Hilltop Corridor and the ES Extension – the program is being led by Technical Advisor Steven Koehler and VP Exploration Robert Edie, with ambitions to cover the vast majority of the Westward ground. High-quality surface mapping will represent a key input in emerging priority drill targets, and additional details and findings will be released to the market as the field season progresses. Qualified Person The technical information contained in this news release was reviewed and approved by Robert Edie, Vice President Exploration of the Company, who is a Qualified Person under National Instrument 43-101 – Standards of Disclosure for Mineral Projects. Mr. Edie is a Certified Professional Geologist (CPG) through the American Institute of Professional Geologists (AIPG). About Westward Gold Westward Gold is a mineral exploration company focused on developing the Toiyabe Hills Project located in the Cortez Hills area of Lander County, Nevada, and the Coyote and Rossi Projects located along the Carlin Trend in Elko County, Nevada. From time to time, the Company may also evaluate the acquisition of other mineral exploration assets and opportunities. For further information contact: Andrew Nelson Chief Financial Officer Westward Gold Inc. +1 (604) 828-7027 andrew@westwardgold.com www.westwardgold.com The Canadian Securities Exchange has neither approved nor disapproved the contents of this news release. The Canadian Securities Exchange does not accept responsibility for the adequacy or accuracy of this news release. This news release contains or incorporates by reference “forward-looking statements” and “forward-looking information” as defined under applicable Canadian securities legislation. All statements, other than statements of historical fact, which address events, results, outcomes, or developments that the Company expects to occur are, or may be deemed, to be, forward-looking statements. Forward-looking statements are generally, but not always, identified by the use of forward-looking terminology such as \"expect\", \"believe\", \"anticipate\", \"intend\", \"estimate”, “potential”, “on track”, “forecast\", \"budget\", “target”, “outlook”, “continue”, “plan” or variations of such words and phrases and similar expressions or statements that certain actions, events or results “may”, “could”, “would”, “might” or “will” be taken, occur or be achieved or the negative connotation of such terms. Such statements include, but may not be limited to, information as to strategy, plans or future financial or operating performance, such as the Company’s expansion plans, project timelines, expected drilling targets, and other statements that express management’s expectations or estimates of future plans and performance. Forward-looking statements or information are subject to a variety of known and unknown risks, uncertainties and other factors that could cause actual events or results to differ from those reflected in the forward-looking statements or information, including, without limitation, the need for additional capital by the Company through financings, and the risk that such funds may not be raised; the speculative nature of exploration and the stages of the Company’s properties; the effect of changes in commodity prices; regulatory risks that development of the Company’s material properties will not be acceptable for social, environmental or other reasons, availability of equipment (including drills) and personnel to carry out work programs, that each stage of work will be completed within expected time frames, that current geological models and interpretations prove correct, the results of ongoing work programs may lead to a change of exploration priorities, and the efforts and abilities of the senior management team. This list is not exhaustive of the factors that may affect any of the Company’s forward-looking statements or information. These and other factors may cause the Company to change its exploration and work programs, not proceed with work programs, or change the timing or order of planned work programs. Additional risk factors and details with respect to risk factors that may affect the Company’s ability to achieve the expectations set forth in the forward-looking statements contained in this news release are set out in the Company’s latest management discussion and analysis under “Risks and Uncertainties”, which is available under the Company’s SEDAR+ profile at www.sedarplus.ca. Although the Company has attempted to identify important factors that could cause actual results to differ materially, there may be other factors that cause results not to be as anticipated, estimated, described or intended. Accordingly, readers should not place undue reliance on forward-looking statements or information. The Company’s forward-looking statements and information are based on the assumptions, beliefs, expectations, and opinions of management as of the date of this press release, and other than as required by applicable securities laws, the Company does not assume any obligation to update forward-looking statements and information if circumstances or management’s assumptions, beliefs, expectations or opinions should change, or changes in any other events affecting such statements or information. Copyright (c) 2024 TheNewswire - All rights reserved.",
    "primary_commodity": "Au"
  },
  "articleProject": {
    "gid": 2705,
    "project_name": "Toiyabe",
    "location": null
  },
  "articleExchange": "CSE",
  "articleCompanyId": 1857,
  "articleTicker": "WG",
  "articleCompanyName": "Westward Gold Inc. ",
  "allOtherCompanyProjects": [
    {
      "company_id": 1857,
      "gid": 2703,
      "project_name": "East Saddle",
      "location": "Nevada"
    },
    {
      "company_id": 1857,
      "gid": 2706,
      "project_name": "Turquoise Canyon",
      "location": "Nevada"
    },
    {
      "company_id": 1857,
      "gid": 3919,
      "project_name": "Coyote",
      "location": "Nevada, United States"
    },
    {
      "company_id": 1857,
      "gid": 3920,
      "project_name": "Rossi",
      "location": "Nevada, United States"
    },
    {
      "company_id": 1857,
      "gid": 2705,
      "project_name": "Toiyabe",
      "location": null
    }
  ],
  "allOtherCompanyNews": [
    {
      "id": 105924,
      "company_id": 1857,
      "title": "Westward Gold Breaks Ground at Campfire Target & Details Additional Exploration Activities at Toiyabe Hills",
      "link": "https://www.thenewswire.com/press-releases?id=1Bb4FRnJj",
      "date": "2025-05-27T13:00:00.000Z",
      "hidden": false
    },
    {
      "id": 104511,
      "company_id": 1857,
      "title": "Westward Gold Appoints Dr. Quinton Hennigh as Chairman of the Board of Directors",
      "link": "https://www.thenewswire.com/press-releases?id=1A0vFxxY6",
      "date": "2025-05-13T13:00:00.000Z",
      "hidden": false
    },
    {
      "id": 99131,
      "company_id": 1857,
      "title": "Westward Gold Announces Closing of Oversubscribed Non-Brokered Private Placement Financing; Strategic Investor Crescat Capital LLC Acquires 10.3% Stake",
      "link": "https://www.thenewswire.com/press-releases?id=1AD4FQZdR",
      "date": "2025-04-08T20:05:00.000Z",
      "hidden": false
    },
    {
      "id": 98639,
      "company_id": 1857,
      "title": "Westward Gold Announces Exercise of Crescat's Over-Allotment Option, Increasing Its Total Investment to C$1.5M",
      "link": "https://www.thenewswire.com/press-releases?id=1AMqFemnv",
      "date": "2025-04-03T13:00:00.000Z",
      "hidden": false
    },
    {
      "id": 92676,
      "company_id": 1857,
      "title": "Westward Gold Announces Upsizing of Crescat-Led Non-Brokered Private Placement Financing to C$3.6M",
      "link": "https://www.thenewswire.com/press-releases?id=1kZaFqPQ5",
      "date": "2025-03-26T20:50:00.000Z",
      "hidden": false
    },
    {
      "id": 91832,
      "company_id": 1857,
      "title": "Westward Gold Announces Non-Brokered Private Placement Financing with $1M Lead Order from Crescat Capital LLC",
      "link": "https://www.thenewswire.com/press-releases?id=1AqRF4QVp",
      "date": "2025-03-19T13:00:00.000Z",
      "hidden": false
    },
    {
      "id": 90656,
      "company_id": 1857,
      "title": "Westward Gold Welcomes Dr. John-Mark Staude as Newest Strategic Advisor",
      "link": "https://www.thenewswire.com/press-releases?id=1AD4FzMw5",
      "date": "2025-03-11T13:00:00.000Z",
      "hidden": false
    },
    {
      "id": 89490,
      "company_id": 1857,
      "title": "Westward Gold Outlines 2025 Exploration Program for the Toiyabe Hills Project, Cortez Trend, Nevada",
      "link": "https://www.thenewswire.com/press-releases?id=1k3wFlrd2",
      "date": "2025-02-27T14:00:00.000Z",
      "hidden": false
    },
    {
      "id": 84452,
      "company_id": 1857,
      "title": "Westward Gold Appoints Mr. J. Kelly Cluer to Board of Directors",
      "link": "https://www.thenewswire.com/press-releases?id=1k98F1Gq6",
      "date": "2025-01-17T14:00:00.000Z",
      "hidden": false
    },
    {
      "id": 84174,
      "company_id": 1857,
      "title": "Westward Gold Announces Expansion of Toiyabe Hills Property Footprint",
      "link": "https://www.thenewswire.com/press-releases?id=1k3wFlj06",
      "date": "2025-01-15T14:00:00.000Z",
      "hidden": false
    }
  ]
}