{
  "article": {
    "id": 42008,
    "link": "https://www.accesswire.com/viewarticle.aspx?id=790023&lang=en",
    "title": "Rover Metals Adds 2,400 Acres to Let’s Go Lithium Project, NV, USA",
    "description": "<p><strong>VANCOUVER, BC / ACCESSWIRE / October 5, 2023 / Rover Metals Corp. (TSXV:ROVR)(OTCQB:ROVMF)(FSE:4XO) </strong>(&quot;<strong>Rover</strong>&quot; or the &quot;<strong>Company</strong>&quot;) is pleased to announce that it has added 2,400 acres of new claims to its Let's Go Lithium (&quot;LGL&quot;) project, bringing the total project size to approximately 8,300 acres.</p><p><strong><u>LGL Project Expansion</u></strong></p><p>Management of the Company, working with McGinley and Associates, dba UES (&quot;UES&quot;), identified additional prospective ground contiguous to the existing claim block this summer. Further to the Company's <a href=\"https://pr.report/VlBONCmf\">news release of September 7, 2023</a>, Culter, and Ingraffia prospected and sampled the new claim area as part of this summer's expanded Phase 1 Exploration Program. Multiple hectorite-like clay outcrops and high-grade lithium surface samples were encountered in the staking area. The Company believes that the project expansion will take advantage of a deeper hydrologic water flow system in the area. Management will be including the new claims into its Plan of Operations submission to the Bureau of Land Management (&quot;BLM&quot;) which it plans to file in short order.</p><p><i>Judson Culter, CEO at Rover Metals, states, &quot;The addition of 2,400 acres to the LGL project gives us the flexibility of abandoning certain existing mining claims that border the ACEC boundary of Ash Meadows. We never intended to mine or develop near to Ash Meadows, and moving the core of the LGL project further away from Ash Meadows sends a clear message that Rover is committed to developing the project in a manner that is sustainable for the surrounding area. UES, are helping Rover to ensure that there will be no impact to the critical water tables in the Amargosa basin. Rover and UES have obtained a copy of the environmental assessment study that the neighbouring mine, operated by Lhoist North America, is operating under. Management at Rover feels confident that sustainable lithium mining can be supported in the Amargosa Valley.&quot;</i></p><p><strong><u>A Call for Battery Recycling Partnerships and Joint Ventures</u></strong></p><p>The eastern Amargosa Valley has been slated for solar farm energy development by the BLM. Solar energy, in addition to the existing hydro energy infrastructure in the area, allows for new development opportunities like EV raw materials battery recycling. Rover is seeking inbound requests to partner with recycling technology companies. Please contact <a href=\"mailto:info@rovermetals.com\">info@rovermetals.com</a> with inquiries. The LGL project is a one and half hour drive from the city of Las Vegas, one of the fastest growing cities in the U.S.</p><p><a href=\"https://pr.report/8GfvpN6o\"><strong>About Rover Metals</strong></a></p><p>Rover is a publicly traded junior mining company that trades on the TSXV under symbol ROVR, on the OTCQB under symbol ROVMF, and on the FSE under symbol 4XO. The Company has a diverse portfolio of mining resource development projects with varying exploration timelines. Its critical mineral projects include lithium, zinc, and copper. Its precious metals projects include gold and silver. The Company is exclusive to the mining jurisdictions of the U.S. and Canada.</p><p><strong>You can follow Rover on its social media channels:</strong></p><p>Twitter: <a href=\"https://pr.report/92xtizcd\">https://twitter.com/rovermetals</a><br />LinkedIn: <a href=\"https://pr.report/lC9yv-sf\">https://www.linkedin.com/company/rover-metals/</a><br />Facebook: <a href=\"https://pr.report/Y5FbaMIc\">https://www.facebook.com/RoverMetals/</a><br />for daily company updates and industry news, and<br />YouTube: <a href=\"https://pr.report/smyuhOkj\">https://www.youtube.com/channel/UCJsHsfag1GFyp4aLW5Ye-YQ?view_as=subscriber</a><br />for corporate videos.</p><p><strong>Website:</strong> <a href=\"https://pr.report/LOJle8oG\">https://www.rovermetals.com/</a></p><p><strong>ON BEHALF OF THE BOARD OF DIRECTORS</strong></p><p><i>&quot;Judson Culter&quot;</i><br />Chief Executive Officer and Director<br />For further information, please contact:</p><p>Email: <a href=\"mailto:info@rovermetals.com\">info@rovermetals.com</a><br />Phone: +1 (778) 754-2617</p><p><strong>Statement Regarding Forward-Looking Information</strong></p><p>This news release contains statements that constitute &quot;forward-looking statements.&quot; Such forward-looking statements involve known and unknown risks, uncertainties, and other factors that may cause Rover's actual results, performance, achievements, or developments in the industry to differ materially from the anticipated results, performance, or achievements expressed or implied by such forward-looking statements. Forward-looking statements are statements that are not historical facts and are generally, but not always, identified by the words &quot;expects,&quot; &quot;plans,&quot; &quot;anticipates,&quot; &quot;believes,&quot; &quot;intends,&quot; &quot;estimates,&quot; &quot;projects,&quot; &quot;potential&quot; and similar expressions, or that events or conditions &quot;will,&quot; &quot;would,&quot; &quot;may,&quot; &quot;could&quot; or &quot;should&quot; occur. There can be no assurance that such statements prove to be accurate. Actual results and future events could differ materially from those anticipated in such statements, and readers are cautioned not to place undue reliance on these forward-looking statements. Any factor could cause actual results to differ materially from Rover's expectations. Rover undertakes no obligation to update these forward-looking statements in the event that management's beliefs, estimates, opinions, or other factors, should change.</p><p><strong>THE FORWARD-LOOKING INFORMATION CONTAINED IN THIS NEWS RELEASE REPRESENTS THE EXPECTATIONS OF THE COMPANY AS OF THE DATE OF THIS NEWS RELEASE AND, ACCORDINGLY, IS SUBJECT TO CHANGE AFTER SUCH DATE. READERS SHOULD NOT PLACE UNDUE IMPORTANCE ON FORWARD-LOOKING INFORMATION AND SHOULD NOT RELY UPON THIS INFORMATION AS OF ANY OTHER DATE. WHILE THE COMPANY MAY ELECT TO, IT DOES NOT UNDERTAKE TO UPDATE THIS INFORMATION AT ANY PARTICULAR TIME EXCEPT AS REQUIRED IN ACCORDANCE WITH APPLICABLE LAWS.</strong></p><p><i><strong>NEITHER THE TSX VENTURE EXCHANGE NOR ITS REGULATION PROVIDER (AS THAT TERM IS DEFINED IN THE POLICIES OF THE TSX VENTURE EXCHANGE) ACCEPTS RESPONSIBILITY FOR THE ADEQUACY OF THIS RELEASE.</strong></i></p><p><strong>SOURCE: </strong>Rover Metals Corp.</p><br><br>View source version on accesswire.com: <br><a href='https://www.accesswire.com/790023/rover-metals-adds-2400-acres-to-lets-go-lithium-project-nv-usa'>https://www.accesswire.com/790023/rover-metals-adds-2400-acres-to-lets-go-lithium-project-nv-usa</a><br><br>",
    "search_terms": "LET'S GO LITHIUM,Rover Critical Metals Corp.,ROVR",
    "master_gid": 3823,
    "date": "2023-10-05T13:00:00.000Z",
    "tags": "|||Lithium|Project Acquisition",
    "image_id": null,
    "hidden": false,
    "company_id": 956,
    "provider": "accesswire",
    "excerpt": "VANCOUVER, BC / ACCESSWIRE / October 5, 2023 / Rover Metals Corp. (TSXV:ROVR)(OTCQB:ROVMF)(FSE:4XO)(&quot;Rover&quot; or the &quot;Company&quot;) is pleased to announce that it has added 2,400 acres of new claims to its Let's Go Lithium (&quot;LGL&quot;) project, bringing the total project size to approximately 8,300 acres.LGL Project ExpansionManagement of the Company,",
    "is_regulatory": false,
    "refined_tags": [
      "Project Acquisition"
    ],
    "ftp_filename": null,
    "company_name": "Rover Critical Metals Corp.",
    "exchange": "TSXV",
    "root_ticker": "ROVR",
    "project_name": "LET'S GO LITHIUM",
    "gid": 3823,
    "location": "Nevada, United States",
    "plan_id": null,
    "description_text": "VANCOUVER, BC / ACCESSWIRE / October 5, 2023 / Rover Metals Corp. (TSXV:ROVR)(OTCQB:ROVMF)(FSE:4XO) (\" Rover \" or the \" Company \") is pleased to announce that it has added 2,400 acres of new claims to its Let's Go Lithium (\"LGL\") project, bringing the total project size to approximately 8,300 acres. LGL Project Expansion Management of the Company, working with McGinley and Associates, dba UES (\"UES\"), identified additional prospective ground contiguous to the existing claim block this summer. Further to the Company's news release of September 7, 2023 , Culter, and Ingraffia prospected and sampled the new claim area as part of this summer's expanded Phase 1 Exploration Program. Multiple hectorite-like clay outcrops and high-grade lithium surface samples were encountered in the staking area. The Company believes that the project expansion will take advantage of a deeper hydrologic water flow system in the area. Management will be including the new claims into its Plan of Operations submission to the Bureau of Land Management (\"BLM\") which it plans to file in short order. Judson Culter, CEO at Rover Metals, states, \"The addition of 2,400 acres to the LGL project gives us the flexibility of abandoning certain existing mining claims that border the ACEC boundary of Ash Meadows. We never intended to mine or develop near to Ash Meadows, and moving the core of the LGL project further away from Ash Meadows sends a clear message that Rover is committed to developing the project in a manner that is sustainable for the surrounding area. UES, are helping Rover to ensure that there will be no impact to the critical water tables in the Amargosa basin. Rover and UES have obtained a copy of the environmental assessment study that the neighbouring mine, operated by Lhoist North America, is operating under. Management at Rover feels confident that sustainable lithium mining can be supported in the Amargosa Valley.\" A Call for Battery Recycling Partnerships and Joint Ventures The eastern Amargosa Valley has been slated for solar farm energy development by the BLM. Solar energy, in addition to the existing hydro energy infrastructure in the area, allows for new development opportunities like EV raw materials battery recycling. Rover is seeking inbound requests to partner with recycling technology companies. Please contact info@rovermetals.com with inquiries. The LGL project is a one and half hour drive from the city of Las Vegas, one of the fastest growing cities in the U.S. About Rover Metals Rover is a publicly traded junior mining company that trades on the TSXV under symbol ROVR, on the OTCQB under symbol ROVMF, and on the FSE under symbol 4XO. The Company has a diverse portfolio of mining resource development projects with varying exploration timelines. Its critical mineral projects include lithium, zinc, and copper. Its precious metals projects include gold and silver. The Company is exclusive to the mining jurisdictions of the U.S. and Canada. You can follow Rover on its social media channels: Twitter: https://twitter.com/rovermetals LinkedIn: https://www.linkedin.com/company/rover-metals/ Facebook: https://www.facebook.com/RoverMetals/ for daily company updates and industry news, and YouTube: https://www.youtube.com/channel/UCJsHsfag1GFyp4aLW5Ye-YQ?view_as=subscriber for corporate videos. Website: https://www.rovermetals.com/ ON BEHALF OF THE BOARD OF DIRECTORS \"Judson Culter\" Chief Executive Officer and Director For further information, please contact: Email: info@rovermetals.com Phone: +1 (778) 754-2617 Statement Regarding Forward-Looking Information This news release contains statements that constitute \"forward-looking statements.\" Such forward-looking statements involve known and unknown risks, uncertainties, and other factors that may cause Rover's actual results, performance, achievements, or developments in the industry to differ materially from the anticipated results, performance, or achievements expressed or implied by such forward-looking statements. Forward-looking statements are statements that are not historical facts and are generally, but not always, identified by the words \"expects,\" \"plans,\" \"anticipates,\" \"believes,\" \"intends,\" \"estimates,\" \"projects,\" \"potential\" and similar expressions, or that events or conditions \"will,\" \"would,\" \"may,\" \"could\" or \"should\" occur. There can be no assurance that such statements prove to be accurate. Actual results and future events could differ materially from those anticipated in such statements, and readers are cautioned not to place undue reliance on these forward-looking statements. Any factor could cause actual results to differ materially from Rover's expectations. Rover undertakes no obligation to update these forward-looking statements in the event that management's beliefs, estimates, opinions, or other factors, should change. THE FORWARD-LOOKING INFORMATION CONTAINED IN THIS NEWS RELEASE REPRESENTS THE EXPECTATIONS OF THE COMPANY AS OF THE DATE OF THIS NEWS RELEASE AND, ACCORDINGLY, IS SUBJECT TO CHANGE AFTER SUCH DATE. READERS SHOULD NOT PLACE UNDUE IMPORTANCE ON FORWARD-LOOKING INFORMATION AND SHOULD NOT RELY UPON THIS INFORMATION AS OF ANY OTHER DATE. WHILE THE COMPANY MAY ELECT TO, IT DOES NOT UNDERTAKE TO UPDATE THIS INFORMATION AT ANY PARTICULAR TIME EXCEPT AS REQUIRED IN ACCORDANCE WITH APPLICABLE LAWS. NEITHER THE TSX VENTURE EXCHANGE NOR ITS REGULATION PROVIDER (AS THAT TERM IS DEFINED IN THE POLICIES OF THE TSX VENTURE EXCHANGE) ACCEPTS RESPONSIBILITY FOR THE ADEQUACY OF THIS RELEASE. SOURCE: Rover Metals Corp. View source version on accesswire.com: https://www.accesswire.com/790023/rover-metals-adds-2400-acres-to-lets-go-lithium-project-nv-usa",
    "primary_commodity": "Li"
  },
  "articleProject": {
    "gid": 3823,
    "project_name": "LET'S GO LITHIUM",
    "location": "Nevada, United States"
  },
  "articleExchange": "TSXV",
  "articleCompanyId": 956,
  "articleTicker": "ROVR",
  "articleCompanyName": "Rover Critical Metals Corp.",
  "allOtherCompanyProjects": [
    {
      "company_id": 956,
      "gid": 3823,
      "project_name": "LET'S GO LITHIUM",
      "location": "Nevada, United States"
    },
    {
      "company_id": 956,
      "gid": 2245,
      "project_name": "Cabin Lake",
      "location": "Northwest Territories, Canada"
    }
  ],
  "allOtherCompanyNews": [
    {
      "id": -194818,
      "company_id": 956,
      "title": "ROVER PROVIDES ADDITIONAL DISCLOSURE ON PIRENOPOLIS GOLD PROJECT ACQUISITION",
      "link": "https://app.quotemedia.com/data/downloadFiling?webmasterId=104408&ref=67fd567a30e9fa754c6fee73&type=PDFC&formType=002-002-001089-003001&formDescription=News+release&dateFiled=2025-04-14",
      "date": "2025-04-14T11:39:54.000Z",
      "hidden": false
    },
    {
      "id": -194820,
      "company_id": 956,
      "title": "ROVER ANNOUNCES SHARE CONSOLIDATION EFFECTIVE DATE",
      "link": "https://app.quotemedia.com/data/downloadFiling?webmasterId=104408&ref=67f82c7b3dbd68058961b8b2&type=PDFC&formType=002-002-001089-003001&formDescription=News+release&dateFiled=2025-04-10",
      "date": "2025-04-10T13:39:23.000Z",
      "hidden": false
    },
    {
      "id": -194819,
      "company_id": 956,
      "title": "ROVER RECEIVES EXCHANGE APPROVAL FOR PIRENOPOLIS GOLD PROJECT, BRAZIL",
      "link": "https://app.quotemedia.com/data/downloadFiling?webmasterId=104408&ref=67f82c7b3dbd68058961b8b1&type=PDFC&formType=002-002-001089-003001&formDescription=News+release&dateFiled=2025-04-10",
      "date": "2025-04-10T13:39:23.000Z",
      "hidden": false
    },
    {
      "id": -194821,
      "company_id": 956,
      "title": "ROVER SIGNS AGREEMENT TO OPTION THE PIRENOPOLIS GOLD PROJECT, BRAZIL, AND PROPOSES CONSOLIDATION OF SHARE CAPITAL",
      "link": "https://app.quotemedia.com/data/downloadFiling?webmasterId=104408&ref=67c103a938936f4792311b4d&type=PDFC&formType=002-002-001089-003001&formDescription=News+release&dateFiled=2025-02-27",
      "date": "2025-02-27T16:30:33.000Z",
      "hidden": false
    },
    {
      "id": -194822,
      "company_id": 956,
      "title": "ROVER RENEGOTIATES LGL PROPERTY OPTION AGREEMENT",
      "link": "https://app.quotemedia.com/data/downloadFiling?webmasterId=104408&ref=66c8bfc51b9aac02316f63f7&type=PDFC&formType=002-002-001089-003001&formDescription=News+release&dateFiled=2024-08-23",
      "date": "2024-08-23T09:58:45.000Z",
      "hidden": false
    },
    {
      "id": 66529,
      "company_id": 956,
      "title": "Rover Announces $0.03 Unit Financing",
      "link": "https://www.accesswire.com/viewarticle.aspx?id=893444&lang=en",
      "date": "2024-07-29T13:00:00.000Z",
      "hidden": false
    },
    {
      "id": -194823,
      "company_id": 956,
      "title": "Rover Critical Minerals Signs LOI to Acquire High Purity Silica Asset with Average 99.6% SiO2 in Golden, British Columbia",
      "link": "https://app.quotemedia.com/data/downloadFiling?webmasterId=104408&ref=66a13a2b2e76d60b52772195&type=PDFC&formType=002-002-001089-003001&formDescription=News+release&dateFiled=2024-07-24",
      "date": "2024-07-24T10:30:19.000Z",
      "hidden": false
    },
    {
      "id": -194824,
      "company_id": 956,
      "title": "ROVER EXTENDS CLOSING OF $0.03 UNIT FINANCING",
      "link": "https://app.quotemedia.com/data/downloadFiling?webmasterId=104408&ref=6685d31bba9e0247907eab5b&type=PDFC&formType=002-002-001089-003001&formDescription=News+release&dateFiled=2024-07-03",
      "date": "2024-07-03T15:39:23.000Z",
      "hidden": false
    },
    {
      "id": -194825,
      "company_id": 956,
      "title": "Gunnar Pedersen files Early Warning Report for Rover Critical Minerals Corp.",
      "link": "https://app.quotemedia.com/data/downloadFiling?webmasterId=104408&ref=664e7137dba2b717c163e460&type=PDFC&formType=002-002-001089-003001&formDescription=News+release&dateFiled=2024-05-22",
      "date": "2024-05-22T15:27:03.000Z",
      "hidden": false
    },
    {
      "id": -194826,
      "company_id": 956,
      "title": "Rover Announces and Closes $0.03 Unit Financing",
      "link": "https://app.quotemedia.com/data/downloadFiling?webmasterId=104408&ref=66451362e07c2c700776e5f5&type=PDFC&formType=002-002-001089-003001&formDescription=News+release&dateFiled=2024-05-15",
      "date": "2024-05-15T12:56:18.000Z",
      "hidden": false
    }
  ]
}
