{
  "article": {
    "id": 46378,
    "link": "https://contentapi.cision.com/api/v1.0/releases/20231222C3752",
    "title": "Getchell Gold Corp. Announces Raising Sufficient Funds to Make the Final Earn-In Option Payment to Acquire 100% of the Fondaway Canyon Gold Project, NV",
    "description": "\n\n<p><span class=\"legendSpanClass\"><span class=\"xn-location\">VANCOUVER, BC</span></span>, <span class=\"legendSpanClass\"><span class=\"xn-chron\">Dec. 22, 2023</span></span> /CNW/ - <b>Getchell Gold Corp. </b>(CSE: GTCH) (OTCQB: GGLDF) (FWB: GGA1)<b> (\"Getchell\" or the \"Company\")</b> is pleased to announce that the Company has received sufficient funds through its ongoing debenture financing (the \"<b>Debenture Financing</b>\") to execute on the final <span class=\"xn-money\">USD 1.6 million</span> earn-in option payment to acquire a 100% interest in the Fondaway Canyon and <span class=\"xn-person\">Dixie Comstock</span> gold properties located in <span class=\"xn-location\">Nevada</span>.</p>\n\n    <div class=\"PRN_ImbeddedAssetReference\" id=\"DivAssetPlaceHolder1\">\n                <p>\n                        <a href=\"https://mma.prnewswire.com/media/2306704/Getchell_Gold_Corp__Getchell_Gold_Corp__Announces_Raising_Suffic.html\" rel=\"nofollow\" target=\"_blank\">\n                    <img alt=\"Getchell Gold Corp. logo (CNW Group/Getchell Gold Corp.)\" src=\"https://mma.prnewswire.com/media/2306704/Getchell_Gold_Corp__Getchell_Gold_Corp__Announces_Raising_Suffic.jpg\" title=\"Getchell Gold Corp. logo (CNW Group/Getchell Gold Corp.)\"></img>\n                        </a>\n                </p>\n\n    </div>\n<p>\"Completing the acquisition of the Fondaway Canyon gold project will undoubtably be a milestone event, marking a key inflection point in the trajectory of the Company.\" <span class=\"xn-person\">Bill Wagener</span>, Chairman and CEO, commented. \"A 100% acquisition of a large developing open-ended at-surface gold deposit in <span class=\"xn-location\">Nevada</span> will deliver a major impetus for the Company going into the new year, especially as we head into a highly supportive and burgeoning gold market.\"</p>\n<p>The Debenture Financing, as announced on <span class=\"xn-chron\">Nov. 27, 2023</span>, remains ongoing and open for subscription to maximum proceeds of CA$5 million. Proceeds received in excess of <span class=\"xn-money\">US$1.6 million</span> will be used to conduct further exploration work on the Fondaway Canyon gold project and for general working capital.</p>\n<p>Under the terms of the option agreement (the \"<b>Agreement</b>\") with Canagold Resources Ltd. (\"<b>Canagold</b>\") executed on <span class=\"xn-chron\">January 3, 2020</span>, the Company has the option to acquire 100% of the Fondaway Canyon and <span class=\"xn-person\">Dixie Comstock</span>, properties by paying Canagold a total of <span class=\"xn-money\">US$2 million</span> in cash and <span class=\"xn-money\">US$2 million</span> in the Company's shares staged over 4 years. The Company also has work commitments totaling <span class=\"xn-money\">US$1.45 million</span> over the four years which have been fully satisfied.</p>\n<p>In the preceding three anniversary payments, the Company has paid a total of <span class=\"xn-money\">US$400,000</span> in cash and <span class=\"xn-money\">US$1 million</span> in the Company's shares with the outstanding balance, required to complete the acquisition, of <span class=\"xn-money\">US$1.6 million</span> in cash and <span class=\"xn-money\">US$1 million</span> in the Company's shares due on or before the fourth anniversary date.</p>\n<p>The Company is preparing the final cash payment and share issuance to be fulfilled prior to year-end.</p>\n<div aria-level=\"3\" class=\"wcag-arialevel-3\" role=\"heading\" style=\"display: block; font-size: 1.17em; margin-block-start: 1em; margin-block-end: 1em; margin-inline-start: 0px; margin-inline-end: 0px; font-weight: bold;\"><b>Fondaway Canyon Gold Project</b></div><p>Getchell Gold Corp. is delineating a potential Tier-1 gold resource at its flagship Fondaway Canyon gold project in <span class=\"xn-location\">Nevada, USA</span>.</p>\n<p>Following three consecutive successful drilling programs, the Company has effectively doubled the size of the historic resource, firmly placing Fondaway Canyon amongst the foremost developing projects in a world class mining jurisdiction.  The Company recently published its first Mineral Resource Estimate (\"<b>MRE</b>\") at Fondaway Canyon (Company news release dated <span class=\"xn-chron\">February 1, 2023</span>):</p>\n<ul type=\"disc\"><li>Gold mineralization is at and near surface supporting an Open Pit mine model;</li><li>Inferred Mineral Resource of 38.3 million tonnes at an average grade of 1.23 g/t Au for <b>1,509,100 ounces of gold</b>;</li><li>Indicated Mineral Resource of 11.0 million tonnes at an average grade of 1.56 g/t Au for an additional <b>550,800 ounces of gold</b>;</li><li>Strong gold mineralization in the most peripheral drill holes leaves the mineral resources open in most directions for further expansion and indicates a substantially larger body of mineralization than delineated to date (Company news release dated <span class=\"xn-chron\">August 9, 2023</span>); and</li><li>Fully permitted drill program designed to expand the mineral resources and upgrade Inferred Resources to Indicated.</li></ul><p>Getchell Gold Corp. is well positioned to continue expanding the Mineral Resource Estimate and advancing towards a Preliminary Economic Assessment.</p>\n<p>Notes on the Mineral Resource Estimate:</p>\n<ol type=\"1\"><li>Mineral Resources are not Mineral Reserves and have not demonstrated economic viability. There has been insufficient exploration to define the Inferred Resource as Indicated or Measured Mineral Resources, however, it is reasonable to expect that the majority of the Inferred Mineral Resource could be upgraded to Indicated Mineral Resources with continued exploration.  There is no guarantee that any part of the mineral resources discussed herein will be converted into a mineral reserve in the future. The estimate of Mineral Resources may be materially affected by environmental, permitting, legal, marketing, or other relevant issues. The Mineral Resources in this report were estimated using the Canadian Institute of Mining, Metallurgy and Petroleum (\"CIM\") standards on mineral resources and reserves, definitions, and guidelines prepared by the CIM standing committee on reserve definitions and adopted by the CIM council (CIM 2014 and 2019).</li><li>The effective date of the Mineral Resource Estimate is <span class=\"xn-chron\">December 12, 2022</span>, and a technical report on the Fondaway Canyon project titled \"Technical Report Mineral Resource Estimate Fondaway Canyon Project, <span class=\"xn-location\">Nevada, USA</span>\" was filed by the Company on SEDAR+ on <span class=\"xn-chron\">February 1, 2023</span>.</li><li>The independent and qualified person for the MRE, as defined by National Instrument 43-101, is <span class=\"xn-person\">Michael Dufresne</span>, P.Geo., from APEX Geoscience Ltd.</li></ol><div aria-level=\"3\" class=\"wcag-arialevel-3\" role=\"heading\" style=\"display: block; font-size: 1.17em; margin-block-start: 1em; margin-block-end: 1em; margin-inline-start: 0px; margin-inline-end: 0px; font-weight: bold;\"><b>Supplemental Financing Increased</b></div><p>Further to the Company's announcement dated <span class=\"xn-chron\">Nov. 30</span> and <span class=\"xn-chron\">Dec. 8, 2023</span>, and due to elevated demand, the amount of the Financing has been increased, while all other terms remain unchanged.  The Financing will consist of up to 5 million units at a price of <span class=\"xn-money\">10 cents</span> per unit, for gross proceeds of up to <span class=\"xn-money\">$500,000</span>.</p>\n<p>Closing of the Financing is subject to receipt of all necessary corporate and regulatory approvals, including acceptance by the Canadian Securities Exchange. The securities issued pursuant to the financing will be subject to a statutory four-month hold period in accordance with applicable securities laws.</p>\n<p>The securities offered in the Financing and the Debenture Financing have not been and will not be registered under the United States Securities Act of 1933, as amended, and may not be offered or sold in <span class=\"xn-location\">the United States</span> absent registration or applicable exemption from the registration requirements.</p>\n<div aria-level=\"3\" class=\"wcag-arialevel-3\" role=\"heading\" style=\"display: block; font-size: 1.17em; margin-block-start: 1em; margin-block-end: 1em; margin-inline-start: 0px; margin-inline-end: 0px; font-weight: bold;\"><b>About Getchell Gold Corp.</b></div><p>The Company is a <span class=\"xn-location\">Nevada</span> focused gold and copper exploration company trading on the CSE: GTCH, OTCQB: GGLDF, and FWB: GGA1. <span class=\"xn-person\">Getchell Gold</span> is primarily directing its efforts on its most advanced stage asset, Fondaway Canyon, a past gold producer with a large mineral resource estimate. Complementing Getchell's asset portfolio is <span class=\"xn-person\">Dixie Comstock</span>, a past gold producer with a historic resource and two earlier stage exploration projects, Star (Cu-Au-Ag) and Hot Springs Peak (Au).  Getchell has the option to acquire 100% of the Fondaway Canyon and <span class=\"xn-person\">Dixie Comstock</span> properties, <span class=\"xn-location\">Churchill County, Nevada</span>.</p>\n<p>For further information please visit the Company's website at <u><a href=\"https://c212.net/c/link/?t=0&amp;l=en&amp;o=4056634-1&amp;h=3443896996&amp;u=http%3A%2F%2Fwww.getchellgold.com%2F&amp;a=www.getchellgold.com\" rel=\"nofollow\" target=\"_blank\">www.getchellgold.com</a></u> or contact the Company at <u><a href=\"mailto:info@getchellgold.com\" rel=\"nofollow\" target=\"_blank\">info@getchellgold.com</a></u>.</p>\n<p><i>The Canadian Securities Exchange has not reviewed this press release and does not accept responsibility for the adequacy or accuracy of this news release.  </i></p>\n<p><i>Certain information contained herein constitutes \"forward-looking information\" under Canadian securities legislation. Forward-looking information includes, but is not limited to, statements with respect to the launching and completion of the Debenture Financing and Financing, the terms of the Debenture Financing and Financing, the issuance and vesting of Warrants, payment of finder's fees in connection with the Debenture Financing and Financing, receipt of all applicable regulatory approval of the Debenture Financing and Financing, the use of proceeds, and timing for the amended proxy materials for the Annual General and Special Meeting.  Generally, forward-looking information can be identified by the use of forward-looking terminology such as \"will\" or variations of such words and phrases or statements that certain actions, events or results \"will\" occur.  Forward-looking statements are based on the opinions and estimates of management as of the date such statements are made and they are subject to known and unknown risks, uncertainties and other factors that may cause the actual results to be materially different from those expressed or implied by such forward-looking statements or forward-looking information. Although management of Getchell have attempted to identify important factors that could cause actual results to differ materially from those contained in forward-looking statements or forward-looking information, there may be other factors that cause results not to be as anticipated, estimated or intended. There can be no assurance that such statements will prove to be accurate, as actual results and future events could differ materially from those anticipated in such statements.  Accordingly, readers should not place undue reliance on forward-looking statements and forward-looking information. The Company will not update any forward-looking statements or forward-looking information that are incorporated by reference herein, except as required by applicable securities laws.</i></p>\n<p> </p>\n<p>SOURCE  Getchell Gold Corp.</p>\n<img alt=\"\" src=\"https://rt.newswire.ca/rt.gif?NewsItemId=C3752&amp;Transmission_Id=202312220001CANADANWCANADAPR_C3752&amp;DateId=20231222\" style=\"border:0px; width:1px; height:1px;\"></img>\n\n",
    "search_terms": "Fondaway Canyon,Getchell Gold Corp.,GTCH",
    "master_gid": 1010,
    "date": "2023-12-22T05:01:00.000Z",
    "tags": "USA|Nevada||Gold|Financing,Project Acquisition",
    "image_id": null,
    "hidden": false,
    "company_id": 110,
    "provider": null,
    "excerpt": "VANCOUVER, BC,Dec. 22, 2023/CNW/ -Getchell Gold Corp.(CSE: GTCH) (OTCQB: GGLDF) (FWB: GGA1)(\"Getchell\" or the \"Company\") is pleased to announce that the Company has received sufficient funds through its ongoing debenture financing (the \"Debenture Financing\") to execute on the finalUSD 1.6 millionearn-in option payment to acquire a 100% interest in the Fondaway",
    "is_regulatory": false,
    "refined_tags": [
      "Project Acquisition",
      "Financing"
    ],
    "ftp_filename": null,
    "company_name": "Getchell Gold Corp.",
    "exchange": "CSE",
    "root_ticker": "GTCH",
    "project_name": "Fondaway Canyon",
    "gid": 1010,
    "location": "Nevada, USA",
    "plan_id": null,
    "description_text": "VANCOUVER, BC , Dec. 22, 2023 /CNW/ - Getchell Gold Corp. (CSE: GTCH) (OTCQB: GGLDF) (FWB: GGA1) (\"Getchell\" or the \"Company\") is pleased to announce that the Company has received sufficient funds through its ongoing debenture financing (the \" Debenture Financing \") to execute on the final USD 1.6 million earn-in option payment to acquire a 100% interest in the Fondaway Canyon and Dixie Comstock gold properties located in Nevada . \"Completing the acquisition of the Fondaway Canyon gold project will undoubtably be a milestone event, marking a key inflection point in the trajectory of the Company.\" Bill Wagener , Chairman and CEO, commented. \"A 100% acquisition of a large developing open-ended at-surface gold deposit in Nevada will deliver a major impetus for the Company going into the new year, especially as we head into a highly supportive and burgeoning gold market.\" The Debenture Financing, as announced on Nov. 27, 2023 , remains ongoing and open for subscription to maximum proceeds of CA$5 million. Proceeds received in excess of US$1.6 million will be used to conduct further exploration work on the Fondaway Canyon gold project and for general working capital. Under the terms of the option agreement (the \" Agreement \") with Canagold Resources Ltd. (\" Canagold \") executed on January 3, 2020 , the Company has the option to acquire 100% of the Fondaway Canyon and Dixie Comstock , properties by paying Canagold a total of US$2 million in cash and US$2 million in the Company's shares staged over 4 years. The Company also has work commitments totaling US$1.45 million over the four years which have been fully satisfied. In the preceding three anniversary payments, the Company has paid a total of US$400,000 in cash and US$1 million in the Company's shares with the outstanding balance, required to complete the acquisition, of US$1.6 million in cash and US$1 million in the Company's shares due on or before the fourth anniversary date. The Company is preparing the final cash payment and share issuance to be fulfilled prior to year-end. Fondaway Canyon Gold Project Getchell Gold Corp. is delineating a potential Tier-1 gold resource at its flagship Fondaway Canyon gold project in Nevada, USA . Following three consecutive successful drilling programs, the Company has effectively doubled the size of the historic resource, firmly placing Fondaway Canyon amongst the foremost developing projects in a world class mining jurisdiction.  The Company recently published its first Mineral Resource Estimate (\" MRE \") at Fondaway Canyon (Company news release dated February 1, 2023 ): Gold mineralization is at and near surface supporting an Open Pit mine model; Inferred Mineral Resource of 38.3 million tonnes at an average grade of 1.23 g/t Au for 1,509,100 ounces of gold ; Indicated Mineral Resource of 11.0 million tonnes at an average grade of 1.56 g/t Au for an additional 550,800 ounces of gold ; Strong gold mineralization in the most peripheral drill holes leaves the mineral resources open in most directions for further expansion and indicates a substantially larger body of mineralization than delineated to date (Company news release dated August 9, 2023 ); and Fully permitted drill program designed to expand the mineral resources and upgrade Inferred Resources to Indicated. Getchell Gold Corp. is well positioned to continue expanding the Mineral Resource Estimate and advancing towards a Preliminary Economic Assessment. Notes on the Mineral Resource Estimate: Mineral Resources are not Mineral Reserves and have not demonstrated economic viability. There has been insufficient exploration to define the Inferred Resource as Indicated or Measured Mineral Resources, however, it is reasonable to expect that the majority of the Inferred Mineral Resource could be upgraded to Indicated Mineral Resources with continued exploration.  There is no guarantee that any part of the mineral resources discussed herein will be converted into a mineral reserve in the future. The estimate of Mineral Resources may be materially affected by environmental, permitting, legal, marketing, or other relevant issues. The Mineral Resources in this report were estimated using the Canadian Institute of Mining, Metallurgy and Petroleum (\"CIM\") standards on mineral resources and reserves, definitions, and guidelines prepared by the CIM standing committee on reserve definitions and adopted by the CIM council (CIM 2014 and 2019). The effective date of the Mineral Resource Estimate is December 12, 2022 , and a technical report on the Fondaway Canyon project titled \"Technical Report Mineral Resource Estimate Fondaway Canyon Project, Nevada, USA \" was filed by the Company on SEDAR+ on February 1, 2023 . The independent and qualified person for the MRE, as defined by National Instrument 43-101, is Michael Dufresne , P.Geo., from APEX Geoscience Ltd. Supplemental Financing Increased Further to the Company's announcement dated Nov. 30 and Dec. 8, 2023 , and due to elevated demand, the amount of the Financing has been increased, while all other terms remain unchanged.  The Financing will consist of up to 5 million units at a price of 10 cents per unit, for gross proceeds of up to $500,000 . Closing of the Financing is subject to receipt of all necessary corporate and regulatory approvals, including acceptance by the Canadian Securities Exchange. The securities issued pursuant to the financing will be subject to a statutory four-month hold period in accordance with applicable securities laws. The securities offered in the Financing and the Debenture Financing have not been and will not be registered under the United States Securities Act of 1933, as amended, and may not be offered or sold in the United States absent registration or applicable exemption from the registration requirements. About Getchell Gold Corp. The Company is a Nevada focused gold and copper exploration company trading on the CSE: GTCH, OTCQB: GGLDF, and FWB: GGA1. Getchell Gold is primarily directing its efforts on its most advanced stage asset, Fondaway Canyon, a past gold producer with a large mineral resource estimate. Complementing Getchell's asset portfolio is Dixie Comstock , a past gold producer with a historic resource and two earlier stage exploration projects, Star (Cu-Au-Ag) and Hot Springs Peak (Au).  Getchell has the option to acquire 100% of the Fondaway Canyon and Dixie Comstock properties, Churchill County, Nevada . For further information please visit the Company's website at www.getchellgold.com or contact the Company at info@getchellgold.com . The Canadian Securities Exchange has not reviewed this press release and does not accept responsibility for the adequacy or accuracy of this news release. Certain information contained herein constitutes \"forward-looking information\" under Canadian securities legislation. Forward-looking information includes, but is not limited to, statements with respect to the launching and completion of the Debenture Financing and Financing, the terms of the Debenture Financing and Financing, the issuance and vesting of Warrants, payment of finder's fees in connection with the Debenture Financing and Financing, receipt of all applicable regulatory approval of the Debenture Financing and Financing, the use of proceeds, and timing for the amended proxy materials for the Annual General and Special Meeting.  Generally, forward-looking information can be identified by the use of forward-looking terminology such as \"will\" or variations of such words and phrases or statements that certain actions, events or results \"will\" occur.  Forward-looking statements are based on the opinions and estimates of management as of the date such statements are made and they are subject to known and unknown risks, uncertainties and other factors that may cause the actual results to be materially different from those expressed or implied by such forward-looking statements or forward-looking information. Although management of Getchell have attempted to identify important factors that could cause actual results to differ materially from those contained in forward-looking statements or forward-looking information, there may be other factors that cause results not to be as anticipated, estimated or intended. There can be no assurance that such statements will prove to be accurate, as actual results and future events could differ materially from those anticipated in such statements.  Accordingly, readers should not place undue reliance on forward-looking statements and forward-looking information. The Company will not update any forward-looking statements or forward-looking information that are incorporated by reference herein, except as required by applicable securities laws. SOURCE  Getchell Gold Corp.",
    "primary_commodity": "Au"
  },
  "articleProject": {
    "gid": 1010,
    "project_name": "Fondaway Canyon",
    "location": "Nevada, USA"
  },
  "articleExchange": "CSE",
  "articleCompanyId": 110,
  "articleTicker": "GTCH",
  "articleCompanyName": "Getchell Gold Corp.",
  "allOtherCompanyProjects": [
    {
      "company_id": 110,
      "gid": 3012,
      "project_name": "Star",
      "location": "Nevada, United States"
    },
    {
      "company_id": 110,
      "gid": 1010,
      "project_name": "Fondaway Canyon",
      "location": "Nevada, USA"
    },
    {
      "company_id": 110,
      "gid": 5213,
      "project_name": "Dixie Comstock",
      "location": "Nevada, United States"
    }
  ],
  "allOtherCompanyNews": [
    {
      "id": 108120,
      "company_id": 110,
      "title": "GETCHELL GOLD CORP. ANNOUNCES CLOSING OF UPSIZED $4 MILLION FINANCING AND CONVERSION OF FIRST TRANCHE OF DEBENTURES",
      "link": "https://contentapi.cision.com/api/v1.0/releases/20250616C9814",
      "date": "2025-06-16T08:00:00.000Z",
      "hidden": false
    },
    {
      "id": 105731,
      "company_id": 110,
      "title": "Getchell Gold Corp. Upsizes Financing Due to Increased Investor Interest",
      "link": "https://contentapi.cision.com/api/v1.0/releases/20250526C4910",
      "date": "2025-05-26T08:00:00.000Z",
      "hidden": false
    },
    {
      "id": 105601,
      "company_id": 110,
      "title": "Getchell Gold Corp. Announces $3 Million Financing and Debenture Conversion Option",
      "link": "https://contentapi.cision.com/api/v1.0/releases/20250523C6798",
      "date": "2025-05-23T08:00:00.000Z",
      "hidden": false
    },
    {
      "id": 100778,
      "company_id": 110,
      "title": "President's Message: Advancing the Fondaway Canyon Project During Record Gold Prices",
      "link": "https://contentapi.cision.com/api/v1.0/releases/20250424C9916",
      "date": "2025-04-24T08:00:00.000Z",
      "hidden": false
    },
    {
      "id": 99755,
      "company_id": 110,
      "title": "Getchell Gold Corp. Announces Bob Bass, Chairman, Increases Holdings",
      "link": "https://contentapi.cision.com/api/v1.0/releases/20250415C8719",
      "date": "2025-04-15T08:00:00.000Z",
      "hidden": false
    },
    {
      "id": -170440,
      "company_id": 110,
      "title": "GETCHELL GOLD CORP. ANNOUNCES WARRANT EXTENSION, DEBT SETTLEMENT, GRANT OF RSUs, AND CANCELLATION OF OPTIONS",
      "link": "https://contentapi.cision.com/api/v1.0/releases/20250220C2112",
      "date": "2025-02-20T23:00:00.000Z",
      "hidden": false
    },
    {
      "id": 87720,
      "company_id": 110,
      "title": "Getchell Gold Corp. Announces Bob Bass, Chairman, Exercises One Million Warrants",
      "link": "https://contentapi.cision.com/api/v1.0/releases/20250213C9533",
      "date": "2025-02-13T09:00:00.000Z",
      "hidden": false
    },
    {
      "id": 87173,
      "company_id": 110,
      "title": "Getchell Gold Corp. Files Robust Preliminary Economic Assessment Fondaway Canyon Gold Project, NV",
      "link": "https://contentapi.cision.com/api/v1.0/releases/20250207C5760",
      "date": "2025-02-07T22:30:00.000Z",
      "hidden": false
    },
    {
      "id": 85018,
      "company_id": 110,
      "title": "Getchell Gold Corp. Announces Positive Preliminary Economic Assessment Fondaway Canyon Gold Project, NV",
      "link": "https://contentapi.cision.com/api/v1.0/releases/20250123C7769",
      "date": "2025-01-23T12:00:00.000Z",
      "hidden": false
    },
    {
      "id": 84384,
      "company_id": 110,
      "title": "Getchell Gold Corp Invites Shareholders and Investment Community to Visit Us at Booth 402 at the VRIC in Vancouver, January 19-20, 2025",
      "link": "https://www.newsfilecorp.com/release/237443/Getchell-Gold-Corp-Invites-Shareholders-and-Investment-Community-to-Visit-Us-at-Booth-402-at-the-VRIC-in-Vancouver-January-1920-2025",
      "date": "2025-01-16T19:30:00.000Z",
      "hidden": false
    }
  ]
}
