{
  "article": {
    "id": 46672,
    "link": "https://contentapi.cision.com/api/v1.0/releases/20240103C8151",
    "title": "Getchell Gold Corp. Announces Executing the Final Earn-In Option Cash Payment and Share Issuance to Acquire 100% of the Fondaway Canyon Gold Project, NV and Closing of the First Tranche of the Debenture and Equity Financings",
    "description": "\n\n<p class=\"prntac\"><b>/THIS NEWS RELEASE IS NOT FOR DISTRIBUTION TO U.S. NEWSWIRE SERVICES OR FOR DISSEMINATION IN <span class=\"xn-location\">THE UNITED STATES</span>/</b></p>\n<p><span class=\"legendSpanClass\"><span class=\"xn-location\">VANCOUVER, BC</span></span>, <span class=\"legendSpanClass\"><span class=\"xn-chron\">Jan. 3, 2024</span></span> /CNW/ -<b> Getchell Gold Corp. </b>(CSE: GTCH) (OTCQB: GGLDF) (FWB: GGA1)<b> (\"Getchell\" or the \"Company\")</b> is pleased to announce that the Company has delivered the final <span class=\"xn-money\">US$1.6 million</span> earn-in option cash payment and <span class=\"xn-money\">US$1 million</span> share issuance to acquire a 100% interest in the Fondaway Canyon and Dixie Comstock gold properties (the \"<b>Properties</b>\") located in <span class=\"xn-location\">Nevada</span>.</p>\n\n    <div class=\"PRN_ImbeddedAssetReference\" id=\"DivAssetPlaceHolder1\">\n                <p>\n                        <a href=\"https://mma.prnewswire.com/media/2309950/Getchell_Gold_Corp__Getchell_Gold_Corp__Announces_Executing_the.html\" rel=\"nofollow\" target=\"_blank\">\n                    <img alt=\"Getchell Gold Corp. logo (CNW Group/Getchell Gold Corp.)\" src=\"https://mma.prnewswire.com/media/2309950/Getchell_Gold_Corp__Getchell_Gold_Corp__Announces_Executing_the.jpg\" title=\"Getchell Gold Corp. logo (CNW Group/Getchell Gold Corp.)\"></img>\n                        </a>\n                </p>\n\n    </div>\n<p>\"The 100% acquisition of the Fondaway Canyon gold project is a major milestone event for the Company.\" <span class=\"xn-person\">Bill Wagener</span>, Chairman and CEO, commented. \"The Fondaway Canyon project has been an eye opener from day one with every drill hole, over three drill campaigns in the Central area, contributing to a doubling of an already sizable historic resource. The closing of this acquisition serves as an immediate injection of significant value into the Company, and considering that the gold mineralization remains open in most directions, adds an indeterminate amount of future potential value waiting to be discovered.\"</p>\n<p>Under the terms of the option agreement (the \"<b>Option Agreement</b>\") with Canagold Resources Ltd. (\"<b>Canagold</b>\") executed on <span class=\"xn-chron\">January 3, 2020</span>, the Company had the option to acquire 100% of the Properties by paying Canagold a total of <span class=\"xn-money\">US$2 million</span> in cash and <span class=\"xn-money\">US$2 million</span> in the Company's shares staged over 4 years. The Company also has to make work commitments totaling <span class=\"xn-money\">US$1.45 million</span> over the four years, which have been fully satisfied, and grant a 2.0% net smelter return royalty (\"<b>NSR Royalty</b>\") on each of the Properties to the Option or on the exercise of the Option.</p>\n<p>In the preceding three anniversary payments, the Company has paid a total of <span class=\"xn-money\">US$400,000</span> in cash and issued <span class=\"xn-money\">US$1 million</span> in the Company's shares.</p>\n<p>The Company has delivered to Canagold a <span class=\"xn-money\">US$1.6 million</span> cash payment, issued 10,167,000 shares, and granted a 2.0% NSR Royalty to Canagold which satisfies the earn-in requirements, and the Company now owns 100% of the Properties. The Company has the option to repurchase half of the NSR Royalty (i.e., a 1% net smelter royalty) on each of the Fondaway Canyon property or the Dixie Comstock property for <span class=\"xn-money\">US$1 million</span>.</p>\n<div aria-level=\"3\" class=\"wcag-arialevel-3\" role=\"heading\" style=\"display: block; font-size: 1.17em; margin-block-start: 1em; margin-block-end: 1em; margin-inline-start: 0px; margin-inline-end: 0px; font-weight: bold;\"><b>Fondaway Canyon Gold Project</b></div><p>Getchell Gold Corp. is delineating a potential Tier-1 gold resource at its flagship Fondaway Canyon gold project in <span class=\"xn-location\">Nevada, USA</span>.</p>\n<p>Following three consecutive successful drilling programs, the Company has effectively doubled the size of the historic resource, firmly placing Fondaway Canyon amongst the foremost developing projects in a world class mining jurisdiction. The Company recently published its first Mineral Resource Estimate (\"<b>MRE</b>\") at Fondaway Canyon, as disclosed in the Company's news release dated <span class=\"xn-chron\">February 1, 2023</span>:</p>\n<ul type=\"disc\"><li>Gold mineralization is at and near surface supporting an Open Pit mine model;</li><li>Inferred Mineral Resource of 38.3 million tonnes at an average grade of 1.23 g/t Au for <b>1,509,100 ounces of gold</b>;</li><li>Indicated Mineral Resource of 11.0 million tonnes at an average grade of 1.56 g/t Au for an additional <b>550,800 ounces of gold</b>;</li><li>Strong gold mineralization in the most peripheral drill holes leaves the mineral resources open in most directions for further expansion and indicates a substantially larger body of mineralization than delineated to date (Company news release dated <span class=\"xn-chron\">August 9, 2023</span>); and</li><li>Fully permitted drill program designed to expand the mineral resources and upgrade Inferred Resources to Indicated.</li></ul><p>Getchell Gold Corp. is now in a position to continue expanding the Mineral Resource Estimate and preparing a Preliminary Economic Assessment.</p>\n<p>Notes on the Mineral Resource Estimate:</p>\n<ol type=\"1\"><li>Mineral Resources are not Mineral Reserves and have not demonstrated economic viability. There has been insufficient exploration to define the Inferred Resource as Indicated or Measured Mineral Resources, however, it is reasonable to expect that the majority of the Inferred Mineral Resource could be upgraded to Indicated Mineral Resources with continued exploration. There is no guarantee that any part of the mineral resources discussed herein will be converted into a mineral reserve in the future. The estimate of Mineral Resources may be materially affected by environmental, permitting, legal, marketing, or other relevant issues. The Mineral Resources in this report were estimated using the Canadian Institute of Mining, Metallurgy and Petroleum (\"CIM\") standards on mineral resources and reserves, definitions, and guidelines prepared by the CIM standing committee on reserve definitions and adopted by the CIM council (CIM 2014 and 2019).</li><li>The effective date of the Mineral Resource Estimate is <span class=\"xn-chron\">December 12, 2022</span>, and a technical report on the Fondaway Canyon project titled \"Technical Report Mineral Resource Estimate Fondaway Canyon Project, <span class=\"xn-location\">Nevada, USA</span>\" was filed by the Company on SEDAR+ on <span class=\"xn-chron\">February 1, 2023</span>.</li><li>The independent and qualified person for the MRE, as defined by National Instrument 43-101, is <span class=\"xn-person\">Michael Dufresne</span>, P.Geo., from APEX Geoscience Ltd.</li></ol><p><span class=\"xn-person\">Scott Frostad</span>, P.Geo., is the Qualified Person (as defined in National Instrument 43-101) who has reviewed and approved the scientific and technical information in this news release. </p>\n<div aria-level=\"3\" class=\"wcag-arialevel-3\" role=\"heading\" style=\"display: block; font-size: 1.17em; margin-block-start: 1em; margin-block-end: 1em; margin-inline-start: 0px; margin-inline-end: 0px; font-weight: bold;\"><b>Closing of First Tranche of Equity and Debenture Financings </b></div><p>The Company has closed the first tranches of both its previously announced debenture financing (the \"<b>Debenture Financing</b>\") and non-brokered private placement of units (the \"<b>Unit Financing</b>\").</p>\n<p>In the first tranche of the Debenture Financing, the Company closed on <span class=\"xn-money\">$1,917,420</span> aggregate principal amount of non-convertible debentures. As part of the Debenture Financing, the Company issued 19,174,200 warrants (each a \"<b>Debenture Warrant</b>\"). Each Debenture Warrant entitles the holder to purchase a common share of the Company at <span class=\"xn-money\">$0.10</span> per share until <span class=\"xn-chron\">December 29, 2026</span>. Fifty percent (50%) of the Debenture Warrants vested on closing and the remaining 50% will vest and be exercisable on <span class=\"xn-chron\">February 28, 2025</span>.</p>\n<p>In the first tranche of the Unit Financing, the Company issued 4,500,000 units (the \"<b>Units</b>\") for gross proceeds of <span class=\"xn-money\">$450,000</span>, with each Unit comprised of one common share and one common share purchase warrant (a \"<b>Unit Warrant</b>\"). Each Unit Warrant entitles the holder to acquire an additional common share at a price of <span class=\"xn-money\">$0.15</span> per common share until <span class=\"xn-chron\">December 29, 2025</span>.</p>\n<p>In connection with the Unit Financing and Debenture Financing, the Company paid finder's fees in the amount of <span class=\"xn-money\">$28,400</span>, issued 1,410,000 finder's shares, and granted 1,564,000 finder's warrants (\"<b>Finder's Warrants</b>\"). Each Finder's Warrant entitles the holder to acquire one additional common share of the Company at a price of <span class=\"xn-money\">$0.15</span> per common share until <span class=\"xn-chron\">December 29, 2025</span>.</p>\n<p>Getchell used the proceeds of the Debenture Financing to pay the final <span class=\"xn-money\">US$1.6 million</span> cash payment to Canagold in order to acquire the Properties.  The balance of the Debenture Financing proceeds and the proceeds from the Unit Financing will be used to conduct further exploration work on the Properties and for general working capital.</p>\n<p>The securities issued in connection with the Canagold final share issuance, the Unit Financing, and Debenture Financing are subject to a statutory hold period of four months from the date of issuance, expiring <span class=\"xn-chron\">April 30, 2024</span>, in accordance with applicable securities laws.</p>\n<p>Two directors of the Company participated in the Unit Financing in the amount of <span class=\"xn-money\">$35,000</span>, and one of the directors also participated in the Debenture Financing in the amount of <span class=\"xn-money\">$20,000</span>. The transaction with the directors, who are insiders of the Company, constitutes a \"related party transaction\" as defined under Multilateral Instrument 61-101 <i>Protection of Minority Security Holders in Special Transactions</i> (\"<b>MI 61-101</b>\"). The Company is relying on the exemptions under section 5.5(a) and section 5.7(1)(a) from the formal valuation and minority shareholder approval requirements of MI 61-101, as the fair market value of the Units and Debentures issued to the related parties and the consideration paid by the related parties under the Unit Financing and Debenture Financing does not exceed 25% of the Company's market capitalization, as determined in accordance with MI 61-101. The Company did not file a material change report in respect of the related party transactions at least 21 days before the closing of the first tranche of the Unit Financing and Debenture Financing, as the details of the participation by related parties of the Company were not settled until shortly prior to closing of the first tranche of the Unit Financing and Debenture Financing.</p>\n<p>The securities offered have not been and will not be registered under the United States Securities Act of 1933, as amended, and may not be offered or sold in <span class=\"xn-location\">the United States</span> absent registration or applicable exemption from the registration requirements.</p>\n<div aria-level=\"3\" class=\"wcag-arialevel-3\" role=\"heading\" style=\"display: block; font-size: 1.17em; margin-block-start: 1em; margin-block-end: 1em; margin-inline-start: 0px; margin-inline-end: 0px; font-weight: bold;\"><b>Annual General Meeting</b></div><p>The Annual General Meeting was held on <span class=\"xn-chron\">December 22, 2023</span>, wherein all resolutions presented by management were approved by a majority of the shareholder votes received.</p>\n<div aria-level=\"3\" class=\"wcag-arialevel-3\" role=\"heading\" style=\"display: block; font-size: 1.17em; margin-block-start: 1em; margin-block-end: 1em; margin-inline-start: 0px; margin-inline-end: 0px; font-weight: bold;\"><b>About Getchell Gold Corp.</b></div><p>The Company is a <span class=\"xn-location\">Nevada</span> focused gold and copper exploration company trading on the CSE: GTCH, OTCQB: GGLDF, and FWB: GGA1. <span class=\"xn-person\">Getchell Gold</span> is primarily directing its efforts on its most advanced stage asset, Fondaway Canyon, a past gold producer with a large mineral resource estimate. Complementing Getchell's asset portfolio is Dixie Comstock, a past gold producer with a historic resource and two earlier stage exploration projects, Star (Cu-Au-Ag) and Hot Springs Peak (Au). Getchell has the option to acquire 100% of the Fondaway Canyon and Dixie Comstock properties, <span class=\"xn-location\">Churchill County, Nevada</span>.</p>\n<p>For further information please visit the Company's website at <u><a href=\"https://c212.net/c/link/?t=0&amp;l=en&amp;o=4059605-1&amp;h=767626082&amp;u=http%3A%2F%2Fwww.getchellgold.com%2F&amp;a=www.getchellgold.com\" rel=\"nofollow\" target=\"_blank\">www.getchellgold.com</a></u> or contact the Company at <u><a href=\"mailto:info@getchellgold.com\" rel=\"nofollow\" target=\"_blank\">info@getchellgold.com</a></u>.</p>\n<p><i>The Canadian Securities Exchange has not reviewed this press release and does not accept responsibility for the adequacy or accuracy of this news release.  </i></p>\n<p><i>Certain information contained herein constitutes \"forward-looking information\" under Canadian securities legislation. Forward-looking information includes, but is not limited to, statements with respect to the vesting of Warrants, future exploration on the Properties and the closing and use of proceeds from the Unit Financing and Debenture Financing. Generally, forward-looking information can be identified by the use of forward-looking terminology such as \"will\" or variations of such words and phrases or statements that certain actions, events or results \"will\" occur. Forward-looking statements are based on the opinions and estimates of management as of the date such statements are made and they are subject to known and unknown risks, uncertainties and other factors that may cause the actual results to be materially different from those expressed or implied by such forward-looking statements or forward-looking information. Although management of Getchell have attempted to identify important factors that could cause actual results to differ materially from those contained in forward-looking statements or forward-looking information, there may be other factors that cause results not to be as anticipated, estimated or intended. There can be no assurance that such statements will prove to be accurate, as actual results and future events could differ materially from those anticipated in such statements. Accordingly, readers should not place undue reliance on forward-looking statements and forward-looking information. The Company will not update any forward-looking statements or forward-looking information that are incorporated by reference herein, except as required by applicable securities laws.</i></p>\n<p>SOURCE  Getchell Gold Corp.</p>\n<img alt=\"\" src=\"https://rt.newswire.ca/rt.gif?NewsItemId=C8151&amp;Transmission_Id=202401030001CANADANWCANADAPR_C8151&amp;DateId=20240103\" style=\"border:0px; width:1px; height:1px;\"></img>\n\n",
    "search_terms": "Fondaway Canyon,Getchell Gold Corp.,GTCH",
    "master_gid": 1010,
    "date": "2024-01-03T05:01:00.000Z",
    "tags": "USA|Nevada||Gold|Financing,Private Placement,Project Acquisition",
    "image_id": null,
    "hidden": false,
    "company_id": 110,
    "provider": null,
    "excerpt": "/THIS NEWS RELEASE IS NOT FOR DISTRIBUTION TO U.S. NEWSWIRE SERVICES OR FOR DISSEMINATION INTHE UNITED STATES/VANCOUVER, BC,Jan. 3, 2024/CNW/ -Getchell Gold Corp.(CSE: GTCH) (OTCQB: GGLDF) (FWB: GGA1)(\"Getchell\" or the \"Company\") is pleased to announce that the Company has delivered the finalUS$1.6 millionearn-in option cash payment andUS$1 millionshare issuance to acquire",
    "is_regulatory": false,
    "refined_tags": [
      "Project Acquisition",
      "Financing",
      "Private Placement"
    ],
    "ftp_filename": null,
    "company_name": "Getchell Gold Corp.",
    "exchange": "CSE",
    "root_ticker": "GTCH",
    "project_name": "Fondaway Canyon",
    "gid": 1010,
    "location": "Nevada, USA",
    "plan_id": null,
    "description_text": "/THIS NEWS RELEASE IS NOT FOR DISTRIBUTION TO U.S. NEWSWIRE SERVICES OR FOR DISSEMINATION IN THE UNITED STATES / VANCOUVER, BC , Jan. 3, 2024 /CNW/ - Getchell Gold Corp. (CSE: GTCH) (OTCQB: GGLDF) (FWB: GGA1) (\"Getchell\" or the \"Company\") is pleased to announce that the Company has delivered the final US$1.6 million earn-in option cash payment and US$1 million share issuance to acquire a 100% interest in the Fondaway Canyon and Dixie Comstock gold properties (the \" Properties \") located in Nevada . \"The 100% acquisition of the Fondaway Canyon gold project is a major milestone event for the Company.\" Bill Wagener , Chairman and CEO, commented. \"The Fondaway Canyon project has been an eye opener from day one with every drill hole, over three drill campaigns in the Central area, contributing to a doubling of an already sizable historic resource. The closing of this acquisition serves as an immediate injection of significant value into the Company, and considering that the gold mineralization remains open in most directions, adds an indeterminate amount of future potential value waiting to be discovered.\" Under the terms of the option agreement (the \" Option Agreement \") with Canagold Resources Ltd. (\" Canagold \") executed on January 3, 2020 , the Company had the option to acquire 100% of the Properties by paying Canagold a total of US$2 million in cash and US$2 million in the Company's shares staged over 4 years. The Company also has to make work commitments totaling US$1.45 million over the four years, which have been fully satisfied, and grant a 2.0% net smelter return royalty (\" NSR Royalty \") on each of the Properties to the Option or on the exercise of the Option. In the preceding three anniversary payments, the Company has paid a total of US$400,000 in cash and issued US$1 million in the Company's shares. The Company has delivered to Canagold a US$1.6 million cash payment, issued 10,167,000 shares, and granted a 2.0% NSR Royalty to Canagold which satisfies the earn-in requirements, and the Company now owns 100% of the Properties. The Company has the option to repurchase half of the NSR Royalty (i.e., a 1% net smelter royalty) on each of the Fondaway Canyon property or the Dixie Comstock property for US$1 million . Fondaway Canyon Gold Project Getchell Gold Corp. is delineating a potential Tier-1 gold resource at its flagship Fondaway Canyon gold project in Nevada, USA . Following three consecutive successful drilling programs, the Company has effectively doubled the size of the historic resource, firmly placing Fondaway Canyon amongst the foremost developing projects in a world class mining jurisdiction. The Company recently published its first Mineral Resource Estimate (\" MRE \") at Fondaway Canyon, as disclosed in the Company's news release dated February 1, 2023 : Gold mineralization is at and near surface supporting an Open Pit mine model; Inferred Mineral Resource of 38.3 million tonnes at an average grade of 1.23 g/t Au for 1,509,100 ounces of gold ; Indicated Mineral Resource of 11.0 million tonnes at an average grade of 1.56 g/t Au for an additional 550,800 ounces of gold ; Strong gold mineralization in the most peripheral drill holes leaves the mineral resources open in most directions for further expansion and indicates a substantially larger body of mineralization than delineated to date (Company news release dated August 9, 2023 ); and Fully permitted drill program designed to expand the mineral resources and upgrade Inferred Resources to Indicated. Getchell Gold Corp. is now in a position to continue expanding the Mineral Resource Estimate and preparing a Preliminary Economic Assessment. Notes on the Mineral Resource Estimate: Mineral Resources are not Mineral Reserves and have not demonstrated economic viability. There has been insufficient exploration to define the Inferred Resource as Indicated or Measured Mineral Resources, however, it is reasonable to expect that the majority of the Inferred Mineral Resource could be upgraded to Indicated Mineral Resources with continued exploration. There is no guarantee that any part of the mineral resources discussed herein will be converted into a mineral reserve in the future. The estimate of Mineral Resources may be materially affected by environmental, permitting, legal, marketing, or other relevant issues. The Mineral Resources in this report were estimated using the Canadian Institute of Mining, Metallurgy and Petroleum (\"CIM\") standards on mineral resources and reserves, definitions, and guidelines prepared by the CIM standing committee on reserve definitions and adopted by the CIM council (CIM 2014 and 2019). The effective date of the Mineral Resource Estimate is December 12, 2022 , and a technical report on the Fondaway Canyon project titled \"Technical Report Mineral Resource Estimate Fondaway Canyon Project, Nevada, USA \" was filed by the Company on SEDAR+ on February 1, 2023 . The independent and qualified person for the MRE, as defined by National Instrument 43-101, is Michael Dufresne , P.Geo., from APEX Geoscience Ltd. Scott Frostad , P.Geo., is the Qualified Person (as defined in National Instrument 43-101) who has reviewed and approved the scientific and technical information in this news release. Closing of First Tranche of Equity and Debenture Financings The Company has closed the first tranches of both its previously announced debenture financing (the \" Debenture Financing \") and non-brokered private placement of units (the \" Unit Financing \"). In the first tranche of the Debenture Financing, the Company closed on $1,917,420 aggregate principal amount of non-convertible debentures. As part of the Debenture Financing, the Company issued 19,174,200 warrants (each a \" Debenture Warrant \"). Each Debenture Warrant entitles the holder to purchase a common share of the Company at $0.10 per share until December 29, 2026 . Fifty percent (50%) of the Debenture Warrants vested on closing and the remaining 50% will vest and be exercisable on February 28, 2025 . In the first tranche of the Unit Financing, the Company issued 4,500,000 units (the \" Units \") for gross proceeds of $450,000 , with each Unit comprised of one common share and one common share purchase warrant (a \" Unit Warrant \"). Each Unit Warrant entitles the holder to acquire an additional common share at a price of $0.15 per common share until December 29, 2025 . In connection with the Unit Financing and Debenture Financing, the Company paid finder's fees in the amount of $28,400 , issued 1,410,000 finder's shares, and granted 1,564,000 finder's warrants (\" Finder's Warrants \"). Each Finder's Warrant entitles the holder to acquire one additional common share of the Company at a price of $0.15 per common share until December 29, 2025 . Getchell used the proceeds of the Debenture Financing to pay the final US$1.6 million cash payment to Canagold in order to acquire the Properties.  The balance of the Debenture Financing proceeds and the proceeds from the Unit Financing will be used to conduct further exploration work on the Properties and for general working capital. The securities issued in connection with the Canagold final share issuance, the Unit Financing, and Debenture Financing are subject to a statutory hold period of four months from the date of issuance, expiring April 30, 2024 , in accordance with applicable securities laws. Two directors of the Company participated in the Unit Financing in the amount of $35,000 , and one of the directors also participated in the Debenture Financing in the amount of $20,000 . The transaction with the directors, who are insiders of the Company, constitutes a \"related party transaction\" as defined under Multilateral Instrument 61-101 Protection of Minority Security Holders in Special Transactions (\" MI 61-101 \"). The Company is relying on the exemptions under section 5.5(a) and section 5.7(1)(a) from the formal valuation and minority shareholder approval requirements of MI 61-101, as the fair market value of the Units and Debentures issued to the related parties and the consideration paid by the related parties under the Unit Financing and Debenture Financing does not exceed 25% of the Company's market capitalization, as determined in accordance with MI 61-101. The Company did not file a material change report in respect of the related party transactions at least 21 days before the closing of the first tranche of the Unit Financing and Debenture Financing, as the details of the participation by related parties of the Company were not settled until shortly prior to closing of the first tranche of the Unit Financing and Debenture Financing. The securities offered have not been and will not be registered under the United States Securities Act of 1933, as amended, and may not be offered or sold in the United States absent registration or applicable exemption from the registration requirements. Annual General Meeting The Annual General Meeting was held on December 22, 2023 , wherein all resolutions presented by management were approved by a majority of the shareholder votes received. About Getchell Gold Corp. The Company is a Nevada focused gold and copper exploration company trading on the CSE: GTCH, OTCQB: GGLDF, and FWB: GGA1. Getchell Gold is primarily directing its efforts on its most advanced stage asset, Fondaway Canyon, a past gold producer with a large mineral resource estimate. Complementing Getchell's asset portfolio is Dixie Comstock, a past gold producer with a historic resource and two earlier stage exploration projects, Star (Cu-Au-Ag) and Hot Springs Peak (Au). Getchell has the option to acquire 100% of the Fondaway Canyon and Dixie Comstock properties, Churchill County, Nevada . For further information please visit the Company's website at www.getchellgold.com or contact the Company at info@getchellgold.com . The Canadian Securities Exchange has not reviewed this press release and does not accept responsibility for the adequacy or accuracy of this news release. Certain information contained herein constitutes \"forward-looking information\" under Canadian securities legislation. Forward-looking information includes, but is not limited to, statements with respect to the vesting of Warrants, future exploration on the Properties and the closing and use of proceeds from the Unit Financing and Debenture Financing. Generally, forward-looking information can be identified by the use of forward-looking terminology such as \"will\" or variations of such words and phrases or statements that certain actions, events or results \"will\" occur. Forward-looking statements are based on the opinions and estimates of management as of the date such statements are made and they are subject to known and unknown risks, uncertainties and other factors that may cause the actual results to be materially different from those expressed or implied by such forward-looking statements or forward-looking information. Although management of Getchell have attempted to identify important factors that could cause actual results to differ materially from those contained in forward-looking statements or forward-looking information, there may be other factors that cause results not to be as anticipated, estimated or intended. There can be no assurance that such statements will prove to be accurate, as actual results and future events could differ materially from those anticipated in such statements. Accordingly, readers should not place undue reliance on forward-looking statements and forward-looking information. The Company will not update any forward-looking statements or forward-looking information that are incorporated by reference herein, except as required by applicable securities laws. SOURCE  Getchell Gold Corp.",
    "primary_commodity": "Au"
  },
  "articleProject": {
    "gid": 1010,
    "project_name": "Fondaway Canyon",
    "location": "Nevada, USA"
  },
  "articleExchange": "CSE",
  "articleCompanyId": 110,
  "articleTicker": "GTCH",
  "articleCompanyName": "Getchell Gold Corp.",
  "allOtherCompanyProjects": [
    {
      "company_id": 110,
      "gid": 3012,
      "project_name": "Star",
      "location": "Nevada, United States"
    },
    {
      "company_id": 110,
      "gid": 1010,
      "project_name": "Fondaway Canyon",
      "location": "Nevada, USA"
    },
    {
      "company_id": 110,
      "gid": 5213,
      "project_name": "Dixie Comstock",
      "location": "Nevada, United States"
    }
  ],
  "allOtherCompanyNews": [
    {
      "id": 108120,
      "company_id": 110,
      "title": "GETCHELL GOLD CORP. ANNOUNCES CLOSING OF UPSIZED $4 MILLION FINANCING AND CONVERSION OF FIRST TRANCHE OF DEBENTURES",
      "link": "https://contentapi.cision.com/api/v1.0/releases/20250616C9814",
      "date": "2025-06-16T08:00:00.000Z",
      "hidden": false
    },
    {
      "id": 105731,
      "company_id": 110,
      "title": "Getchell Gold Corp. Upsizes Financing Due to Increased Investor Interest",
      "link": "https://contentapi.cision.com/api/v1.0/releases/20250526C4910",
      "date": "2025-05-26T08:00:00.000Z",
      "hidden": false
    },
    {
      "id": 105601,
      "company_id": 110,
      "title": "Getchell Gold Corp. Announces $3 Million Financing and Debenture Conversion Option",
      "link": "https://contentapi.cision.com/api/v1.0/releases/20250523C6798",
      "date": "2025-05-23T08:00:00.000Z",
      "hidden": false
    },
    {
      "id": 100778,
      "company_id": 110,
      "title": "President's Message: Advancing the Fondaway Canyon Project During Record Gold Prices",
      "link": "https://contentapi.cision.com/api/v1.0/releases/20250424C9916",
      "date": "2025-04-24T08:00:00.000Z",
      "hidden": false
    },
    {
      "id": 99755,
      "company_id": 110,
      "title": "Getchell Gold Corp. Announces Bob Bass, Chairman, Increases Holdings",
      "link": "https://contentapi.cision.com/api/v1.0/releases/20250415C8719",
      "date": "2025-04-15T08:00:00.000Z",
      "hidden": false
    },
    {
      "id": -170440,
      "company_id": 110,
      "title": "GETCHELL GOLD CORP. ANNOUNCES WARRANT EXTENSION, DEBT SETTLEMENT, GRANT OF RSUs, AND CANCELLATION OF OPTIONS",
      "link": "https://contentapi.cision.com/api/v1.0/releases/20250220C2112",
      "date": "2025-02-20T23:00:00.000Z",
      "hidden": false
    },
    {
      "id": 87720,
      "company_id": 110,
      "title": "Getchell Gold Corp. Announces Bob Bass, Chairman, Exercises One Million Warrants",
      "link": "https://contentapi.cision.com/api/v1.0/releases/20250213C9533",
      "date": "2025-02-13T09:00:00.000Z",
      "hidden": false
    },
    {
      "id": 87173,
      "company_id": 110,
      "title": "Getchell Gold Corp. Files Robust Preliminary Economic Assessment Fondaway Canyon Gold Project, NV",
      "link": "https://contentapi.cision.com/api/v1.0/releases/20250207C5760",
      "date": "2025-02-07T22:30:00.000Z",
      "hidden": false
    },
    {
      "id": 85018,
      "company_id": 110,
      "title": "Getchell Gold Corp. Announces Positive Preliminary Economic Assessment Fondaway Canyon Gold Project, NV",
      "link": "https://contentapi.cision.com/api/v1.0/releases/20250123C7769",
      "date": "2025-01-23T12:00:00.000Z",
      "hidden": false
    },
    {
      "id": 84384,
      "company_id": 110,
      "title": "Getchell Gold Corp Invites Shareholders and Investment Community to Visit Us at Booth 402 at the VRIC in Vancouver, January 19-20, 2025",
      "link": "https://www.newsfilecorp.com/release/237443/Getchell-Gold-Corp-Invites-Shareholders-and-Investment-Community-to-Visit-Us-at-Booth-402-at-the-VRIC-in-Vancouver-January-1920-2025",
      "date": "2025-01-16T19:30:00.000Z",
      "hidden": false
    }
  ]
}
