{
  "article": {
    "id": 89431,
    "link": "https://www.newsfilecorp.com/release/242579/Summa-Silver-Announces-Staking-of-the-HighGrade-GoldSilver-Kennedy-Project-Nevada",
    "title": "Summa Silver Announces Staking of the High-Grade Gold-Silver Kennedy Project, Nevada",
    "description": "<img src=\"https://api.newsfilecorp.com/newsinfo/242579/367\" id=\"367\" width=\"2\" height=\"2\" style=\"width: 1px;  height: 1px;border: 0px solid;\" /><p>Vancouver, British Columbia--(Newsfile Corp. - February 27, 2025) - Summa Silver Corp. (TSXV: SSVR) (OTCQX: SSVRF) (FSE: 48X) (\"<b>Summa</b>\" or the \"<b>Company</b>\") is pleased to announce that it has acquired the Kennedy Project, located in Pershing County, Nevada, (the \"<b>Kennedy Project</b>\" or the \"<b>Project</b>\") through low-cost claim staking. The Kennedy Project consists of 99 mineral claims spanning approximately 2,000 acres, is 100% owned by the Company, and is free of any royalties. </p><p><b>Key Highlights </b><a href=\"https://api.newsfilecorp.com/redirect/zEO27TVZMy\"><b>(See attached figure)</b></a><b>:</b></p><ul style=\"list-style-type: disc;\"><li><b>Past Producing District:  </b>The Project covers most of the historic Kennedy Mining District in north-central Nevada where minor amounts of gold and silver were produced intermittently from high-grade veins between 1891 and World War II<sup>1</sup>.</li></ul><ul style=\"list-style-type: disc;\"><li><b>High Grades Reported:</b> Historic mining focused on near surface oxide mineralization where mined grades were reported to be 15 g/t Au and 311 g/t Ag<sup>2</sup>. Deeper secondary and sulfide mineralization reportedly remains unmined.   </li></ul><ul style=\"list-style-type: disc;\"><li><b>Undrilled Nevada Vein Field: </b>Approximately <b>22 km</b> of veins have been traced across the Kennedy Project which have not seen systematic modern exploration.  </li></ul><ul style=\"list-style-type: disc;\"><li><b>Acquisition Thesis: </b>The Kennedy project represents an internally generated prospect that was acquired because it was open for staking and potentially represents a 1M ounce near surface gold target in Nevada.</li></ul><ul style=\"list-style-type: disc;\"><li><b>Company to Remain Focused on Robust Core Projects: </b>Summa Silver will continue to focus on the Hughes and Mogollon projects where high-grade mineral resource estimates were recently announced. </li></ul><ul style=\"list-style-type: disc;\"><li><b>Hughes Project Drilling update:</b> The previously announced drill program at the Hughes Project is well underway.  All holes completed have intersected zones of quartz veins, stockworks and breccias in aggressive step-outs at the Ruby zone.  All assays are pending. </li></ul><p><b>Galen McNamara, CEO, stated:</b> \"It's not often that a significantly underexplored high-grade historic mining district in Nevada is open for staking. As many explorers in the state know, multiple important Nevada discoveries have been made by re-evaluating historic mining districts like this. Although we will continue to direct our focus to the Hughes and Mogollon projects, we look forward to advancing the Kennedy Project to drill-ready status in the coming months.\"</p><p style=\"text-align: center;\"><a rel=\"nofollow\" href=\"https://images.newsfilecorp.com/files/7983/242579_e2638a49a4904941_002full.jpg\"><img src=\"https://images.newsfilecorp.com/files/7983/242579_e2638a49a4904941_002.jpg\" style=\"border-width: 0px;\" alt=\"Cannot view this image? Visit: https://images.newsfilecorp.com/files/7983/242579_e2638a49a4904941_002.jpg\" /></a></p><p style=\"text-align: center;\"><b>Figure 1: Regional Map of Northern Nevada</b></p><p style=\"text-align: center;\">To view an enhanced version of this graphic, please visit:<br /><a rel=\"nofollow\" href=\"https://images.newsfilecorp.com/files/7983/242579_e2638a49a4904941_002full.jpg\">https://images.newsfilecorp.com/files/7983/242579_e2638a49a4904941_002full.jpg</a></p><p><b>Kennedy Project Summary </b></p><p>The Kennedy Project consists of 99 unpatented mining claims located in Pershing County, Nevada, approximately 75 km south of Winnemucca. The Kennedy Project is situated on major aeromagnetic and gravity lineaments which are also spatially associated with the Sleeper gold deposit (Figure 1). Priority exploration targets at the Project consist of high-grade sheeted veins as well as bulk tonnage disseminated and/or stock-work hosted gold-silver mineralization.</p><p>The Kennedy district consists of numerous high-grade, gold-silver bearing quartz veins where over 22 km of veins have been traced at surface. Most of historic mining in the Kennedy district was reportedly from the Gold Note mine which was centered on a series of high-angle northwest striking veins traced for over 350 m along strike. Historic mining at Gold Note focused on near-surface (&#60;40 m) oxide mineralization. Deeper secondary sulfide mineralization remains unmined. Mine grades were reportedly as high as 15.5 g/t Au with 311 g/t Ag<sup>2</sup>. </p><p><b>Exploration Plans </b></p><p>Following staking, a short prospecting and sampling program was completed and results are pending. The Company is now planning a multi-disciplinary exploration program consisting of geological mapping, soil geochemical sampling, and IP geophysics. Data from these programs will be used to prioritize targets for follow-up drill testing, in early 2026. </p><p><b>Corporate Update</b></p><p>In addition, the Company has engaged the services of ICP Securities Inc. (\"<b>ICP</b>\") to provide automated market making services, including use of its proprietary algorithm, ICP Premium&#8482;, in compliance with the policies and guidelines of the TSX Venture Exchange and other applicable legislation. ICP will be paid a monthly fee of C$7,500, plus applicable taxes. The agreement between the Company and ICP was signed with a start date of March 3, 2025, and is for a term of four months (the \"Initial Term\") and will be automatically renewed for subsequent one-month terms (unless either party terminates. ICP is an arm's length party to the Company. </p><p>The Company has also engaged Fairfax Partners In. (\"<b>Fairfax</b>\") to provide investor relations services. Under the agreement which starts immediately, Fairfax will receive a total payment of $70,000 plus GST for a three-month term. Services provided by Fairfax include social media marketing, marketing collateral development, and digital marketing, ensuring Summa Silver's investor relations efforts align with market expectations. Fairfax confirms that neither the company nor its directors own any securities of Summa Silver.</p><p><b>Qualified Person</b></p><p>The technical content of this news release has been reviewed and approved by Galen McNamara, P. Geo., the CEO of the Company and a qualified person as defined by National Instrument 43-101.</p><p><b>About Summa Silver Corp</b></p><p>Summa Silver Corp is a junior mineral exploration company. The Company owns a 100% interest in the Hughes project located in central Nevada and in the Mogollon project located in southwestern New Mexico. The high-grade past-producing Belmont Mine, one of the most prolific silver producers in the United States between 1903 and 1929, is located on the Hughes project. The Mogollon project is the largest historic silver producer in New Mexico. Both projects have remained inactive since commercial production ceased and neither have seen modern exploration prior to the Company's involvement.</p><p><b>Follow Summa Silver on Twitter: @summasilver<br />LinkedIn:</b> <a href=\"https://api.newsfilecorp.com/redirect/4QpXxFbYva\"><b>https://www.linkedin.com/company/summa-silver-corp/</b></a><a href=\"https://api.newsfilecorp.com/redirect/jpDqQcoNRn\"><br /></a><b>Website: </b><a href=\"https://api.newsfilecorp.com/redirect/v1ByPcEz1x\"><b>https://www.summasilver.com</b></a></p><p><b>ON BEHALF OF THE BOARD OF DIRECTORS</b></p><div id=\"contactInfo\"><p><b>\"Galen McNamara\"</b><br />Galen McNamara, Chief Executive Officer<br /><a href=\"mailto:info@summasilver.com\" target=\"_blank\"><b>info@summasilver.com</b></a><br /><a href=\"https://api.newsfilecorp.com/redirect/JgjGwuGoVy\"><b>www.summasilver.com</b></a></p><p><b>Investor Relations Contact:</b><br /><b>Giordy Belfiore</b><br />Corporate Development and Investor Relations<br /><b>604-288-8004</b><br /><a href=\"mailto:giordy@summasilver.com\"><b>giordy@summasilver.com</b></a><br /><a href=\"https://api.newsfilecorp.com/redirect/QOBVEhYwNy\"><b>www.summasilver.com</b></a></p></div><p><b>References</b></p><ol style=\"list-style-type: decimal;\"><li>Wallace, Alan R (2016) The Story of the Kennedy Mining District, Pershing County, Nevada (<a href=\"https://api.newsfilecorp.com/redirect/m3zq7FXOZg\">https://pubs.nbmg.unr.edu/The-story-of-the-Kennedy-mining-district-p/aw1.htm</a>)</li><li>Klopstock, Paul (1913) The Kennedy mining district, Nevada, American Institute of Mining Engineers Bulletin, v. 77. p. 1041-1046</li></ol><p><i>Neither the TSX Venture Exchange nor its Regulation Services Provider (as that term is defined in the policies of the TSX Venture Exchange) accepts responsibility for the adequacy or accuracy of this release.</i></p><p><i>Cautionary note regarding forward-looking statements</i></p><p><i>This news release contains certain \"forward looking statements\" and certain \"forward-looking information\" as defined under applicable Canadian and U.S. securities laws. Forward-looking statements and information can generally be identified by the use of forward-looking terminology such as \"may\", \"will\", \"should\", \"expect\", \"intend\", \"estimate\", \"anticipate\", \"believe\", \"continue\", \"plans\" or similar terminology. The forward-looking information contained herein is provided for the purpose of assisting readers in understanding management's current expectations and plans relating to the future. These forward&#8208;looking statements or information relate to, among other things: the Company's exploration plans.</i></p><p><i>Forward-looking information is subject to known and unknown risks, uncertainties and other factors that may cause the actual actions, events or results to be materially different from those expressed or implied by such forward-looking information, including but not limited to: the requirement for regulatory approvals; enhanced uncertainty in global financial markets; unquantifiable risks related to government actions and interventions; stock market volatility; regulatory restrictions; the ongoing conflict in Ukraine; and other related risks and uncertainties disclosed in the Company's public disclosure documents. </i></p><p><i>Forward-looking information are based on management of the parties' reasonable assumptions, estimates, expectations, analyses and opinions, which are based on such management's experience and perception of trends, current conditions and expected developments, and other factors that management believes are relevant and reasonable in the circumstances, but which may prove to be incorrect.</i></p><p><i>The Company undertakes no obligation to update forward-looking information except as required by applicable law. Such forward-looking information represents management's best judgment based on information currently available. No forward-looking statement can be guaranteed and actual future results may vary materially. Accordingly, readers are advised not to place undue reliance on forward-looking statements or information.</i></p><p id=\"corporateNewsLogoContainer\"><img src=\"https://images.newsfilecorp.com/files/7983/242579_e2638a49a4904941_logo.jpg\" id=\"corporateNewsLogo\" alt=\"Corporate Logo\" /></p><p id=\"corporateLinkBack\">To view the source version of this press release, please visit <a href=\"https://api.newsfilecorp.com/redirect/kOrqBhDaWB\">https://www.newsfilecorp.com/release/242579</a></p>",
    "search_terms": "Kennedy,Summa Silver Corp.,SSVR",
    "master_gid": 9918,
    "date": "2025-02-27T12:00:00.000Z",
    "tags": "USA|Nevada||Silver|Company Update,Marketing,Project Acquisition",
    "image_id": null,
    "hidden": false,
    "company_id": 70,
    "provider": "newsfilecorp",
    "excerpt": "Vancouver, British Columbia--(Newsfile Corp. - February 27, 2025) - Summa Silver Corp. (TSXV: SSVR) (OTCQX: SSVRF) (FSE: 48X) (\"Summa\" or the \"Company\") is pleased to announce that it has acquired the Kennedy Project, located in Pershing County, Nevada, (the \"Kennedy Project\" or the \"Project\") through low-cost claim staking. The Kennedy",
    "is_regulatory": false,
    "refined_tags": null,
    "ftp_filename": null,
    "company_name": "Summa Silver Corp.",
    "exchange": "TSXV",
    "root_ticker": "SSVR",
    "project_name": "Kennedy",
    "gid": 9918,
    "location": "Nevada, United States",
    "plan_id": null,
    "description_text": "Vancouver, British Columbia--(Newsfile Corp. - February 27, 2025) - Summa Silver Corp. (TSXV: SSVR) (OTCQX: SSVRF) (FSE: 48X) (\" Summa \" or the \" Company \") is pleased to announce that it has acquired the Kennedy Project, located in Pershing County, Nevada, (the \" Kennedy Project \" or the \" Project \") through low-cost claim staking. The Kennedy Project consists of 99 mineral claims spanning approximately 2,000 acres, is 100% owned by the Company, and is free of any royalties. Key Highlights (See attached figure) : Past Producing District: The Project covers most of the historic Kennedy Mining District in north-central Nevada where minor amounts of gold and silver were produced intermittently from high-grade veins between 1891 and World War II 1 . High Grades Reported: Historic mining focused on near surface oxide mineralization where mined grades were reported to be 15 g/t Au and 311 g/t Ag 2 . Deeper secondary and sulfide mineralization reportedly remains unmined. Undrilled Nevada Vein Field: Approximately 22 km of veins have been traced across the Kennedy Project which have not seen systematic modern exploration. Acquisition Thesis: The Kennedy project represents an internally generated prospect that was acquired because it was open for staking and potentially represents a 1M ounce near surface gold target in Nevada. Company to Remain Focused on Robust Core Projects: Summa Silver will continue to focus on the Hughes and Mogollon projects where high-grade mineral resource estimates were recently announced. Hughes Project Drilling update: The previously announced drill program at the Hughes Project is well underway.  All holes completed have intersected zones of quartz veins, stockworks and breccias in aggressive step-outs at the Ruby zone.  All assays are pending. Galen McNamara, CEO, stated: \"It's not often that a significantly underexplored high-grade historic mining district in Nevada is open for staking. As many explorers in the state know, multiple important Nevada discoveries have been made by re-evaluating historic mining districts like this. Although we will continue to direct our focus to the Hughes and Mogollon projects, we look forward to advancing the Kennedy Project to drill-ready status in the coming months.\" Figure 1: Regional Map of Northern Nevada To view an enhanced version of this graphic, please visit: https://images.newsfilecorp.com/files/7983/242579_e2638a49a4904941_002full.jpg Kennedy Project Summary The Kennedy Project consists of 99 unpatented mining claims located in Pershing County, Nevada, approximately 75 km south of Winnemucca. The Kennedy Project is situated on major aeromagnetic and gravity lineaments which are also spatially associated with the Sleeper gold deposit (Figure 1). Priority exploration targets at the Project consist of high-grade sheeted veins as well as bulk tonnage disseminated and/or stock-work hosted gold-silver mineralization. The Kennedy district consists of numerous high-grade, gold-silver bearing quartz veins where over 22 km of veins have been traced at surface. Most of historic mining in the Kennedy district was reportedly from the Gold Note mine which was centered on a series of high-angle northwest striking veins traced for over 350 m along strike. Historic mining at Gold Note focused on near-surface (<40 m) oxide mineralization. Deeper secondary sulfide mineralization remains unmined. Mine grades were reportedly as high as 15.5 g/t Au with 311 g/t Ag 2 . Exploration Plans Following staking, a short prospecting and sampling program was completed and results are pending. The Company is now planning a multi-disciplinary exploration program consisting of geological mapping, soil geochemical sampling, and IP geophysics. Data from these programs will be used to prioritize targets for follow-up drill testing, in early 2026. Corporate Update In addition, the Company has engaged the services of ICP Securities Inc. (\" ICP \") to provide automated market making services, including use of its proprietary algorithm, ICP Premium™, in compliance with the policies and guidelines of the TSX Venture Exchange and other applicable legislation. ICP will be paid a monthly fee of C$7,500, plus applicable taxes. The agreement between the Company and ICP was signed with a start date of March 3, 2025, and is for a term of four months (the \"Initial Term\") and will be automatically renewed for subsequent one-month terms (unless either party terminates. ICP is an arm's length party to the Company. The Company has also engaged Fairfax Partners In. (\" Fairfax \") to provide investor relations services. Under the agreement which starts immediately, Fairfax will receive a total payment of $70,000 plus GST for a three-month term. Services provided by Fairfax include social media marketing, marketing collateral development, and digital marketing, ensuring Summa Silver's investor relations efforts align with market expectations. Fairfax confirms that neither the company nor its directors own any securities of Summa Silver. Qualified Person The technical content of this news release has been reviewed and approved by Galen McNamara, P. Geo., the CEO of the Company and a qualified person as defined by National Instrument 43-101. About Summa Silver Corp Summa Silver Corp is a junior mineral exploration company. The Company owns a 100% interest in the Hughes project located in central Nevada and in the Mogollon project located in southwestern New Mexico. The high-grade past-producing Belmont Mine, one of the most prolific silver producers in the United States between 1903 and 1929, is located on the Hughes project. The Mogollon project is the largest historic silver producer in New Mexico. Both projects have remained inactive since commercial production ceased and neither have seen modern exploration prior to the Company's involvement. Follow Summa Silver on Twitter: @summasilver LinkedIn: https://www.linkedin.com/company/summa-silver-corp/ Website: https://www.summasilver.com ON BEHALF OF THE BOARD OF DIRECTORS \"Galen McNamara\" Galen McNamara, Chief Executive Officer info@summasilver.com www.summasilver.com Investor Relations Contact: Giordy Belfiore Corporate Development and Investor Relations 604-288-8004 giordy@summasilver.com www.summasilver.com References Wallace, Alan R (2016) The Story of the Kennedy Mining District, Pershing County, Nevada ( https://pubs.nbmg.unr.edu/The-story-of-the-Kennedy-mining-district-p/aw1.htm ) Klopstock, Paul (1913) The Kennedy mining district, Nevada, American Institute of Mining Engineers Bulletin, v. 77. p. 1041-1046 Neither the TSX Venture Exchange nor its Regulation Services Provider (as that term is defined in the policies of the TSX Venture Exchange) accepts responsibility for the adequacy or accuracy of this release. Cautionary note regarding forward-looking statements This news release contains certain \"forward looking statements\" and certain \"forward-looking information\" as defined under applicable Canadian and U.S. securities laws. Forward-looking statements and information can generally be identified by the use of forward-looking terminology such as \"may\", \"will\", \"should\", \"expect\", \"intend\", \"estimate\", \"anticipate\", \"believe\", \"continue\", \"plans\" or similar terminology. The forward-looking information contained herein is provided for the purpose of assisting readers in understanding management's current expectations and plans relating to the future. These forward‐looking statements or information relate to, among other things: the Company's exploration plans. Forward-looking information is subject to known and unknown risks, uncertainties and other factors that may cause the actual actions, events or results to be materially different from those expressed or implied by such forward-looking information, including but not limited to: the requirement for regulatory approvals; enhanced uncertainty in global financial markets; unquantifiable risks related to government actions and interventions; stock market volatility; regulatory restrictions; the ongoing conflict in Ukraine; and other related risks and uncertainties disclosed in the Company's public disclosure documents. Forward-looking information are based on management of the parties' reasonable assumptions, estimates, expectations, analyses and opinions, which are based on such management's experience and perception of trends, current conditions and expected developments, and other factors that management believes are relevant and reasonable in the circumstances, but which may prove to be incorrect. The Company undertakes no obligation to update forward-looking information except as required by applicable law. Such forward-looking information represents management's best judgment based on information currently available. No forward-looking statement can be guaranteed and actual future results may vary materially. Accordingly, readers are advised not to place undue reliance on forward-looking statements or information. To view the source version of this press release, please visit https://www.newsfilecorp.com/release/242579",
    "primary_commodity": "Au"
  },
  "articleProject": {
    "gid": 9918,
    "project_name": "Kennedy",
    "location": "Nevada, United States"
  },
  "articleExchange": "TSXV",
  "articleCompanyId": 70,
  "articleTicker": "SSVR",
  "articleCompanyName": "Summa Silver Corp.",
  "allOtherCompanyProjects": [
    {
      "company_id": 70,
      "gid": 9918,
      "project_name": "Kennedy",
      "location": "Nevada, United States"
    },
    {
      "company_id": 70,
      "gid": 2302,
      "project_name": "Mogollon",
      "location": "New Mexico, United States"
    },
    {
      "company_id": 70,
      "gid": 994,
      "project_name": "Hughes",
      "location": "Nevada, USA"
    }
  ],
  "allOtherCompanyNews": [
    {
      "id": 107584,
      "company_id": 70,
      "title": "Summa Silver Provides Quarterly ATM Program Update",
      "link": null,
      "date": "2025-06-10T23:00:00.000Z",
      "hidden": false
    },
    {
      "id": 106819,
      "company_id": 70,
      "title": "Silver47 and Summa Silver Announce Upsize of Brokered Financing to C$6 Million",
      "link": null,
      "date": "2025-06-03T15:30:00.000Z",
      "hidden": false
    },
    {
      "id": 104453,
      "company_id": 70,
      "title": "Silver47 and Summa Silver Announce Merger to Create a Premier U.S. High Grade Silver Explorer & Developer and C$5 Million Brokered Financing",
      "link": null,
      "date": "2025-05-13T11:00:00.000Z",
      "hidden": false
    },
    {
      "id": 100795,
      "company_id": 70,
      "title": "Summa Silver Confirms High-Grade Gold-Silver at the Kennedy Project, Nevada",
      "link": null,
      "date": "2025-04-24T11:00:00.000Z",
      "hidden": false
    },
    {
      "id": 91887,
      "company_id": 70,
      "title": "Summa Silver Announces Mogollon Project Anniversary Payment pursuant to Amended Lease Agreements",
      "link": null,
      "date": "2025-03-19T23:00:00.000Z",
      "hidden": false
    },
    {
      "id": 89945,
      "company_id": 70,
      "title": "Summa Silver Files Technical Reports for its Two American High-Grade Silver Projects",
      "link": "https://www.newsfilecorp.com/release/243187/Summa-Silver-Files-Technical-Reports-for-its-Two-American-HighGrade-Silver-Projects",
      "date": "2025-03-04T00:11:00.000Z",
      "hidden": false
    },
    {
      "id": 89431,
      "company_id": 70,
      "title": "Summa Silver Announces Staking of the High-Grade Gold-Silver Kennedy Project, Nevada",
      "link": "https://www.newsfilecorp.com/release/242579/Summa-Silver-Announces-Staking-of-the-HighGrade-GoldSilver-Kennedy-Project-Nevada",
      "date": "2025-02-27T12:00:00.000Z",
      "hidden": false
    },
    {
      "id": -165741,
      "company_id": 70,
      "title": "Summa Silver Announces Grant of Stock Options",
      "link": "https://www.newsfilecorp.com/release/238415/Summa-Silver-Announces-Grant-of-Stock-Options",
      "date": "2025-01-25T00:30:00.000Z",
      "hidden": false
    },
    {
      "id": 84298,
      "company_id": 70,
      "title": "Summa Silver Announces First-Ever Mineral Resource Estimates on its Two American High-Grade Silver Projects",
      "link": "https://www.newsfilecorp.com/release/237388/Summa-Silver-Announces-FirstEver-Mineral-Resource-Estimates-on-its-Two-American-HighGrade-Silver-Projects",
      "date": "2025-01-16T12:00:00.000Z",
      "hidden": false
    },
    {
      "id": 82174,
      "company_id": 70,
      "title": "Summa Silver Outlines Timeline for Mineral Resource Estimates on the Hughes and Mogollon Projects, Southwest United States",
      "link": "https://www.newsfilecorp.com/release/234076/Summa-Silver-Outlines-Timeline-for-Mineral-Resource-Estimates-on-the-Hughes-and-Mogollon-Projects-Southwest-United-States",
      "date": "2024-12-17T12:00:00.000Z",
      "hidden": false
    }
  ]
}
